[
    {
        "book_title": " James",
        "devo_passages": "James 1:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we study James, we are memorizing the book’s key verses together, James 1:2-4. This week, we’ll memorize verse 4, which focuses on the effect of enduring in Christ.\nAnd let endurance have its full effect, so that you may be mature and complete, lacking nothing.\n– James 1:4\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/4-HRT-James-2.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "Galatians 5:22-23",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness,  gentleness, and self-control. The law is not against such things.\n– Galatians 5:22-23\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram13.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 5:7-20, Joel 2:23, Matthew 5:33-37, Hebrews 11:32-40, 1 Peter 4:7-11",
        "devo_title": "Patience for the Long Haul",
        "devo_summary": "\n                    \n                    We spend our time in this life waiting for the Lord’s return. But we do not wait idly. We’re given work to do—kingdom work. One of the unique works that Christians are called to is caring for one another over time. In today’s reading, James gives us some instructions on how to do that. In particular, I want to focus on this strange little practice of anointing the sick with oil. What is that about?\nMany churches today practice anointing the sick with oil. And based on James 5, all churches should.\nJames charges elders to gather to pray for the sick and anoint them with oil in the name of the Lord. His explanation of this practice is very abbreviated. We’re given only a few specifics—elders, sick people, oil, and prayer. Regardless of how well we understand it, James gives the instruction, so we must seek to understand what it means.\nJames tells us the prayer of a righteous man is powerful and effective—or in the old language, it availeth much. I am convinced that in matters such as these, the Lord is as interested in what He is doing in the lives and hearts of His church leaders as He is in the bodies of the sick. God calls the leadership of the church to complete and pure reliance upon His grace and power to redeem and restore our fallen world and broken bodies.\nThe oil is not magic, and neither is prayer. We know anointing with oil is not a “sign-gift” given only to healers, because James does not call on those with a special gift of healing to pray. He calls the elders of the church to do it. Ordinary people. In humble reliance upon God’s grace and sober submission to His perfect will, elders pray for the sick in the name of Jesus, our Great Physician, in the hope that God will heal the person they love, here and now.\nSinclair Ferguson, in his book The Holy Spirit, summarizes this hope:\nNo right-thinking Christian would deny that God continues to be active in the world, to do wonderful things for His people, and especially to answer their prayers in keeping with His promises. It is still appropriate for the sick not only to consult a doctor but to “call the elders of the church to pray over him and anoint him with oil in the name of the Lord”. The promise remains that “the prayer offered in faith will make the sick person well; the Lord will raise him up” (James 5:14-15). People continue to be healed by God — through, above, and even against means.\nIf any are suffering with serious illness, the elders of the church are called to come to them, pray for them, and anoint them with oil in the name of the Lord Jesus Christ, believing His promises are true, His power is strong, and His love is abounding in grace.\nWhen we observe this practice, we’re praying for the Lord’s gospel to be proclaimed, for His Holy Spirit to be present, and for His glory to be revealed. And we boldly ask for a miracle, all the while praying as our Lord Jesus taught us, “not my will, but yours be done on earth as it is in heaven”—all by the grace of God and all for His glory. This is part of what it means to wait on the Lord.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram12.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 5:1-6, Matthew 5:38-42, Hebrews 10:35-39, Revelation 20:11-15",
        "devo_title": "Warnings to the Rich",
        "devo_summary": "\n                    \n                    Surely you’ve heard some variation on this theme: It’s not what you do, it’s whose you are.\nWhile that statement sounds uber-spiritual, does have a hint of truth to it, and would look great emblazoned on a fairtrade t-shirt, the text in James blows a raspberry at it, and then offers this corrective without apology:\nBecause of whose you are, what you do matters. A lot.\nAnd while this text could be read to a general audience, there is a specific group the writer had in mind: the rich. Or as one translation puts it, “the arrogant rich.” Their continued stockpiling of wealth with no concern, much less thought, for the hearts and minds and souls and strength of the little people who were used and abused to make such wealth a reality, is a telling indication of whose the rich are not. If they were God’s people, they would act differently.\nMost of us are, to some degree, the little people. So we raise a fist and cry, “You tell ‘em, James,” to which James responds, “I will. But hey, don’t forget the other texts for today, okay?” Sigh. Thanks a lot, James. For now we see that we, too, can be the arrogant rich. While God has very direct things to say with regard to endlessly amassing wealth, God also speaks equally direct things into other areas of our lives where we are to act differently because of whose we are.\nThe spirit found in James and his fellow writers is one of living generously, open-handed and open-hearted—embarrassingly so. Because of our identity in Christ, the singular thing we should expend any effort toward stockpiling on this earth is what we’ve been given: mercy. Now that can work itself out not in building bigger barns, but instead building better childcare. Or turning the other cheek, standing there and taking it like a man who knows the sting of mercy. Or staying loyal to those friends persecuted or imprisoned for their faith when the safest thing would be to turn tail and run away fast.\nWhose we are is of the utmost importance in this life, because this identity drives both our words and actions. And those deeds matter. \nMercy, do they ever matter. A lot.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram111.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 4:13-17, Proverbs 27:1, Acts 18:19-21, 1 Corinthians 5:6-8",
        "devo_title": "Boasting About Tomorrow",
        "devo_summary": "\n                    \n                    The older I get, the more I realize how little I know. Each season and event in my life seems to usher me into a world far larger than the world I thought I knew. Certainties give way to questions. Sureties sink under the weight of wonder. I just don’t have the grip on things like I once thought I had.\nThere is no place this is more evident than when considering the future. When I was young, I was sure of a number of things. I was sure about how I would live, how I would raise my kids, and what my vocation would be. But in reality, so many things go the way we plan, and this fact has a habit of humbling us as the years go by. It’s enough to make us laugh at ourselves when we’re done with the tears.\nI read James’s statement—about how we do not know what tomorrow will bring—differently as a 45 year old man than I did as a 25 year old. Back then, I looked sideways at his declaration as harsh and unnecessary. After all, everyone tells others about their plans for the following day when asked. What’s the big deal?\nBut now I get it. We really have no idea what is coming, though we think we know so much and have so much control. James is helping us recalibrate what is at stake in our arrogance. We not only have the propensity to deny God’s sovereignty over our lives, but we also run the risk of living in fear about what tomorrow will bring.\nYou see, I am now wise enough to know that I know nothing about what is coming. But I am also prone to worry about that very fact. Worry is just another form of this same arrogance James warns against. I ask myself, “Why are you worried about what is coming? You have no idea what is coming!”\nWe do not know if the diagnosis will come, the relationship will hold, or the finances will be there. But we do know one thing about tomorrow: we know that Christ will be our certain hope. The hope of the gospel is not like the unstable hope this world offers, where we can only wish for what we want to happen. Our hope in the grace and mercy and steadfast love of God is as certain as the finished work of Christ.\nThe great error in arrogantly thinking we know what tomorrow will bring is that it places our trust in ourselves and our circumstances, rather than in Christ alone. If I am sure about what tomorrow will bring, then not only am I not submitting to God’s sovereignty over all things, but I am also prone to question God’s goodness when tomorrow becomes a place a fear, or doesn’t pan out like I hoped.\nThe gospel mercifully humbles us in the face of God’s will and gives us confidence in the face of the unknown tomorrows before us—all of them.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram10.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 4:1-12, Psalm 9:19, John 4:23-24, Galatians 1:10, 1 John 5:13-15",
        "devo_title": "Grace for the Humble",
        "devo_summary": "\n                    \n                    “It was pride that turned angels into devils; it is humility that makes man as angels.”\n–St. Augustine of Hippo\nPride was at the core of the first great schism between creation and God. Satan and his fallen angels thought that they could lead, create, and govern better than God Himself.\nI believe that pride, in its purest and most destructive form, still looks very much like that. It’s the notion that we can somehow lead, discern, and choose better than our Creator. When you say it out loud, it just sounds ridiculous. But at our center there is still this whispering, nudging voice that says, “I can do it better. And for doing it better, I deserve the glory.”\nPerhaps pride can most simply be defined as a longing for glory that doesn’t really belong to us. Instead of desiring a moment of worship and adoration directed towards God, we try to redirect that glory and praise to ourselves.\nConversely, humility was at the center of our reconciliation with God. Jesus humbled Himself to the point of death, even death on a cross, in order to restore the brokenness our collective pride had established. Think about that: the humility of God heals, covers, and restores the prideful destruction of humanity.\nIn the quote above, Augustine was speaking figuratively about men being turned into angels, but the heart of his message is clear. Humility, and not pride, is the posture true Christ followers should seek to adopt.\nIt’s no wonder that James harps on humility so much. He knew it to be the core redemptive posture of his brother and our Lord. James challenges his readers: “Resist the devil, and he will flee from you. Draw near to God, and He will draw near to you” (4:7-8). If we don’t pay careful attention, we miss the fact that this statement is sandwiched between verses exhorting the reader to choose humility as a way of life. This is a spiritual discipline that takes effort, but James knows it to be the way forward.\nYou want to flee from the devil? Live a humble, God-centered life.\nYou want to draw near to God? Mirror the posture that He has perfectly imaged in Jesus, humility.\nPride always seeks personal glory, but leaves you feeling empty and lacking. It promises to make your name powerful, but all it really does is puff you up so that the deflation aches all the more.\nJames calls on us all to walk in the way of Jesus, and to choose humility. Not only because it is the right thing to do, but because it brings a sense of wholeness and unity with God. It may seem counterintuitive, but then again, so is nearly the entire gospel and Jesus’ reverse economy of the Kingdom.\nTo borrow language from Eugene Peterson: live a life of a long obedience in the same direction, a humble life; this is the way of Jesus.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram9.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 3:13-18, Proverbs 11:18, Romans 12:9-21, Galatians 5:22-23, Hebrews 12:11",
        "devo_title": "Wisdom from Above",
        "devo_summary": "\n                    \n                    When I was a boy, my dad would often pray that the Lord would make us “wise beyond our years.” I’m not sure that I understood the importance of that prayer when I was young. The older I get—and the longer I have been in ministry—the more I appreciate that he prayed it for us.\nThat prayer, however, opens the door for a litany of interconnected questions: What is wisdom? Where does it come from? How do I know that I have wisdom? These are the questions James raises and answers for us in the third chapter of his letter.\nFirst, he tackles the question, “What is wisdom?” Sometimes the best way to define something is to explain what it is not. J. Gresham Machen once explained, “You can’t set forth clearly what a thing is without contrasting it with what it is not… definition proceeds by way of exclusion.”\nJames explains that some who think they are wise actually have hearts full of “bitter envy and self-seeking” (3:14). Bitterness and self-seeking may accompany a form of worldly wisdom, but they are antithetical to true wisdom. By way of contrast, true wisdom is full of meekness. Meekness is willingness to bow to the will of God, even when it means laying aside what I want, for the good of others.\nNext, James contrasts the source of true wisdom and its counterfeit. One is sensual, earthly, and demonic; the other is from above. James calls worldly wisdom “demonic” because it leads to “confusion and every evil thing” (v.16). The Scriptures tell us that the evil one is the author of confusion and the father of lies. When we adopt the wisdom of the world we inevitably begin to live and think like the evil one, rather than like the heavenly Christ.\nFinally, James says we will be able to tell whether the wisdom we possess is from God or from the evil one by what it produces in our lives. Whereas the wisdom of this world brings about bitter envy and self-seeking, the wisdom that is from above manifests itself in “the fruit of righteousness” in the life of the one who possesses it (v.18).\nTrue wisdom is pure in doctrine and life. It is peaceable, gentle, willing to yield, merciful, impartial, and sincere. The question we must ask ourselves is, “Which of these two forms of wisdom am I manifesting in my life?” God’s grace in Christ enables us to become wise beyond our years in the wisdom that is from above.\nWritten by Nicholas Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram8.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 1:2-3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we study James, we will memorize the book’s key verses together, James 1:2-4. This week, we’ll begin with the first part of the passage, which teaches us the paradoxical truth of rejoicing in suffering.\nConsider it a great joy, my brothers and sisters, whenever you experience various trials,\nbecause you know that the testing of your faith produces endurance.\n– James 1:2-3\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/4-HRT-James-1.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "Jeremiah 31:13",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nI will turn their mourning into joy,\ngive them consolation,\nand bring happiness out of grief.\n– Jeremiah 31:13\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram6.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 3:1-12, Genesis 1:26-27, Psalm 12, Matthew 12:36-37",
        "devo_title": "Controlling the Tongue",
        "devo_summary": "\n                    \n                    James brings up one thing we all do every day of our lives: communicate. Whether we are texting friends, talking with family, or updating social media, we are always communicating and we’re doing it all under the reign of Christ. \nMany of us believe Jesus is Lord over our lives, but do we see His gracious reign over our tongues, our words, our sentences, and paragraphs? Do we post verses in the morning and then speak unkind comments in the afternoon? How often have we sung praises to our great God and Savior and then turned around and gossiped or slandered someone made in God’s image?\nThe tongue is a tiny muscle, hardly noticeable, rigged with two cages—teeth and lips—and yet it still gets out of control. Brothers, Jesus cares about our speech.\nTypically, men love completing tasks. We finish a project at work, mow the grass, or grill the perfect steak, and we enjoy a sense of accomplishment. Well, James looks right at us and says, “Guys, here’s one task you can’t accomplish. You can’t wrangle in your words. You won’t tame your tongue.” \nAnd to make matters worse, James shows us the warhead nature of our sinful words—they leave havoc, pain, and rubble after they’ve been launched. Is James trying to make us feel powerless and hopeless? In a way, yes—so that we’ll find our power and hope in Christ alone.\nHow many times have we tried to be like Jesus without Jesus? Too many. James doesn’t want to us to feel conviction about our speech, hang our heads, and try to do better tomorrow on our own. He tells us straight up, “You can’t tame this beast.”\nBut God can.\nWhether you unleash biting sarcasm, inappropriate humor, rage-filled rants and raves, bragging big-deal-ness, or common complaining, there is good news: Jesus specializes in transforming sinners like us. He gives us new lives with Him. He can tame our tongues. He can retrain our speech. His cross, His empty tomb, and His reign in Heaven transform our hearts and our words.\nWhere the Lord convicts your speech, surrender to Him. Pray “Lord, help me.” He looks toward those who make this humble request. He will draw near.\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram5.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 2:14-26, Deuteronomy 6:4-5, Romans 3:23-26, Ephesians 2:8-10",
        "devo_title": "Faith Made Complete",
        "devo_summary": "\n                    \n                    When you buy a car, there are special features you can get as upgrades. Extras are nice, though not necessary. But what if you purchased a vehicle and looked under the hood to find that there was no engine? I’m no car expert, but I know the engine is essential for the car to run. It is not an “extra.” This is a picture of the Christian life: Faith is the engine that powers our works. And faith without works is dead faith.\nAs disciples of Jesus Christ, our proclamation of faith is validated in our demonstration of good works. When Jesus is acknowledged as the good King who sits on the throne over all of our desires, it changes the way we live out our faith. We live as God’s children—children who believe in the one true King. And we live as His servants who want to carry out His will.\nOur works do not save us. Jesus’ work alone produces the saving faith that springs forth from one’s heart. Only by faith in Jesus’ kingship and His triumph over the power of death can we be brought to a newness of life—new creations, found in Him complete. God the Father gives this gift of faith by grace. Grace is a currency that is unattainable by any human work. \nGrace is not transactional. It is charity—a completely free gift from God which produces faith in faithless men and causes us to cling to Jesus.\nThe very Word of God wrapped in flesh cried out on the rugged cross, “It is finished!” Three days later He rose and defeated death. No man is capable of keeping perfect faith on his own. But as they used to say in the old church choir, “He is able.” God is able to keep the engine of faith running. Even in our hypocritical moments of disconnect between our words and our deeds, He keeps us and uses us.\nWe are men of imperfect faith, but we are met with perfect grace. By remembering and trusting in God’s faithful work, our faith will never die. Our faith is living and active because it is in a living, active God who eternally loves us and uses us for His glory.\nWritten by Jevon Washington\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram41.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 2:1-13, Zechariah 7:9-10, Matthew 7:1-5, Romans 13:8-10",
        "devo_title": "Mercy Triumphs Over Judgment",
        "devo_summary": "\n                    \n                    Most of us aren’t murderers or thieves or adulterers. Those sins are the “worst” of sins, the extra-double-plus bad ones. Those are the sins that clearly break God’s law. We don’t do those things. (I mean, unless you count bitterness, coveting, lust, or pornography. Moving on quickly, though.)\nYet we’re all law-breakers in one overarching way: we lack love. Wait, what? Yes, a lack of love and a lack of mercy not only break God’s law, but this is where all law breaking comes from.\nJames brings this to our attention by describing favoritism in the church. A wealthy person receives honor while a poor person is ignored and pushed to the fringes. The richly attired person is moved front and center while the shabby person is asked to sit in the back. In our context today, this kind of attitude and behavior dons other garments—racial favoritism, gender favoritism, generational favoritism, and cultural favoritism. We are all inclined to favor one kind of person over another. And in so doing, we fail to love as Christ loved.\nWe think of “love your neighbor as yourself” as the Golden Rule. That’s a cute, shiny phrase, but it undersells what Jesus calls one of the two greatest commandments. This must mean love is deeper and broader than we normally think of it—more active and big and robust and committed, not simply romantic or feely. Love must be an attitude and a perspective, even a lifestyle. It must be a shaping, defining force.\nWhen we lack love, we judge, whether or not we are in any position to do so. We judge others more harshly than we would like to be judged and for the very things we fail at daily. We forget we will be held to the very standard by which we judge others. We are blinded by the log in our own eye while we make much of the sawdust in someone else’s.\nWe are all law-breakers because we lack love. For this reason, we deserve judgment and we need mercy. We need it foremost from Jesus, and we have it. \nChrist’s mercy has already triumphed over judgment. But has it done so in our lives? Do we share that mercy forward and do we receive it from others? Are we shaped by it or by the desire to judge others in order to position ourselves as something we are not?\nWritten by Barnabas Piper\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram3.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 1:19-27, Proverbs 10:19, Ephesians 4:26-27, Romans 5:20",
        "devo_title": "Both Hearing and Doing",
        "devo_summary": "\n                    \n                    I have a quick temper. Just ask my family. In an attempt to be repentant and Christlike, I typically have to take a few moments to gather myself when my wife frustrates me or my kids disobey. Sometimes I’m silent. Sometimes I have to leave the room and come back. If I’m not careful, I can be like a tea kettle with steam billowing out of my ears, my only way to cool off being an ice-water bath from the Holy Spirit.\nI know I should be “quick to listen, slow to speak, and slow to anger” (James 1:19), but I don’t always do it. That’s because, ultimately, my mind doesn’t always connect to my heart. As James tells us in this passage, we can’t merely hear God’s Word—we have to act on it.\nBelief is an interesting thing. Everyone believes in something, right? Not just normal beliefs, like “the grass is green” or “the sky is blue.” Everyone believes in deeper truths, like goodness and beauty and love and purpose. I believe it’s right to control my temper, yet often I act out anyway.\nAs Christians, our beliefs go even further. We confess and believe certain things about God and about how the universe does (or doesn’t) work. In other words, we don’t believe in a generic, watered-down God. The commands of Scripture and the indwelling of the Holy Spirit are unique signposts for Christian living. They are how we move from a general morality to Christlikeness. They are how we are kept “unstained from the world” (James 1:27).\nWe do what we believe. According to Paul in Romans 10:9, what we confess with our mouths and believe in our hearts is a matter of salvation, of eternity. James says elsewhere that even the demons believe (2:19)! And yet the demons are anything but godly. They are the embodiment of evil.\nThis command—“be quick to listen, slow to speak, and slow to anger”—is a perfect example of the difference between a hearer and a doer of the Word. We can believe one thing with our minds, but “the mouth speaks from the overflow of the heart” (Matthew 12:34). Our ability to heed these words in James 1:19 reveals much about the state of our hearts.\nTrust me, I should know.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram2.jpg"
    },
    {
        "book_title": " James",
        "devo_passages": "James 1:1-18, Jeremiah 31:7-14, Matthew 4:1-11, 1 Peter 1:6-7",
        "devo_title": "How Can We Rejoice in Suffering?",
        "devo_summary": "\n                    \n                    How can we rejoice in suffering? It really seems like an outlandish question, doesn’t it? Suffering and rejoicing feel like opposites, and we prefer the rejoicing by a landslide. So how can these have any compatibility?\nThey cannot be compatible unless we can live in the depth of them both. We have to resist the superficial “just rejoice and be happy.” We cannot ignore our suffering.\nPart of our problem is that we idolize comfort and efficiency. We live under the idea that if something is comfortable, then it is good; and if it is also efficient and productive, even better. \nEnter: our suffering. \nChristians are really good at asking about what we are learning in suffering, as if every horrible event that brings us to our breaking point could be summed up in some three-point action plan for becoming better people. I once heard someone say that we want suffering to be like a pregnancy—pain and discomfort for a set time, then a wonderful life lesson emerges in the end.\nBut suffering is real and painful. And we have no promise that in the end, if there even is an end, we will gain some lesson to pass forward. In suffering we encounter the reality that this is not how it is supposed to be, and that God is close to the brokenhearted. To grasp both of these is to rejoice.\nTwo years ago when I was thrown into the role of widower and single dad to four kids, I experienced a level of suffering that seemed unimaginable. By God’s grace and in my own frailty, I sat in my grief. I tried to avoid any quick fix, like a new addiction or moving on. I just sat and cried and suffered.\nDuring that time, I felt completely inefficient and unproductive. Eventually, my joy began to return in the midst of this brokenness. James 1:3 says the testing of our faith produces steadfastness. I saw this steadfastness in the way God gave me the strength to get out of bed each morning; such a simple thing to rejoice in.\nIt is interesting that James moves from suffering and the benefits of suffering to this instruction: “If any of you lacks wisdom, let Him ask of God, who gives generously.” Perhaps our suffering is where we grasp the wisdom and goodness of God, and in this wisdom, we rejoice in His grace.\nSuffering has the ability to shatter any superficial idol of comfort, and we would be wise to let it. Don’t run from your suffering, but rejoice that God will never leave you.\nWritten by Jason Tippetts\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/05/HRT-James-instagram1.jpg"
    }
]