[
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 28:6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week’s verse captures the heart of why Matthew wrote his Gospel.\nHe is not here. For he has risen, just as he said. Come and see the place where he lay.\n– Matthew 28:6\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/4-HRTMatthew-4.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Daniel 7:14",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe was given dominion,\nand glory, and a kingdom;\nso that those of every people,\nnation, and language\nshould serve him.\nHis dominion is an everlasting dominion\nthat will not pass away,\nand his kingdom is one\nthat will not be destroyed.\n– Daniel 7:14\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-27.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 27:1-66, Matthew 28:1-20, Psalm 22:7-8, 1 Corinthians 15:6, 2 Corinthians 3:18",
        "devo_title": "Jesus Is Risen",
        "devo_summary": "\n                    \n                    Innocent, betrayed, questioned, traded, mocked, beaten, tortured, ridiculed, brutalized, executed, abandoned, sacrificed, dead—so went the end of Jesus’ earthly life. To pacify jealous leaders, the sinless God-man was put to death in the fashion of traitors and rebels. He was displayed like a bloody yard sale sign for all passersby to see and to scorn.\nThat is one side to this story, the unjust and bloody murder of the Messiah.\nThere is another side woven throughout the same events, the side of signs, wonders, and hope. In the face of questioning and mockery, Jesus remained silent, like a sheep being peacefully led to slaughter. The purple robe, crown of thorns, and placard declaring Him to be “King of the Jews”—all of these details were meant to demean Him but were infinitely more accurate than His accusers knew. \nWith His final words, Jesus referred to Psalm 22, which speaks of being forsaken by God, but also of His rescue and good pleasure in doing so. Just as He gave up His spirit as a willing sacrifice, darkness fell at midday, displaying the Father’s sorrow. In that moment, the rending of the temple curtain made the holiest place accessible to all. Somehow, in the midst of the blood and gore and screams and agony, a Roman centurion saw the signs and recognized the truth: “Surely this man was the Son of God” (Matthew 27:54). And so He was.\nAnd so He is. \nJust as the Son of God gave up His spirit, He then took it back again, rising from the dead, resurrected. With an earthquake and angelic entourage, Jesus exited the grave. He greeted friends, spoke tenderly to the doubting, made public appearances to hundreds, and gave life to the tales His murderers sought to spread. He left witnesses in His wake and left them with a charge: go and make disciples. And then He left them with a promise, saying, “I will be with you always, even to the end of the age” (Matthew 28:19-20). \nWhen Jesus departed earth, He had fulfilled His mission: to live a perfect life as one both completely divine and completely human; to die the death He alone did not deserve in order to give salvation to all those who did; and to bring about the death of death with His own resurrection. He then established His church by commissioning His followers to be disciple-makers, promising to impart the Holy Spirit to them as teacher, guide, empowerer, and life-giver. \nIndeed, this man was, and is, the Son of God. And one day, He will come again.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-26.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 26:1-75, Leviticus 23:5-6, Isaiah 53:7, Jeremiah 31:31",
        "devo_title": "Jesus Gives His Life",
        "devo_summary": "\n                    \n                    When was the last time you came across a situation in your life that you simply wanted to avoid at any cost? I can think of a handful of difficult conversations in my life that I would have preferred to avoid completely, if at all possible. Yet, if we are honest with ourselves, it is often the most difficult of life’s circumstances that, when looked back upon, appear to have had the most lasting, transformative impact on our lives or the lives of others. \nNo one has felt this feeling of foreboding conflict and pain like Christ.\nAs He approached His death, Jesus was overcome by the grim reality of what was to come. He would be betrayed, sold into the hands of His enemies, and killed—separated from God the Father for the good of His children. Even knowing there would be light on the other side of the darkness, Jesus’ trust in the will of the Father was pushed to the brink.\nIn the Garden of Gethsemane, not far away from where He would be crucified the next day, Jesus prayed to the Father, saying, “My Father, if it is possible, let this cup pass from me. Yet not as I will, but as you will” (Matthew 26:39).\nJesus did not fear death. He was not trying to back out of the impending physical pain, as horrible as it was going to be. Jesus was facing the reality that His Father was about to forsake Him. The Father does not forsake even the vilest of sinners who repents. Yet, He was about to forsake His own Son.\nBut Jesus, as soon as He asked that the cup of God’s wrath pass from Him if possible, said He knew He must yield to the will of God the Father and endure all that was to come.\nIt would be easy to look at this passage and ask the questions, “What is it that you need to endure from God on behalf of others? What conflict do you need to face for the sake of those you love?” But such an application is short-sighted. \nWhen we witness the courageous, life-giving embrace of imminent death by our Savior, the most appropriate response is not for us to try to emulate this sacrificial act, but to praise Him for it. We must look to Christ as our hope; as the one who gave up His unity with the Father so that we, too, might experience such unity with Him ourselves.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-25.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 24:1-51, Matthew 25:1-46, Daniel 7:13-14",
        "devo_title": "Jesus Will Come Again",
        "devo_summary": "\n                    \n                    All of my brothers are significantly older than me. The brother closest in age is nine years older, and the oldest is about thirteen years older than I am. At family reunions, my kids are playmates with their grandkids. When I was my youngest son’s age, my brothers were either in college or about to finish college. It was like having four dads or three extra uncles who were only around sometimes. The one time of year I always got to spend with them was around the holidays. Even if they were in college or grad school they would come home for a couple of weeks. I loved those times.\nMy brother Wes was a genius. He made incredible grades in high school and college. Because of this, he was accepted to Georgetown Law School in Washington, D.C. While I loved going to visit and getting familiar with the nation’s capital, I missed having him around. He’d stayed home during his years as an undergrad, so throughout those four years I was able to pester him and do everything I could to get his attention. But now he was states away and his visits home were few and far between.\nBut he always came home for the holidays.\nThere were no cell phones back then, so the timing of his exact arrival was always a mystery. But I would wait for hours. Our house sat on the side of a small mountain, and when you were on the second floor of the house, the street below seemed far away. I loved sitting in the living room at Christmas and listening to my dad’s Christmas mix tapes. There was something about the colors of those lights on the tree and the lights on the street below that carried Wes and other family members home. \nI knew he was coming. He had told us. I just had no idea when exactly he would show up. \nThere is a lot to this being ready when Jesus comes. But when He says to “be alert,” we know one thing for sure: Part of watching for Him is wanting Him to come. When I watched for my brother to show up at Christmas, I was anxious for him to come home. I wanted his presence in our home. When we keep an eye on Jesus’ return, we look forward to His return. We are not wanting Him to delay. \nThat’s not always easy when things are going well. When the wedding bells are chiming and the money is coming in and the children are being born and the pantries are full to overflowing—that’s when it’s hard to watch for Jesus’ coming. But watch we must. \nBecause of who He is and what He has done for us, we ought to prize Christ’s presence more than all the good things in our lives that He has given to us. We must long for Him to come and then rejoice when He does— just as a young boy waits for his brother, knowing the things of this world do not shine as brightly as his presence.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-24.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 23:1-39, Exodus 10:21-23, Romans 8:22-23",
        "devo_title": "Jesus Judges the World",
        "devo_summary": "\n                    \n                    It will be difficult to find a more pointless occasion on television than that of the red carpet broadcast of an awards show. Gawking over the clothes of celebrities, movie stars, and millionaires is a low point of television’s year. Success isn’t on that carpet. Greatness isn’t found in the glamor of the world. Jesus would tell us to look past the people in the flashing lights and to look for the people who rolled that carpet out; find the people who are picking up the trash, opening doors, and serving others—there you’ll find a shadow of kingdom greatness.\nBrothers, do we fall for the same trap in our churches and in our inner lives? Do we think greatness is found in being at the top of the pyramid or being the person in the room everyone looks to—the kind of person everyone oohs and aahs over? \nJesus reminds us that greatness isn’t found in a title. Rabbi, teacher, pastor, doctor, CEO, head of the house—our crucified Savior smashes all the pomp the world finds in titles. On the cross, literally nailed above our nailed Lord, were titles mocking Him. Yet even in the midst of being mocked with those titles, true greatness and compassion remained as Jesus served us to the point of death on that cross.\nIf you want to be great, you won’t be. If you want to serve, you will be. Servanthood isn’t a back alley to greatness. We don’t serve, waiting for the eventual boomerang of greatness to be bestowed upon us. It doesn’t work that way. If you chase greatness and superiority you will only achieve great hypocrisy. Serving from the heart, for the good of others, is the true greatness of the gospel of the kingdom.\nJesus says the greatest among us are the servants. His cross and resurrection prove it. He didn’t come to be served, but to serve, and to give His life as a ransom for many (Matthew 20:28)—for you and for those whom you serve. \nIf you crave a red carpet for your life, don’t crave one to walk on, but one to roll out for your wife, your kids, your friends, and coworkers. Serve as you’ve been served by your servant-hearted Savior. Greatness is there with Him and from Him.\n Written by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-23.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 22:1-46, Psalm 110, Hebrews 10:11-14",
        "devo_title": "Jesus Is Our Access to God",
        "devo_summary": "\n                    \n                    I recently presided over the graveside service of the father of one of the members of my congregation. The day before, two sons of the deceased man had come to the beautiful country cemetery to dig their own father’s grave. Allow that to set in for a moment.\nIt was at the end of the service that I was no longer able to hold back my tears. Family and friends all stood in silence as these two brothers lowered the urn of their father’s remains into the earth and slowly covered it with dirt, shovelful after shovelful. What a profound ritual of remembrance. What a powerful reminder of the brevity of life on this earth.\nBefore I left, I prayed that my words during the service would comfort them as they faced the harsh reality of his death. The good news: this was not goodbye; it was “see you soon.” \nIt is in this passage from Matthew 22 that Jesus challenges the Sadducees, the religious teachers of the day, in their limited understanding of life beyond this world. Quoting Exodus 3:6, Jesus says, “Now concerning the resurrection of the dead, haven’t you read what was spoken to you by God: ‘I am the God of Abraham and the God of Isaac and the God of Jacob’? He is not the God of the dead, but of the living” (vv. :31-32).\nJesus called forth this poignant passage, one the religious leaders would have been familiar with, for a reason. When these words were written in Exodus, the men mentioned had been dead for centuries; however, it was written in present tense. Why did the writer of Exodus refer to Abraham, Isaac, and Jacob as living?\nYou see, Jesus was pointing the Sadducees to God’s power to raise not only the patriarchs, but also all of God’s people to enjoy His eternal covenant in the world to come—an eternal life beyond anything they could imagine by comparison to life in this world.\nAs Christians, we understand that when Christ sat down at the right hand of the Father following His death, resurrection, and ascension, it was a declaration that His work was finished (Hebrews 10:12-13; Psalm 110:1). Sin and death had been defeated. Death no longer has the last word. For all believers, there is an Easter morning to come.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-22.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 20:28",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nIn this week’s verse, Jesus tells us why He stepped down from eternity to live among us. \nThe Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.\n– Matthew 20:28\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/4-HRTMatthew-3.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Isaiah 43:11-12",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“I—I am the LORD.\nBesides me, there is no Savior.\nI alone declared, saved, and proclaimed—\nand not some foreign god among you.\nSo you are my witnesses”—\nthis is the LORD’s declaration—\n“and I am God.”\n– Isaiah 43:11-12\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-20.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 21:1-46, Ezekiel 16:10-13, Zechariah 9:9",
        "devo_title": "Jesus Is King",
        "devo_summary": "\n                    \n                    When we read Scripture, we’ll notice many different ways Jesus is described. Some have to do with His nature (who He is), and some have to do with His ministry (what He does). To understand the depth of Jesus’ life and ministry, we have to understand many things about Him. We have to understand that He is fully God and yet fully man; He is the God who can forgive sins, and the man who shed His blood to cover them. He is a priest, standing as mediator between God the Father and His sinful people. He is also a prophet, who speaks on behalf of God and embodies His message of both grace and judgment. And in today’s reading, we see that Jesus is also a king.\nHe is not king in the way the people laying down their palms and coats might have imagined—a political hero or a military leader. But make no mistake: He is King.\nNow, when we think of kings, we often think of corrupt leaders. We tend to be wary of power because, as Lord Acton said, “absolute power corrupts absolutely.” There is no such thing as a perfect earthly king or ruler, president or prime minister. In our passage today, Jesus is mentioned in the same breath as King David. We all know the faults of David, most notably that he was a murderer and adulterer. Even so, in all his imperfection, he was a man “after God’s own heart,” whose bloodline would one day produce the True King (1 Samuel 13:14; 2 Samuel 7). David wasn’t perfect, but God would send a perfect King from David’s family line.\nKing Jesus is the King who can never be corrupted, because He is the only man who lived and died without sin (2 Corinthians 5:21). While other kings barter over possessions and land and military might, our King owns all things and is eternally undefeated. Even His death on a cross was not a defeat, but a cosmic victory over His greatest enemies: sin and death (1 Corinthians 15:57).\nOur passage today reminds us that Jesus is the rightful King of the world and of our hearts. He does not make deals with the devil, but rather stomps his head (Genesis 3:15; Matthew 4:1-11). Praise God that King Jesus is not only a powerful and perfect ruler, but also a kind and humble King who invites His children to come to Him. May we, with childlike faith, embrace our King, trusting Him to grant us His life-giving grace and protect us from life-stealing sin.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-19.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 19:1-30, Matthew 20:1-34, Deuteronomy 6:4, 2 Peter 3:10-13",
        "devo_title": "Jesus Came to Serve",
        "devo_summary": "\n                    \n                    I honestly believe that if we are not thrown by what Christ says, we probably haven’t heard Him correctly. Jesus’ words continue to baffle those who hear them. Even His disciples, who walked with Him daily, kept double-checking to be sure they’d understood Him correctly. And when He addressed the issues of divorce and marriage, His disciples simply reasoned, “If the relationship of a man with his wife is like this, it’s better not to marry” (Matthew 19:10).\nIf we hear Jesus correctly, we are right there with the disciples, scratching our heads, and doing our best to understand it all. When He speaks of camels passing through needles, they respond: “Then who can be saved?” (Matthew 19:23-25). Who indeed? Who can live in the economy of God’s kingdom? No one, according to his own works. With man, it is impossible, but with God, all things are possible (v. 26). \nWe are both legalists and antinomians at heart; we think of the law as a means of earning favor, salvation, and glory, yet we also think of the law in the loosest terms possible. Like the men in the vineyard, we are incensed when we don’t get paid bonuses, despite the fact that we’ve received our just wages (Matthew 20:1-15). Like the rich man, we’ve kept our own version of the law and are disappointed to find that it is not enough (19:16-22). Like the Zebedees, we think we can drink the cup, and we’d like to get a few thrones thrown in just to make things fair. And if someone else seems to beat us to it, we are indignant (20:20-24). \nMankind has always been angling for first place, failing to recognize that God’s economy works very differently. But many who are first will be last, and the last first (Matthew 20:16). To inherit the kingdom, we ought to come to Him as children, that He may lay His hands on us and pray (Matthew 19:13-15). May we come to Him as the blind men, saying “Lord, have mercy on us… Open our eyes!”  (Matthew 20:30, 34). \nLet us lay aside our anglings and barterings, the clamoring for first place, lording what authority we have over those in our care. Yes, left to ourselves and in our own strength, this is impossible, but with God all things are possible. For, “the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many” (Matthew 20:28). In His kingdom, great and small are overturned, as He simply calls us to Himself, saying, “Come, follow me.”\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-18.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 17:1-27, Matthew 18:1-35, 1 Kings 8:10-13, Jeremiah 23:1-4 ",
        "devo_title": "Jesus’ Glory and Power",
        "devo_summary": "\n                    \n                    Have you ever been frustrated when a writer or film director does something that seems outside the expected or conventional lines of a story? Recent backlash over the film Star Wars: The Last Jedi is evidence of that very kind of frustration. Some faithful fans have expressed their disappointment and even disgust with the plot twists director Rian Johnson made. The Star Wars-obsessed had trouble allowing their predictable plot lines to be altered in a new creative direction. No longer could the audience say to themselves, I know where this is going…  \nThe problem is we often think that way about Jesus too. Even Jesus’ closest disciples did. As our passage today points out, Peter thought he had it down when it came to the plot line of Jesus. As he stood with James and John on the mountain and Jesus revealed His full and radiant glory to them, it seemed this was the moment Peter had been expecting: Now the Kingdom has come! Now Rome will be overthrown!\nEven the appearance of Moses and Elijah confirmed Peter’s perceived familiarity with the trajectory of Jesus’ story. As the glory mounted, he proposed the opportunity to harness the moment, saying,  “Lord, it’s good for us to be here. I will set up three shelters here: one for you, one for Moses, and one for Elijah” (Matthew 17:4). Looking to establish a way to memorialize, and perhaps even monetize, God’s power and glory, Peter believed he had it all figured out about Jesus.\nIs that the case with you too? Does Jesus fit into the nice and tidy box that you have built around your behaviors, politics, and religious expectations? It’s possible that when we really see who Jesus is, we will be frustrated that He doesn’t fit our perceived patterns of who He should be. \nGod’s interruption of Peter is the exact remedy we need in those moments. As the glory of Christ was placed on full display, the Father broke into the story, which forces us to evaluate what kind of relationship we possess with Him. Jesus isn’t one we can manipulate into bringing about our best life now. Instead, the Father declares Jesus to be His beloved Son to whom we are obligated to listen. The familiar line we expect is that Jesus is obligated to us; the plot twist is that we are commanded to listen to Him. \nMaybe this is why Jesus is frustrating to many; He doesn’t fit the tropes we’ve constructed for Him. When we come face to face with who He really is, sometimes we’d rather listen to ourselves. Yet, for those who will abandon their own storylines and desires to manipulate Jesus, they will hear Jesus say, “Do not be afraid.” That’s the power and glory He came to show.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-17.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 15:1-39, Matthew 16:1-28, Zechariah 12:10, 2 Peter 1:16-18",
        "devo_title": "Jesus Is the Messiah",
        "devo_summary": "\n                    \n                    Follower. It’s a word that’s always been in danger of half-hearted usage. But social media has captured the word and diluted it with a swift terribleness. For many in our current culture, to be a follower means nothing more than loosely keeping track of someone online whom you may or may not know in person, and if you do know them, it’s often by way of a mutual friend. There is little to any actual commitment to that person other than clicking the “follow” or “like” buttons and then, on occasion and only if the mood strikes, commenting with an emoji in response to words or images that person posted. These days following is, as they say, “easy peasy.”\nJesus the Messiah was accused of many things in His day, but being indirect was usually not one of the charges. If anything, His approach may have seemed too direct, too piercing, or at least more so than His contemporaries would’ve preferred. The Gospel according to Matthew records Jesus’ straightforward, but rather un-easy-peasy, conditions when it comes to following:  \n“If anyone wants to follow after me, let him deny himself, take up his cross, and follow me” (Matthew 16:24).\nThis is a good example of the danger of sidestepping the truth of Scripture in an attempt to remake Jesus in our own image. We must let Jesus be Jesus. If we’re not careful, we’ll paint Jesus as a consensus-seeking savior, always content to hear every opinion around the table, and then in conclusion, to encourage some variation on a theme of “Can’t we all just get along?” But hold on. That is not Jesus—certainly not Jesus the Messiah we find in Matthew’s words. \nThe truth here is clear, stabbing, and let’s face it, possibly more than we would prefer. There is a cost involved with being a follower of Jesus. It requires a self-denial that rings strange in our postmodern ears, and a level of commitment that rubs our progressive wills the wrong way. It means surrendering to the reality that, as one pastor paraphrased: “We are not in the driver’s seat. Jesus is.” The faded bumper sticker you may see from time to time reads: “God is my co-pilot.” No, no He’s not. And if He is, you can call yourself something—just not a follower.       \nFollower. According to Jesus the Messiah’s definition, this means choosing to be, as they say, all in. Anything less is simply about liking Jesus. What the Messiah calls for is our love.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-16.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 13:53-58, Matthew 14:1-36, Deuteronomy 8:3, Isaiah 43:10-13 ",
        "devo_title": "Jesus Is the Son of God",
        "devo_summary": "\n                    \n                    The power of Jesus is greater than any of us can imagine. \nAt the end of the movie The Matrix, there’s a scene where the protagonist Neo is in a hallway fighting Mr. Smith. As Mr. Smith sprays bullets toward him, Neo raises his hand, causing the bullets to stop mid-air and harmlessly drop to the floor. Remember that scene—when Neo realizes he is “The One”? After the bullets fall, Neo flexes his arms, and when he does, it’s as if the walls surrounding him and the rest of the world flex with him. It’s an exhilarating scene because it marks the moment when evil realizes it is no match for good. \nIn today’s reading, Jesus walks on water. This may be one of the most well-known details of Jesus’ life, but when we look at the text, we see that those who are close to Him do not respond with a cheer. They are afraid. Why? Because Jesus is flexing and the world is flexing with Him. His disciples are beginning to wonder if they have a tiger by the tail; if they let go, there’s no telling what may happen.\nPerhaps one of the most accurate words we could use to describe Jesus during the Galilee phase of His earthly ministry, is “famous.” Though the time was coming when the world would turn on Him with a vengeance, in these early chapters of Matthew’s Gospel, everyone seems to want a piece of Him. When He opens His mouth to teach, great crowds gather. When word spreads that He is close to a town, the sick, lame, and blind are brought for healing. When He goes to the synagogue to teach, religious leaders square up for debate as though they are facing a worthy opponent. \nBut as we know well in our own culture, being famous is not the same as being known. Most people who admired Jesus in this stage of His earthly ministry admired Him for who they thought He was, not for who He truly was. We all do this to one degree or another. Even John the Baptist, who came out of the womb with a call to prepare the way for Jesus’ life of ministry, wondered if Jesus really was the Messiah (Matthew 11:1-19).\nOne reason I love the story of Jesus walking on the water is because of how it terrifies those who see Him. Surely if any of us saw Jesus flex like this, if we saw His full glory and power on display, we’d be terrified too. Why? Because the power of Jesus is greater than any of us can imagine.\nThe Apostle Paul says in Philippians 2 that every knee will bow before Jesus, and every tongue will confess that He is Lord (vv. 10-11). He has this sort of power and glory. But just as He invited Peter out onto the water, He invites us to draw near to Him in all His glory and power. We draw near by faith, knowing He will not use His power to crush us, but to save us. Still, it is good for us to remember that His power remains greater than we can imagine.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-15.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 9:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize a verse from Matthew that powerfully summarizes what Jesus came to do, and why.\n“Go and learn what this means: ‘I desire mercy and not sacrifice.’ For I didn’t come to call the righteous, but sinners.”\n– Matthew 9:13\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/4-HRTMatthew-2.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Isaiah 29:18-19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nOn that day the deaf will hear\nthe words of a document,\nand out of a deep darkness\nthe eyes of the blind will see.\nThe humble will have joy\nafter joy in the LORD,\nand the poor people will rejoice\nin the Holy One of Israel.\n– Isaiah 29:18-19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-13.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 13:1-52, 1 Corinthians 5:6-7",
        "devo_title": "Jesus Speaks in Parables",
        "devo_summary": "\n                    \n                    “Dad, stop making your points,” my exasperated middle school daughter sighed recently, after one more of my brilliant analogies. As parents naturally do, I was using an example to make a point about an attitude she needed to change. It was concrete, clear, and drew out the truth I was seeking to make obvious to her. Needless to say, it fell on deaf ears. \nYou might say she did not have ears to hear. (You might also note that I am not Jesus and don’t have His perfect communication skills.) She heard me, she understood my words, yet the meaning did not penetrate her heart. \nJesus navigated this very matter at a more profound level, an eternal life-and-death level. He spoke life-saving truths in parables, veiled stories packed with meaning. But only some people could pull back the veil to access the meaning with clarity—those with “ears to hear.” To some, Jesus said, the secrets of the kingdom had been revealed, and for them parables were clear and crystalline, solid and sharp. For everyone else, they were a fog of words swirling around the truth, keeping it from being clearly seen and understood.\nWhen Jesus spoke of good soil, mustard seeds, wheat and weeds, and leaven, He was using familiar objects and actions to give imagery to spiritual realities. Like an optical illusion, His words were lost on many listeners. But for those who were willing to hear, Jesus would explain His parables. \nWhy didn’t He explain them for everyone? Why not just speak in plain language to begin with? Because Jesus was calling hearts, not arguing with minds. He spoke to the ears of the heart, and if those ears could hear Him, then the heart would follow Him. Those with ears to hear were the good soil in which the Word could spring up, grow, and bear fruit. Their fruit was like a mustard seed of faith that started small and would become a great plant.\nSo often we read Scripture and see the words of Jesus. We hear sermons and lessons. We read books and receive teaching. Our minds absorb it and parse it out. Our intellects are stimulated as we put together ideas and arguments. But are we good soil? Is the seed of the Word planted and bearing the fruit of faith? We hear, but do we listen? For that is how we truly know Jesus and enter into His kingdom.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-12.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 12:1-50, Leviticus 19:9-10, Isaiah 42:1-4",
        "devo_title": "Jesus Is Lord of the Sabbath",
        "devo_summary": "\n                    \n                    For thousands of years, and even today, controversy and confusion surround the matter of the Sabbath. Should the day of rest be Saturday or Sunday? Are we allowed to do anything on the Sabbath, or is the point to just avoid work? And why can’t Chick-fil-A be open all the time? \nRegardless of what we believe about the Sabbath, we know two things to be true: we need rest, and Jesus is our ultimate rest. Currently, I have been working for about twelve days straight, so I am experiencing the practical need for a day of rest in my life right now. At the same time, I know that it is in Jesus alone that I find true Sabbath rest.\nIn Matthew 12, Jesus is confronted with the legalism of the Pharisees who seek to prosecute Him for not adhering to the culturally appropriate ways of observing the Sabbath in His day. Jesus responds by telling the Pharisees and others listening that “the Son of Man is Lord of the Sabbath” (v. 8). Meaning, the religious ordinances and rules erected by the Pharisees in an attempt to worship Yahweh, yield to the authority of the Son of Man, who is Jesus.\nThe Pharisees misunderstood the Sabbath. They understood it to be a day in which they rested, but they executed it as a sort of worshipful mimicry of how God rested after He created the earth. This was a partial, and therefore incorrect, view of the Sabbath.\nJesus came to tell them that the Sabbath is more than a day. It is a person. It is Jesus Himself. And it is in Him that we find true rest, not in a day defined by ritualistic relaxation. Indeed, one day, as Matthew said in recounting Jesus’ confrontation with the Pharisees, “The nations will put their hope in his name” (Matthew 12:21; Isaiah 42:1-4).\nTaking a day of our week to rest from work and the routine stressors of life is wise, no matter what day of the week it is. But we rob ourselves of true rest if we simply understand the Sabbath to be a license to be lazy one day out of every seven. \nTo experience true Sabbath rest, we must rest in the finished work of Jesus. He is the only One in whom we can find true rest, because His work is the only work which is actually finished. Might we, the nations, put our hope in the name of the One who purchased eternal rest on our behalf.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-11.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 11:1-30, Isaiah 29:18-19, 1 John 5:3-4",
        "devo_title": "Jesus Gives Rest",
        "devo_summary": "\n                    \n                    “Come to me, all who labor and are heavy laden, and I will give you rest” (Matthew 11:28).\nFor a number of years I lived inside this verse. Or the verse lived inside me.\nMonday through Friday I would drive begrudgingly to the office. I would park the truck as far from the building as possible, walk through the parking lot, use my badge to get into the building, wait for the elevator, and then clock in. And Monday through Friday I would work hard, clock out with a sigh, wait for the elevator, use my badge to leave the building, walk across the parking lot, and drive home miserably, knowing I would get up the next morning and do it all over again. \nAnd this verse from Matthew 11 would swirl inside my head.\nI know what this verse is about. It’s not about the rest that I longed for, from a job I was ill-fitted for in the business world. This verse is not about the weariness I am experiencing now while working at a school doing something I love. Yes, that is God-given rest, but this is not the rest Jesus was offering. They are related, though. \nYou see, while I was working in that awful place, I would often doubt God’s affection for me. There was an intellectual compartment in which I stored all the knowledge of God’s justifying grace and love toward me, regardless of my attitude and sin. I could teach it to a Sunday school class. I could counsel friends about it. But buying in while sitting at my desk was proving elusive. Doubt would creep in, riding on the wings of emotional reactions to stress and the hardship of work I had to do and could not seem to escape.\nLet me tell you if you don’t already know: misery in your work, coupled with guilt over that misery, is a deadly mix. Guilt because you have a job and you hate it. Guilt over not doing a good job at work because you just don’t care. Guilt because God has given you so many other good things. It wears you down. It crowds out hope, and you have trouble enjoying even the smallest things.\nI just wanted some rest. And Jesus offered it. \nWhen in the midst of all the stress and frustration, I would sometimes remember the gospel message of Christ’s work on my behalf. I’d remember that He did all the heavy lifting—actually, He did all the lifting, period. Regardless of how my day went and how frustrated I was, I could rest in the knowledge that God the Father loved me because of what God the Son did for me. \nAnd here’s the kicker. One day, we will not only rest in the work of Christ, but we will rest from all the weariness of this world. We need to go to Jesus with our need for rest from trying to work ourselves into God’s good graces. That is good news. In a world that offers work, Jesus offers rest for our weariness.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-10.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 10:1-42, Acts 1:13, James 2:1-7",
        "devo_title": "Jesus Sends the Twelve",
        "devo_summary": "\n                    \n                    I remember roughly two to three handfuls of stuff from high school, and somehow, a lesson from Basic Economics made the cut. Here it is: There’s no such thing as a free lunch. Everything costs something. Sure, you may be getting a free bowl of chili, but it cost someone to make it. They bought the food, used labor hours to prepare it, bought bowls, utensils, and on and on. Something may appear free to you, but it was costly for someone else. \nAnd this is Jesus’ point too.\nJesus sends His band of brothers out, reminding them what they paid to become His disciples: absolutely nothing. They didn’t earn it. They weren’t selected because of their prestige, influence, or liquid cash to make things happen. They didn’t pay a premium to get in the room with Jesus. The Twelve freely received the message of the kingdom. Their discipleship with Jesus was free of charge. Jesus now tells them as they go forth proclaiming the kingdom, to not do it for the coin. “Don’t acquire gold, silver, or copper for your money-belts” (Matthew 10:9). Freely they received, so they should freely give, expecting nothing in return.\nJesus operates on the currency of grace with His people, and this is to be our currency with others too. There is no fitting exchange rate for grace. Once we try to exchange grace for something else—swap it out for works, mere morality, or self-righteousness—we get zero back. The entire Christian life, beginning to end, is from this reality: “For you are saved by grace through faith, and this is not from yourselves; it is God’s gift” (Ephesians 2:8). \nBrothers, we’ve freely received, so we freely give. We’ve been forgiven, so we forgive. We’ve been loved, so we love. The message of grace came to us, so we can give it to others. Jesus wants us function and serve from a place of grace, freely given to us by Him. \nRemember, there is no such thing as a free lunch. It will cost you to give to others. Maybe you’ll have to spend money to help someone who is down. Perhaps you’ll spend time over lunch evangelizing. Or maybe you’ll rack up weekends serving in a prison or a pregnancy center. But these operating costs are joyfully spent because the kingdom is worth it. Jesus is worth it. It cost Jesus His blood—His very life—to free us from our sins and give us new life. We did nothing but believe. \nAnd today, the risen Jesus invites us to freely give as we’ve freely received, to share a no-strings-attached gospel. To serve as you’ve been served by Jesus. In your day-to-day, invite others in to the experience of freely receiving the grace of Christ through you from Him.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-9.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 9:1-38, Numbers 19:11-21, Hosea 2:19-20",
        "devo_title": "Jesus Forgives",
        "devo_summary": "\n                    \n                    Shame is a powerful emotion. We have all felt the painful feeling of shame arising from the consciousness of something dishonorable or impure. Shame causes us to pull away from others. It is impossible to estimate how much time and energy people invest in trying to hide or deny the things they are ashamed of.\nThis is why the woman who rudely breaks into the account of Matthew 9 is so intriguing. According to medical and social norms of the time, she was beyond unclean. She was the carrier of an unspeakable bloody discharge. And yet she pushes through the crowd. Does she have no shame?\nIn the ancient Near East, most people would have gone to great lengths to avoid unnecessarily exposing themselves to her. Yet here she is, moving through a large crowd in pursuit of Jesus. Doesn’t she know that, according to Old Testament law, she could infect other people with her impurity?\nSo what is more powerful than her shame? What causes her to go public and push through the crowd in order to grasp the edge of Jesus’ robe?\nDesperation.\nDesperation may be the only thing more powerful than shame. It is the woman’s desperation that causes her to expose her dishonor and impurity with the hope that she will be made clean.\nAnd Jesus responds unexpectedly. He doesn’t pull away from her in disgust; He accepts her in love. When this woman touches the hem of His garment, Jesus turns to her and refers to her as His “daughter.” With great affection, He welcomes her as a dependent.\nIsn’t this amazing? Jesus was unashamed to be identified with her uncleanliness. “‘Have courage, daughter,’ He said. ‘Your faith has saved you’” (Matthew 9:22).\nThis should not surprise us. After all, this is the same Jesus who came to embrace all of humanity’s  uncleanliness and shame on the cross. This is the same Jesus who would pour out His own blood to make us clean. This friends, is the good news of the gospel. Christ tells us not to cover our shame, but bring it to Him. When we confess our shame, Jesus covers it for us, making us clean before the only audience that matters: our Holy God. Therefore, don’t pull away from Christ—run to Him in desperation. He is the only one who can rid you of your shame.\n Written by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-Matthew-instagram-8.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 4:17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    \nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for the Gospel of Matthew:\nFrom then on Jesus began to preach, “Repent, because the kingdom of heaven has come near.”\n– Matthew 4:17\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/4-HRTMatthew-1.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "1 Chronicles 29:11",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    1 Chronicles 29:11\n \nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nYours, LORD, is the greatness and the power and the glory and the splendor and the majesty, for everything in the heavens and on earth belongs to you. Yours, LORD, is the kingdom, and you are exalted as head over all. \n– 1 Chronicles 29:11\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/HRT-Matthew-instagram-6.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 8:1-34, 2 Samuel 22:16, Isaiah 53:4-5",
        "devo_title": "Jesus Heals",
        "devo_summary": "\n                    \n                    Growing up in North Texas, you get used to tornadoes. Every April or May, tornado warnings seem to go off multiple times a week. For eight weeks, it feels like you spend more time in your closet or bathtub than anywhere else in the house. For my family, our fear of these uncontrollable storms was always at red alert. Our area wasn’t just at risk for the occasional twister; we lived where many of those tornadoes tended to start. We were often glued to The Weather Channel, sure that our day was (eventually) going to come.\nI’d like to say that we always prayed and trusted the Lord in those moments. Truthfully, we didn’t. We treated tornadoes like embodied deities, almost bowing down to them and begging them not to hit our house. C’mon, tornado. Stay north of us. Don’t come through here, we prayed from our closet. We stopped just short of leaving them an offering on our doorstep.\nMuch like the disciples on the boat, we had doubts. When the storms raged around us, we said, “Lord we’re going to die!” We wish we were more like so many of those in today’s passage who turned to Jesus, with faith that he could heal and protect. In fact, we have even less excuse than the disciples to doubt Jesus’ power, because we get to look back on these stories and see the Savior at work.\nIf we believe the Bible is true, then we’ll ultimately rest in the truth that Jesus is in the business of healing and protecting. Storms, diseases, and frailties are like house flies in the face of Jesus—they are annoying, but of no real threat. He squashes them with a mere word. After all, “even the wind and sea obey him” (Matthew 8:27). Surely, even our greatest heartaches, missteps, and fears are no match for Him. \nToday, may we trust that even through life’s storms and pains, Jesus is here. He cares. He empathizes. He reaches out to us. He may not always answer exactly how and when we’d like, but He is never silent or ambivalent to us. \nThanks be to Him.\n Written by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/HRT-Matthew-instagram-5.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 6:1-34, Matthew 7:1-29, 1 Chronicles 29:11-13, 1 John 2:28-29",
        "devo_title": "Jesus Preaches the Sermon on the Mount, Part 2",
        "devo_summary": "\n                    \n                    I’ve been listening to the song “Weight of Lies” from the Avett Brothers’ album Emotionalism. They sing:\nShow them all of your good parts,\nLeave town when the bad ones start to show.\nIsn’t this the inclination of the heart? I like to keep my good works in public view, and keep my shameful side out of sight. Please, notice me for showing up to church on time every Sunday, but don’t look at the way I badgered my family into getting there.\nChrist’s Sermon on the Mount turns everything on its head. His declaration, “you must not be like the hypocrites” (Matthew 6:5), is a direct confrontation to my every natural proclivity. I want people to think the best of me. Is that so wrong? I want to be the sort of guy others can look up to and emulate, which is great. But I quickly slip into a pursuit of reputation, rather than a pursuit of righteousness. I begin to store up treasures on earth. And before I know it, the moths have come, and the rust eats away at my storehouse.\nPride can make much even of humility. It can turn even fasting and prayer into pomp and show. Greed goes out dressed as generosity. Meaningless babble goes out dressed as prayer. And the weight of hypocrisy begins to drag us down.\nOf course, the Sermon on the Mount isn’t chiefly about hypocrisy. It is about the kingdom of God. Hypocrisy is our way of looking like we’re walking in step with the kingdom. We think it might be easier to pretend, to turn a blind eye to the pet sins, to push aside the really difficult parts. We like the idea of dressing in the robes of righteousness, but we don’t want it deep down in our bones. We don’t want it to trouble our habits, to muddle with our comforts, to mess with our bank accounts. We tell ourselves we can serve two masters.\nI wrestle daily with how to confront the hypocritical leanings of my heart. The old carnal man sticks too close for comfort, and I keep tripping over him. Christ’s remedy is simple.\nAsk, and it will be given.\nSeek, and you will find.\nKnock, and the door will be opened. \nAsk, for your Father in heaven gives you the very bread of life. Seek, because He first sought you. Knock, because He Himself is the door. Do not seek for bread that does not satisfy, or water that does not quench, but seek first His kingdom, and His righteousness, and all these things will be provided.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/HRT-Matthew-instagram-4.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 5:1-48, Romans 12:9-21, 2 Timothy 3:16-17",
        "devo_title": "Jesus Preaches the Sermon on the Mount, Part 1",
        "devo_summary": "\n                    \n                    Monopoly is a great game to play if you have seven hours to kill and you’re looking to lose a few friendships and most of your dignity along the way. It usually starts out civil, but before you know it, you’re yelling at your grandma and throwing the dice across the room. \nIn fact, I think it’s safe to speculate that the ratio of those who have started a game of Monopoly to those who have finished one is staggeringly askew. Sometimes it’s best for everyone’s sanity that the game is called off before completion. \nIf we’re not careful, we can start to think that the Law is a lot like Monopoly. God thought it was a great idea at first, but after a few shouting matches, and a bunch of hurt feelings, He realized it was probably best to just call the whole thing off. In this scenario, He sent Jesus to help extricate us from a flawed game and pronounce us all friends and winners. \nThe trouble with this way of thinking is that Jesus directly contradicts this notion in the midst of the Sermon on the Mount. Jesus didn’t come to abolish the Law or show up as a Plan B to remove unfair rules and arbitrary regulations. Rather, in His own words, He came to fulfill it (Matthew 5:17). \nMatthew 5 is a very special passage because we see Jesus carefully re-calibrating His listeners’ understanding of the Law. Where there was so much emphasis on outward piety, Jesus drills down and applies God’s principles to the heart. What’s also fascinating about this moment is we see a direct resonance with Moses’ original reception on the Law on Sinai. We see a leader of God’s people—and this time God incarnate—standing on a mountain, revitalizing the hearts and lives of His listeners; offering a way to fulfillment that never existed before. \nThrough His fulfillment, Jesus offers release and reprieve for the heavy-laden. He offers rest for the weary. He brings grace and restoration for those who need it most: all of us. In other words, in the Monopoly analogy, Jesus didn’t show up to calm us all down and shelve the game. He came to complete the game that, literally, no one else could even come close to finishing rightly. And we participate in His victory, not because the Law was flawed and needed ending, but because we were incapable of being faithful to it. \nHis love for us is one of the reasons that He didn’t abolish the Law. Because the Law was fundamentally not the problem—our sinfulness, selfishness, and cynicism was. He walked this life all the way through, perfectly and righteously on our behalf. And in His victory, He didn’t just free us from the Law; He makes us co-heirs and co-victors with Him (Romans 8:17).\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/HRT-Matthew-instagram-3.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 3:1-17, Matthew 4:1-25, Isaiah 40:3, Malachi 4:1-6",
        "devo_title": "Jesus’ Ministry Begins",
        "devo_summary": "\n                    \n                    For better or worse, I grew up watching “Sesame Street” as a child. I especially remember that instructional skit in which one of the characters would have four things set in front of him. Three of the items would be identical and one would be different. The song would then start: \nOne of these things is not like the others\nOne of these things just doesn’t belong…\nBefore His earthly ministry started, Jesus came to the Jordan River to be baptized by John the Baptist, the herald who proclaimed the coming Messiah, saying, “Prepare the way for Lord; make his paths straight!” (Matthew 3:3; Isaiah 40:30).\nGod had sent John to inaugurate the Messianic ministry by calling His people to repentance, representing their cleansing by baptism. People flocked to John and his ministry, turning back to God in repentance and faith. And so Jesus also came to John to be baptized. But why? \nThroughout the New Testament we learn that Jesus “did not commit sin” (1 Peter 2:22) and was “holy, innocent, undefiled, separate from sinners” (Hebrews 7:26). Why would the sinless Son of God come to John to receive baptism, a sign indicating the need to have sins washed away? \nWhen Jesus stepped into the Jordan, He was stepping into the waters that had been symbolically polluted by the sin of the great line of those who had gone in before Him. Jesus submitted Himself to having that symbolically polluted water poured over Him. Geoff Thomas captures the scene so well:\n“There is a great line of repentant sinners standing soberly and sorrowing on the bank of the Jordan waiting to go down into the waters… There’s a thief, a drunkard, an adulterer, a liar, a bully, a wife-beater, an idol-worshiper, a torturer, Jesus, a murderer, a forger, a troublemaker, a braggart, a terrorist, a blasphemer, an abuser of children… and hundreds more—every one a sinner, and there is Jesus—made in the likeness of sinful flesh—standing in line.”\nHow do we know Jesus was so very different from the others in that water?\nEven John questioned the need for Jesus’ baptism, at first trying to stop Him, saying, “I need to be baptized by you, and yet you come to me?’” But Jesus said, “Allow it for now, because this is the way for us to fulfill all righteousness” (Matthew 3:14-15). \nSo John baptized Him. Then the heavens opened up. The Holy Spirit descended on Him. And the Father Himself spoke over Jesus: “This is My beloved Son, with whom I am well-pleased” (Matthew 3:13-17). \nThe Father’s affirmation would carry Jesus all the way to the cross where He would die for those who could not live without Him. Nailed to the tree and under the wrath of God, Jesus washed away the sins of His people through His bloody baptism on the cross (Luke 12:50). \nImagining Him there now, on the banks of the Jordan River, we must conclude that truly, He is the One who is most certainly not like the others. Yet He became like us in order to redeem us. “God made him who had no sin to be sin for us, so that in him we might become the righteousness of God” (2 Corinthians 5:21).\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/HRT-Matthew-instagram-2.jpg"
    },
    {
        "book_title": " Matthew",
        "devo_passages": "Matthew 1:1-25, Matthew 2:1-23, Isaiah 9:2-7, Isaiah 11:1-9, Jeremiah 31:15",
        "devo_title": "This Is Jesus",
        "devo_summary": "\n                    \n                    I was a sophomore in high school when I became a Christian. I remember that season well. I received the gospel like it was a gift given especially to me. I was hungry to learn what it meant to live out this new faith, but I had no idea where to begin.\nThe counsel my youth group leaders gave—read the Bible and pray—has since become what I refer to as “the jeans and t-shirt” of the Christian life. Scripture and prayer are so basic, and yet they never go out of style. No matter what is happening in my life, spiritually or otherwise, I am happiest and healthiest when prayer and Scripture are part of my regular rhythm.\nMy youth pastor gave me a “Read the Bible in a Year” plan. That little card directed me to start by splitting my time between Genesis and Matthew. I imagine these are the first books of Scripture for many new believers—the beginnings of the Old and New Testaments.\nToday’s reading—Matthew’s opening two chapters—are a bridge between the Old and New Testaments. They give the history of those who came before Jesus, and the story of His birth, which changes everything that follows. No one understood this better than Matthew himself.\nMatthew was not just an historian. He was a person who knew firsthand the transforming power of the gospel. Matthew was one of Jesus’ twelve disciples, a tax-collector called away from his booth. Jesus called him to stop feeding off the wealth of his countrymen and to give away the riches of God’s kingdom instead.  \nMany people meet Jesus for the first time through Matthew’s Gospel. This was Matthew’s primary goal: to introduce his readers to Jesus. Matthew also introduces us to the world in which Jesus lived, died, and rose again. In this Gospel, we meet key people and groups involved in the story of salvation, from John the Baptist to Pontius Pilate, from the twelve disciples to the Pharisees. And not only that, we also become familiar with the Promised Land itself—Israel, with the Sea of Galilee in the north and Jerusalem on the mountain in the middle. \nAs you read, pay attention to these details: the characters, places, and plot points. Ask the Lord to give you eyes to see things you’ve never before noticed or known. Whether you are new to Scripture or reading this Gospel for the tenth time, my prayer is that we would all come to know Jesus better after spending time in these words.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/12/HRT-Matthew-instagram-1.jpg"
    }
]