[
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 3:5",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for 2 Thessalonians. \nMay the Lord direct your hearts to God’s love and Christ’s endurance.\n—2 Thessalonians 3:5\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/4-Thessalonians-2.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Peter 5:8-9",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBe sober-minded, be alert. Your adversary the devil is prowling around like a roaring lion, looking for anyone he can devour. Resist him, firm in the faith, knowing that the same kind of sufferings are being experienced by your fellow believers throughout the world.\n—1 Peter 5:8-9\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-13.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 3:1-18,  2 Corinthians 11:7-9, 1 Peter 5:8-11",
        "devo_title": "May the Lord Direct Your Hearts",
        "devo_summary": "\n                    \n                    Sometimes faithfully following Christ is exhausting. Day after day we get up, look ahead, and see a climb with no end in sight. We scrabble and scramble ahead, then fall sideways, then slip back, then slog and crawl ahead again. Over time we get worn down.\nWhen we feel this way we need encouragement, or maybe a good kick in the pants. We need a glimpse of what lies ahead so that the grind of life today, in the moment, feels worth it and we find motivation. And that’s what we find in these passages from today’s reading. \nFirst, Paul describes how he prays for believers, so they will know they are in the hands of God. This reminds us of our own security, and the source of our ability to persevere. Then he points to his own life as an example. Now we know someone has gone before us and has been faithful through great struggle. If Paul can do it with God’s help, then we can find hope and motivation too (2 Thessalonians 3:1-5). \nThen we see the reason for our struggle. It is not in vain; it is in resisting the devil who actively seeks to destroy us. We are fleeing temptation and fighting sin. And as we do this, we are spreading the Word through our faithfulness, both by our example and through our profession. Our struggle is for our own well-being and for the salvation of others.\nYes, this will cost us, most likely, far more than just fatigue. We will suffer. We will face conflict with those who refuse to follow Jesus, especially those closest to us. We will become weary and wonder if it is worth it. Our weariness might lead to doubts or apathy or just plain giving up. \nThat is why Paul writes “do not grow weary in doing good” (v. 13). And he pairs it with a promise: God’s love will direct the believer’s heart, allowing us to press on, powered by Christ’s endurance. Christ was faithful in pressing on, resisting temptation, navigating difficulties, and facing His suffering to the utmost—and without failing! The Lord will certainly lead believers to that same endurance. \nIf we press on, if we do not let our weariness get the best of us, we will be established and strengthened. We will always slip and slide, but we will gain ground. We will fail, but we will show the world the faithfulness of God to us in Christ. So let us pray as Paul prayed. Let us follow his example as he followed Christ’s, and move forward—however nearly spent and discouraged—one step at a time. \n“The God of all grace, who called [us] to his eternal glory in Christ, will himself restore, establish, strengthen, and support [us] after [we] have suffered a little while. To him be dominion forever. Amen” (1 Peter 5:10-11).\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-12.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 2:1-17, Daniel 11:36-37, Matthew 24:30-31",
        "devo_title": "Do Not Let Anyone Deceive You",
        "devo_summary": "\n                    \n                    If there is one thing that unsettles men, it is deception. If you have ever been lied to, deceived, or manipulated in any way, I imagine you have felt alarmed and shaken to your core. In a sense, this is justified; deception is born in the pits of hell.\nThe father of all lies is the defeated one, Satan. Jesus makes it very clear in John 8 that there is no truth in him (v. 44). Moreover, one of the ways the evil one seeks to devour the faith and hope of the church is by spreading deceptive doctrine (1 Timothy 4:1). These things are important as we approach 2 Thessalonians, where the church has been deceived to believe that the day of the Lord had already come.\nThe second coming of Christ is a foundational doctrine of the New Testament church. When speaking of Christ’s imminent return, the aim of the apostles was to spur the church on—through affliction and trials, toward the hope of Christ’s final vindication, where all things are made right.\nImagine if you are counted among the Thessalonian Christians, awaiting the return of Christ for final deliverance from life’s most difficult challenges. Now imagine that you have been deceived to believe that it has already occurred. You would probably ask questions like, Where is the final justice God promised? Where is the vindication of the righteous that Christ secured? Where is the fulfillment of God’s most comforting promises for the suffering believer?\nIf it were me, I would have been shaken, alarmed, even disheartened. For this reason, Paul urges the church to not “let anyone deceive you in any way” (2 Thessalonians 2:3). This exhortation still holds true for us today.  \nSatan has been a liar from the beginning. His aim has always been the same, to pull Christians away from their hope and joy in the promises of Christ. The deception of the church in Thessalonica was not so different from the other forms of deception used by Satan today.\nHave you ever been deceived enough to question if God really loves you? Have you ever been deceived enough to question whether or not God hears your prayers, or even cares? Have you ever been tempted to despair over your circumstances? In all of these cases, Satan’s aim is to steal your joy and diminish your hope.\nThe Apostle Paul is clear: Let no one deceive you! Do not let the evil one rob you of your joy and hope in Christ. Deception is a spiritual war waged in the minds and hearts of men, fought by assaulting the lies of the enemy with the truth of God. Christian, take up your armor and fight for faith! We learned this from our Master. Satan tempted Jesus three times, and three times the offer was refused (Matthew 4:1-11). All three times, Jesus fought back with the truths found in Scripture, saying, “It is written.” \nDo not be deceived, but hold fast to the truth of the gospel.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-11.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 1:1-12, Isaiah 66:15-16, Romans 8:30",
        "devo_title": "You Will Be Counted Worthy",
        "devo_summary": "\n                    \n                    Turn in your badge. Remove the wings. Return your medal. \nThese scenes have a common thread under the surface. The officer, the pilot, and the Olympic medal winner—all revealed by their hypocrisy and inconsistency—were no longer allowed to represent the police force, serve in the military, or compete on behalf of their country. Commitment matters. Honor counts. When it comes to representing Christ, our actions aren’t irrelevant, but the good news is we aren’t left to navigate it all on our own.\nIn today’s reading, the Thessalonian Christians are under severe persecution from the surrounding culture. The pressure to faithfully live as disciples of the crucified and risen God-Man are heating up around them. And yet, instead of retreating or dividing from one another, their love is increasing in all directions. Paul tells them, “We ought to thank God always for you, brothers and sisters, and rightly so, since your faith is flourishing and the love each one of you has for one another is increasing” (2 Thessalonians 1:3). \nTheir unflinching devotion is so alien and heart-warming that it even causes Paul to brag about them to other Christians. “Therefore, we ourselves boast about you among God’s churches—about your perseverance and faith in all the persecutions and afflictions that you are enduring” (v. 4). When the apostle Paul is bragging on you, it’s got to be hard to stay humble—that is, unless you know, like Paul, where the strength to persevere originates.\nPaul doesn’t pray that the Thessalonians would muster their collective energies and elbow grease to be worthy disciples of Christ. Nor does he give them ten hot tips to be worthy of Christ’s call to discipleship, sanctification, and glorification. Rather, Paul guides the heart of the Thessalonians to where their focus—and ours—must reside.\nHe prays that God, not they themselves, will make them worthy of His calling. Paul remembers what we often forget: God will get us to the other side. God will strengthen us. God makes us fit the call of discipleship. God gives us the nutrients and calories to endure till the end. He is the fuel in our good works, the holy umph in our lives.\nWe can’t make ourselves worthy; the gospel is bad news for self-actualization. But the gospel is good news for sinners who realize they need a mighty Savior. Jesus alone makes us worthy. He gives us the badge, the wings, and the medal. Why? Because He earned them for us. \n“By his power fulfill your every desire to do good and your work produced by faith, so that the name of our Lord Jesus will be glorified by you, and you by him, according to the grace of our God and the Lord Jesus Christ” (vv. 11–12). Whatever challenges are ahead, they are not ahead of God or His work in making you fit for His calling. He is with you.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-10.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 5:12-28, 2 Chronicles 31:4-10, Ephesians 4:11-16",
        "devo_title": "Hold On to What Is Good",
        "devo_summary": "\n                    \n                    Consider this list:\n\nSchool shootings.\nTerrorist attacks.\nHurricanes.\nPolitical decisions that seem to disregard “justice for all.”\nAnxiety and depression.\nHarassment and abuse.\nTowns without clean water.\nRefugees without a home.\nWars and rumors of wars. \nSuch is the daily hemorrhage of news. In view of such a list, it is tempting to lock the doors and pull the curtains. Keep your head down, do your job, protect those around you, and try to sock away enough money for retirement. No doubt there are times when such a response is necessary. It’s a survival mechanism. However, there are other times, maybe more times than we’d like to admit, when to retreat is a refusal of God’s will for us.  \nConsider these two statements:\nHold on to what is good.\nDon’t hold back.\nThey sound almost contradictory. But in the context of today’s Scripture passages, the second actually complements the first, giving us clarity as to how God wants us to live. In light of all the darkness around us, our challenge is to not lose hope, but to “hold on to what is good” (1 Thessalonians 5:21). Goodness is just as strong a presence in our world as evil, stronger even, but evil gets all the headlines. We know this. So it takes a hearty faith to, as the Journey song says, “Don’t stop believing.”\nBut faith without works is dead (James 2:14-26). We know this too. God’s will for us is that our belief then compels us to action. To not hold back, to not retreat, as tempting as it is, but to stay engaged and “pursue what is good for one another and for all” (v. 15). God calls us to live lives with open hands and open hearts and open minds and open homes and open wallets. This will take all your courage. The writer Annie Dillard describes such an all-in, full-on commitment this way: “to fling yourself at what you’re doing… to point yourself, forget yourself, aim, dive.” To live in a closed-off withdrawn way is the scrooge’s life—fearful there’s really not enough to go around, and believing evil really does win in the end.\nHold on to what is good. Don’t hold back. Fling yourself into life. In terms of what that looks like, yes, it varies according to the moment. But Scripture gives us some timeless directions.\nConsider these:\nRejoice always!\nPray constantly.\nGive thanks in everything.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-9.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 4:13-18, 1 Thessalonians 5:1-11, Joel 2:31-32, 1 Corinthians 15:42-49",
        "devo_title": "Build Each Other Up",
        "devo_summary": "\n                    \n                    When a believer loses a loved one, the Word of God begins to take on new significance. I lost my mother quite unexpectedly three years ago. It was, far and away, the most difficult and painful thing that I have had to walk through. As challenging as it was to do, I preached the sermon at her funeral. In the moments leading up to her funeral and in the days that followed, I started to understand in new ways why the Apostle Paul charged the Thessalonians to “encourage one another with these words”—words about the truth of the resurrection of believers (1 Thessalonians 4:18). \nThe resurrection is the great hope that God has given us as we make our way through the valley of the shadow of death. However, it is a truth that has often been misunderstood, neglected, denied, and even perverted. \nSome in the congregation in Thessalonica had let themselves be led astray by false teaching that insisted that those who remained alive until Jesus returned were those who received the divine blessing. In this sense, they were tempted to think that those who had passed away prior to the return of Christ were not counted as blessed by God. We don’t know all of the precise nuances of this false teaching, but we do know that Paul believed it to be of such significance that he devoted an entire section of this letter to the doctrine of the resurrection. \nIn 1 Thessalonians 4, Paul set out the divine blueprint for the resurrection of believers: “For the Lord himself will descend from heaven with a shout, with the archangel’s voice, and with the trumpet of God, and the dead in Christ will rise first. Then we who are still alive, who are left, will be caught up together with them in the clouds to meet the Lord in the air, and so we will always be with the Lord” (vv. 16-18).\nThis is the unfolding of the events surrounding the resurrection. The importance of this order must not be missed. Those who have passed away in Christ are now with Christ. They will come with Christ at His return, and their souls and bodies will be reunited by His resurrection power. Then, those who are alive when Christ comes will be reunited with them and with the Lord. \nWe often feel as though there is no end to sorrow in this fallen and dying world. However, believers have the hope of the resurrection. And because of this, the comfort we derive from the hope of the resurrection checks our sorrow. \nAll of this is based on God’s Word, which is why Paul tells us to comfort one another with these words found in Scripture. Our hope is grounded on the Word about the resurrection of Jesus, the resurrection of our loved ones, and our own resurrection. The coming of our Lord is guaranteed, and the resurrection of believers is guaranteed with His return.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-8.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 5:16-18",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for 1 Thessalonians. \nRejoice always, pray constantly, give thanks in everything; for this is God’s will for you in Christ Jesus.\n—1 Thessalonians 5:16–18 \nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/4-Thessalonians-1.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "Romans 8:37-39",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nNo, in all these things we are more than conquerors through him who loved us. For I am persuaded that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor any other created thing will be able to separate us from the love of God that is in Christ Jesus our Lord.\n—Romans 8:37–39\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-6.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 4:1-12, Ezekiel 36:26-27, 1 Peter 1:15-23",
        "devo_title": "Live in Holiness",
        "devo_summary": "\n                    \n                    I’m not a scientist or physicist by any stretch of the imagination. I could hardly pass my high school physics class let alone explain how substantive scientific issues work. I have a hard time remembering what the formula for something as simple as momentum is. All I know is that if you push it and it rolls, inertia has been overcome. (Please email me if I’m wrong, physicists). \nEqually complex and difficult for me to explain is the concept of holiness. At times, I think I would do better explaining string theory. That’s how I feel when I hear people talk about holiness. It is an utterly essential component to the Christian faith, yet only the wisest, best minds seem to be capable of articulating what it is exactly. Often it comes with a Latin wrapper of language that muddles the concept for me even more. \nBut Paul makes holiness abundantly practical. In today’s passage he tells us that God’s will for our lives is that we are sanctified, which means “made holy.” He then unpacks what it means to “live in holiness,” explaining what it consists of in a practical way. It’s keeping away from sex outside the context of marriage, exercising self-control, loving your brother and sister in the Lord, minding your own business, working hard and well, and behaving as decent citizens in your communities (1 Thessalonians 4:3–7). \nIn many ways the mystery of holiness is not all that mysterious. It’s readily practical and down to earth. Holiness isn’t something that is outside our grasp after all. God intends for us to be holy in our everyday lives—here and now. That is His will for us. \nThe challenge Paul brings to the Thessalonians, and to us, is simply to keep pursuing this holiness. The practical outworkings of holiness are the simple things of everyday life. The question is, do we believe God’s Word for us more than we love our own way of living? Do we believe His way is better? Will we walk in the day-to-day holiness He has for us?\nUnlike string theory, holiness is not a complex, overwhelming mystery. It’s being faithful to your wife. Being vigilant against lust and sexual temptations. It’s keeping your word, loving your neighbor, and living an ordinary life that has been changed by God’s extraordinary grace. That’s the holiness we’re called to. \nWe won’t be perfect. Thank God for His grace. But we are called to live in the holiness we’re given in Christ. And a big part of living in holiness is learning to walk in it.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-5.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 3:1-13, Matthew 4:1-11, Romans 8:16-21",
        "devo_title": "Stand Firm in the Lord",
        "devo_summary": "\n                    \n                    In 2015, as my wife and I made our way home to Nashville from spending Thanksgiving with our families in Indiana, we hydroplaned on I-65. We hit a concrete barrier in the middle of the highway and flipped back into the southbound lanes of traffic, landing on the roof of our Toyota Camry. It was the most terrifying experience of both of our lives. We crawled out of the car with minor physical injuries but lasting emotional ones. The horrifying event dramatically changed how I relate to my wife and how I love other people. You don’t walk away from a traumatic accident like that unchanged, even if physically unscathed.\nToward the end of his first letter to the Christians at Thessalonica, Paul encourages his readers by transcribing his prayer for them. In 1 Thessalonians 3:12, he prays, “And may the Lord cause you to increase and overflow with love for one another and for everyone, just as we do for you.” \nAs he says earlier the chapter, Paul is anxious about the Christians at Thessalonica (vv. 1-5). He fears that Satan has tempted them to abandon the Christian faith because of the difficulty and persecution they’ve had to endure as a result of their faith in Jesus.\nIn today’s reading, as Paul finishes up his letter to his brothers and sisters in the faith, he feels the need to encourage them. If they are going to be able to endure the hardships that have already afflicted them and the troubles that are yet to come, they would have to love each other with an overflowing love that can not be quelled no matter the circumstances or persecution they face. The love the Christians in Thessalonica have for one another needs to be strengthened despite their hardships, not eroded by them. \nIn the same way that our terrible crash drew my wife and I closer together and radically changed the way we love each other, so we Christians must love one another in times of hardship with an overflowing kind of love that is bolstered by difficulty, not defeated by it. \nLike Paul prays for the Christians of Thessalonica, our understanding of God’s love for us must cause our hearts to overflow with love for others. Any trials or difficulties we may encounter must serve to strengthen, not weaken, our love for one another.\nWritten by Chris Martin \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-4.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 2:1-20, 1 Corinthians 9:3-14, Hebrews 4:12",
        "devo_title": "You Are Our Glory and Joy",
        "devo_summary": "\n                    \n                    The gospel is always personal.\nIt is given by our very own Father, from whom all good things come. It declares us to be His sons and daughters—even heirs. The gospel is secured by Christ, our own Savior, who gave His life and body for us, that we might be with Him in the eternal and heavenly kingdom. The truth and power of the gospel is sealed by the Spirit, who indwells us, binding us to Him, making us intimate friends. \nIt’s no wonder, then, that the gospel should also transform the nature of all human relation and interaction. \nPaul fills his letter to the Thessalonians with deeply personal language, calling them brothers and sisters, “our glory and our joy” (1 Thessalonians 2:20). He reminds them of how he has been with them, gently nurturing their faith and community, sharing his own life with them—encouraging, comforting, imploring, working night and day on their behalf. He tells them, “We were pleased to share with you not only the gospel of God but also our own lives” (v. 8). Time and again Paul repeats how he has longed to see them face to face.  \nI am humbled by this great witness of the power of the gospel. I long to be able to say, with Paul, that I have labored devoutly, righteously, and blamelessly—that I have lived worthy of God, who calls us into His own kingdom and glory. But I am humbled because I can never be worthy but for the redeeming work of the cross. \nEven now, I am prone to see all of my shortcomings, and fix my eyes upon them instead of on the work of Christ, instead of on the gospel. But the gospel is precisely where Paul would have us fix our eyes. There, we find transformation and healing, hope and joy, and even glory. It is a life-on-life transformation: Christ’s life in His people, ministering in the rich communion of the saints. \nThe Word of God, Paul writes, works effectively in those who believe its truths and receive the gospel message (1 Thessalonians 2:13). The writer of Hebrews puts it even more strongly: “For the word of God is living and effective and sharper than any double-edged sword, penetrating as far as the separation of soul and spirit, joints and marrow. It is able to judge the thoughts and intentions of the heart” (Hebrews 4:12).\nThe gospel doesn’t merely change our minds; it reshapes our hearts and our lives in every way. It takes dying, grumbling, limping, and feeble souls, and transforms them into glory and joy, into crowns of boasting. What marvelous grace! \nMay our hearts be filled with thankfulness, as we run to the gospel, as we run to the Word, as we run to Christ.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-3.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 1:1-10, Romans 8:35-39, 1 Peter 4:12-14",
        "devo_title": "We Always Thank God for You",
        "devo_summary": "\n                    \n                    When I read Paul’s warm greeting to the church at Thessalonica, I’m reminded of a poignant quote from Catholic thinker Henri Nouwen:\n“When we honestly ask ourselves which person in our lives means the most to us, we often find that it is those who, instead of giving advice, solutions, or cures, have chosen rather to share our pain and touch our wounds with a warm and tender hand.”\nSimply put, real friends are the ones who stick with you through the tough stuff. Instead of pontificating about the philosophical realities you’re facing, they’re the ones who enter the mess with you and walk with you through the challenges and the painful moments whether or not you’ve reached resolution, healing, or victory. \nThe Apostle Peter tells us we should not be surprised when affliction comes our way. “Instead, rejoice as you share in the sufferings of Christ, so that you may also rejoice with great joy when his glory is revealed” (1 Peter 4:13). Peter is primarily talking about our individual sharing of Christ’s sufferings with Him. However, there is another layer here; we are to rejoice in sharing Christ’s sufferings with one another. For Peter knew that shared suffering and perseverance would build not only a deeper connection with Christ, but also a more tightly knit community within the body of Christ. \nPart of Paul’s profound appreciation for the church at Thessalonica stemmed from the fact that they had stuck with him and supported him through thick and thin, “in spite of severe persecution” (1 Thessalonians 1:6). Yet they had not grown weary in doing good, preaching the Word, or caring for those in need. \nWhile Paul initially wrote this passage as a blessing and commendation, there is an implicit call for all of us in Paul’s prayer of blessing. As members of the body of Christ we are meant to share in Christ’s suffering. This often means that we will endure hardship and resistance for the sake of His name and His gospel. This also means we are called to lend a “warm and tender hand” to our friends and other members of the body of Christ. \nFriends, this is where the rubber hits the proverbial road. When we lend our time, our treasures, and our talents to those in need—perhaps at the expense of our own comfort and security—we glorify God and participate in His kingdom work. Instead of fearing the fiery trials, we should aspire to be the kind of local church Paul would thank God for in this present age: empowered by the Holy Spirit to faithfully endure with one another and persevere against that which opposes God’s kingdom. \nThat’s how we become a cause for thanks in tumultuous and painful times.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-2.jpg"
    },
    {
        "book_title": " 1 & 2 Thessalonians",
        "devo_passages": "Acts 16:1-40, Acts 17:1-34, Acts 18:1-5",
        "devo_title": "Paul’s Ministry in Thessalonica",
        "devo_summary": "\n                    \n                    Editor’s note: You’ll notice the Scripture reading for today is longer than the others and comes from the book of Acts. These chapters in Acts provide context for our study of 1 and 2 Thessalonians, and give us a foundation for understanding the Apostle Paul’s relationship with this church.\n\nHave you ever been through a tough season, one where you wondered how much more you could bear? Have you ever felt alone in your calling? Have you ever worked at something you believed you were supposed to do, but were met with more opposition than welcome? Have you ever gotten so tired you wondered if you could press on? I have.\nWhen the Apostle Paul wrote 1 and 2 Thessalonians, I have to believe he knew that feeling. He had given his recent years to proclaiming a simple but polarizing message: “This Jesus I am proclaiming to you is the Messiah” (Acts 17:3). The Holy Spirit was working through Paul, but the road to spreading the gospel was tough.\nWhen Paul arrived in Corinth during his second missionary journey, he was beat up, weary, and ready for some encouraging news. Up to that point, he had been driven out of nearly every town he’d visited. It is a miracle of the Holy Spirit that the opposition he faced had not worn him down to nothing. \nBut it wasn’t all opposition. He had seen a few churches take hold along the way. One of those churches was in the port city of Thessalonica, the capital of the Roman province of Macedonia. Today’s reading from the book of Acts gives us the narrative of Paul’s relationship with the Thessalonians—how he planted that church, how the new believers there took his message about the Messiah to heart, and how they stayed hungry for the gospel, learning from Timothy in Paul’s absence.\n\nPaul’s letters to the Thessalonians are like so many of his other letters: filled with theological clarification and instruction for how to live the Christian life. But it doesn’t take long to see that these letters are also a little different from the others, filled with words of affection for these believers who have been a tremendous encouragement to Paul.\nThe legacy of Paul’s letters to the Thessalonians is evidence of the Spirit’s work in the world. Were it not for missions like the one that took Paul to Thessalonica, we would not have the gospel today. And were it not for the Holy Spirit’s work, those missions would have failed to build anything lasting.\nSo when you’re struggling, wondering if you can go on, remember this: the Holy Spirit is at work in the world still. How can we know this? Because Jesus promised He would send the Spirit as our helper in this life (John 14:15-31). When your faith is in Jesus, the Messiah, you are not alone—you are never alone. \nIn the face of impossible odds or unbearable weariness, God is at work. May the Lord encourage your heart as you read these letters and the story surrounding them.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/01/HRT-12Thessalonians-Instagram-1.jpg"
    }
]