[
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "Titus 3:5",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for the book of Titus. \nHe saved us—not by works of righteousness that we had done, but according to his mercy—through the washing of regeneration and renewal by the Holy Spirit.\n—Titus 3:5\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/4-TimothyTitus-3.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "Hebrews 6:17-19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBecause God wanted to show his unchangeable purpose even more clearly to the heirs of the promise, he guaranteed it with an oath, so that through two unchangeable things, in which it is impossible for God to lie, we who have fled for refuge might have strong encouragement to seize the hope set before us. We have this hope as an anchor for the soul, firm and secure.\n—Hebrews 6:17-19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day20.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "Titus 3:1-15, 2 Corinthians 1:3-11, Ephesians 2:8-10",
        "devo_title": "Christian Living",
        "devo_summary": "\n                    \n                    Just a few miles down the road from where I lived in Philadelphia was a famous, privately owned art collection. The man who owned this collection of rare paintings stipulated in his will that no one should be allowed to alter them. The problem was that he stored many of these paintings in the boiler room of his home. Over the years, the coal from the furnace left them tarnished. \nAfter he died, his family made the executive decision to breach his will and have these paintings professionally restored. This was certainly the right decision as his home is now one of the most famous art museums in the world, hosting some of the most rare and wonderful works of art in the world. \nIn many respects, we, by nature, are all like those tarnished paintings. We need God to restore His image in us by the saving grace and work of Christ.\nThe Scriptures are clear that salvation is by grace alone through faith alone in Christ alone. There is absolutely nothing we contribute to our salvation other than the sin that makes it necessary. However, when God redeems individuals through the saving work of Christ and the regenerating work of the Spirit, He begins to restore His image in them. God doesn’t save us by our good works, but He saves us so that we would be zealous for good works. After all, we are His artwork of grace, designed to display His own glory in us (Ephesians 2:10).\nIn the same way as the paintings in the boiler room needed to be professionally restored, so Christ restores the image of God in His redeemed people. He alone can do this since He is Himself the very image of God. Just as Jesus went around doing good, so those who are united to Him by faith, washed in His blood, and filled with His Spirit are to seek to do good. \nWe need to be reminded that this is God’s purpose for us. If the paintings in the boiler room had been left alone, they would be of no good to anyone. God has appointed ministers to continually encourage His people to do good and to be ready for every good work. It is in this way that God displays the glorious artwork of His grace to a world full of those who likewise need to undergo that same restoration in Christ.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day19.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "Titus 2:1-15, Malachi 3:17-18, 1 John 3:2-3",
        "devo_title": "Sound Teaching",
        "devo_summary": "\n                    \n                    Before I went to seminary, I worked for a rental car company. I had a cubicle in their administrative offices. It was a great job for a number of reasons, and I was actually good at what I did. So good, in fact, that they knew I was leaving and promoted me anyway—six months before I left for seminary.\nI don’t tell you this story to brag, but to explain why I was able to have the most coveted cubicle in my department. It was away from everyone else and over by the printer, so I was by myself but never really alone. And since I was by myself, I could listen to music and sermons. Back in those days, I was listening to lots of sermons on cassette tapes, but I can only remember one. The preacher’s text was from Titus 2: “For the grace of God has appeared that offers salvation to all people. It teaches us to say, “No” to ungodliness…” (vv. 11-12). \nHis thesis was that we are conditioned to look at the gospel as the way to enter into the Christian life, but then we look to the law to make us holy. It is the law of God that trains us to say “no” to sin, or so we believe. He said that when we believe the gospel—the good news of what Christ has done for us—we become trained to follow Him in righteousness. When we look at what God the Father has done through God the Son, then God the Spirit changes us. Preaching to ourselves, the beauty of the gospel helps us to say “no” to the ugliness of ungodliness.\nI was glad I had that isolated cubicle, not only so I could listen to that sermon while working, but also because I was able to listen and then let the tears flow down without any embarrassment. You see, I had heard all this before, but until that day, I just kept forgetting. We come to Christ by believing the gospel of His grace. And we follow Christ by doing the same thing. \nThere are two kinds of people reading this. Some of you have never heard the full gospel. You have only heard that believing the gospel is how you become a Christian, but perhaps no one has ever told you that believing the gospel is also how you live as a Christian. The beauty of the rest of the gospel is that it actually teaches us how to turn from sin.\nSome of you are just like me; you’ve heard this before, but you keep forgetting. You forget the beauty. You forget the power of gazing on that beauty. My hope is that you are reminded today that when you are tempted to use the law to fight sin, the gospel is a better teacher of who we are in Christ and the life promised to us.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day18.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "Titus 1:1-16, Ephesians 4:11-13, Hebrews 6:13-20 ",
        "devo_title": "Titus’s Ministry",
        "devo_summary": "\n                    \n                    In any type of leadership—whether in the home, the church, the workplace, a political office, or anywhere else—character should be an important component. Not only that, but leaders should be constantly aware of raising up other leaders. You won’t find any more fundamental rules of leadership than these two things.\nIn our passage today, Paul begins his letter to Titus with a few basic ground rules for being a pastor. He doesn’t tell Titus to work on his sermon illustrations or his building budget. He doesn’t tell him to dress a certain way or make sure he reads the right leadership books. Maybe these things have their place, but they aren’t fundamental to leadership in Paul’s mind.\nPaul starts with character. He tells Titus to be humble and self-controlled and sacrificial. He tells him to be bold in this leadership, protecting the people he leads and driving out evil and false teaching. False teachers are “unfit for any good work” (Titus 1:15).\nThese are strong words by Paul. He’s not raising up weak-minded pastors to be nonchalant about sin and heresy. He even tells Titus to be “blameless.” Now, surely, someone like Paul doesn’t mean that Titus should never sin. This is the same Paul who calls himself the “chief of sinners” (1 Timothy 1:15). He’d be quite the hypocrite if he told Titus to be sinless when no one can be—not even Paul (Romans 3).\nPaul is instead comparing two types of leaders: those who are fit for ministry due to their character and striving for truth, and those who are unfit due to their lack of character and striving for falsehood. The idea of blamelessness here refers more to a disposition or worldview rather than pure sinlessness. In other words, God will use a humble, kind, sacrificial, and truth-seeking person, even in his or her weakness and imperfection.\nWhether you’re a pastor, parent, construction worker, school teacher, or astronaut, you’re called to lead. You don’t need a team of marketers reporting to you in order to be a leader. As Christians, we are called in every sphere of life to reflect Christ and teach His ways to others (Matthew 28:18-20). Jesus was perfect and sinless on your behalf; your job is to be “blameless” before others, to point people to the One who was perfect so you don’t have to be. That’s the type of leader—the type of person—God will use.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day17.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 4:1-22, Deuteronomy 31:6-8, 1 Corinthians 9:24-27",
        "devo_title": "Keep the Faith",
        "devo_summary": "\n                    \n                    Some famous last words:\n“I can’t sleep.” – J.M. Barrie, author of Peter Pan.\n“I’ll finally get to see Marilyn.” – Joe DiMaggio, baseball player formerly married to Marilyn Monroe.\n“I give my soul to God, my body to the earth, and my worldly possessions to my nearest of kin, charging them to remember the sufferings of Jesus Christ.” – Michelangelo, painter.\nLast words are fascinating. We want to know: did the person say something meaningful? Did they summarize their life well? Though not everyone gets to choose the last thing they will say, some, when given the rare opportunity, make the most of it, like Michelangelo.\nToday’s Scripture reading from 2 Timothy includes Paul’s last recorded words. They are, of course, not the last words he spoke (presumably), but they are the last lines of the last existing letter he wrote before being martyred for his faith. So they are the last word we have from Paul. And I don’t know about you, but I love them. \nI love that Paul charges Timothy to preach the Word of God faithfully, noting that it will not always be a welcome message. I love that Paul reflects on his own life and concludes, before God, that he has run his own race to its end, and is finishing well. I love that he is ending his life with a lot of faithful friends around him. And I love that he asks Timothy to bring him his books and his coat because winter is coming. These last verses of 2 Timothy deal with both the theological and the practical—both of which are deeply spiritual.\nA few years back, I became seriously ill and had to put my own house in order. I recovered, but ever since then I’ve thought about the end of my own life quite a bit. I wonder what I will say, who will be around me, where I’ll be, and how I’ll experience the presence of God in that moment. There is an old Puritan prayer that makes me laugh, in which the writer asks God to let him die in a particular way. He writes: \n“Prepare me for death, that I may not die after long affliction or suddenly, but after short illness, with no confusion or disorder, and a quiet discharge in peace, with adieu to brethren. Let not my days end like lumber in a house, but give me a silent removing from one world to another.” \nI love the courage in those words, in essence, saying, If it’s all the same to you, Lord, let me go in this way. \nI suppose what I love most about both that old Puritan prayer and Paul’s last words in 2 Timothy is the way they express a confident hope that the gospel they’ve clung to all these years is still true, burning like a light that attracts these soon-to-depart brothers to their Maker.\nMay you and I, when we come to our own ends in this life, have such an affection for the Lord as Paul. May we not be questioning the truth of the gospel, but rather may we be chained to it. Until then, let me conclude with Paul’s last words from this letter: “The Lord be with your spirit. Grace be with you all” (2 Timothy 4:22).\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day16.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 3:1-17, Exodus 7:8-13, John 15:18-21",
        "devo_title": "Struggles in the Christian Life",
        "devo_summary": "\n                    \n                    Not long after my wife and I moved to Colorado, we became increasingly excited about exploring the foothills and peaks along the front range of the Rocky Mountains. One particular Saturday morning, we set out on a hike that had been recommend to us by a few trusted friends. Since they were Colorado natives and more adventurous than most, we naturally trusted their suggestion and set out for what we hoped would be a memorable afternoon.\nThe hike started out pleasant enough, meandering paths through a wooded glade. Over time the trail began to slowly rise toward the summit. Pointing out gnarled trees and curiously spotted birds to one another, we hardly noticed the change in the slope. We laughed and lingered as we pleased. Several miles later, though, we questioned just how far we actually were from the peak.\nWe began to wonder, “Are we there yet?”\nThe gentle pitch had turned into an aggressive incline. The gnarled trees had become logs crossing and blocking our footpath. The soft breeze had become an unnaturally chilly wind. Our legs were tiring, and our spirits weren’t quite as chipper as when we’d set out. \nBefore either of us spoke it, we both were thinking it: “Maybe we should head back?” \nWe stopped to consider our options. Then we began to head back down, slowly weaving our way through the boulders and rocky outcroppings. \nA stranger passed by, heading uphill. “How was the view today?”\n“Oh,” I muttered, “we didn’t quite make it. Maybe next time.”\n“Are you serious?! You’re less than 500 yards from the top!” \nThis is precisely Paul’s spiritual concern for Timothy in our reading today, and it is still a spiritual concern for each us: that we would give up before we’ve completed the journey and falter before the finish. Paul cautions, “Continue in what you have learned and firmly believed” (1 Timothy 3:14). \nContinue. Sometimes that’s all we can do. It may not feel all that glamorous or exciting, but the call is to continue—not for the joy of each step, but for the wonder of what lies beyond.\nThanks to our encounter with that seasoned hiker, we turned back uphill. We continued. We completed the summit, and the views were more than worth the effort. Filled with awe and wonder, my wife and I rested in a moment of indescribable fulfillment. \nThrough the life, death, and resurrection of Jesus, we live a life and walk a journey characterized by grace and redemption. However, this does not mean the way is smooth or the journey is easy. We need only look at the life of Jesus to know this is true. The Christian life will ebb and flow through different seasons. Sometimes the way is easy and the burden feels light; others times the way is steep and perhaps overwhelming. \nIf you’ve come to know Jesus, then I pray that Paul’s challenge and encouragement sticks with you this week. Continue on. Continue on in what you know to be true. Continue on in who you know you were made to be. Continue on in the belief that the summit is closer than you think.\nIf your heart is heavy, if your feet are weary, if your back is sore, if you can’t go one step more, I pray a one-word prayer for you today: continue.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day15.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 3:16-17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for 2 Timothy. \nAll Scripture is inspired by God and is profitable for teaching, for rebuking, for correcting, for training in righteousness, so that the man of God may be complete, equipped for every good work.\n—2 Timothy 3:16-17\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/4-TimothyTitus-2.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "Galatians 5:22-23",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBut the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. The law is not against such things.\n—Galatians 5:22-23\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day13.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 2:14-26, Galatians 5:22-25, 1 Peter 3:14-16",
        "devo_title": "An Approved Worker",
        "devo_summary": "\n                    \n                    My teenage years were spent in prodigal living. I was horribly addicted to drugs by the time I was 17. After the Lord rescued and redeemed me, I heard someone liken false teaching to drugs. He said, “Heretics are like drug addicts. Those who do drugs think that they are doing themselves good, when, in fact, they are progressively destroying themselves. So, those who play with false teaching will be subject to its destructive influence.” This is an apropos illustration. False teaching has a progressively destructive influence on the life of the one who entertains it. \nQuite a number of theologians have insisted that if there were no false teaching, there would be no New Testament. So much of the New Testament is taken up with apostolic warnings about the many varieties of false teaching that had infiltrated the fledgling churches and threatened the spiritual life of those Christ had redeemed. Characteristic of the pastoral letters is the Apostle Paul’s insistence that ministers of the gospel must be on guard against the subtle ways in which false teaching wrecks havoc.  \nThe first thing we have to keep in mind is that words matter. There is no such thing as an inconsequential word. God spoke the world into existence by the Word of His power. He then spoke a Word to His image bearers about His intentions for them as residents of the habitable world over which He had given them dominion. If our first parents were to rightly interpret the newly created world in which they lived, they would need the Word of God to do so. After the fall, Adam and Eve needed God’s Word about the promise of redemption (Genesis 3:15). Listening to the revealed Word of God is the greatest need you and I have today. \nIt should then come as no surprise to us to discover that the attacks of the evil one are directed at the Word of God. After all, when he tempted our first parents, Satan’s first words were, “Did God really say…?” (Genesis 3:1). The power of this temptation lay in the fact that the evil one sought to convince our first parents that it was a noble task for them to question the truthfulness of the Word of God. This continues to be his most potent attack on the members of the Church today. \nMinisters of the gospel are “not to quarrel about words” (2 Timothy 2:14). Instead, they are to “avoid irreverent babble” that will “lead people into more and more ungodliness” (v. 16). There is a progressively destructive nature to false teaching. The more one entertains it—often under the guise of academic sophistication or open-mindedness—the more destructive influence it has on the minds, hearts, and lives of God’s people. \nBy way of contrast, the more we stay in the truth of God’s Word, the more it will impact our spiritual well-being. But, a failure to reject false teaching will cause those who propagate it to “swerve from the truth,” upsetting and weakening the faith of the members the Church (v. 18).\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day12.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 2:1-13, Romans 6:5-10, 1 Corinthians 15:3-8",
        "devo_title": "Be Strong in Grace",
        "devo_summary": "\n                    \n                    The smell and feel of a sunny spring afternoon always remind me of baseball. I fell out of love with baseball during the younger years of my adulthood because it didn’t have the excitement of college football or the NBA. As I have aged, however, I have come to appreciate baseball again, probably because baseball is more like real life than any other sport. You can be considered a legend in baseball while failing seven out of ten trips to the plate. Baseball season lasts for most of the year, yet division titles may be won by only one or two games, so a baseball player has to do little things well for the long haul. \nPaul’s vision of the Christian life in 2 Timothy 2:1-13 breathes this same ethos. He portrays the Christian as one who lives faithfully day in and day out, doing little things that no one notices. This is the thrust of every image he uses in verses 2-7. A teacher entrusts what he has heard to others not in a moment, but in a lifetime of faithful modeling and teaching. The soldier does not stand out in the crowd, but pleases the one who enlisted him and suffers for his service. The farmer toils in obscurity, but gets his reward in harvest time. The athlete who competes according to the rules works long hours to be prepared for his one shining moment.\nThis kind of slow faithfulness is difficult for those of us nurtured in youth groups where we were transported from one spiritual high to another, showing a burst of zeal for Jesus before going back to where we were. We find encouragement, though, when Paul says, “be strengthened by the grace that is in Christ Jesus” (2 Timothy 2:1). Nothing is more difficult than enduring faithfulness, but this burden causes us to despair of our own efforts and lay hold of the strength that only Christ can give. To live faithfully as a man each day requires a strength we do not possess. But God overflows with all the power we need and he gives it freely to those who call out for it.\nPaul closes by pointing us to Jesus Christ, who endured the pain of the cross for the joy set before Him and received the prize of His endurance. In the same way, we endure the difficulty of faithful Christian living but receive the joy of knowing Christ and enjoying His gifts, ultimately receiving our final reward: reigning as joint heirs with Christ. And so, we labor on, pleading for His strength to fill us and looking to our blessed hope.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day11.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 1:1-18, 2 Corinthians 3:4-6, 1 Thessalonians 5:16-22",
        "devo_title": "Not Ashamed of the Gospel",
        "devo_summary": "\n                    \n                    It’s always amusing to me to see the guy at a football game wearing a paper bag over his head. Whether the New Orleans Saints of a prior generation, or our more recent lowly favorite, the Cleveland Browns, the bag-on-the-head guy gets one thing right: it’s embarrassing to root for a pathetically bad football team. \nThat might be how Timothy felt about his father in the faith, Paul. As Paul sat shackled to the wall of a dark prison cell in Rome, you have to wonder if Timothy was ready to find a bag to put over his head and walk away from his calling. Certainly, Paul felt that anxiety regarding Timothy. It’s why he tells him to “rekindle the gift of God that is in you” and “don’t be ashamed of the testimony about our Lord, or of me his prisoner” (2 Timothy 1:6, 8). On the surface, living and working for the sake of the gospel looks about as likely as the Browns having a winning season next year (spoiler alert: it’s not going to happen). \nYet, Paul knows why he is on the losing side of the ledger and he wants to convince Timothy that this is exactly where the victory is found. Though Christianity looks like a loss to the world, it is actually power, life, and immortality to those who believe. The Savior who was betrayed, rejected, and crucified is the one who abolished death and enabled Paul to endure the suffering and shame of Roman imprisonment. Paul knew whom he had trusted, and he knew Christ would not let him fall. \nPerhaps you feel like putting a bag over your head when it comes to displaying and declaring your faith in Christ. You fear what others will think about you, or even worse, what they may do to reject you. “Closet Christianity” seems to be a better way to go rather than being the guy publicly cheering on the “losing” squad week after week. Just as Paul told Timothy, so God’s Spirit says to us today, “Take off that paper bag! Don’t you know who your Savior is? Don’t you know the victory He has won? Don’t be ashamed! He has overcome! \nToday let’s take courage and lay down our timidity toward the gospel. There is a world waiting to hear good news, and a victorious King enabling us to persevere to the victory. \nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day10.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 6:2-21, Psalm 90:1-17, Matthew 27:11-14",
        "devo_title": "Guard the Heritage",
        "devo_summary": "\n                    \n                    Have you ever tried to log on to an old account, only to find you couldn’t remember your username or password? When you signed up, the name you wanted was already taken, so you came up with something close. Your usual password wasn’t secure enough, so you added some strange character at the end. Now you can’t recall either your username or password. The irony is these were supposed to protect sensitive information, but now not even you can get to it. Is this what is means to guard something? Sure, you kept your sensitive data out of the hands of criminals. Good job. But you also kept it from yourself. \nPaul tells Timothy to guard the gospel. What does this mean? \nTo guard the gospel is not only to discern and object to false teachings that might seek to undermine God’s truth, it is also to become intimately familiar with that truth ourselves. To guard the gospel is to know it—to see through the lens of it, to be increasingly aware of where we stand in relationship to God because of it. The gospel is more than a set of doctrinal distinctions—it is the truth of our relationship with the living Christ who loved us, and gave Himself for us (Galatians 2:20). \nPaul says the gospel is a heritage entrusted to Timothy, meaning it didn’t begin with Timothy or Paul, nor with any of us the day we first believed. Christians have a great spiritual heritage. Paul traces both his and Timothy’s spiritual lineage, saying the God he serves is the God of his forefathers—the same as the God of Abraham, whom Paul grew up studying as a Jew. Paul’s present conversion was a matter of recognizing God’s perfect fulfillment of His ancient covenant promises to Abraham in Christ.\nLater, Paul instructs Timothy to “rekindle the gift of God that is in you” (2 Timothy 1:6). Why would Paul tell Timothy to fan the call to gospel faithfulness into flame? Is it dying inside Timothy? No. Paul tells him this because the gospel is not something we embrace once and then leave alone like some username and password. We take it up, tend to it like a fire, and study it to learn of God’s grace and ponder Christ’s life, death, and resurrection. Though its power is already perfectly complete in Christ, we still need to hear it daily. \nThis is how we guard the gospel. We internalize it.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day9.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 5:1-6:2a, Matthew 18:15-20, 1 Corinthians 7:39-40",
        "devo_title": "Support and Honor",
        "devo_summary": "\n                    \n                    In his play Hamlet, Shakespeare’s Polonius famously declares: “This above all: to thine own self be true.” The phrase has its appeals, and at first glance seems like wise counsel. In fact, it appeals to something we are all naturally drawn to: a devotion to self, to our own sense of honor, to our own interests, often at the expense of genuine wisdom and careful consideration. We live in a “believe in yourself” world that tells us everything of value—everything worth doing—begins and ends with self. \nAs Paul reminds Timothy, however, though the idolatry of ego comes naturally to us, it is antithetical to the honor of God. Indeed, he says, one who is self-indulgent is dead, even while he lives. And, contrary to popular belief, the philosophy of self-focus and self-fulfillment is no barrier against abuse, favoritism, partiality, and all other societal ills. Fulfilling Paul’s injunction to show no favoritism can only be done when we honor God as God, and see ourselves not as victims who need to stand up for our own needs and wants, but as servants to one another, and to His kingdom.\nAt the center of this passage is an outward-looking vision: a concern for the kingdom, for the purity of the Church and the honor of God’s name. It is full of warnings against being caught up in worldly concerns that might overshadow and compromise the witness of the faith: maintain pure relationships in the household of God; support of those in need, but do not support idleness; honor those who have undertaken the care of the flock; do so without prejudice; and even, servants honor your masters, so that God’s name may not be blasphemed. Servants, honor your masters? How contrary this runs to all the wise counsel of our day!\nWe like to think that if we muster enough self-will and self-confidence, and if we all try really hard together, we can fix the ills of our world. As it turns out, however, the gospel is the only practical means by which hearts, lives, communities, and the world can be changed. No matter how many plans for social change man may offer, none can effectively change the world, because none can effectively change the human heart. \nThe life of the Church, therefore, must be among our chief concerns. There, in worship, we meet Christ. In the life of the body, we grow in Christ through the fellowship of the saints. Both judgment and blessing begin at the household of God. He enacts the extension of His kingdom through the Church, which is His body here on earth. Therefore, we must not be self-indulgent, or we are dead even while we live. Rather, we are to rest wholly upon Christ as we walk. He must be our chief desire, the fulfillment of our hearts, and the shaper of our lives.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day8.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "2 Peter 3:14-15",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nTherefore, dear friends, while you wait for these things, make every effort to be found without spot or blemish in his sight, at peace. Also, regard the patience of our Lord as salvation, just as our dear brother Paul has written to you according to the wisdom given to him.\n—2 Peter 3:14-15\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day6.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 4:1-16, Ecclesiastes 9:7-9, Colossians 2:16-23",
        "devo_title": "Instructions for Ministry",
        "devo_summary": "\n                    \n                    I don’t remember exactly how old I was when my mom told me I had to brush my teeth with soap, but I do remember where I was and what I’d said. I never used much bad language when I was a kid, so this was the first and only time I had to wash my mouth out with soap. Needless to say, it made an impact.\nI was running up the basement stairs after competing in some meaningless sport or other activity with my younger brother when I yelled down at him (apologies for the language), “Kyle, you are p$&%#ing me off!” I’d learned the phrase from a neighborhood kid a number of years older than me. I didn’t know what it meant, but I knew it was something you yelled at people when you were mad at them.\nThe neighborhood kid was not setting a good example in speech for me, his young friend. Unfortunately, we Christians often don’t do our part to set good examples for others in our lives either. Depending on how we are wired, most of us tend either toward legalism or licentiousness. That is to say, some Christians lean more toward pridefully following the rules, and some lean toward pridefully pushing the limits of what is allowed in our speech, our conduct, or otherwise.\nThankfully, as followers of Jesus, we know and must remind each other that our works do not save us. We rely on the grace of God in Christ alone to save us from our sin. But this glorious truth does not exempt us from living lives worthy of our salvation, setting good examples for all with whom we come in contact. First Timothy 4:12 says, “Set an example for the believers in speech, in conduct, in love, in faith, and in purity.” \nPractically speaking, what does this look like in our lives? It means we can’t beat ourselves up for not being shining examples of righteousness in every moment. But it also means we should seek to live lives worthy of Christ. Setting an example for others in our conduct really comes down to being mindful of our surroundings and our calling as Christians: to die to ourselves, sacrificing our perceived freedoms to become more like Jesus, walking in the freedom that can only come from knowing Him. \nAs we walk with Christ, we look to God’s Word to see how He conducts Himself, how He speaks, and how He lives, with the goal of imitating Him, by the power of the Holy Spirit.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day5.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 3:1-16, Romans 9:15-24, Ephesians 2:8-9",
        "devo_title": "The Mystery of Godliness",
        "devo_summary": "\n                    \n                    I have a difficult time keeping surprises under wraps. I often give my children hints as to what their birthday and Christmas gifts will be. Even worse, my wife and I have a history of revealing gifts for one another before the proper time. There is excitement in knowing that giving the gift will result in bringing joy to the receiver—it’s almost too much to bear. Especially when the receiver is someone I love dearly.\nIt is no surprise that Paul exudes joy when he declares that “the mystery of godliness is great” (1 Timothy 3:16). The entirety of world history is riddled with religions where godliness is not a gift to be received, but a wage to be earned. It is staggering to think that millions of people have religiously worked throughout their lives to earn the title of “godly.” But the gospel, a gift from our good Father, explodes with earth-shattering news for weary people like you and me.\nAccording to Paul, godliness is not something we earn; it is a gift we receive. And at the right time, Jesus Christ came to offer this gift to those He dearly loves. In his letter to the Ephesians, the Apostle Paul declares,  “For you are saved by grace through faith, and this is not from yourselves; it is God’s gift—not from works, so that no one can boast” (Ephesians 2:8-9). This is the mystery of godliness! This is the content of the previously hidden, unwrapped gift. The gospel is God’s greatest gift to us, finally revealed: His plan for salvation through Jesus Christ.\nOne of the beautiful truths about this gift is that God gives us hints of it in every human heart. If anyone has ever tried to earn the title “godly” by their religious works, I would wager that deep down inside they know they do not measure up. There is the ever-present reminder of our failure. However, the mystery of godliness from the gospel brings a deep inner peace and joy that religious work cannot earn.\nIn this sense, “the mystery of godliness” means more than the initial good news of salvation. This is a gift that keeps on giving. Every day the gospel provides both salvation from our sin and peace from our failed efforts, but also the motivation to pursue godliness by God’s power and not our own. Our godliness does not earn our salvation. Our godliness is evidence of our salvation. We don’t rely on our works for salvation; we trust in Christ’s perfect work on our behalf. This is great news!\nTo put it another way, godliness is evidence that we are in Christ. It comes freely, flowing from Christ’s work in us. Once we grasp the goodness of this gift, we should all have a difficult time keeping this mystery under wraps. Think about it: God holds out to us the greatest gift that we could ever imagine! Reach out and receive joy and peace forevermore.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day4.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 2:1-15, Deuteronomy 6:4, John 10:14-18, 2 Peter 3:14-16",
        "devo_title": "Instructions on Prayer",
        "devo_summary": "\n                    \n                    When I was in college a hurricane came through town and did a lot of damage. Roofs were stripped away by gale-force winds. Trees were toppled on homes and businesses. Some roads were closed for days. Afterward, I lived in a house with five other guys for days without power. It was all pretty exciting, really. Before the weather turned, I can remember waiting for the storm, but nothing was happening. We kept going outside, looking at the sky, but it was calm. All was quiet and peaceful, and we were disappointed.\nThere is a lot of teaching on prayer in 1 Timothy 2. Some of it is obvious. Other parts are challenging. Some is controversial. But there is one teaching here that, if we are not careful, we will pass by and miss something important.\nKeep in mind that Paul is mentoring Timothy, a young pastor. His letters to young Timothy are full of wisdom, instruction, commands, helpful advice, and encouragement. This is what you would expect from Paul, the older, more seasoned minister of the gospel, compared to one who was still a little wet behind the ears.\nRight before chapter 2 begins, Paul charges Timothy to hold on to his faith, to not be like others who have made a wreck of their faith. I mention this because the first words in this chapter are, “First of all, then…,” followed by instructions on prayer. And what is the end of those prayers? Why is this so important? So that we may “lead a tranquil and quiet life in all godliness and dignity” (v. 1).\nThink about that logic. \nHold onto the faith. Don’t shipwreck your life. You and your people need to pray for everyone so you may lead a quiet, peaceful life. \nWho teaches this? Most people teach that the way to an exciting life is not through quietly and prayerfully holding onto your faith. Most will teach you to live out loud for Jesus—to live boldly, implying that you need to make a ruckus for God. But Paul paints a different picture of what the prayers of a person of faith give us; those prayers lead to a quiet and peaceful life.\nQuiet and peaceful sound like nothing is happening. Quiet and peaceful sound boring, not exciting. Quiet can lead to a life in which, if excitement is the standard, disappointment is sure to follow. This can be hard for anyone who wants to live an exciting life. But for Christians, Paul seems to think link this quiet and peaceful life with godliness—with not wrecking our spiritual lives.\nWhy, though?\nBecause our culture and our flesh tell us that spirituality is where the action is. But Paul and the rest of the Scriptures show us that, as Eugene Peterson says, “Prayer gets us in on what God is doing.” The world is after action. God is after prayerful faith displayed in a quiet and peaceful life.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day3.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 1:12-20, Acts 8:1-3, Acts 9:1-22",
        "devo_title": "Paul’s Testimony",
        "devo_summary": "\n                    \n                    Christians love dramatic testimonies. We’ve all been moved by brothers and sisters who tell stories of unfathomable sin and brokenness before coming to Christ. Many of these narratives move in excruciating detail through the kind of pain and wickedness some of us have only heard about second-hand. But the implication of their testimonies is clear: “If God can save someone like me, He can save you, too.”\nBut what about brothers and sisters who seem to have “boring” testimonies? What about those who grew up in a home where their parents loved them and told them about Jesus from the day of their birth? Almost with a sense of shame at the simplicity of it, they confess they knew they needed to be saved when they were young, trusted in Jesus, and have followed Him since. They might say they don’t even remember life before becoming a Christian. Compared to the stories of fights, drugs, and prison, these testimonies might seem lackluster. \nWriting in the early 1700s to give testimony to the amazing work of revival happening in his town, Jonathan Edwards spoke about two women with very different testimonies. One was a “company-keeper,” an 18th-century term for living a notorious life, and the other a four-year-old girl named Phoebe. Both came to see their desperate need for Christ and were gloriously saved. Edwards used their examples to make a simple point: No matter what a person’s background may be, we all need grace.\nPaul makes this point through the example of his own testimony in 1 Timothy chapter 1. He looked back at his life before the Damascus Road, and even though he was a “Pharisee of Pharisees” and a “Hebrew of Hebrews,” he had also been a “blasphemer, persecutor, and insolent opponent” who “acted ignorantly in unbelief.” After meeting Jesus, he looked at his present life and saw himself as someone who could never merit the favor of God because he was “the chief of sinners” (1Tm 1:12-20).\nYet, Paul saw something that was true about God much more clearly than he saw his own sin and unbelief: “The grace of our Lord overflowed” for him, as it does for us all. Paul pictured God’s grace as a mighty river, flowing toward him at a pace so fast and a force so strong that his own sin was no match for it. His sin and his self-righteousness had been overwhelmed “with the faith and love that are in Christ Jesus” (1Tm 1:14).\nMany days, you will be tempted to think you have been so bad that grace could never reach you. Other days, the temptation will be to believe you’ve been so good that grace is beneath you. Therefore, on each and every day, take a long look toward the cross of Jesus Christ. There, you will remember how desperately you needed grace, and hear the good news that God is glad to freely give it to you.\nIn the end, every Christian has the same testimony: I need Jesus. He has freely accepted me. His grace is more than enough to sustain me with hope and joy throughout my journey.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day2.jpg"
    },
    {
        "book_title": " 1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 1:1-11, Psalm 119:1-7, Acts 16:1-5",
        "devo_title": "Timothy’s Ministry",
        "devo_summary": "\n                    \n                    During a recent visit with my parents, I climbed into their attic and brought down a few boxes of old photos. They’d been up there for at least 20 years, maybe more. In one box, I found pictures of my parents in their early twenties. Every time I see pictures of them from before I was born, I wonder who they were. What did they love? How did they spend their time? What kept them up a night? What made them laugh? How did they get from there to here?\nTime is a funny thing. We tend to think of people in terms of who they are to us now. But everyone has a story, and none of them are simple. Those stories shape us into who we are. They shape what we care about. The Apostle Paul’s letters to Timothy and Titus bear this out.\nFirst and 2 Timothy and Titus are Paul’s last letters—his swansong. He writes to his young protégés with the maturity and resolve of a man who knows his end is near. But within Paul’s Spirit-led words, we see reminders of the apostle when he was young—little literary snapshots that take us back to the days when he opposed Christianity and persecuted the Church. We read about his calling to follow Christ and his fight to preserve doctrine that is pure and true. We see a web of relationships forged over the years—some broken, some thriving.\nThe words we read in these letters have a tremendous amount of history and context behind them. Though they are addressed to individuals, they were written for the sake of all Christians everywhere. For the young believers who will one day become old, these letters exist to guide them along a journey that is faithful and true to the heritage of the gospel of Christ.\nPaul says “the goal of our instruction is love that comes from a pure heart, a good conscience, and a sincere faith” (1 Timothy 1:5). Here at the end of his life, Paul is seasoned in such a way that he knows what it takes to develop this sort of character. He is writing to a young pastor and congregation knowing what sort of training and trials most likely lie ahead for these Christians. Some of what lies ahead for them will be filled with joy; other parts will carry a lot of sorrow. But Paul’s primary concern in these letters is spiritual growth.\nOne goal of the Christian life is that we would grow and change—that we would become more like Jesus. As you read these letters, I pray the Lord would call to mind ways He has worked to make you more like Jesus. And may this time you spend in His Word add to that ongoing work.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day1.jpg"
    }
]