[
    {
        "book_title": " Colossians",
        "devo_passages": "Philippians 1:3-6",
        "devo_title": "Rest",
        "devo_summary": "\n                    \n                    Take this day to catch up, pray, and sit in God’s presence. Pray the scripture below for someone in your life and for yourself.\nI give thanks to my God for every remembrance of you, always praying with joy for all of you in my every prayer, because of your partnership in the gospel from the first day until now. I am sure of this, that He who started a good work in you will carry it on to completion until the day of Christ Jesus.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram14.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 3:12 ",
        "devo_title": "Remember",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof and truth in your heart and mind each day.\nWrite these verses down, keep them in your wallet, post them on your mirror or at your desk—anywhere you will see it often.\nTherefore, as God’s chosen people, holy and dearly loved, clothe yourselves with compassion, kindness, humility, gentleness and patience.\n-Colossians 3:12\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/4-Colossians-3-12.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 4:7-18, Romans 15:30-33, Philippians 1:3-7",
        "devo_title": "Final Greetings",
        "devo_summary": "\n                    \n                    Many of us want to be the alpha wolf, the one leading the pack. This desire can be subtle and masquerade as goodness, but we all have it in us to some degree. Even Jesus’s own disciples argued about who would be the greatest among them (Luke 22:24). While we may not always argue with our mouths, we compete in our hearts. Inward competition is just as divisive as the outward kind. \nOne of the fascinating things about this letter from Paul is his specific inclusion of so many names here at the end. Why does the well known and well respected apostle, the “alpha wolf” in this scenario, take time to include these names most of us won’t recognize? Let’s dig deeper and see what we can learn about them.\nTychicus, a native of Asia Minor, delivered not only this letter to Colossae, but also the letter to the church in Ephesus and Paul’s personal letter to Philemon. God used this man to carry the Word of God to His people. The world doesn’t have to know your name in order for you to do something significant for God.\nOnesimus. Talk about a step of faith—Onesimus was the runaway slave of Philemon. While in Rome, he met Paul and subsequently met Jesus. Both Colossians and Philemon tell the story of how the gospel saved Philemon’s life. In Onesimus’s relationship with Philemon, we see forgiveness and restoration at work, a glimpse of the unifying power of the gospel.\nAristarchus, from Thessalonica, joined Paul on his journey and gave his life and freedom so that others may know Christ.\nMark had a reputation. He had bailed on Paul earlier which caused a fall out between Paul and Barnabas (Acts 13:13, 15:39). Mark grew spiritually and now worked alongside Paul, who instructed the church to welcome him. Mark shows us that the gospel is bigger than our conflict.\nEpaphras, who was from the Colossae area, “contended” for them in his prayers (Colossians 4:12). The Greek word for “contend” means “to fight for.” Epaphras fought for the church at Colossae in his prayers, demonstrating that we can be fighters not with fists but with hearts devoted to God.\nLuke, author of the Gospel that bears his name and the book of Acts, seems to have stayed with Paul throughout his imprisonment, aiding in the ministry of the gospel.\nDemas appears to have deserted Paul and chased after the things of this world (2 Timothy 4:10). In his sobering story, we see the reality of our need to pursue Christ.\nNympha was a wealthy Christian woman who valued the gospel over possessions. She hosted the church in her home, using her earthly treasure for heavenly gain.\nAfter naming all these people and more, Paul charges Archippus (possibly the son of Philemon) to pay attention to the ministry he has received in the Lord, so that he may accomplish it (Colossians 4:17).\nPaul is not competing with the people he lists in his letter. He loves them. He is not trying to be the alpha wolf. He is trying to be the Lord’s servant.\nWhat would it look like if we as the church laid aside our competition and intentionally encouraged and exhorted our brothers and sisters in Christ? Jesus said, “By this all people will know that you are My disciples, if you have love for one another” (John 13:35). Paul’s conclusion to his letter reveals this recognizable love in the way he addresses his friends.\nAs Christians, may we not be identified by our competitiveness but by our love. And may that love show the gospel at work in our lives to those around us.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram12.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 4:2-6, Psalm 145:18-19, Philippians 4:6-7, Matthew 5:16",
        "devo_title": "Seasoned With Salt",
        "devo_summary": "\n                    \n                    A good conversation makes life more enjoyable. There is nothing more satisfying for me than engaging with someone about their life or important issues facing our world. When it comes to talking about the gospel, I get even more energized because I know these occasions can have eternal significance.\nThis passage from Colossians is largely about how we interact with those who do not know Christ. Paul takes for granted that Christian people will interact with those around them, particularly people with little understanding of the gospel. Like a good pastor, Paul encourages these believers to make the most of these opportunities. As believers, we are to thoughtfully represent Christ to those who don’t know Him.\nDo you think about your conversations with non-Christians very much? Do you reflect on the content or the quality of those interactions? You may be one of the only authentic followers of Jesus your non-believing friends or co-workers come into contact with on any given day.\nPaul challenges us to be more intentional with how we represent Christ to the world. He says we should “act wisely toward outsiders, making the most of the time,” and our words should be “gracious, seasoned with salt” (Colossians 4:5-6).\nGraciousness in speech refers to a generosity of spirit. Have you ever met someone who is not set on needing the last word or winning an argument? I’m guilty of seeking both. Gracious speech invites further conversation, with a genuine interest in the one to whom we speak. Our speech is also to be “salty.” If speech can be “colorful,” then I guess it can also be flavorful. Salty speech is relevant, engaging, and thoughtful. It takes skill, but we must learn to speak so that our words convey the truth of Christ in an intelligible way. This takes practice and discernment to learn “how to answer each person” (v. 6).\nThe gospel is the best news ever given to our weary world. As we encounter those who do not know Christ, let us share the greatest news the world has ever heard with generosity and creativity, always seeking to make the most of every opportunity.\nwritten by Chris Comstock\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram11.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 3:18-4:1, Matthew 6:33, Ephesians 5:22-6:9",
        "devo_title": "Whatever You Do",
        "devo_summary": "\n                    \n                    If I received a letter in the mail containing only the instructions in this text, I would feel lost and discouraged because I know I don’t have it in me to follow through. It’s not the instructions that necessarily bother me—I’m as good as the Pharisees at following rules. It’s my heart that trips me up. \nIn this passage from Colossians, Paul calls his readers not only to submit, love, and obey; but to do so with sincerity of heart, fearing the Lord (Colossians 3:22). He urges them not only to work heartily, but to do so for the Lord and not for man, and not by way of eye service or as people-pleasers (3:22-23). He reminds them that, in everything they do and in all their earthly relationships, they are serving Jesus, their master in Heaven (3:23-4:1).\nThis list from Paul is tough for me because it completely kicks against the way my flesh approaches work and relationships. Left to myself, I’m a good and hard worker—so long as someone will notice and pat me on the back. Left to myself, I can put on a good face and fulfill my relational duties—but not with a sincere heart and not with a posture that serves the Lord. \nBut the beauty of this text is that it doesn’t stand alone. This isn’t a list of instructions Christians are expected to follow without the context of the gospel. These instructions are found in a letter that details the authority and goodness of Jesus and the redemption of God’s people (Colossians 1:13-17). Left to ourselves, we couldn’t submit to these instructions with sincere hearts; but, because God has raised us with Christ, we can follow Christ’s example through Christ’s strength. We are a new creation with hearts made new (Colossians 3:10). We’ve already been given both the grace to follow through as well as the forgiveness when we fail.\nAnd so, may we receive these instructions and fulfill God’s design for our relationships with an awareness that we’ve been given new hearts. May we work unto the Lord—for Him and not for man. And may we do what Christ has asked of us—submit, love, obey, and work heartily—not by any earthly power and not for any earthly prize, but through the power of Christ in us and for the glory of God our Father.\nwritten by Billy Jack Brawner\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram10.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 3:1-17, John 11:25, Philippians 3:12-16, Romans 6:1-14",
        "devo_title": "The Christian Life",
        "devo_summary": "\n                    \n                    Every Sunday I put on a white robe called an alb (it looks about as funny as it sounds). It’s what most priests wear during worship. My close friends give me a hard time when they see me in it, mostly because it is unlike anything else I wear. I prefer flannel and jeans, or a hoodie and shorts, but on Sundays, I put on my alb. I don’t look cool in it. I wear it because it reminds me and everyone else of a profound truth: Christians are a people who have put on Christ. We have been clothed in a “new self” (Colossians 3:9-10). This is why people often wear white when they are baptized as well. We adorn ourselves in white garments because we are (and bear with me, guys) pure and holy as a bride awaiting the groom (Ephesians 5:27).  \nWhat Paul writes in this part of the letter to the Church at Colossae is about the life that is birthed when we are made new in Christ. Paul says, “so if you have been raised with Christ, seek the things that are above” (Colossians 3:2). This raising is a mystery whereby we are buried with Christ and raised with Him in His resurrection. By God’s grace, we take off the old garments that defined us before we were dead and buried, and replace them with new garments in our resurrection (Galatians 3:27).  \nIn Christ, we are a different kind of people. “Therefore we were buried with Him by baptism into death, in order that, just as Christ was raised from the dead by the glory of the Father, so we too may walk in a new way of life” (Romans 6:4). We put off those things which defined us before we met Christ, and replace them with compassion, humility, meekness, patience, forgiveness, and above all, love (Colossians 3:12-14). God moves us from death to life.   \nOn baptism days we have a tradition in my church that Christians have practiced for centuries. Since I already look ridiculous in my alb, it makes no difference if I also carry a “priest broom.” (I know this sounds strange. Just listen.) After we baptize those who have come to the waters, I get to place my broom in the water and sling it into the crowd of people. It hits them in their faces, it gets on their clothes, it ruins their hair— it gets everywhere. But I say to them, “Remember your baptism.” Likewise, I say to you now, “Remember yours.” \nRemember that you have been raised with Christ; you have put off the old self and have been clothed in righteousness. So now, in everything you do, do it in the name of the Lord Jesus, giving thanks to God the Father.  \nwritten by Father Aaron Wright\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram9.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 2:16-23, Romans 14:1-23, Hebrews 8:1-6, Hebrews 10:1-10",
        "devo_title": "Shadow vs. Substance",
        "devo_summary": "\n                    \n                    Why would Paul need to direct the Colossian church to not get caught up in feeling guilty when people judge them for not practicing ancient customs or observing old traditions? (Colossians 2:16-17) Why would the apostle need to tell these young Christians to resist bowing to those who teach that the way to spiritual health comes through asceticism— the self-denial and fasting summarized in verse 21 as “Do not handle. Do not taste. Do not touch”?\nFalse teachers had descended on the Colossian church, teaching that true believers in God needed to practice self-discipline, observe certain festivals, and follow a certain diet in order to claim genuine faith. \nAt first blush, many of us might say those rules don’t sound like much of a life. Who would be tempted to fall into those traps?\nBut Paul is not speaking to the particular rules themselves. He is speaking to the heart behind them. Paul is essentially saying, These guys will come through and they will have an air of wisdom. They will be very persuasive. They will appeal to your consciences. And you will be tempted.\nPaul knows the human heart. He knows we will always find the prospect of turning genuine faith into a system of alluring rules. Show us the levers to pull and the button to push to get this faith up and running; tell us what to do and what to avoid in order to get our spiritual lives in order, and we will always be tempted to lean in and listen.\nPaul does not completely demonize ceremonies or the observance of holy days. What he is saying is that those things were given to foreshadow the coming of Christ. They were given as symbols of the promise that the relationship between God and man would one day be restored. Christ has fulfilled that hope. Ceremonies and holy days are only shadows. Christ is the substance of our faith. \nFor as long as the church exists on this earth, we will need to be reminded that Christ is not after our behavior. He is after our hearts. Hearts are not won by prescribing rules. But for the heart that loves God, devotion and obedience become the overflow of our affection and trust. This is what Paul wants to mark the lives of the believers in Colossae, and this is what Christ Himself wants for us—that our devotion and discipline would flow out of our love for Jesus Christ, the substance of our faith.\nwritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram8.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": " Colossians 2:6-7",
        "devo_title": "Rest",
        "devo_summary": "\n                    \n                    Take this day to catch up, pray, and sit in God’s presence. Pray the scripture below for someone in your life and for yourself.\nTherefore, as you have received Christ Jesus the Lord, walk in Him, rooted and built up in Him and established in the faith, just as you were taught, overflowing with gratitude.\n-Colossians 2:6-7\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram7.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 1:17 ",
        "devo_title": "Remember",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof and truth in your heart and mind each day.\nWrite these verses down, keep them in your wallet, post them on your mirror or at your desk—anywhere you will see it often.\nHe is before all things, and by Him all things hold together.\n-Colossians 1:17 \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/4-Colossians-1-17.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 2:8-15, Matthew 15:1-9, Romans 7:4",
        "devo_title": "He Made You Alive",
        "devo_summary": "\n                    \n                    Take a look at the New York Times Best Seller list. Read the headlines on the magazine covers at the grocery store. Even look at the book titles of many of today’s best-selling Christian personalities. What do you see? People offering the secrets to a better life. The writer of Ecclesiastes tells us that there is nothing new under the sun (Ecclesiastes 1:9). This desire in us to crack the code to a better life has been on our minds since the fall of man. We are drawn to the false promises like moths to a flame.\nIn Colossians 2, Paul writes to the church about some false teachers who have begun to deceive many new Christians through empty lies based on human traditions. The fact that Paul doesn’t give us more specifics about their teaching here is, I believe, part of the wisdom of God. We have to infer the false teaching based on the truth Paul offers as its substitute.\nWhat does Paul tell us? He says we need not try to find life in empty things because we have already been given life in Christ, in whom all the fullness of God dwells (Colossians 1:19). What sort of life have we been given? It is the kind of life where we have been filled with the Spirit of God (Colossians 2:9-10). It is the kind of life where we are joined to Christ in a covenantal bond (Colossians 2:11). It is the kind of life where we have been buried with Him in baptism and have been raised to newness of life by the power of God who also raised Christ (Colossians 2:12).\nIt is the kind of life where, though we were once dead in our sins, we have now been made alive. It is the kind of life where we are forgiven of our sins, where the debt we owed because of our transgressions has been paid in full; the notice of the cancelled debt has been nailed to the cross and we bear it no more (Colossians 2:13-14). The cross of Christ marks a decisive triumph over the power of the devil, and what follows that victory is a triumphal parade celebrating the security we have in Christ forever (Colossians 2:15).\nRead this summary of the riches we have in Christ from Colossians 2 and ask this question: what else does your heart pine for? And why? We are just as susceptible today as Paul’s original readers to chase after the hollow promises of a better life. What resides in us that would make us want to listen to empty philosophies?\nMay we use the Word of God to investigate the desires of our own hearts even as we consider the magnificence of the victory of Jesus, who has given us not only a guilt-free life, but also an eternal home in His presence forever.\nwritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram5.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 1:24-2:7, 2 Timothy 1:8-10, 1 Corinthians 15:10, Isaiah 11:1-2",
        "devo_title": "A Holy Calling",
        "devo_summary": "\n                    \n                    I’m cynical by nature, and I don’t like that about myself. I long for a simple and childlike faith. But, for as long as I can remember, I have wrestled with my faith. There are questions that, at times, I just can’t seem to shake. There are things of God that I have difficulty reconciling with the world I see around me. Doubts nag at me. Unbelief crouches at my doorstep. I am easily swayed by the teachings of this world, constantly reminded that I need God to give me grace to believe. \nLately, it feels like my doubts have rooted themselves more deeply than before. I was telling this to a friend the other day, as a confession of sorts and a request for prayer. He reminded me that, in seasons of doubt, the best thing I can do is to look intently at the personhood of Jesus. He suggested that focusing on Jesus—on who He is and what He did—would allow me to acknowledge my doubts without feeling the need to sort out every single question, because Jesus is sufficient. Faith in Jesus is sufficient.\nIn this text, we see Paul doing something similar with the people of Colossae and Laodicea. He writes to them with a deep love, struggling and toiling with all the energy Jesus has given him to be a servant of the church, “to make God’s message fully known” (Colossians 1:25). Paul warns that, like me, they are prone to be deluded by the plausible arguments of false teachers. And, like my friend, Paul confronts this tendency by pointing them back to Jesus, reminding them that “all the treasures of wisdom and knowledge are hidden in Him” (Colossians 2:3).\nWe find comfort when we place our doubt next to the wisdom and knowledge of Christ. Because He Himself is wisdom and knowledge, faith in Jesus is sufficient when facing doubts, false teachers, and cultural norms that war against our faith. Faith in Jesus is sufficient because Jesus is sufficient.\nLet us continue to live our lives in Christ and may we be deeply rooted and firmly built in Him, knowing He holds the treasures of wisdom and knowledge. May our faith be strengthened by what we have been taught by His Word and Spirit, and may we strenuously persevere with all the strength of Christ that so powerfully works in us.\nwritten by Billy Jack Brawner\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram4.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 1:15-23, 1 Corinthians 8:5-6, Jude 1:24-25 ",
        "devo_title": "Through Him and For Him",
        "devo_summary": "\n                    \n                    Have you ever found it impossible to explain something? I used to backpack the Dingle Peninsula in Ireland every summer. I don’t know why I kept going back to the same place again and again. Pictures or grand words could never capture the reality of just being there. It has always been a struggle to explain my love for it. I have since learned to say, “It’s just mysterious.”\nI’ve learned to do this with things of the faith as well. Eugene Peterson, in his book Unnecessary Pastor, says this about mystery: “Mystery is not the lack of meaning; it’s more meaning than we can comprehend.” I don’t throw myself on the mystery “excuse” so I can dodge conversations, but so I can fully engage them. What we find with mystery is the freedom to say some pretty amazing things without fully comprehending them or knowing how to explain them perfectly.\nPaul most likely didn’t write this part of Scripture. Sure, he penned the letter, but this is an early Christian hymn birthed in the worship life of the infant Church. This is some of the earliest (and best) Christian theology we have. Paul is not sharing with the Colossians something new; he is reminding them of a song they already know. This song is the basis of Paul’s letter to them, and one of the earliest faith statements of the Church. In fact, as you journey further into the letter to the Colossians, you will see the themes of this song woven throughout. It is inescapable.\nI believe the words of this hymn not because I can make perfect sense of them, but because I can’t. The mystery of Christ is far too rich, far too deep, far too mysterious for me to not believe. There is no way we can explain who “the image of the invisible” is without sooner or later leaning on mystery. Fully human and fully divine, Creator of all things, in Him all things hold together—these are statements that stretch our imagination to see beyond that which we can comprehend. And these are core beliefs of the worshipping church to whom Paul is writing.\nThe real beauty comes not when we can recite the hymn or know its intricacies, but when it captures us. When it moves us to worship. When we realize that He, Christ—who is, in His flesh, the image of the invisible God—reconciled us to Himself through His death. That’s a place we can keep coming back to again and again.\nBrothers, may Christ, Lord of all, bless and keep you. May your hearts and minds be daily made new, strengthened in the deep well of love that pours forth from our God. And, may you be in awe of the deep mysteries, finding them not a place of confusion but of faith and encouragement.\nwritten by Father Aaron Wright\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram3.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 1:3-14, Psalm 1:1-3, Matthew 24:14, Ephesians 1:7-8",
        "devo_title": "Walk Worthy",
        "devo_summary": "\n                    \n                    Do you remember your first steps as a child? I don’t remember mine, but bet it was exhilarating! \nIt is not quite as exciting to take steps as I’m sure it once was, but it definitely makes life a whole lot easier when you are skilled at it. Sometimes maturity can sound boring, as if the excitement has been taken out of something. However, in reality, maturity allows us to navigate life in a more skilled fashion, avoiding dangerous pitfalls and living a life that flourishes.\nIn many areas of our lives we are on a natural trajectory towards maturity. We grow from infants to toddlers, from adolescents to teens, and finally to adults. This happens automatically, without much thinking or even active participation— it just happens. Maturity in some aspects of our lives, on the other hand, will not just happen in the way of growing taller, getting a deeper voice, or growing facial hair (some of us are still hoping for that last one). In fact, in key areas of our lives, maturity necessitates—even requires—that we actively participate in, foster, and nurture our growth. Otherwise, we will remain in an early stage of development.\nPaul is writing to a Colossian church just beginning to take its first steps in their newfound faith in Jesus. He is letting these young believers know that he is praying for them, that the new life planted in them would permeate their lives and have its effect. \nGod’s primary objective and delight is for us to grow up and walk. This is His goal for us: “to walk in a manner worthy of the Lord, fully pleasing to him, bearing fruit in every good work, and increasing in the knowledge of God” (v. 10). We are to actively cooperate with God in this endeavor of taking on the character of Jesus. As we do, we will not only bear the fruit of spiritual maturity (Galatians 5:22-23), but we will actually come to know more intimately the God who saved us.\nThe reality is we need power to grow. And it will not come from mustering it up, but by the powerful rule of God that has taken its place in our lives through the bold rescue of Jesus Christ (v. 13). In Jesus, God has secured both forgiveness of and freedom from our sin. Our response: give thanks and grow!\nAs men of God, may we pursue maturity in our walks with God, living lives worthy of our redemption in Jesus Christ.\nwritten by Chris Comstock\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram2.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "Colossians 1:1-2, Romans 1:7, 2 Corinthians 1:1, 1 John 3:1-2",
        "devo_title": "Greetings To The Saints at Colossae",
        "devo_summary": "\n                    \n                    Maximus and Juba (Gladiator)\nWilliam Wallace and Hamish (Braveheart)\nHawkeye and Uncas (Last of the Mohicans)\nSherlock and Watson (Sherlock Holmes)\nWho are the men you would take into battle with you? Who are the men that you “do life” with?\nWhen we read the opening of Paul’s letter, it seems pretty standard. We are tempted to quickly move past it but, if we do, we miss a glimpse into how Paul is living his life. Paul begins his letter to the believers at Colossae by mentioning Timothy. One of the things we know about Timothy is that he was young, and others would at times use his youth against him (1 TImothy 4:12). So why would Paul, now a recognizable name and voice of authority in the early church, take the time to specifically mention such a young person in the faith?\nThough Paul doesn’t tell us directly, we can see as we read through his other letters (1 & 2 Timothy, specifically) that Paul is empowering Timothy. This reveals a humility in Paul that is often lacking in our culture today.\nWe love to platform ourselves, to brag or build our identity around our accomplishments. In his letter to the Colossians, Paul orients people to Christ, not himself. He is not threatened by including others into the work God is doing—he is actually validating that God can and does work in others, quite possibly even those you would least expect.\nPaul’s actions of including and validating Timothy reveal the heart of discipleship—a heart that is centered on Christ and not accolades, a heart that encourages and fosters growth. This is so important to the new believers in Colossae. Although they would draw a line between themselves and Paul, they could relate even more with Timothy, who was also half Gentile. Paul’s inclusion of those younger in the faith shows the reality of the transforming power of the gospel and makes it more difficult for me to alienate myself from it due to my inadequacies.\nEncouraging one another in Christ may strip us of our excuses, but it also also helps us solidify our understanding of our identity in Christ.\nPaul sees the importance of being united in Christ and encouraging those who battle alongside us for the sake of the gospel. The Christian life is not a race we are meant to run alone. While we may sometimes find ourselves out in front, may we, like Paul, not misplace our significance in our position. May we instead encourage those around us toward the gospel.\nLet us not make the race about us, but instead run together, encouraging one another towards the true prize: knowing the fullness of Christ.\nwritten by Britton Sharp\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Colossians-instagram1.jpg"
    },
    {
        "book_title": " Colossians",
        "devo_passages": "",
        "devo_title": "Introduction",
        "devo_summary": "\n                    \n                    Have you ever moved somewhere new? I’ve moved several times in my life and every time the transition has been a struggle, no matter how excited I was to live in that new city. I would get lost, feel out of place, and when things got overwhelming, I would wonder if I should have even moved to begin with. \nThe people of Colossae were new—new to Christianity, that is. Colossae, located in modern-day Turkey, was located at a crossroads, making the city both a commercial and tourist destination. Paul had most likely never been there, but he had heard of their faith and pursuit of holiness (Colossians 1:4). The Colossian church was primarily made up of Gentile believers who, according the focus of Paul’s letter, were being confronted with teachings contrary to the gospel of Christ. Paul’s desire in his writings is to encourage the Colossian believers in their new faith and help them form a stable foundation on which to grow.\nPaul points out early in his letter that central figure in the Christian faith is Christ Himself: “He is before all things, and in him all things hold together” (Colossians 1:17). Paul appeals to the Colossians to orient their lives and faith around Christ, not the persuasive yet false teachings we’ll read about in Chapter 2.\nIn the final two chapters of the letter, Paul continues the theme of the supremacy of Christ by discussing how the believer ought to live as a citizen in this new city. He talks about how to protect and defend the city, identifying the characteristics of a healthy citizen and how they should conduct themselves. They are to live as “God’s chosen ones, holy and loved” (Colossians 3:12).\nAs we read through the book of Colossians together, may we remember that our citizenship is in heaven. Whether we are new to our literal or metaphorical city or have resided there awhile, we must orient ourselves to Christ alone.\n\n                ",
        "img_url": ""
    },
    {
        "book_title": " Colossians",
        "devo_passages": "",
        "devo_title": "How To Use This Plan",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Colossians as well as supplementary texts for scriptural and historical context. \nDaily Scripture Reading\nOur heart is that you would read scripture first and foremost. Daily scripture readings can be read here on the site, on the He Reads Truth iOS app, or via email subscription.\nReflection & Response\nThink on the following 5 questions. Consider journaling your responses & prayers.\n1. What does this teach me about God?\n2. What does this teach me about man?\n3. What does this teach me about the Gospel?\n4. How will I respond?\n5. How will I pray?\nRemember & Rest\nThe “Remember” and “Rest” days are offered to provide time for scripture memorization, prayer and rest. If you are participating in the current HRT Community Plan (such as this study of Colossians, beginning on October 19, 2015), you’ll find the Remember and Rest days fall on Saturday and Sunday, respectively.\nAdditional Features\nOther features— including space to record your reflections and prayers, lock screens and daily share graphics—are available on the He Reads Truth iOS app.\nWe pray your time in God’s Word will be rich and that you will find the theme of the Gospel of Jesus Christ on each page of scripture.\n\n                ",
        "img_url": ""
    }
]