[
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 5:22–23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThroughout Paul’s letter to the Galatians, he encourages believers to walk in the Spirit. This week, we’ll memorize Galatians 5:22–23, a non-exhaustive list of qualities cultivated in believers as we follow Him.\nBut the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. \n—Galatians 5:22–23\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/4-Galatians-3.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Hosea 10:12",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nSow righteousness for yourselves\nand reap faithful love;\nbreak up your unplowed ground.\nIt is time to seek the LORD\nuntil he comes and sends righteousness\non you like the rain.\n—Hosea 10:12\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day20.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 6:11-18, Jeremiah 9:23-24, Matthew 23:1-36, 2 Corinthians 5:17-21",
        "devo_title": "Concluding Exhortation",
        "devo_summary": "\n                    \n                    When my oldest son, Jonah, was still a baby, just nine or ten months old, I decided to shave off my beard. Now, I realized that he might have a reaction to my bare face, since my fuzzy visage was all he’d ever known, but I wasn’t prepared for just how pronounced his reaction was. For hours after the reveal, whenever I tried to hold him or even come near, he’d cry uncontrollably and push me away. I was a stranger. I couldn’t be his dad, not with those pitiful, hairless cheeks.\nEventually, Jonah and I worked it out. He stopped crying long enough to hear my voice clearly, and slowly but surely he came to recognize me as the man who tossed him in the air with reckless precision, who fed him his bottle before bedtime, and who tucked him in every night with his special song. (For the record, I have grown my beard back in full, and if I even hint that I might someday shave it again, Jonah counters, “But then I won’t know you, Daddy!”)\nAt the end of Galatians, Paul does something to make sure the Galatians can “recognize” him. He stops dictating the letter to his scribe and picks up the stylus himself: “Look at what large letters I use as I write to you in my own handwriting” (Galatians 6:11). In other words, “It’s really me here on the other end of this conversation. It’s Paul! Your friend!” Paul’s personal relationship with the Christians in Galatia went deeper than any logical or biblical argument he could make to steer them away from the false teaching that threatened to rob them of the true gospel and steal their joy. So, his final appeal is to tell his friends about his scars.\n“I bear on my body the marks of Jesus” (Galatians 6:17). Paul had been persecuted just about everywhere he went—imprisoned, beaten, and left for dead more than once. He could have saved himself a world of hurt, at least from the Jews who opposed him, if he would have just advocated for circumcision in his calls to repentance. But that would be changing the gospel of grace into a gospel of works. He believed so strongly that Jesus, and Jesus alone, was enough that he could not compromise, not for all the comforts in the world.\nDo you believe Jesus is enough? Or have you believed the lie that there’s something you must do to earn eternal life with God? The gospel is the most precious and priceless message that’s ever been shared. Paul stands in good company with all those, down through the centuries, who have suffered for a gospel that can seem just too good to be true. Thank Jesus today for the gospel of grace. And may we pray for one another with these final words of Paul here in Galatians: “Brothers and sisters, the grace of our Lord Jesus Christ be with your spirit. Amen” (Galatians 6:18).\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day19.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 6:1-10, Hosea 10:12, John 15:9-17, James 2:14-26",
        "devo_title": "Carry One Another’s Burdens",
        "devo_summary": "\n                    \n                    Kevan Chandler was born with spinal muscular atrophy, a genetic disorder that limits his mobility and leaves him bound to a wheelchair. But Kevan wasn’t content to see life at “belt-buckle level,” as he calls it. So, a few years ago, he left his wheelchair at the Atlanta airport and boarded a plane for Europe. Kevan toured three countries, visiting places that lack handicap-accessible ramps, places that would normally be off-limits to someone with his disability. He even scaled Skellig Michael, a steep mountain island off the coast of Ireland.\nHow did Kevan do all this? He has friends. Five friends accompanied Kevan and took turns carrying him using a specially-designed backpack, making it possible for Kevan to experience things that would have been impossible on his own. The trip is chronicled in the book We Carry Kevan and the film The View from Here. It’s a simple but amazing story that demonstrates what can happen when we take turns carrying one another’s burdens.\nPaul wasn’t thinking of physical burdens when he wrote to the Galatians. Instead, he was thinking of spiritual ones no less debilitating—sins that so easily entangle us. Chapter five of Galatians closed with Paul instructing his friends to walk by the Spirit. Now he says, “Carry one another’s burdens; in this way you will fulfill the law of Christ” (Galatians 6:2). In other words, as we walk by the Spirit, we are to walk alongside our brothers and sisters in Christ. When someone trips headlong into sin, we are to “restore such a person with a gentle spirit” (v.1), helping them get back on their feet so they can continue to walk in “love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control” (Galatian 5:22–23).\nThe false teachers in Galatia were trying to convince the Galatian Christians they needed to be circumcised and obey certain other rules in order to fulfill the law and be real followers of Christ. But Paul says the only law that matters is “the law of Christ”—and that law is fulfilled when we “carry one another’s burdens.” After all, remember that when Jesus carried His cross through the streets of Jerusalem, falling under its weight, He was carrying our burdens. That cross was our rightful punishment, the curse we deserved for our rebellion against God. We fulfill the law of Christ when we follow Jesus’s lead, bearing the burdens of those whom we love.\nEach one of us must battle against his own flesh, the snares of the devil, and the traps of this world, but we don’t fight alone. God has given us the local church, brothers and sisters who also love the Lord, to help us. But all too often we reject this help out of pride, shame, or fear. We don’t share our struggles. We don’t ask for prayer. We don’t confess our sins. And so, we don’t have someone by our side to pick us up when we fall. We spend most of our time at “belt-buckle level,” spiritually speaking.\nJesus said, “Love one another as I have loved you” (John 15:12). If we are going to take this command seriously, we can’t live the Christian life as a solo adventure. We must go together, and we must carry one another.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day18.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 5:16-26, Ezekiel 37:1-14, Ephesians 2:1-10, Revelation 21:1-8",
        "devo_title": "The Spirit Versus the Flesh",
        "devo_summary": "\n                    \n                    I once heard a megachurch pastor describe his church as a store where people can come on Sunday mornings to be consumers of faith. He said this was by design, as Americans are generally more comfortable with transactions than they are with relationships. At a restaurant or a store, a person’s credit card gives them a special kind of power. They can have anything they see, whatever promises happiness at that particular moment. They can get their coffee personalized a thousand different ways, and while they’re waiting in the drive-thru lane for said coffee, they can order nearly any product in the world from the phone in their pocket. If we want to reach the lost for Christ, this pastor’s argument went, we ought to speak their language, and that language is consumerism.\nThis shouldn’t be controversial to say, but that is not the Christian faith. Jesus is more than a transaction. He is a Person, and the Christian life can only be lived in relationship with Him. Paul reminds the Galatians of this important truth, writing, “If we live by the Spirit, let us also keep in step with the Spirit” (Galatians 5:25).\nJesus Himself modeled the kind of life Paul describes, being “led by the Spirit” (Luke 4:1). He also promised His disciples, “the Spirit of Truth… will be in you” (John 14:17) and then added, “I will not leave you as orphans; I am coming to you” (John 14:18, emphasis mine), and also, “If anyone loves me, he will keep my word. My Father will love him, and we will come to him and make our home with him” (v.23, again, emphasis mine). When we receive the Holy Spirit, we enter into a relationship with the Father and the Son also.\nThe Christian life is not a one-and-done transaction. It’s not a one-time prayer. It’s not walking down the aisle. And it’s not merely a moment of decision. It never has been, and thanks be to God, it never will be. When we walk by the Spirit, as we are necessarily called to do, we become more like Jesus. That’s why Paul could report that the fruit of the Spirit is “love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control” (Galatians 5:22–23). That’s a pretty great description of Jesus, if I’ve ever heard one.\nJesus is alive, and those who know Him have the privilege of doing life with Him. He’s always with us through His Spirit. And that’s better than anything we can buy at a store.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day17.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 5:1-15, Numbers 11:1-20, Romans 2:25-29, 1 John 3:19-24",
        "devo_title": "Freedom of the Christian",
        "devo_summary": "\n                    \n                    On certain spring days, when the temperature is just right and the breeze is steady, I am taken back in time to another spring, many years ago, when I was a short-term missionary in Jamaica.\nMaybe you’ve had this experience: your senses take a mental snapshot of a moment—a seemingly perfect moment—so that it might be remembered forever. In this case, I was hiking back to our mission house one afternoon, talking with a friend. Something about the kingdom work we were doing on our trip, the spiritual conversation we were having as we walked, and the beauty of our surroundings made an impression deep inside of me. To this day, when the dwindling afternoon sunlight hits my eyes just right or I smell a certain combination of nearby ocean mists and fruit trees in bloom, I am transported to that moment.\nMy mind has taken other pictures over the years, but for reasons unknown to me, this one is the most vivid. And every time I’m taken back, the goosebumps on my arms remind me that God is present in my life, no matter my current circumstances. It’s a gift that cannot be purchased or earned. Even if I headed to the airport and boarded a flight to Kingston, I doubt the trip would have the same effect.\nThere are certain beautiful experiences in this world that cannot be maneuvered into being, the most precious of which is receiving the grace offered by God in Christ. Yet that’s precisely what the Galatian Christians were being talked into. There was a moment—a wonderful, amazing, unforgettable moment—for each and every Galatian believer, when they understood the gospel deep within and took hold of it as their own, when they surrendered to God’s love and traded their sins for Christ’s righteousness. But now a group of false teachers were telling them they had to earn God’s favor through obedience to certain aspects of Old Testament law, including circumcision. In short, they were being told to doubt the moment that everything in their life had changed.\nPaul wrote to remind the Galatians of their freedom in Christ. Jesus paid the price for their sins, so there was now nothing standing between them and the love of God. “For you were called to be free, brothers and sisters” (Galatians 5:13). But the false teachers in their midst were preaching a twisted gospel that would render Christ’s sacrifice meaningless. If salvation must be earned, the cross accomplished nothing. To turn and follow the instructions of the false teachers would be to turn away from Christ, to reject the grace He offers. It’s no wonder Paul used such harsh language in this passage: “I wish those who are disturbing you might also let themselves be mutilated!” (v.12). This is deadly serious business.\nMore powerful than a sight or a smell that can transport a person back in time, Paul’s letter to the Galatians served to remind them of the moment in their own history that was truer than every lie those false teachers could think up. But his letter wasn’t just for them. The Holy Spirit inspired Paul’s words and preserved them so that you and I, nearly two thousand years later, could receive the same reminder: In Christ, we have God’s love. There’s nothing we can do to show ourselves approved. We already are, and it’s all thanks to grace, bought and paid for on our behalf at Calvary.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day16.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 4:21-31, Genesis 16:1-16, Romans 9:6-8, Hebrews 12:18-24",
        "devo_title": "Sarah and Hagar: Two Covenants",
        "devo_summary": "\n                    \n                    Growing up, I attended a small and fairly conservative Christian school. While I’ll always be grateful for the time I spent there, there were many years where I felt out of place: I was one of the only students whose parents were divorced.\nToday, that might sound strange. Sadly, divorce is an all too common reality, and many kids are growing up in single-parent or blended-family homes. But back then, in my small corner of the world, it felt like I was the only one. Through no fault of my own, I was an outsider, at least in my own head. I believed God’s biggest blessings were reserved for those families that seemed to have it all together, and I—I was just surviving. I was a Christian, and in that sense I belonged, technically, but only as a black sheep.\nThe Christians in Galatia knew what it felt like to be black sheep. As they read the Old Testament, they saw how God loved and blessed the people of Israel, the descendants of Abraham, Isaac, and Jacob, over and over again. The Galatian Gentiles were grafted into the family of God because of Jesus. But they were the black sheep of the family because they weren’t Jewish. Or at least that’s what they thought.\nThis is why it was so easy for false teachers to convince the Galatians they needed to become Jewish through circumcision and obedience to the law; only then could they really be Christians. But Paul showed them another way to read the Old Testament, to see themselves in the story, not as outsiders, but as real and true descendants of Abraham and heirs of God’s promises.\nLong before the law was given to Moses, there was Abraham, and he was an outsider until God invited him in, not because of anything he had done, but simply on the basis of faith. Abraham had two sons—Ishmael and Isaac. Ishmael was the son of the slave woman, Hagar, and the result of Abraham taking God’s promises into his own hands. Isaac, on the other hand, was the child given to Abraham and Sarah. His birth was unnatural. It was miraculous. And it was through this miracle child, Isaac, that God’s promises came down through history.\nLike Isaac, the Galatians were “unnatural” children of God. They, too, were part of God’s family by way of a miracle. “Now you too, brothers and sisters, like Isaac, are children of promise” (Galatians 4:28). God’s family is made up of men, women, and children who enter in by faith, in fulfillment of the promises God spoke to Abraham. Being a Jew or a Gentile means nothing. What matters is Christ.\nThough I spent years feeling like an outsider, a child of divorce, I understand now that divorce and brokenness and my inability to keep it all together are among the many reasons why Jesus came. As He said, “It is not those who are well who need a doctor, but those who are sick” (Mark 2:17). We can belong to the family of God, not because of who our parents are or because of how well we obey, but simply because Jesus paid the price and invites us to enter in by faith. Thanks be to God!\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day15.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 3:27",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse from our reading on day 11. Throughout the book of Galatians, Paul teaches that nothing gives us an advantage over others in approaching God. Believers have equal access to God because we are clothed with Christ.\nFor those of you who were baptized into Christ have been clothed with Christ.\n—Galatians 3:27\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/4-Galatians-2.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "1 Peter 2:24",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe himself bore our sins in his body on the tree; so that, having died to sins, we might live for righteousness. By his wounds you have been healed.\n—1 Peter 2:24\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day13.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 4:8-20, Deuteronomy 32:1-9, Acts 17:24-31, Romans 1:18-25",
        "devo_title": "Paul’s Concern for the Galatians",
        "devo_summary": "\n                    \n                    One of my biggest fears as a parent is that my kids will reject Christianity altogether. We’re a family that doesn’t have a lot of history with the faith, and my wife and I are flying blind on almost everything. What is it like to grow up with Christian parents? No idea. We didn’t do that. What is it like to be Christian parents? We’re making it up as we go along.\nBasically I don’t want to do something that’s going to completely mess them up. (Which I know is already too late, because every parent messes up their kids to one degree or another.)\nIn our early years as parents, we tried to follow a program that claimed to be help parents raise their kids, basically, God’s way. But God’s way in that instance seemed to be a whole lot of Law, and not a lot of gospel. Children will obey the first time. They will do what they’re told. Because if they don’t, they’ll be lost. For us, the approach didn’t make us more godly parents. It did, however, feed into our insecurities and anxieties—and into our larger problem of our natural tendency to wander away from the One we love (and too often had one of us losing our cool because the kids did not obey the first time we asked them to do something). We were getting so wrapped up in trying to be a good Christian parent that we were losing our focus on the gospel.\nRemembering that particular season, I can’t help but think of what Paul wrote to the Galatians: “But now, since you know God, or rather have become known by God, how can you turn back again to the weak and worthless elements?” (Galatians 4:9)\nThat, in a nutshell, summarized our problem: we were turning our eyes from what mattered most. We were parenting from a legalistic view, instead of parenting out of the gospel. Our parenting was based on the wrong foundation. We needed to point our kids—and point ourselves—to “the Rock;” to pay attention, to remember, and to tell our children about all that He has done day in and day out (Deut. 32:1-9).\nI needed this reminder yesterday. I need this today. I’m going to need this tomorrow. Everyday, I need to confront myself of this truth, because it’s so easy to wander away from it into something else. To lose sight of what really matters. But God is good. He is kind. And whenever I am out of step, I am reminded that the only hope that I have, and my kids have, is in “the man [God] has appointed;” Jesus, the man He raised from the dead (Acts 17:31). And that’s all any of us need.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day12.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 3:27-29, Galatians 4:1-7, John 14:1-11, John 14:18-21, Romans 8:1-17",
        "devo_title": "Sons and Heirs",
        "devo_summary": "\n                    \n                    As a kid and well into adulthood, I thought Christianity was… well, let’s just say “joyless” is the most polite thing I could say. I had friends who grew up with either Anglican or Catholic parents (I didn’t care enough to ask in all honesty) and they were required to go to catechism classes once a week up until they had their first communion. Given that I had no background with anything Christianty-related, I asked what that even was. They did not speak of it with joy. They didn’t speak of anything that sounded particularly exciting at all. Just rules, at least from their perspective. We all had enough people telling us what to do already, so if Christianity was about more rules on top of the rules I already had to deal with, I wasn’t interested.\nWhen I started reading the Bible in my 20s, and found something completely different than I was expecting. It wasn’t the drudgery that my childhood friends described. It wasn’t lists of rules and commands that left us hopeless and helpless. It was something wondrous. Life-giving, I dare say. Words that told me that God takes people who were orphaned by sin, and makes them part of His family. He adopts them as His sons and daughters (John 14:18; Rom. 8:15). Heirs, the Bible called them (Gal. 4:7).\nAnd after I believed, after I recognized the only way to the father was through the One who called Himself the “way, the truth, and the life” (John 14:6), I kept noticing many people who struggled with the same sort of begrudging attitude toward Christianity that my childhood friends had with their catechism classes. They were exhausted, trying to work for what God had already given them. It was like they had forgotten that “there is no Jew or Greek, slave or free male or female; since you are all one in Christ Jesus” (Gal. 3:28). They lived as slaves instead of sons (and daughters) and heirs of the promise. I swore that this wouldn’t happen to me.\nUntil it happened to me.\nNot too long ago, I was tired, running on empty. Something was off. I was working hard—really hard—to help people see how great the gospel is. But I was working so hard that I took my eyes off the gospel’s greatness for myself. So, I turned to the Scriptures once again. And in Galatians, I was once again reminded of this good news: in Christ, I am a child of God. I am adopted into God’s family. I am an heir according to God’s promises (Gal. 3:29). And because of this, I know I am going to enjoy eternity with Him forever—not because of anything that I do, but all because of Christ, the way, the truth, and the life.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day11.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 3:19-26, Jeremiah 31:31-34, Hebrews 10:1-10, Romans 3:21-26",
        "devo_title": "The Purpose of the Law",
        "devo_summary": "\n                    \n                    The law does not justify, faith in Jesus does. If you live by the law then you are under a curse. It’s difficult to read these statements as anything but derogatory about the law. It cannot save and it actually condemns, so what exactly is the purpose of the law? Is there anything good about it at all?\nPaul poses this very question in Galatians 3:19. He recognizes that the previous 18 verses have seemingly diminished and undermined the law of God, the very commands God gave his people as a means of being set apart for holiness as his own. Rather than doing what we are often so prompt to do and taking an extreme position Paul answers it in a sequence of clarifying statements adding depth and nuance to our understanding of God’s plan and purpose.\nFirst, the law was “added for the sake of transgressions until the Seed to whom the promise was made would come.” (v.19) Paul clarifies this a few verses later in 3:24 when says “the law, then, was our guardian until Christ.” The Old Testament law was a protective measure, a gift from God to show his people what sin was, what honoring him required, and to guide them to an understanding of righteousness.\nSecond, makes abundantly clear that the law is not contrary or in opposition to the promise of God to save through Jesus. In 3:21 he explains that the law was not given with the ability to give life. It was never designed to be the means of justification. Following the law without faith was never salvific. God gave the law to protect his people, guide his people, and teach his people their need for a true and perfect savior.\nJeremiah 31 helps us understand the connection between the law (old covenant) and the promise of Jesus (new covenant). In verses 31-34 the Lord declares that he will make a new covenant, not like the old one which Israel broke (and like we break the law). This covenant will be written on their hearts, that is, it will be believed by faith and given by the Spirit. The old covenant law paves the way for the new covenant. Hebrews 10:1 clarifies even further by describing the law as “shadow of good things to come.” The sacrifices and rituals of the old covenant law could never purify and never justify, but they echoed forward to the promised saving sacrifice of Jesus.\nSo what was the purpose of the law? It protected. It foreshadowed. It echoed. This was God’s intention, not to save through the law but to create a family for himself: “Through faith you are all sons of God in Christ Jesus.” Before Jesus their faith was in the one true God and a coming savior, and it was credited to them as righteousness. Since Jesus’ ascension our faith is in him as the perfect sacrifice, the mediator and great high priest, and the coming King.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day10.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 3:10-18, Genesis 12:1-7, Isaiah 53:1-12, 1 Peter 2:24-25",
        "devo_title": "Law and Promise",
        "devo_summary": "\n                    \n                    One of the most foundational truths of the gospel, of being a Christian, is that we are unable to save ourselves because we are sinners. In our nature we are rebellious against God and cannot make ourselves righteous and good enough to enter his perfect Holy presence and be right in his eyes. Somehow, some way, though, we convince ourselves that good works will save us and that following a moral code will gain us justification in God’s eyes. It is an easy thing to believe: do good and earn rewards. In this way we are like the Galatians.\nWhat Paul says is something much stronger than “this is incorrect” or “make some adjustments to your thinking.” He says “all who rely on the works of the law are under a curse . . . it is clear that no one is justified before God by the law.” Not only was the Galatians’ focus on law-keeping failing to save, it was keeping them under a curse of judgement by God. By depending on the law they were condemning themselves to hell.\nThank God the passage does not stop there, nor does the gospel. Paul does not leave us with bad news but rather wipes away the curse of the law by looking to Jesus in faith: “Christ redeemed us from the curse of the law by becoming the curse for us.” 1 Peter 2:24 says he “bore our sins in his body on the tree,” and Isaiah 53 is rich with hope because Jesus carried our curse and stepped in to take our punishment. After verse upon verse describing Jesus’s sacrifice and burden bearing for his lost sheep it says “The Lord was pleased to crush him severely . . my righteous servant will justify many, and he will carry their iniquities.” The curse of the law was broken by the sacrifice of Jesus. We are no longer bound by the task to pushing our righteous high enough to please God only to see it fall short time and again.\nThis text offers more than personal salvation, however. The promise of salvation is not just an individual thing. This is a promise for the nations, a fulfilling of God’s covenant to Abraham. In Genesis 12: 1-7 God calls Abraham out of paganism to follow him and promises to make Abraham into a great nation. This blessing is not Abraham’s ego or world domination; it is a promise to bring hope to the world through Abraham’s offspring. “I will make your name great and you will be a blessing . . . and all the peoples on earth will be blessed through you.”\nPaul points out that the promise was not to multiple offsprings of Abraham but to one. The offspring of Abraham through whole the world is blessed is Jesus, the curse bearer. The law, which came centuries later than this promise, doesn’t change it. The law served a different purpose altogether. Salvation is through Jesus alone, and all who have faith in Jesus are members of the promise God made to Abraham, both blessed and commissioned to spread the blessing of Christ to our world.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day9.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 3:1-9, Genesis 15:1-6, Matthew 3:1-12, Romans 4:13-25",
        "devo_title": "Justification through Faith",
        "devo_summary": "\n                    \n                    “Who has bewitched you?” sounds more like a question Hermione Granger might ask Ron Weasley in the Hogwarts common room than something Paul would ask the church at Galatia. It is the steroidal version of “have you lost your mind?” Yet this is how Paul addresses the Galatians right after calling them foolish. What precipitated this exasperated expression?\nThe Galatians had done what so many of us do: turned to good works (in their case this was living by the Jewish ceremonial law) as their means of justification. They were living as if their standing in the eyes of God was based on their actions. This is why Paul reacted so strongly.\nHe hammers them with rhetorical questions each of which smashes the foundation for their false sense of justification.\n“Did you receive the Spirit by works of the law or by believing what you heard?”\n“After beginning by the Spirit are you now finishing by the flesh?”\n“Did you experience so much for nothing?”\n“Does God give you the Spirit and work miracles among you by your doing or by works of the law?”\n“Or is it by believing what you heard—just like Abraham who believed God and it was credited to him for righteousness?”\nThis last question is incredibly significant for people seeking to be good Jews, to follow the law. It harkens back to their patriarch and his standing before God. In Genesis 15 God promises Abraham, an old man, an heir who will lead to offspring as numerous as the stars. Abraham believed this promise and it was “credited to him as righteousness”—that is, his faith was his righteousness in the eyes of God. Abraham, the father of God’s people, was justified by faith. The Galatians could not rest on their law-based laurels. A few years prior John the Baptist had warned about this very thing when he preached the coming of Jesus: “Do not presume to say to yourselves ‘We have Abraham as our father.” He then preaches repentance and the coming of Christ, the true messiah.\nWhat does all this add up to? We have a church inclined to seek justification through following the law. We see Paul point back to Abraham, their father figure, as justified by faith. We see John the Baptist dismiss justification by association with Abraham and point forward to Jesus.\nPaul ends this section with the clarifying, defining words: “those who have faith, these are Abraham’s sons.” He does not dismiss the significance of Abraham or God’s promise to him. No, he clarifies it. Abraham was promised to be the father of a great nation through whom all the nations of the world would be blessed (gentiles, like me and most of you). How does this happen? Through Jesus, the offspring of Abraham. We are made right in the eyes of God by faith in Jesus and no other way, no other action, no other law. So it is that faith folds us into the family of Abraham, the people of God.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day8.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 2:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Galatians.\nI do not set aside the grace of God; for if righteousness comes through the law, then Christ died for nothing.\n—Galatians 2:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/4-Galatians-1.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Colossians 1:13-14",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe has rescued us from the domain of darkness and transferred us into the kingdom of the Son he loves. In him we have redemption, the forgiveness of sins.\n—Colossians 1:13–14\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day6.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 2:11-21, Deuteronomy 10:12-17, Acts 10:9-48, 1 Corinthians 7:17-19",
        "devo_title": "Freedom from the Law",
        "devo_summary": "\n                    \n                    “I have been crucified with Christ, and I no longer live, but Christ lives in me. \nThe life I now live in the body I live by faith in the Son of God, \nwho loved me and gave himself for me” (Galatians 2:20).\nIf you don’t have a life verse yet, I submit Galatians 2:20 to you as a possible contender for the job. When the truth of this verse hits your heart, it’ll feel like you touched a live wire with 2,000 volts pumping through its coils. You’ll feel dead. And then you’ll feel alive. Our lives are no longer our own, brothers. Christ lives in us and works through us. He brings with Him life after death. That’s the way of the gospel.\nPaul reminds us of the time Peter struggled to walk in the freedom of the gospel. Christ’s cross and empty tomb finished the demands of the law. “For Christ is the end of the law for righteousness to everyone who believes” (Romans 10:4). If the law were a subway, Christ is the final stop. Everyone off. If the law were a movie, Christ is the hero-scene. Roll the credits. With Christ, we’ve died to the law, and we now live with Christ.\nIf you are a Christian, your commitment to Him is more than merely believing that a man from Nazareth was crucified under Roman occupation. You were crucified, too, right along with Him. You are a crucified man. As Jesus struggled to breathe, your sins and your past life were struggling to breathe too. And when Christ walked out of that borrowed burial site, you walked out, too—into new life. Right now, your life is animated by the Lord Jesus. Christ lives in you, and you live by faith. Faith in Christ is now the driving force in your life, if only you’ll let Him lead.\nWhy did Christ do all of this for you? Because He knew you were going to be a great Christian? Ha! No, not at all. He knew you and I would be bumbling followers of The Way. Did He do all of this because our good works caught His attention? Nope. Paul is clear: Jesus loved us and gave Himself for us out of His great love for us (Ephesians 2:4–5). Jesus loves you, brothers. The Bible tells us so. Rejoice. Live freely in Christ, with Christ, and for Christ. That’s the Christian life.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day5.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 2:1-10, Isaiah 19:21-25, Acts 15:1-29",
        "devo_title": "Paul Defends His Gospel at Jerusalem",
        "devo_summary": "\n                    \n                    Bullies are the worst. I can’t stand them. There are times to mind your own business, and there are times to step up for others. Paul wasn’t going to let the church bullies in Galatia win. No way. Forget about it. Paul was riding this theological Harley to Galatia, ready to step up for the Galatian church. Christ’s church is too precious to let a distorted gospel run amok.\nBy this point in the letter, you are beginning to get a whiff of the garbage in Galatia. People are teaching that you have to be circumcised, in addition to faith in Jesus, if you want to be a real Christian. Paul brings up the fact that Titus, an uncircumcised Greek, was at his meeting with apostles in Jerusalem—mission control of the early church—and they didn’t make Titus get circumcised. So, why is that? Because it’s not vital to the gospel of grace.\nBut legalists will try and sneak in their lists of “do-this and don’t do that.” They want to enslave people, corrupting the freedom we have in Christ, and chaining them to their yokes and burdens. But Paul refuses to entertain it for even a minute. False gospels don’t get any courtesy. You must be swift to cut out any distortions of the gospel you see in your life. What do you think defines rightness before God other than the righteousness of Christ? The answer is nothing—not even reading your Bible every morning and going to church every Sunday.\nYes, we are called to read Scripture, to meditate on it day and night (Joshua 1:8) and to store it up in our hearts so that we might not sin against the God whom we love (Psalm 119:11, ESV). We are to feast on His words (Jeremiah 15:6) and delight in them (Psalm 1:2–3) because they teach us how to live best, but also because God’s Word invites us to know Him better. In Scripture we encounter Jesus and learn to follow Him as He transforms us into His image, making us more like Him.\nBut even spiritual disciplines, good things, like reading Scripture and serving do not make us right with God. His grace alone does that. As Dallas Willard said, “Grace is not opposed to effort, but to earning.” So let the real gospel out, share the truth with others, and it will defend against all its distortions. Today, may we rest in and run to our crucified and risen Savior.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day4.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 1:11-24, Joel 2:12-14, Acts 9:1-22",
        "devo_title": "Paul Defends His Apostleship",
        "devo_summary": "\n                    \n                    Basketball is a beautiful game. The flow, the rhythm, the athleticism, the speed. Dr. James Naismith created a spectacle that still dazzles millions of people every year. While it’s been improved over time (the addition of the three-point shot, for example), the game originated with Dr. Naismith, a physical education teacher, his student athletes, and a peach basket hanging off a gymnasium balcony. It’s amazing what can come from human ingenuity; human beings can be quite clever.\nBut no human came up with the gospel. It’s too beautiful. It’s too “other than us” for one of our kind to have dreamed up the drama and goodness of redemption. The gospel came to us from another dimension, from heaven to earth. Holy became human; the Son of God became man. Learning to live out the gospel is to believe it. To trust it.\nPaul didn’t create this message to the church. He received it from God and then went on mission with Him to spread it all over the Roman world. And this is our task, too: to believe in the gospel—in Jesus, the one God sent to us (John 6:29)—and to share the good news with others, spreading its message far and wide beyond us. It won’t always be easy, but it will always be worth it.\nWhile false teachers pushed back against Paul’s message and his authenticity to even preach the gospel, Scripture shows us that he remains committed to sharing his testimony. Paul begins by reminding us that he isn’t an ordinary teacher; he’s a full-blooded apostle. Not ordained by men, not trained in some weekend program in a shopping mall—the risen Christ gave Paul this ministry. And his authority surpasses anyone who would disagree with him. Paul establishes his apostleship, not to puff out his chest, but to wrap his arms around us, as to say, “I’m here to help. I know what I’m talking about. Will you trust me?” A former Pharisee before Jesus flipped his world upside down in the very best way, Paul knows the power of Christ and is not ashamed of the gospel.\nHow has Jesus flipped your world around? Don’t ever be ashamed of your story. Jesus isn’t. He wrote it. He’s using it. Your personal narrative of new life doesn’t have a human origin either—it’s all grace. Praise God for it! Your origin story doesn’t even begin with you. Your story begins with the God of all grace, and a book filled with the names of those redeemed by the blood of the Lamb (Luke 10:20; Revelation 3:5). Rejoice, brother. Your life has been touched by God Himself.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day3.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 1:6-10, Isaiah 52:1-10, 2 Corinthians 11:1-4, 2 Corinthians 11:12-15",
        "devo_title": "No Other Gospel",
        "devo_summary": "\n                    \n                    I remember the first time I got lost using the navigation app, Apple Maps, on my iPhone. I put the name of the business in correctly, but it took me about ten blocks away—in the opposite direction from where I needed to go. I’ve since ditched Apple Maps, and I’ve been faithful to Google Maps ever since. We are right to ditch apps when they fail us. There are better options out there. But there are no better options when it comes to the gospel.\nPaul is amazed that the Galatians are turning from the pure gospel of Christ, turning from Jesus Himself, and turning to a “different gospel.” It’s not like Jesus led them astray. there’s no chance Jesus pointed them ten blocks in the opposite direction. He hadn’t failed them. So why were they installing a different gospel in their lives? Perhaps because they were deceived and pressured into buying into a gospel that’s really no gospel at all.\nHow often are you tempted to subscribe to a “gospel” that says you only matter to God if you prayed today? Or read your Bible? Do you follow the crushing logic of a “gospel” that ties your joy to your works, or do you tie it to Jesus’s cross and resurrection? If we aren’t careful, we can take good things, like spiritual disciplines, and we can make them into cursed things if we attach them to the gospel. Bible reading doesn’t level us up in God’s sight, no more than circumcision leveled up the Galatians. Distorted gospels are a dime a dozen.\nOne of the great weapons of legalists and pushy people in the Church is peer pressure. Most of us like being liked; we don’t want to make waves and offend others. But if this goes unchecked, it can lead to adopting all kinds of dangerous teachings. Paul tells that he isn’t trying to please people first and foremost. He’s Christ’s servant. He is committed to speaking the truth and guarding the good deposit of grace to the Galatians.\nIf you ever sense someone spreading a distorted gospel, remember who you live to please, first and foremost. Correct course in love. Correct course because it matters. And when possible, do no’t let others be led astray.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day2.jpg"
    },
    {
        "book_title": " Galatians",
        "devo_passages": "Galatians 1:1-5, Psalm 16:1-11, 1 Corinthians 15:1-11, Colossians 1:9-14",
        "devo_title": "Greeting",
        "devo_summary": "\n                    \n                    If Martin Luther’s 95 Theses registered as a 9.0 earthquake on the Reformation’s Richter scale, his commentary on Galatians was the aftershock. Galatians is a nuclear rod of grace. Whatever it touches is transforms, sets free, enlivens and revitalizes. The church in Galatia needed a reviving around the gospel of grace. Honestly, who doesn’t?\nPaul wrote this spicy letter to the Galatians because they were toying with the gospel. Because of false teachers in their community, the Galatians were about to tamper with the gospel of grace, diluting it by adding their own works. But we don’t make the gospel better by adding to it—that’s how to de-grace the gospel. Christ alone and none of our works makes us righteous before the Father. This is why Paul wrote to the Church, and this is what we still need to hear today on the regular.\nAs Paul gets off the starting block, he goes right into the full-flavored gospel. “Grace to you”—it’s not you climbing toward grace, reaching for it. Grace to you. Grace always runs downhill, meeting us right where we are. Only Jesus can deliver us from our sins—past, present, and future—and we cannot deliver ourselves and make our relationship with God right. Only Jesus can rescue us from this dark, post-Eden, pre-New Jerusalem age. Faith alone in Christ alone is the only way we are saved. Simple. Supernatural.\nRight now, in the heavenly places, the risen Christ lives for you. The Father raised the Son out of Joseph’s borrowed tomb, defeating the biggest threat in your life: death. Jesus cracked the jaws of death when His eyelids flung open that Sunday morning. Were any of our works present that first Easter? No. But our risen Savior was there, dying in our place.\nGrace alone. Grace always.\nAnd that leads us to say, “Glory to God alone!” As Paul says, “To him be glory forever and ever. Amen.” And that’s what the book of Galatians is all about: God alone gets the glory. We can’t smuggle in any works, impressiveness, or goodness along with God’s grace. It’s just grace. It’s just Jesus. He is more than enough. Glory to God.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/09/HRT-Galatians-Instagram-Day1.jpg"
    }
]