[
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 12:1b-2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Hebrews.\nLet us run with endurance the race that lies before us, keeping our eyes on Jesus, the source and perfecter of our faith. For the joy that lay before him, he endured the cross, despising the shame, and sat down at the right hand of the throne of God.\n-Hebrews 12:1b-2\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/4-Hebrews-4.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "1 Timothy 2:5-6",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor there is one God and one mediator between God and humanity, the man Christ Jesus, who gave himself as a ransom for all, a testimony at the proper time.\n-1 Timothy 2:5–6\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day27.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 13:1-25, Joshua 1:5-9, Matthew 25:34-40",
        "devo_title": "Benediction and Farewell",
        "devo_summary": "\n                    \n                    Ask anyone who regularly communicates to a group what the hardest part of putting together their presentation is, and they will often tell you (or at least I will) that it is coming up with the conclusion. It’s usually the last part of my preparation for preaching each week. Oftentimes I feel like I’m just slamming the plane on the runway from about 15,000 feet; we eventually come to a stop, but it can be a bumpy landing before we do.\nMaybe the writer of Hebrews was familiar with this same feeling. After masterfully calling his listeners to not abandon following Christ, he seems to run off a hit-list of items he wanted to get in before he finished, but perhaps didn’t have the time to fully develop. These powerful last words, however, are instructive; they don’t need much explanation because they call us to a life of truly following Christ. This final list is a matter of living in light of having a far superior Savior in Jesus. The author’s conclusion brings us to the unchanging, glorious Savior and how we should live in light of His grace.\nWith Jesus as our unchanging Savior, we can love others well, serve the stranger, care for those suffering for the sake of the gospel, honor the institution of marriage, live simply, and show regard for those who communicate the gospel to us. Because Jesus is unchanging in His grace toward us, we can reject false teaching and bear up under suffering, while following and praying for our leaders, and continuing to do good as we have opportunity. Jesus’s faithfulness toward us assures us that He will work these good things in us and through us.\nIn this final passage of Hebrews, we are met with a powerful reflection on the enduring faithfulness of Christ to us. Only through the grace of God and the constancy of Christ—who is the same yesterday, today, and forever—are we redeemed from our sins and empowered to live for God’s glory. \nThis exhortation we have been reading the last few weeks is a powerful call to be men who have our lives centered and focused on Christ. This kind of life is one of faith, love, and glory, where we trust God’s promises over what we can see. \nMay we always put our hope in the eternal Savior who is superior in every way.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day26.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 12:14-29, Genesis 4:8-13, Isaiah 62:6-12",
        "devo_title": "Warning Against Rejecting God’s Grace",
        "devo_summary": "\n                    \n                    God is gracious. God is kind. God is loving. God is a consuming fire?\nScripture is full of passages of comfort, but today we examine one that is actually a stern warning and reminder. It is true that “God is love” (1 John 4:8), but it is also true that “the fear of the Lord is the beginning of wisdom” (Proverbs 9:10).\nOne of the starkest reminders of the danger of rejecting God’s grace is found in the case of Esau. You’ll remember that in a moment of weakness and extreme hunger, Esau sold his birthright as the eldest son to his younger brother Jacob. To make matters worse, he sold it for a cup of stew (Genesis 25:27–34).\nWhile I know Esau acted rashly and unwisely, there’s a part of me that’s always felt sorry for him. Did he really understand what he was giving away? Surely, he must have. Yet he was willing to forsake all of his inheritance, his rights, his future lands, and his stake in the family name in exchange for instant gratification. There’s some significant personal irresponsibility here. Certainly, when he had a full belly and came to his senses, Esau must have realized the massive mistake he made. Yet it was too late to turn things around (Hebrews 12:17).\nThe writer of Hebrews issues a strong caution, one that was meant to rouse the attention of his first-century readers, and still causes us to do a double take today. His words about Esau are stern: “For you know that later, when he wanted to inherit the blessing, he was rejected, even though he sought it with tears, because he didn’t find any opportunity for repentance” (Hebrews 12:17).\nWhile the Father’s heart is loving, lavish, and long-suffering toward us, Hebrews 12 reminds us that we should not play fast and loose with those luxuries. Paul puts it another way, “What should we say then? Should we continue in sin so that grace may multiply? Absolutely not! How can we who died to sin still live in it?” (Romans 6:1–2).\nGod’s grace comes freely, but it’s not cheap. If you’ve handed your life over to God through Jesus, you’ve found freedom, but it was bought for a price. The writer of Hebrews expresses an important corrective to two different types of readers. The first is the person who has heard the invitation to salvation but, for whatever reason, hasn’t made the leap of faith yet. The second is the reader who knows Jesus but is consistently eyeing the ways of the world, wondering if there might be something better, more fulfilling “over there.”\nPerhaps you find yourself in one of those places today—unsure of the invitation to repentance and restoration, or perhaps not as enamored with the Christian life as you once were. Wherever you stand, the writer of Hebrews brings a loving challenge today: God is loving, compassionate, and generous, but it’s not wise to play with fire. Once you’ve tasted the goodness of God, be sure not to reject His loving redemption.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day25.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 12:1-13, Romans 12:18-21, 1 Timothy 2:5-6",
        "devo_title": "The Call to Endurance",
        "devo_summary": "\n                    \n                    The Beverly Hillbillies was a 1960s sitcom about the Clampett family: a poor, backwoods family who lived in the Ozark mountains. While out hunting for dinner, family patriarch, Jed Clampett, fires his rifle at an animal and accidentally strikes oil. That oil comes bubbling up from the ground, and they realize their property is an oil field. So overnight, they go from dirt-poor to filthy rich, their wealth literally pouring out from the dirt. And then the rest of the series is about these backwoods hillbillies moving to luxurious Beverly Hills and being totally out of place there.\nNow, some prosperity gospel, health-and-wealth preachers might say this is the normal Christian life. If you’re dirt poor, just have faith, keep believing, support their ministry, and eventually you’ll strike it rich—God will give you all the money and stuff you could ever want. But that’s not Jesus’s story as told in our passage today. Hebrews 12 is a reminder that Jesus Himself suffered, and it is a call to endure the hardship, struggle, and discipline that will surely come when we follow Him.\nJesus would have been the worst prosperity preacher of all time: He left the riches of heaven to enter the poverty of this world. Being determined to do His Father’s will all the way to the cross meant He had few friends, no permanent home, and a ministry that went from thousands of cheering admirers to even His closest friends abandoning Him in His hour of greatest need. No, Jesus preaches a different kind of health and wealth. He promises not physical riches, but spiritual ones—eternal ones. \nThe gospel is not a promise of a full bank account; it’s a promise of heavenly riches even in earthly poverty. It’s a promise of life even in the face of death. Like Jesus, we are called to look suffering in the face and endure it with joy. In Him, we don’t merely survive suffering, we overcome it. \nThe truth is, we’re all spiritual Clampetts. We’re dirt-poor misfits who become filthy rich: our riches come up from the dirt of death to the abundance of resurrection life. Our residence in God’s Kingdom may seem as unlikely as hillbillies in Beverly Hills, but our citizenship and inheritance have been secured by Christ (Philippians 3:20, 1 Peter 1:3-4). \nHear the good news today: our suffering is no surprise to God, and in His kindness it is not wasted. He refines us in love, “so that we can share his holiness” (Hebrews 12:10). In our struggle, we can look to Jesus, who endured the cross and sent us the Holy Spirit to strengthen our weak hands and wobbly knees. May our own endurance be for His glory. \nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day24.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 11:17-40, Luke 13:34-35, James 1:2-4",
        "devo_title": "Legacy of Faith",
        "devo_summary": "\n                    \n                    The Basketball Hall of Fame is on my bucket list of places to see. All those great players, all those great teams; it’s a glorious place for a basketball fan to visit. The Rock and Roll Hall of Fame would be pretty cool to see too. Out of the great many singers and bands who have risen up the charts, only a select few make into the Hall. But enough Hall of Fame talk, because Hebrews 11 isn’t really a Hall of Fame or a Hall of Faith, despite it sometimes being described that way. Let’s put a cease-and-desist order on that.\nHalls of Fame are meant to separate the greats from the not-greats, the famous from the ordinary. No one visits the Basketball Hall of Fame and walks away thinking he can imitate Wilt Chamberlain’s 100-point game, or Yao Ming’s 7’6” height, or Michael Jordan’s gravity-defying dunks. You leave a Hall of Fame in awe of their greatness, not hoping to imitate what you see. But that’s not the point the writer of Hebrews is making.\nHebrews 11 exists for your imitation. God didn’t give us this section of the Bible for us to think, Look at these great followers of God. Too bad I’ll never be like them. The barrage of “by faiths” in the chapter are meant to weave us together with these Bible characters, joining us with them in the unfolding story of God’s glory. Like these saints of old, we, too, can walk by faith. God did great things through them, and He can do great things through us too. \nIn other words, Hebrews 11 doesn’t exist to museumify those who came before us. It is there to motivate and encourage us to believe that if these folks could live by faith, so can we. We know the crucified and risen Christ too. We’ve been joined to Him by faith, and we can walk through our temptations, sufferings, and joys, looking to Him. So go ahead and plant that church, start that Bible study at your office, invite your Muslim coworker over for dinner. Do it all by faith, trusting God to lead you and help you each step of the way.  \nOur biblical ancestors show us that by faith we, too, can endure and walk with God. We can look to the crucified and risen Lord Jesus and endure with Him till the end. There’s a great cloud of witnesses, testifying that faith is what we need to follow Jesus. So whatever lies ahead of you today or tomorrow, go by faith in the gospel of grace.\nWritten by Jeff Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day23.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 11:1-16, Psalm 33:6-7, John 1:9-13",
        "devo_title": "Living by Faith",
        "devo_summary": "\n                    \n                    When I was a kid, I loved playing video games on the family computer. I wanted the best computer so I could beat the best players online. Sometime during middle school, my parents finally decided we needed a new family computer, and I was ecstatic because I knew it would be able to play a bunch of new games our old one couldn’t. This was before two-day Amazon delivery, and it felt like I waited months for the UPS man to drop off our new computer, when it really only took a week or two. I was hoping and waiting with eager anticipation for that computer to come. Some days I wondered if it ever would. My faith wavered.\nIn Hebrews 11, we find a beautiful, brief definition of faith, and then a handful of examples of people from the Bible who demonstrated faith. Because Hebrews 11 strikes such a victorious chord of triumphant faith, it’s tempting to read through the chapter spending most of our time admiring these faithful followers of God and their tremendous acts of faith. Reading about them can be faith-building, but I want to focus on the first two verses of the chapter, which are foundational to understanding faith, though sometimes overlooked.\nVerses 1–2 say, “Now faith is the reality of what is hoped for, the proof of what is not seen. For by it our ancestors won God’s approval.” These verses, especially verse one, can seem a bit cryptic. What does the author mean by “the reality of what is hoped for” or “the proof of what is not seen”? How is faith “reality” or “proof”?\nIn his commentary on Hebrews, Be Confident: Live by Faith, Not by Sight, Warren Wiersbe writes, “True Bible faith is confident obedience to God’s Word in spite of circumstances and consequences.” God has spoken to us through His Word about things both seen and unseen, and faith is trusting that what He says is true, especially about the things we can’t see. His Word describes “reality,” and is all the “proof” we need to believe. \nThe entire Christian life is meant to run on faith, not sight. We read that God’s approval is “won” by faith (v.2), and that “without faith it is impossible to please God” (v.6). Why does faith matter so much to God? Because our faith brings Him glory. When we take Him at His word, He shows Himself faithful and accomplishes His will through us. The Scriptures testify again and again that walking by faith is part of the normal Christian life. It isn’t just for elite Christians, but for all Christians, including you and me.   \nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day22.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 10:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis verse is a reminder of the once-and-for-all nature of Jesus’s death and resurrection. \nFor by one offering he has perfected forever those who are sanctified.\n-Hebrews 10:14\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/4-Hebrews-3.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "John 10:10",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“A thief comes only to steal and kill and destroy. I have come so that they may have life and have it in abundance.”\n-John 10:10\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day20.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 10:19-39, Deuteronomy 32:35-36, Matthew 27:50-54",
        "devo_title": "Warning Against Deliberate Sin",
        "devo_summary": "\n                    \n                    When I was a freshman in high school, I got to attend my first college football game. It was a surreal experience for me to see our local college team. I was a big fan. Let’s face it; I’m still a big fan! But what made this day unforgettable was that we had all-access tickets. My friend’s uncle, who worked for the visiting school’s football program, had asked him to come and be a ball boy on the sidelines. I didn’t get to carry equipment and meet players like my friend did (I’m still a little jealous), but we did get free tickets and the chance to see the locker room before the game.\nI can remember approaching the security guard outside the locker room door. My friend’s uncle simply said, “They’re with me,” and just like that, we were in.\nDo you know what’s more incredible than an all-access ticket to a football game? Hebrews tells us that we can boldly enter into the very presence of God. In today’s passage, we read:\n“Let us draw near with a true heart in full assurance of faith, with our hearts sprinkled clean from an evil conscience and our bodies washed in pure water. Let us hold on to the confession of our hope without wavering, since he who promised is faithful” (Hebrews 10:22–23).\nIf we’re with Jesus, we can confidently draw near to God in worship, prayer, and communion. His new covenant sacrifice has washed us clean. So, we can walk right in. \nCan you imagine if my friend and I had tried to get into that locker room without his uncle? The security guard would’ve turned us right around. The same is true for those who approach God apart from Christ. Hebrews tells us that Jesus’s sacrifice is the only way we can be saved. If we reject Christ and go on deliberately and defiantly sinning, even after learning the truth of the gospel, we’ll find ourselves out of options (v.26). Judgment is coming for all. And if we’re not with Jesus, entering into God’s presence at the judgment will be a fearful thing. The author of Hebrews states it plainly: \n“It’s a terrifying thing to fall into the hands of the living God” (v.31). \n\nBeing with the Savior or without Him makes all the difference. This is so important to remember—especially when difficulty comes and our faith is tested. The church to which the author of Hebrews wrote had experienced conflict, suffering, public insults, imprisonment, and the confiscation of their property (vv.32–34). They endured all this hardship because they knew that with Christ there are better and more lasting rewards. \nFriends, don’t throw away your confidence in Christ. Don’t throw away your credentials! Stay with Jesus, and one day you’ll be richly rewarded (v.35). Then, it will be said of you: “But we are not those who draw back and are destroyed, but those who have faith and are saved” (v.39).\nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day19.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 10:1-18, Psalm 40:1-17, 1 Peter 2:24",
        "devo_title": "The Perfect Sacrifice",
        "devo_summary": "\n                    \n                    When work is done, we sit down. After a long day at the office, after tough yard work, there is nothing that says we’re finished like sitting down and resting. In fact, if you are like me, you might even get a little irritated when you need to get up again because there is something else to do. It seems like the work never ends, doesn’t it? I’ve often reflected on this reality when reading Hebrews 10:12, “But this man, after offering one sacrifice for sins forever, sat down at the right hand of God.”\nIn ancient Israel, the work of offering animal sacrifices seemed to have no end. The perpetual sacrifices offered by the priest for the forgiveness of the people’s sins were a continual reminder that more needed to be done. Since the people could not rid themselves of their sinfulness, the need for atoning sacrifices was always before them. There was no finality. There was no rest. There was no end in sight. For this reason, the writer of Hebrews reminds us that Jesus is the true and greater sacrifice for sin. In contrast to the priests who made daily sacrifices, “by one offering he has perfected forever those who are sanctified” (v.14). \nAfter Jesus’s resurrection and ascension, He entered the presence of God and sat down, having completed His work. No more sacrifices are needed. There is nothing else to do for the forgiveness of sin. Jesus sits at the right hand of God reminding us that we are not saved by what we do, but by what He has done. Jesus is the Lamb slain for us. He has made peace between God and us. He has taken our guilt upon Himself. He has conquered sin and death. Jesus didn’t just die for us; He died instead of us—in our place.\nIf you are a Christian, remember that the shout from the cross, “It is finished” (John 19:30), wasn’t a cry of defeat but a declaration of victory. It is a victory cry because Jesus is seated on the throne, not buried in a tomb. Praise God that in Christ we have a perfect sacrifice for sin, and He is more than sufficient to save. And thus, the salvation offered by Christ is perfect in every way and eternal in its effect. But also remember that while He is seated now, there is coming a day when He will rise from His throne. Jesus will return to judge the living and the dead (2 Timothy 4:1). And on that day, every tongue will confess that He is Lord, either in thankfulness or in terror.\nUntil He rises to return, the question for all of us is this: Are we resting in the perfect work of Jesus Christ? The alternatives—running from God in rebellion, or working to earn God’s favor by our good behavior and religious activities—are exhausting, futile pursuits. The work is finished. Christ has done it. We can rest. \nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day18.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": " Hebrews 9:16-28, John 10:10, 2 Timothy 1:8-10",
        "devo_title": "What Forgiveness Requires",
        "devo_summary": "\n                    \n                    In a letter written to Jean-Baptiste Le Roy in 1789, Benjamin Franklin made the now famous statement: \n“Our new Constitution is now established, and has an appearance that promises permanency; but in this world nothing can be said to be certain, except death and taxes.” \nDeath is the inevitable end for each of us. For many, the thought of death is terrifying because our consciences bear witness to the truth that after we die there awaits a day of judgment in which we will be held accountable for all we have ever done. The Christian need not fear death, though. The Scriptures bear witness to the certainty of death and judgment in order to hold out hope for the forgiveness of sins through the death of the God-Man, Jesus Christ, and His subsequent return on the last day, when the dead in Christ are raised to new life in Him.\nThe writer of Hebrews emphasizes the greatness of the sacrifice of Jesus on the cross. When contrasting it with the weakness of the old covenant’s sacrificial system, the writer highlights the need for the continual sacrificing of calves and goats. The repetition of these sacrifices indicated that sin remained. If these sacrifices had been able to permanently take away sin, they would have ceased. By contrast, “[Jesus] has appeared one time, at the end of the ages, for the removal of sin by the sacrifice of himself” (Hebrews 9:26). He cannot and will never need to be re-sacrificed. There is permanence to the one sacrifice of Christ on the cross for the sins of His people.\nIn order to drive home the point of the one-time, definitive nature of Jesus’s sacrificial death on the cross, the writer explains the mechanics of death and redemption. He sums up the history of redemption in the following way: “And just as it is appointed for people to die once—and after this, judgment—so also Christ, having been offered once to bear the sins of many, will appear a second time, not to bear sin, but to bring salvation to those who are waiting for him” (Hebrews 9:27–28). The one-time, definitive sacrifice of Jesus secures resurrection glory for His people when Jesus returns.\nThis precious truth has huge implications for our souls today. When we look to the crucified Son of God, we are assured that He has fully paid for our sins. They all have been nailed to the cross—nothing more is required. His one-time sacrifice for sin means we need not fear death and judgment. For the believer, there is nothing more sure than the finished work of Christ on the cross, and His coming again in glory for our salvation. This gives us great encouragement and strength to persevere with hope.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day17.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 9:1-15, Leviticus 16:6-19, 2 Corinthians 1:10",
        "devo_title": "New Covenant Ministry",
        "devo_summary": "\n                    \n                    Bill loved baseball. It was one of the few things I shared in common with the man who was fifty years my elder. Because of our age gap, Bill could tell me stories about growing up in Detroit and going to the old Tiger Stadium at the corner of Michigan and Trumbull avenues. His eyes would light up when he told me about the character of the stadium and the historic events he’d witnessed there. He would say that, in some ways, Tiger Stadium was a sacred place to him. When we would talk about the modern-era Tigers and the new Comerica Park, Bill’s eyes didn’t light up in that same way. For Bill, there was something special about the old park that retained its grandeur even after its glory had long passed.\nThe first recipients of the sermonic letter we call Hebrews seemed to have a similarly nostalgic perspective on the ministry of the priests at the temple. To them, the temple was the prescribed place of worship, and the priests were responsible servants to help them clear their consciences. But the writer of Hebrews contends that the old temple, and the old practices of the temple, were just a “symbol” (Hebrews 9:9) that pointed to the more glorious and better ministry of Christ.\nWhile the priests of the old order had to offer sacrifices on an annual basis to cleanse the consciences of sinful people, Jesus’s ministry as a priest is far greater. Instead of having to offer a sacrifice once a year before God, Christ has entered the presence of God by His own cross to obtain eternal redemption, purification, and life, so that we can serve God faithfully (vv.12–14). He stands as the one who, by His sacrificial death, perfectly represents us before God so that we receive all the blessings of God in Him. \nAnd yet, there still can be times when we’re tempted to go back to some of the things we did before we came to know Christ. We look at the supposed freedom we had before following Christ and long for easier days. Like the first readers of Hebrews, we can be deceived into thinking that the hardships that come with following Christ validate our stepping back into our former way of life. There are all kinds of pulls for our hearts to believe that the old way, the old place, the old worship was better than what we have now.\nBrothers, let it sink into your heart that “the good things that have come” (v.11)—the good life—is only found in Christ. So let’s fix our eyes on Him and not turn back.  \nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day16.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 8:7-13, Jeremiah 31:31-34, Luke 22:14-20",
        "devo_title": "A Superior Covenant",
        "devo_summary": "\n                    \n                    “Forgive, but don’t forget.” — Unknown\nThere is a certain earthly logic in being willing to extend forgiveness but not forgetfulness for significant wrongs and wounds we’ve suffered. Much of our international politics in the twenty-first century is predicated on this kind of thinking. Heads of state put aside differences and extend either explicit or implicit forgiveness to their global allies, enemies, and neighbors. Yet, they don’t completely forget their ideological differences and past conflicts. \nOn an interpersonal level, wrongs and wounds are also complicated to resolve. All of us have been in situations, probably even this week, where we’ve been hurt by others or we’ve hurt others. While these times are not representative of us at our best, they are regular occurrences in our post-Genesis 3 world and impact how we relate to one another.\nThe writer of Hebrews continues to explain how Jesus is our Great High Priest, far exceeding all who came before Him. He is a better mediator of a superior covenant between God and humanity. In stark contrast to the uneasy covenants, shaky treaties, and tentative agreements that govern our world and relationships, the covenant God establishes with us through Jesus is solely dependent upon the power and goodness of one party, and that party is not us but God. Though we frequently, consistently, and brazenly sin against God, He frequently, consistently, and tenderly forgives us on account of Christ’s atoning sacrifice for our sins. \nGod also “forgets” our sins in the sense of choosing not to remember them. There’s no lingering grudge, ongoing distrust, or probationary period with God. He does not drag up the past. The slate has been wiped clean—completely clean. David captured this amazing reality in vivid, memorable language in Psalm 103: “As far as the east is from the west, so far has he removed our transgressions from us” (v.12). Our sins have been removed an infinite distance from us so that God could move intimately close to us. \nWe tend to have short memories when it comes to remembering God’s mercy and forgiveness. But if we’ve come to know God through Jesus, then God is actually the one with the short memory. For He promises, “I will remember their sins no more” (Hebrews 8:12). He chooses not to look at us and see our sin. Thanks be to God for His unending mercy and grace. \nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-Hebrews-instagram-Day15.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 4:15",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse summarizes Jesus’s role as our High Priest. \nFor we do not have a high priest who is unable to sympathize with our weaknesses, but one who has been tempted in every way as we are, yet without sin.\n-Hebrews 4:15 \nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/4-Hebrews-2.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "1 John 2:1",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nMy little children, I am writing you these things so that you may not sin. But if anyone does sin, we have an advocate with the Father—Jesus Christ the righteous one.\n-1 John 2:1\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day13.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 8:1-6, Zechariah 6:12-13, John 10:14-18, Romans 11:33-36, Romans 12:1-2",
        "devo_title": "A Heavenly Priesthood",
        "devo_summary": "\n                    \n                    We’re all tempted to be on the lookout for items that are “new and improved.” We can easily become enamored with appliances promising additional conveniences, cars loaded with luxury options, houses that include energy-efficient features, or cell phones with the latest upgrades. But we know from experience that the latest and greatest updates do not always match their promotional hype. Newer is not always better.\nNevertheless, the possibility of occasional letdowns does not discourage us from taking advantage of significant leaps in technology. We know that advances in science and industry do lead to some wonderful inventions. An automobile is better than a horse and buggy, steel-toed work boots provide much more support and protection than primitive sandals, a phone is a much quicker way to contact someone than the Pony Express, and thanks to anesthetics, surgery today is much more bearable than in centuries past. So, while the claims for the latest “life-changing” product deserve a certain level of scrutiny, there are many instances where the claims have some truth to them. \nThroughout Scripture, God institutes priests to make atonement for His people. Like us, they couldn’t shake their sin no matter how hard they tried. A priest represented the people for the Lord in helping remove the weight of sin through the sacrificial system God commanded. As the Israelites wandered in the wilderness in the book of Numbers, Aaron was first appointed to carry this mantle of the priesthood. In places like Zechariah 6, we see the Israelites longing for the day when their final priest would come. God promised a newer and better covenant fulfilled by a new and better priest.\nIn Jesus, that promise of a new and better priest has come true. The priests of God throughout biblical history had a role to play, but were ultimately pointing forward to Jesus, who is both the final priest and the final sacrifice of the new covenant between God and man. As Hebrews 8:6 says, “Jesus has now obtained a superior ministry, and to that degree he is the mediator of a better covenant, which has been established on better promises.”\nIn the case of Jesus, newer really is better. He has a superior ministry based on a better covenant and better promises. We don’t need to look around for a better sacrifice. We don’t need to search for a better salvation. We only need to look at Jesus, our risen Priest and King.\nWritten by Brandon Smith \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day12.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 7:11-28, Genesis 14:18-20, 1 John 2:1",
        "devo_title": "A Superior Priesthood",
        "devo_summary": "\n                    \n                    I heard the scariest words I had ever heard in a seventh- and eighth-grade Sunday school class. That Sunday morning’s topic escapes me. All I remember are three sentences uttered by the teacher. “Boys, one day you will die. If the good you have done outweighs the bad, you will get to go to heaven. If your bad outweighs the good, you will go to hell.”\nWords could not describe the sense of panic that set in as I attempted to do the math on how far behind I was. I figured I had done way more bad than good during the time I had lived, so it would take at least ten to twelve years of almost perfect living to catch up. Then I remembered how much I liked the bad things I did, so I wasn’t sure how I could turn things around. Plus, we learned in church that sin starts in the heart, so the bad things we think are sinful as well. I came to the inevitable conclusion that my situation was hopeless. Sadly, in my ponderings about my own sinfulness, lack of goodness, and eternal life, Jesus never crossed my mind.\nToday’s Scripture passages offer good news that destroys both our excessive guilt and our futile attempts at self-justification. In chapter 7, the writer of Hebrews argues for the superiority of Jesus’s priesthood (vv.11–28). It’s a different line of argument from the one he uses at other places in the book.\nThe author of Hebrews draws from Genesis 14 and Psalm 110 to show that Jesus is a great high priest after the order of Melchizedek. The priests under the Levitical priesthood could not continue in their service perpetually because death prevented them from doing so. However, since Christ lives forever, He fulfills the promise made through David in Psalm 110 that He would have an everlasting priesthood. In this way, “Jesus has also become the guarantee of a better covenant” (Hebrews 7:22).\nIn other passages in Hebrews, the author shows that Jesus is a merciful and faithful high priest because He took on our humanity and can sympathize with our weaknesses. In chapter 7, he instead emphasizes Jesus’s perfect life as the qualification for His eternal priesthood. He stresses that Christ has no sins of His own to atone for, but rather He is “holy, innocent, separated from sinners, and exalted above the heavens” (v.26). Christ’s priesthood offers us hope because He lived a sinless life on our behalf and now sits at the right hand of God in His glorious perfection.\nJohn shows us in 1 John 2:1 why we should trust Christ, our Great High Priest. He says he was writing so they might not sin. He follows this with what I believe to be the most humorous conditional clause in all of Scripture: “But if anyone does sin… ” Not just “anyone” is going to sin. We all have sinned in serious and tragic ways. Yet John points us to our advocate before the Father, “Jesus Christ the righteous one,” emphasizing Christ’s perfect righteousness deliberately because His perfect righteousness is our only hope before a holy God.\nWe experience real guilt when we sin, and rightly so. We feel a separation from the Father and are tempted to shrink back from coming into His presence because of the weight of our sin. When that happens, we must look to Jesus, the perfect high priest and our righteous advocate. He gives us His righteousness so that we can stand before the Father knowing the same blessing and approval Jesus does.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day11.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 6:13-20, Hebrews 7:1-10, Genesis 22:15-18, Romans 8:28-30",
        "devo_title": "Inheriting the Promise",
        "devo_summary": "\n                    \n                    Back when I was starting to read deeply, I picked up a Hebrews commentary and read it straight through. That was my first time doing such a thing. Commentaries are not meant to be read like that. But such was my hunger in the face of my ignorance. I don’t remember much from that book, but I do remember one particular section that affected me.\nIn Hebrews chapter 6, the author connects the promise made to Abraham to the promise made to us in Christ. When I read that, and the notes on that passage, I was undone. It was like that moment when you have all the puzzle pieces in front of you, and they finally begin to make sense. When God made the promise to Abraham, He swore by the highest thing there was—Himself. He was the guarantee of His faithfulness to the promise made to Abraham. \nI can remember understanding for the first time that Christ gave His life for us because we weren’t faithful and had broken God’s covenant. Christ, who is God, not only kept covenant, but also died as a fully human representative for those who could not keep covenant. When I, as a young college student, saw that God in Christ was the guarantee of His love for us, my mind was blown. It changed everything.\nFast-forward twenty-plus years. What had blown my mind as a young man was beginning to penetrate my weary heart. Four in the morning was becoming a time I was well-acquainted with. And the fears and worries that reared their ugly heads the minute I awoke were also becoming unwelcome companions. In these times, my temptation is to make promises to God. If I’m fearful about one of my children, I make a promise to do better as a parent. If I’m worried about work, I try to bargain with God to secure His help with my job. I forget the promise that God has already made and kept, and this forgetfulness leads to a lack of hope. \nI’m someone who has every reason to hope but often forgets where hope lies. I keep living as if my hope is in what I do. My own works, and promises of more and better works, are far too often my hope and refuge at 4 a.m., and trust me, they bring no comfort. But when I can finally get a sane thought, I remember what I learned as a young man: “We have this hope as an anchor for the soul, firm and secure“ (Hebrews 6:19).\nSleep doesn’t always come. But there is always rest when I place my hope in Him.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day10.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 5:11-14, Hebrews 6:1-12, Philippians 3:12-16, 1 Peter 2:1-3",
        "devo_title": "Warning Against Falling Away",
        "devo_summary": "\n                    \n                    I’ve been in two car accidents—both in parking lots. My depth perception, the blind spots, and the lack of beeping sensors on my truck are a recipe for me to back into cars and poles in a parking lot. My wife’s car has the warning lights. I love them. I miss them when I get in my truck. Her car warns you if someone is in your blind spot. It warns you if you are too close to a wall or another car in front. A backup camera and flashing lights alert you to what’s going on behind you. Warnings are gifts, and Hebrews 6 is a flashing light.\nThe writer of Hebrews is alerting this group of Jewish Christians to watch out for the temptation to go back to Judaism, thinking that Jesus isn’t really the Messiah. They are getting hung up on some of the basic teachings and hurdles they’ve already jumped. They don’t need to repent from the dead works of Judaism—they’ve already done that if they are in Christ (v.1). They don’t need another lesson on the place of cleansing rituals—they are already clean and righteous in Christ (v.2). But the lights are still flashing.\nApparently, some in their group had already turned away from Christ and gone back to Judaism. Even though they knew something of the freedom and joy that is offered in Christ, they ultimately rejected it. They didn’t really believe in Christ and the value of His crucifixion. Verse 6 puts it in stark terms: “To their own harm, they are recrucifying the Son of God and holding him up to contempt.” In their rejection of Christ, they were saying His crucifixion was deserved because He wasn’t really the sinless Son of God.\nNo genuine believer can imagine himself saying and believing such things. True Christians know Jesus didn’t deserve to be crucified—we did. He was crucified for our sins. He should not be mocked and held in contempt. God has highly exalted Him and given Him a name that is above every name (Philippians 2:9). He deserves worship and loyalty, not dishonor and rejection. \nDo you see what the writer of Hebrews is doing? He is warning the church that not everyone who appears to be a believer really is. Just because some people attend church for a time, or have some understanding of the gospel, doesn’t mean they have truly trusted in Christ for salvation. It’s the same in our churches today. \nSeeing some of their number depart from Christ was no doubt discouraging to these suffering believers, so he reminds them that “God is not unjust; he will not forget your work and the love you demonstrated for his name by serving the saints—and by continuing to serve them” (Hebrews 6:10). God saw their faithfulness and perseverance, and He sees yours too. Whatever you are facing today—temptations, doubts, fears—let the reality of the risen Christ strengthen you. You will remain faithful to the end because Christ has already been faithful, and He promises to never leave you or forsake you.\nWritten by Jeff Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day9.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 4:14-16, Hebrews 5:1-10, Psalm 110:1-7, Matthew 4:1-11",
        "devo_title": "Our Great High Priest",
        "devo_summary": "\n                    \n                    Several years ago, I attended a weekend conference on prayer led by an author who had recently written a book on the subject. I learned all sorts of helpful tips that weekend, but my biggest takeaway could be summed up as: Get in the game. Don’t just talk about prayer or think about prayer or wait until you have just the right system or motivation to pray, but actually begin praying in any and every situation you can. Don’t hold back. Pray often, pray honestly, pray imperfectly (which you will), but pray. Get in the game.\nChildren can lead the way here. Think about it: they ask for what they want, unconcerned with their motives or having just the right words or whether or not it’s a good time to be asking. They make their requests known, fully expecting their parents to be able to give them what they need or want. It’s no wonder Jesus said, “Don’t try to keep them from coming to me, because the kingdom of heaven belongs to such as these” (Matthew 19:14). Jesus is not turned off by need and desire, but moves toward it.\nHebrews 4:14 describes Jesus as our “great high priest.” In the Old Testament, a priest served as a mediator between God and the people of God. This priest was human, of course, and so was weak and sinful, just like us. He knew what it felt like to desperately need God’s mercy and grace. As a fellow sinner, the offerings he made to God on behalf of the people were also made to cover his own sins. While he was called by God to represent the people, he was not above the people.\nJesus was also called by God to serve as our high priest. “He did not exalt himself” to that role (Hebrews 5:5). Because He lived a sinless life, His sacrifice was a sufficient and permanent offering to God. And yet His sinlessness does not mean He is unable to sympathize with us. He was “tempted in every way as we are” (Hebrews 4:15). And “during his earthly life, he offered prayers and appeals with loud cries and tears” (Hebrews 5:7). Jesus knows what it feels like to be human. He is our Great High Priest, but He has been in low places. He is not an unapproachable Savior.\nAnd so Hebrews 4:16 offers this exhortation and invitation: “Let us approach the throne of grace with boldness, so that we may receive mercy and find grace to help us in time of need.” In light of who Jesus is (great, and sympathetic to our needs) and in light of what He has done (provided a permanent sacrifice for sin) we can and must approach God with unashamed boldness, fully expecting Him to give us the mercy and grace we need. He delights to do so, for He is a merciful and gracious God. \nWritten by Matt Erickson\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day8.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 1:3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse about the relationship between God the Father and Jesus the Son. \nThe Son is the radiance of God’s glory and the exact expression of his nature, sustaining all things by his powerful word.\n-Hebrews 1:3\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/4-Hebrews-1.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "2 Corinthians 4:5–6",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor we are not proclaiming ourselves but Jesus Christ as Lord, and ourselves as your servants for Jesus’s sake. For God who said, “Let light shine out of darkness,” has shone in our hearts to give the light of the knowledge of God’s glory in the face of Jesus Christ.\n-2 Corinthians 4:5–6 \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day6.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 4:1-13, Psalm 95:7-11, 1 Peter 1:3-5",
        "devo_title": "The Promised Rest",
        "devo_summary": "\n                    \n                    This summer I endured one of the most stressful weeks of my life. We led a fun but exhausting youth retreat, I traveled for work, a close family friend passed away, one of our cars got a flat tire at a bad time, the other car was damaged in a hit-and-run the night before we were supposed to take it home for the funeral (and there weren’t any rentals available in town)—and the list goes on.\nIt was a rough week. But when we went home for the funeral, we had a couple of days of much-needed rest, and it felt like we had finally reached a quiet oasis in a desert of noise and stress.\nAs great as that felt, Hebrews 4 reminds us that in Christ we have a much greater rest than can be found in a quiet weekend away from the busyness of daily life. Scholars debate about what the author of Hebrews means by the “rest” found in Christ. Does it mean our rest in eternity? Does it mean rest from working for our salvation? Theologically, both are true, but the emphasis here seems to be on enjoying our future rest today. \nWe can find refuge and rest in the finished work of Christ today because we are not responsible for securing the salvation rest we will receive in eternity. Hebrews 4:10 says, “For the person who has entered his rest has rested from his own works, just as God did from his.” The only way we can enjoy the rest God wants to give us is to rest from our own works.  \nThe good news of the gospel is that all the work necessary for our salvation was completed by Jesus through His life, death, and resurrection. While we are called to lives of obedience to God’s Word, we are not called to live a life of anxious striving, desperately trying to obey God’s law in order to earn His love. Christ has done for us what we couldn’t do for ourselves. He has fulfilled the law perfectly on our behalf. We can rest in that. We must rest in that or have no rest at all.   \nThe grace of God is hard for us to understand. The idea that a reward as great as eternity in the presence of God would be granted to us with no consideration for whether or not we earned it is just plain hard for us to wrap our heads around. It seems too good to be true, which is precisely the point—God’s grace is meant to amaze us. We need faith to believe the gospel.  \nSometime soon, whether a Saturday morning, a night during the week, or perhaps on a day off, take some time to rest. And don’t just rest physically. Don’t just take a nap or leisurely work in your garden. Take some time to rest in the promise that your eternity is secure because of the finished work of Christ, not because of how obedient you’ve been. Repent of any and all self-salvation projects, believe the gospel afresh, and enjoy God’s rest in Christ. He’s earned it.  \nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day5.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 3:7-19, John 3:16-21, Romans 11:1-6",
        "devo_title": "Warning Against Unbelief",
        "devo_summary": "\n                    \n                    It wasn’t a good mail day. I’d gotten a letter from the IRS saying that I owed money—a lot of money. And to make matters worse, the letter came with a warning: if I didn’t pay up within a couple of weeks, I’d get a stiff penalty. Honestly, the letter left me confused. I’d used a reputable accountant. I’d filed my return weeks before. What could have caused me to owe so much? I double-checked my records, and the mistake was obvious; I had filed the return, but I’d forgotten to mail the check. \nI can laugh about it now, but that letter produced a lot of anxiety at the time. I don’t look forward to warning letters. If I’m honest, I don’t really like warnings. They’re not always positive and encouraging, but they’re necessary. I’d rather be warned than incur a steep penalty. \nThe author of Hebrews invites us to hear a needed warning today. He reminds us how the human heart is bent toward evil. Like the Israelites who longed to go back to Egypt (Exodus 16:3,17:3), our sinful hearts can delude us into thinking we’re more secure apart from God than we are walking with Him. We’ve got to watch out and guard ourselves against an “evil, unbelieving heart that turns away from the living God” (Hebrews 3:12). \nThis passage in Hebrews 3 also tells us that we need our friends, wives, and church leaders to step in daily to tell us when we’re headed in the wrong direction. We are human, which means we’re also sinners. We forget to mail checks on time; we lose our keys; and we sometimes lose our cool. Maybe it’s easy to speak up when it’s something small. But when I see a brother who’s slandering his pastor or putting down his wife behind her back, am I tempted to think, Well, that’s his business, and just walk away?\nHebrews doesn’t let me off the hook so easily. It instructs us to encourage one another daily, so we’re not hardened by sin’s deception (v.13). And as we caution one another, we also inspire confidence, believing that all who keep holding on to the reality Christ gives us at the start will share in His eternal rest at the end (v.14).\nThe time for giving and receiving these warnings and encouragements is now. We must speak up and warn one another before it’s too late. If you see me headed in the wrong direction on a one-way street, please honk your horn! I need a course correction because I’m headed for destruction. The direction of our souls requires this same level of urgency. As Paul writes elsewhere, “Now is the acceptable time; now is the day of salvation!” (2 Corinthians 6:2). \nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day4.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 2:10-18, Hebrews 3:1-6, Genesis 12:1-3, Acts 10:34-43",
        "devo_title": "Greater than Moses",
        "devo_summary": "\n                    \n                    A quote often attributed to Ralph Waldo Emerson says, “Do not go where the path may lead; go instead where there is no path and leave a trail.” In many ways, this captures the essence of pioneering leadership. Those who have led through the unlikely and even seemingly impossible often stand out as examples of greatness among their peers.\nWhen you think of great leaders, who comes to mind? Most of us would think of a political leader or a CEO or a famous coach. There are plenty of good options to choose from. For an ancient Israelite, though, it would have been difficult to think of anyone greater than Moses. If you read through Exodus, you’ll understand why.\nGod used Moses to miraculously deliver Israel from Egyptian slavery, even though Moses initially showed reluctance based on his feelings of inadequacy to perform such a task. Moses wasn’t the greatest speaker. What were the odds that he, an Israelite, would be able to persuade Pharaoh, the god-king of Egypt to bend to his request? It seemed like an unlikely mission at best, and would certainly require divine intervention to succeed.\nGod did intervene. While Moses was the chosen human instrument through which God would act to bring His people out of slavery, ultimately it was God’s power that secured freedom for the Israelites. God demonstrates throughout the Bible that He is a great rescuer and redeemer. Redemption as a release from the slavery of sin is one of the most often used metaphors for salvation in Scripture. \nAs the book of Hebrews reminds us, all the key events in Scripture, like the exodus, and even the great leaders of God’s people, like Moses, point to someone much greater. In Hebrews, we are reminded that Jesus is much greater than Moses, and He led His people out of a slavery far worse than that which was imposed by Egypt; we had been held captive under the slavery of sin and death until Christ set us free.\nFor this reason, Jesus is the pioneer of our salvation, our redemptive forerunner and representative. He leads us out of slavery to sin and death toward a greater promised land, the presence of God. Jesus forged a new path; in fact, He is the new path. He says, “I am the way, the truth, and the life” (John 14:6), and calls us to trust Him and follow Him. \nThroughout the Bible, we are reminded again and again that God delivers His people. The book of Hebrews shows us that Jesus provides the ultimate deliverance the Scriptures have been pointing to all along. And so, we can say with the prophets and the writer of Hebrews, “Again, I will trust him” (2:13), knowing that “every one of God’s promises is ‘Yes’ in him” (2 Corinthians 1:20).\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day3.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 2:1-9, Psalm 8:1-9, 1 Corinthians 15:50-57",
        "devo_title": "Jesus and Humanity",
        "devo_summary": "\n                    \n                    Like anyone who loves happiness, I dread the thought of sitting in the nosebleed section of a stadium during a game. After all, who in his right mind would want to sit as far away from the field as possible? I do, however, have an appreciation for the aerial shots of a televised football game. Such shots tend to put the biggest and strongest athletes in perspective—they’re still relatively small. \nIn Psalm 8, David—who seems to have had a keen eye for the book of nature, which was perhaps strengthened from his days as a shepherd—contrasted mankind with the majesty of the heavenly bodies: “When I observe your heavens, the work of your fingers, the moon and the stars, which you set in place, what is a human being that you remember him, a son of man that you look after him?” (vv.3–4).There is perhaps nothing so effective at reminding us of our insignificance as looking up at the starry skies. Both their vast distance away and their glory leave us awestruck. We are so small and insignificant by comparison.\nThough we are so much smaller, so much less glorious than the night sky, the psalmist, speaking of God’s assessment of man, goes on to say, “You made him little less than God and crowned him with glory and honor. You made him ruler over the works of your hands; you put everything under his feet” (vv.5–6). It is absolutely astonishing—even after the fall—the sorts of things God allows man to accomplish. We have built cities, developed amazing technologies, and even discovered cures for some diseases. These are, in small part, a picture of what it means for man to have dominion over creation.\nNevertheless, men still die in fires, while at sea, and occasionally even by wild animal attack. Since the  fall of Adam, man has not been able to fully exercise dominion over this world for the glory of God. The writer of Hebrews, picking up on the teaching of Psalm 8, puts it this way: “As it is, we do not yet see everything subjected to him” (Hebrews 2:8). He then adds, “But we do see Jesus—made lower than the angels for a short time so that by God’s grace he might taste death for everyone—crowned with glory and honor because he suffered death” (v.9). Though the kingdom of God has come, it is not yet fully here. Sin remains in the world, and our dominion is limited until Christ returns. \nIn the meantime, we wait with hope, looking to Jesus, the One who has already conquered sin and death. We know that when He returns, we will reign with Him for all eternity. That is our sure future. Our ultimate significance is found not in what we can accomplish in this life, but in our union with Christ now and forevermore.   \nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-instagram-Day2.jpg"
    },
    {
        "book_title": " Hebrews",
        "devo_passages": "Hebrews 1:1-14, 2 Samuel 7:12-15, John 1:1-5, 2 Corinthians 4:4-6",
        "devo_title": "The Nature of the Son",
        "devo_summary": "\n                    \n                    Hebrews 10:31 says, “It is a terrifying thing to fall into the hands of the living God.” I love that verse for the same reasons I love the entire book of Hebrews. First, I love the poetry of the line. It’s a beautifully crafted statement and image—lyrical, ironic, forthright, and severe. The entire book is this way—filled with imagery, concepts, warnings, and encouragement that read like poetic meditations on glorious and fearful things.\nAlso, I love how the line frames the holiness of God and our need for redemption, another theme that runs throughout the book. This is a beautiful, powerful, sometimes terrifying book if you read it without humility, reverence, and a sense of awe before the Lord.\nBut if you read it with humble eyes and an open heart, you’ll find Hebrews fights for our hearts. It lifts our eyes up from our present struggles—and in the case of the original audience, from persecution—to consider the eternal glory and majesty of Christ and to find our hope there.\nThis letter was written to Christians with Jewish roots. They were being persecuted for their faith, and many were wondering if it was worth it to continue to claim the name of Christ. To these people facing these struggles, the author clearly says, “Long ago God spoke to the fathers by the prophets at different times and in different ways. In these last days, he has spoken to us by his Son. God has appointed him heir of all things and made the universe through him” (Hebrews 1:1–2).\nYou’ll notice as you read that the author threads this letter with dozens of references to the Old Testament. He does this to demonstrate that everything the Hebrew people’s forefathers believed in and hoped for has been fulfilled in Christ. And Christ will finish the saving work He began. Where else can they go? To what else can they cling?\nThe power and supremacy of Christ described in this letter would cause any of us to tremble in His presence. It is a terrifying thing to fall into the hands of the living God. But to adapt a phrase from the disciple Peter, where else should we fall? He alone has the words of life. May the daily Scripture readings in this study plan challenge you, inspire you, correct you where needed, and deepen your confidence in God’s ability and resolve to rid the world of all evil and make all things new. \nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/09/HRT-Hebrews-Instagram-Day1-1.jpg"
    }
]