[
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "2 Peter 1:3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 2 Peter.\nHis divine power has given us everything required for life and godliness through the knowledge of him who called us by his own glory and goodness.\n2 Peter 1:3\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/4-HRT-1-2Peter-3.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "Ephesians 2:19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n19 So then you are no longer foreigners and strangers, but fellow citizens with the saints, and members of God’s household, 20 built on the foundation of the apostles and prophets, with Christ Jesus himself as the cornerstone. 21 In him the whole building, being put together, grows into a holy temple in the Lord. 22 In him you are also being built together for God’s dwelling in the Spirit.\nEphesians 2:19–22\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day20.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "2 Peter 3:14-18, 2 Corinthians 4:1-6, Galatians 5:1-6",
        "devo_title": "To Him Be the Glory",
        "devo_summary": "\n                    \n                    It was the end of October. It was New Jersey. And we were seated outside in view of the shoreline. My wife, Laurin, and I had traveled many miles north from our oh-so-warm home in Georgia for her cousin’s wedding. We had not realized the ceremony was going to be held in the open air, and we had not dressed for the weather. It was windy, and it was freezing—almost literally. The temperature was hovering somewhere in the upper 30s. More than once during the ceremony, my bride nudged me in the ribs because my teeth were chattering audibly.\nThe scene itself was beautiful: the bride and groom holding hands under the arbor, bathed in autumn light, with the rhythm of the ocean waves lapping steadily behind their wedding vows. But I was too busy counting the seconds until we would be dismissed into the gloriously well-heated hotel ballroom for the reception. When that wonderful moment came, Laurin and I were among the first to find our way inside. As the rest of the wedding guests entered the ballroom, I watched them as they quickly shed their coats. The garments that had brought them comfort outdoors no longer had the same effect inside.\nThere is coming a day when those who have been comfortable in this broken world will no longer be so. That is why Peter, at the close of his second letter, tells us, “Therefore, dear friends, while you wait for these things, make every effort to be found without spot or blemish in his sight, at peace” (2 Peter 3:14). Peter wants us to get ready now for the world that is coming, a kingdom where righteousness reigns. It’s time to shed the sins we hide behind, those fears that threaten to consume us, and our misguided attempts to find security apart from Jesus.\nIt’s striking to me that our reading from 2 Peter today comprises the last recorded words of the apostle Peter in Scripture. Think about his journey from Galilean fisherman to close friend of Jesus to denying disciple to Spirit-filled apostle. Tradition tells us that not too long after this final letter was penned, Peter was crucified in Rome for his faith in Jesus Christ. He seems to have known his death was imminent, for earlier in the letter he wrote, “I know that I will soon lay aside my tent, as our Lord Jesus Christ has indeed made clear to me” (1:14), likely an allusion to John 21:18–19. Peter was focused on the world to come, and his final words are a plea for us to do the same. We do that when we “grow in the grace and knowledge of our Lord and Savior Jesus Christ” (2 Peter 3:18), because only that which reflects the goodness, truth, and beauty of Jesus will last.\nPeter, the disciple who once rebuked Jesus for talking about His death (Matthew 16:22), can now say with his own martyrdom in full view, “To him be the glory both now and to the day of eternity” (3:18). The kingdom is coming. Now is our time to prepare, so that through our lives, Jesus will have the glory that is rightfully His. As the day draws near, may we look toward the future with the same single-minded focus as Peter.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day19.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "2 Peter 3:1-13, Genesis 1:6-10, Genesis 7:17-24, Revelation 21:1-8",
        "devo_title": "The Day of the Lord",
        "devo_summary": "\n                    \n                    In the past few decades, there has been no shortage of speculation about Christ’s return in popular culture. From novels and movies that present elaborate scenarios to Y2K scares and sincere (but misguided) predictions about specific dates, it’s been difficult to escape teaching about the end of the world and Jesus’s second coming. Believers can read the same Scriptures but come to different conclusions about the specifics. That’s okay. Our understanding of the end of days is not a salvation issue. But here in 2 Peter, we find an interesting spin on the end-times debate.\nWhile prediction books and code-cracking movies abound in our day, Peter says that we shouldn’t be in the prediction business. Why? Because Jesus will come “like a thief in the night” (1 Thessalonians 5:2), in a time or manner we won’t expect. So until then, he says, we should be patient, knowing that God is delaying the end so that more will be saved.\nBut Jesus didn’t come live a perfect life and conquer the grave so we could sit on our hands. He made us new creations here and now, to be ministers of reconciliation here and now, and to be His mouthpiece here and now (2 Corinthians 5:17–21). He sends us out to mirror what the end of Revelation promises—that God is making all things new. Our lives should shout eternity to the world around us.\nThe disciples in Acts 2 weren’t merely preaching and living out good morals; rather, they were painting a picture with their lives of the new world God is creating. They were pointing to something bigger. The disciples shared all their belongings because, in eternity, everything broken will become unbroken. There will be no more evil or selfishness or famine. People will live together in one accord under the reign of a perfect King. And so now, “we wait for new heavens and a new earth, where righteousness dwells” (2 Peter 3:13).\nThis is still our call today. We are still ministers of reconciliation. God still uses His people to show the world what redemption looks like. We give because, one day, no one will be in need. We tell the truth because, one day, there will be no more lies. We gather together to worship God and to press one another toward Him because, one day, worship will be the air we breathe. We share the good news because, one day, there will be no more bad news.\nWritten by Brandon Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day18.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "2 Peter 2:1-22, John 10:27-29, Ephesians 2:19-22",
        "devo_title": "The Judgment of False Teachers",
        "devo_summary": "\n                    \n                    I’ll never forget watching a television preacher spend an entire sermon defending gluttony and greed. His sermon was simple: gluttony and greed were sins that were included in the Old Testament Law. They were a way to keep people in check. But now, because of Christ’s life and death, Christians were perfectly free to store up their bellies and bank accounts without concern. After all, “nothing is impossible with God!”\nIn our passage today, we see a stark warning against false teachers. They come in all theological shapes and sizes, from denying Jesus’s resurrection to claiming that God is essentially an ATM with endless cash for those who pray long and hard enough. This passage seems to indicate another kind of false teaching—some version of denying Jesus’s second coming (see 2 Peter 3) and indulging in sinful behavior.\nIn the Gospels, Jesus calls the Pharisees hypocrites and sons of the devil. It wasn’t because they taught the law or expected people to follow certain rules; rather, He scolded them for being a type of false teachers who skewed God’s law in a way that made it antithetical to the gospel. In fact, Jesus compliments some Pharisees for asking the right questions and trying to better understand the law—a law Jesus came to fulfill, not abolish. Here, Peter is chastising counter-Pharisees who seem to think there are no rules that apply to them anymore.\nBut there is hope for those who follow Jesus. “The Lord knows how to rescue the godly from trials” (2 Peter 2:9). Those who keep His Word, who hear His voice (John 10:27) will be rescued from suffering and judgment. Why? Because believing in Christ requires certain beliefs and actions. Those who teach against the gospel show that their beliefs and actions are in opposition to Christ. But those who believe in Him also believe and act rightly.\nBoth extremes—rigid rule-following and unhinged rule-breaking—are simply opposed to the gospel. Praise God that through the gospel we’ve been freed from our sin and the curses that come with it. But let us also praise God that He’s shown us a way of living that honors Him and reflects His image to the world around us.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day17.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "2 Peter 1:16-21, Matthew 17:1-8, 2 Timothy 3:10-17",
        "devo_title": "The Trustworthy Prophetic Word",
        "devo_summary": "\n                    \n                    One of the distinguishing marks of classical music is the lack of amplification devices. There are no microphones, so the volume comes from the power of the instruments and voices, as well as the acoustics in the concert hall. And that volume, without any help from electricity, is powerful.\nA few days ago, my wife and I went to see Handel’s Messiah performed by our city’s symphony orchestra and a rather large choir. The experience was magical. During the two hours we sat listening to the concert, I kept thinking how remarkable it was to hear the gospel declared so clearly in that packed concert hall. It was wonderful to hear Scripture sung clearly and loudly in English. Hearing all those prophecies from Isaiah set to some of the most beautiful music ever made was worth the price of admission.\nAs I sit here and write this, our Christmas tree is sparkling. Presents are strewn around the tree. There are lights and greenery on the mantle. Nutcrackers stand like sentinels on a bookcase. We are just a few days away from the celebration of a tiny baby being born in a tiny town, where “the hopes and fears of all years are met.” Where did all that hope come from? We find the answer in those same verses Handel used in his magnum opus.\nIn 2 Peter 1:16–21, Peter wants his readers to know they can trust the prophecies about the Messiah in the Old Testament are fulfilled in Jesus. He wants them to know they can count on the prophetic word. Christ’s coming is not some cleverly devised myth. The stories are true. The prophecies are fulfilled. Yes, there have been false prophets, just like there are false teachers now. But that does not change the fact that Jesus has come and is the promised Messiah.\nThis is no fiction. Old Testament Scriptures are reliable and point to “the coming of our Lord Jesus Christ” (v.16). We need to be reminded of this too. Because these were given by the Holy Spirit and we would “do well to pay attention [to them] as to a lamp shining in a dark place, until the day dawns and the morning star rises in [our] hearts” (v.19).\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day16.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "2 Peter 1:1-15, John 21:17-19, Titus 3:4-7",
        "devo_title": "Growth in the Faith",
        "devo_summary": "\n                    \n                    The other day I was driving down a street I have traveled thousands of times in the almost-decade we have lived in our present home. And for the first time I saw a house I’d never noticed before. No, it was never hidden by trees; it’s always been right there, in plain view. I just never got a good look at it. It’s a very attractive house that I’ve missed time and time again. My first thought was how there are so many beautiful things I must miss every single day.\nI miss them in the Scriptures too.\nWhen considering what Peter means when he says, “May grace and peace be multiplied to you through the knowledge of God and of Jesus our Lord” (2 Peter 1:2), I looked at other places where the words “grace” and “peace” are coupled together, and I was surprised at the result. Almost every letter in the New Testament starts with the author expressing a desire for the reader to have grace and peace.\nEven though I have taught on nearly all of these books at one time or another, I never noticed how pervasive this greeting is. What do these writers want for the readers of their letters? What does it mean to have “grace and peace multiplied”?\nPeter’s wish does have a qualification. He wants grace and peace to be born of their “knowledge of God and of Jesus our Lord.” In other words, Peter want grace and peace to be “multiplied” to the reader because of what they themselves know about God and their Lord, Jesus.\nThere are times when life gets hard. Money gets tight. Parenting well seems impossible. Friendships and air conditioners fail. The storms come, and we imagine God is being harsh and working against us. We start wondering what we did to deserve difficult, heartbreaking circumstances. We run through our memory’s rolodex trying to figure out what sin we committed that warrants such treatment from God.\nAll that sounds foolish unless you are in the middle of the suffering—you know, like Peter’s original readers. And the same is true of us. While in the midst of suffering, it’s hard to imagine the grace and peace of God are ours. But that is when we most need to have grace and peace multiplied to us. That is when we need to remember the gospel. When we are tempted to think God is against us, we need to remember Peter’s expressed desire in the opening of his second letter. Because of the work of Jesus on the cross, we have peace—not just feelings of peace, but real peace—with God. We are never at odds. His disposition toward us is always one of grace and peace.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day15.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 1:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the second half of the key verse for 1 Peter.\nBlessed be the God and Father of our Lord Jesus Christ. Because of his great mercy he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead and into an inheritance that is imperishable, undefiled, and unfading, kept in heaven for you.\n1 Peter 1:3–4\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/4-HRT-1-2Peter-2.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "Galatians 3:27",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor those of you who were baptized into Christ have been clothed with Christ. There is no Jew or Greek, slave or free, male and female; since you are all one in Christ Jesus. And if you belong to Christ, then you are Abraham’s seed, heirs according to the promise.\nGalatians 3:27–29\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day13.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 5:8-14, 2 Corinthians 4:7-18, Ephesians 6:12-20",
        "devo_title": "Firm in the Faith",
        "devo_summary": "\n                    \n                    When I read this passage from 1 Peter 5 and see the word “sober-minded,” I tend to place all the emphasis on “sober.” And that word makes me think about behavior. But this is a mistake, even though the original word in the Greek does in fact mean “sober.” Allow me to explain. Peter’s call for sobriety is bookended between two discussions of suffering. The first is encouragement, found at the end of chapter 4, and the other is this: “Resist [the devil], firm in the faith, knowing that the same kind of sufferings are being experienced by your fellow believers throughout the world” (1 Peter 5:9).\nAnd that is why I think Peter’s call for sobriety is all about belief and not behavior. Peter is concerned about the faith of His readers surviving in the midst of suffering. “Keep awake! Show some self-control! Be alert! In the midst of you suffering, the devil is out to wreck your faith!”—I think that is what Peter is trying to say in this passage.\nHe knows what we all know. The most important things are often the things we cannot see. We can see our sufferings. If the suffering is intense enough—and we know it certainly was for Peter’s original readers—our faith can waver. We can begin to lose control of our imagination, which is really the lack of sobriety Peter is worried about.\nWe imagine what it would be like to let go of our faith. We picture in our minds an easier life. We picture freedom and imagine the suffering will go away. We daydream about all the ways we might get control of our own life which, at any given moment, appears to be coming apart at the seams.\nPeter wants them (and us) to know the devil is at work in this wavering. This is why he uses the image of a lion to capture our imagination, so we can “see” by faith the danger we are actually in. He wants us to picture the suffering of other believers. And he wants us to remember we are not alone. He encourages us to think about the restoration that is coming, to remember that Jesus has dominion. He is the King after all.\nOur imaginations can run wild. Peter wants us to be alert to the fact that we do have an adversary working against us, but all the while we have a King who never stops working for us.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day12.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 5:1-7, Proverbs 3:27-35, 1 Timothy 3:1-13",
        "devo_title": "About the Elders",
        "devo_summary": "\n                    \n                    Most men reading this are not elders (or pastors or deacons or priests or any other sort of official church leader), so the question confronting us about this text is this: So what? Why should we pay special attention to a passage about elders. The obvious answer is that it is in God’s Word, so it must matter. But there is a more pointed, personal reason to care about Peter’s words to elders.\nElders, those men who lead churches, lead your church. They are your leaders, your example. They are your friends. You are part of a single body of believers, peers as followers of Christ. And do not miss what Paul says in 1 Timothy 3: “If anyone aspires to be an overseer, he desires a noble work” (v.1). You may feel pulled toward church leadership right now, or you may in the future, and that is a good thing! So these are words for you as brothers of the elders, followers of the elders, and people who aspire to be elders.\nIn both 1 Peter 5 and 1 Timothy 3, the apostles lay out standards by which church leaders should live. These are “qualifications” in one sense, but foundationally they are standards for Christian character, standards to which every follower of Jesus should hold himself. We should all serve willingly, avoid greed, be above reproach, and be faithful husbands. Every Christian man should be hospitable, respectable, avoid excessive drinking, not be bullies, have an upstanding reputation in the community, avoid hypocrisy, and manage our households. These are measures of Christ-likeness, and in this way these are words for every man.\nBut church leaders are called to something unique. They must be able to teach. They must lead others and be an example. They shepherd God’s flock as they follow the Chief Shepherd. Peter makes clear that within the Church, leaders must be followers, submitting themselves to Christ intentionally and faithfully.\nOne characteristic is the banner over all the others and the foundation underneath them: humility. In 1 Peter 5:5 Peter commands, “All of you clothe yourselves with humility toward one another.” For those who are not elders this instruction enables us to learn and follow well. For leaders, it enables them to avoid a false sense of self-importance and the false mindset that God’s flock is their flock. To clothe ourselves in humility is constant and holistic, a perpetual awareness of who we are before God.\nHumility ties every other qualification and characteristic of a godly man together. It enables them and empowers them—how else could we be hospitable, open to correction, generous, and caring? Our bent is toward pride and that undermines everything Peter and Paul command in these passages. But humility unifies. Humility creates leaders we want to follow, and followers who are a joy to lead. And humility honors God by exemplifying Christ most clearly, the truest calling of every believer.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day11.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 4:12-19, Isaiah 11:1-5, Matthew 5:3-12",
        "devo_title": "Christian Suffering",
        "devo_summary": "\n                    \n                    Our most common question when suffering comes is “Why?” Why is this happening, and, more specifically, why is it happening to me? We are floored by unexpected troubles. While it’s natural and okay to wonder, this passage from 1 Peter frames the response to suffering quite differently. “Do not be surprised… as if something unusual were happening to you.” Peter is telling us to expect suffering and hardship. He also gives an answer to the question, “Why?”\nScripture offers a multi-layered and miles-deep answer to why people suffer, all of which is anchored in the sovereignty of God and the result of sin in the world. Some suffering is a result of the natural world’s brokenness and being cursed (Genesis 3). Some is the result of our sins and stupidity. Some is the result of injustice and others’ sin. But this passage looks particularly at suffering that is a result of living for Jesus, the cost of faithfulness to Him. The cause of this suffering is doing right, following our Savior, and being in Christ. It is suffering for being where, what, and who we truly ought to be.\nThat may be the cause of the suffering, but it is not the purpose of it. First Peter chapter 4 points us to the purpose: to “share in the sufferings of Christ so that you may rejoice with great joy when his glory is revealed” (v.13). It goes on to say, “If you are ridiculed for the name of Christ, you are blessed because the spirit of glory and of God rests on you” (v.14). Rejoice. Be blessed. The purpose of this suffering is to draw us closer to Jesus in such a way that we profoundly recognize and know His joy and His Spirit.\nIn the midst of suffering we often struggle to feel this truth. We know it, we remember it, but we don’t sense it. What we sense is the injustice and pain of suffering, both of which are profoundly real. Scripture speaks to this too. It speaks to the injustice by promising a Judge, a defender whose “delight will be in the fear of the LORD,” who will not judge based on appearances or earthly standards, but will “judge the poor righteously and execute justice for the oppressed” (Isaiah 11:3–4).\nScripture speaks to the pain by promising wholeness. The beatitudes (Matthew 5:3–11) are a liturgy for the hurting and those who are the lowest. What do they promise? Comfort, inheritance, fullness, mercy, the presence, kinship, and kingdom of God. This is why we can “entrust [ourselves] to a faithful Creator while doing what is good” (1 Peter 4:19). He has promised that our suffering has a purpose, that justice is coming, and that comfort will abound in His kingdom and for His family.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day10.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 4:1-11, Proverbs 10:12, Romans 6:1-11",
        "devo_title": "Following Christ",
        "devo_summary": "\n                    \n                    One of the most uncomfortable and countercultural aspects of Christianity is its dependence on death. In our Western culture we abhor even the mention of death. We fend it off, euphemize it, and ignore it. When it comes to death, we cover our eyes like children; if we refuse to see it, then it must not exist. But the very hope of our faith depends on death—the death of Jesus and our death to sin.\nFrom the first verse in today’s reading, we see it: Christ suffered in the flesh (1 Peter 4:1), we were baptized into His death and were buried with Him in baptism (Romans 6:3–4). This is no morbid wallowing in mortality, nor is it merely a metaphor. This is the path to following Jesus. Christ’s death truly killed the power of sin and death, and in Him sin is killed in us too. We live “no longer for human desires, but for God’s will” (1 Peter 4:2). Our old self was crucified so that sin would be rendered powerless. We died with Christ, so we could live with Him (Romans 6:6,8).\nWhat does this look like? It often means our lives make no sense to the world around us. Our neighbors, friends, and coworkers may even resent us for no longer living like they do, as we leave behind our sinful lifestyles (1 Peter 4:4). In Christ we can’t follow the same evil desires we did before. We are tempted, and we will sin, but our lives are no longer ruled by sin. Instead our lives are to be marked by urgency and alertness, because God will judge both believers and unbelievers (vv.5–7). We are to exemplify Jesus by being hospitable, serving, using our gifts to care for others, and speaking God’s Word to one another.\n“Above all,” Peter says, “maintain constant love for one another, since love covers a multitude of sins” (v.8). He is echoing an ancient proverb God gave Solomon (Proverbs 10:12) and tying it to faithful discipleship. Love should be constant, not wavering or wilting, depending on feelings or circumstances. It is to be “for one another,” meaning believers in Jesus are to love other believers in Jesus. This means no division, no gossip, no backbiting, for love allows no room for those.\nLove covers a multitude of sins, and it’s a good thing, too, because we will commit a multitude of sins. How does love cover them? Covering doesn’t mean making, fostering, or protecting them in secrecy. No, love smothers sins and protects sinners. It covers sinners like clothes cover nakedness, like armor covers and protects a body. It cover sins like a debt already paid, gone and done with, forgotten and settled. We know this because this is how Jesus loved. He killed sin and saved sinners, so that God would be glorified through Christ. So we seek to do the same in our obedience, faithfulness, and love for one another.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day9.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 3:8-22, John 15:18-21, Galatians 3:23-29",
        "devo_title": "Do No Evil",
        "devo_summary": "\n                    \n                    A number of years ago, a meme with a picture of first Century Christians, standing in a Roman stadium and surrounded by lions, was floating around various social media sites. The caption underneath the picture said, “God loves you and has a wonderful plan for your life.” It was quite an impactful illustration of what is missing in so much that passes for Christian teaching today. Many are led to believe that if they come to Christ, their life will get easier and easier. In fact, the opposite is the case. When we come to Christ, we do so with the expectation that we will suffer and endure hardship on His account. What enables us to endure suffering for the name of Christ is that He suffered in the flesh for us.\nThe apostles were themselves men well acquainted with suffering, and members of the early church witnessed how much the apostles endured for the sake of the gospel. Nevertheless, Peter believed it was necessary to remind first century believers about the blessing of suffering for the sake of Christ. He wrote, “It is better to suffer for doing good, if that should be God’s will, than for doing evil” (1 Peter 3:17).\nNothing can hurt us if we endure suffering for the sake of Christ. Jesus taught this when He said, “Don’t fear those who kill the body, and after that can do nothing more” (Luke 12:4). The suffering we are called to endure in this life serves the glory that shall be revealed in us. The first Christian martyr, Stephen, knew this when he looked up into heaven as he was being stoned and prayed with the face like an angel, “Lord Jesus, receive my spirit!” (Acts 7:59). Polycarp, a disciple of the apostle John, learned what it meant to suffer for doing good. While burning at the stake for his testimony, he famously said, “Eighty-six years I’ve served him, and he has never done me injury.”\nWhen we arm ourselves with the same mind with which Christ was armed, we will be able to endure hardship for the glory of God. Since Jesus suffered for us (1 Peter 3:18), to forgive us and to bring us to glory, we can suffer for Him. The suffering we endure for doing what is good is a mark of God’s blessing, rather than a mark of failure and loss. In the end, it will be seen as gain. May God give us the grace to remember the One who suffered for us to bring us to God, so that we might suffer for Him to bring Him glory.\nWritten by Nicholas Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day8.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 1:3-4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the first part of the key verse for 1 Peter.\nBlessed be the God and Father of our Lord Jesus Christ. Because of his great mercy he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead and into an inheritance that is imperishable, undefiled, and unfading, kept in heaven for you.\n1 Peter 1:3–4\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/4-HRT-1-2Peter-1.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "Galatians 5:13-14",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor you were called to be free, brothers and sisters; only don’t use this freedom as an opportunity for the flesh, but serve one another through love. For the whole law is fulfilled in one statement: Love your neighbor as yourself.\nGalatians 5:13–14\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day6.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 3:1-7, Genesis 1:26-28, Ephesians 5:22-33",
        "devo_title": "Wives and Husbands",
        "devo_summary": "\n                    \n                    When I was a boy, the term modesty was one of the more familiar words bandied about by members of evangelical churches across America. In almost all of the discussion about modesty I overheard in the ’80s and ’90s, it was inevitably framed around young Christian women who were supposedly not wearing enough clothing to church or school. The Bible actually does have quite a bit to say about modesty, but, contrary to what one might expect, it is not with regard to how much clothing a young woman is (or isn’t) wearing. Rather, it’s focused on how women of any age were adorning themselves in order to gain attention.\nGod is more concerned with inner beauty than He is with external beauty. Peter sums this up so well when he tells wives, “Don’t let your beauty consist of outward things… but rather what is inside the heart” (1 Peter 3:3–4). In a day when we are consumed with body enhancement surgeries, cosmetic and health products, and fitness regimens, it would do us a world of good to reconsider what is most important to God. The fact of the matter is, God is far more concerned with the hearts of His people.\nThis truth should animate godly wives to give the better part of their time and energy to cultivating the beauty of “a gentle and quiet spirit” within (v.4). This should also motivate Christian men to value and encourage what is most beautiful in this precious gift of a godly wife. A godly husband delights in what is most valuable—the image of Christ renewed in his bride. As the book of Proverbs tell us, “Charm is deceitful, and beauty is vain, but a woman who fears the Lord is to be praised” (Proverbs 31:30). There is something more worthwhile, more glorious, and more desirable than the external beauty the fallen world prizes above all else.\nCultivating and valuing our spouse’s inner beauty is the key to a lasting and God-honoring marriage. When wives seek to adorn themselves with a spirit that is “precious to God,” and when husbands seek to lovingly dwell with them in understanding, beauty abounds. May God give us grace to cultivate and value the reflected beauty of Christ in our marriages.\nWritten by Nicholas Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day5.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 2:11-25, Romans 13:1-7, Galatians 5:13-14",
        "devo_title": "A Call to Good Works",
        "devo_summary": "\n                    \n                    One of my all time favorite hymns is the old African-American spiritual, “Were You There When They Crucified My Lord?” Every time I sing it, I want to cry out loud, “You bet I was there! I was nailed to the tree with Him as He hung under the wrath of God for me.” That is, of course, the great truth of our union with Christ. What the Savior did, He did for His people. Whatever He endured, He endured in our place and for our good. This is the heart of the gospel itself. When Jesus died, our old sin nature was crucified with Him. When He was buried, our old sin nature was put away from the presence of God in the tomb. And, when Jesus stepped out of the tomb, we stepped out with Him unto newness of life.\nFrom the great exchange to the great renewal, everything about the Christian life is summed up in our union with Christ in His death and resurrection. The apostle Peter captured this truth so marvelously when he wrote, “He himself bore our sins in his body on the tree; so that, having died to sins, we might live for righteousness” (1 Peter 2:24). Sin is what keeps us from living a life that is pleasing to God. Jesus came to deal with our sin on the cross. He died to the power of it. He died for the guilt of it. He took the shame of it upon Himself. When Jesus died, He was treated as the worst sinner who had ever walked the face of the earth—even though He knew no sin in His personal experience. God the Father reckoned Christ a sinner in our place, so that He might do what we could never do for ourselves. That is the great exchange of the gospel.\nAs glorious a truth as that is in itself, there is another beautiful dimension to the gospel. Peter tells us that He took our sin in His own body on the tree so that we might die to sin and live to righteousness. When Jesus rose from the dead, He raised us up with Him so that we might bear fruit to God. We have been brought into a new world of grace, one in which we live and move as part of God’s new creation in Christ. We were redeemed to live out lives of holiness unto God. Our union with Jesus Christ crucified and raised is, in every way, the secret of our sanctification. May God give us grace to remember this precious truth as we seek to live out our new lives in union with Him!\nWritten by Nicholas Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day4.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 2:1-10, Psalm 34:1-14, Hebrews 13:14-16",
        "devo_title": "A Holy People",
        "devo_summary": "\n                    \n                    I realize that these days, it can be problematic to talk about “tribes.” That sort of language smacks of exclusivity and division, an us vs. them mentality that’s hardly helpful in our increasingly polarized world. However, we can’t run away from the fact that we form tribes over seemingly anything and everything—from the love of a certain football team to an affinity for gourmet coffee. But the best tribes are those where the connection runs deep, when being together feels like a family gathering.\nIn the Bible, God formed tribes—quite literally. From Jacob’s sons, He formed twelve tribes that would become the nation of Israel, His chosen people from all the peoples of the earth. That, of course, did not mean God was altogether abandoning the rest of humanity. The purpose of setting Israel apart had always been to shine a light to the Gentiles. This happened at times, but for most of the Old Testament, the people of Israel saw their chosen status as a reason to boast rather than a reason to shine.\nAnd then came Jesus, the light of the world. Through His life, death, and resurrection, He made a way for people from every nation to be saved. The dividing wall between Jew and Gentile was torn down.\nPeter, one of Jesus’s closest friends, had an ongoing struggle with this. He had to receive a supernatural vision and hear a voice from heaven before he would enter the house of the Gentile Cornelius and share the gospel (Acts 10:9–48). Later, he refused to sit with Gentile Christians for fear of what his Jewish friends might think (Galatians 2:11–14). But something changed in Peter. In the letter we now know as 1 Peter, he writes to Gentile Christians, “But you are a chosen race, a royal priesthood, a holy nation, a people for his possession” (1 Peter 2:9). These descriptors were all once used of Israel. But now, because of Christ, Gentiles have been invited into the tribe.\nOur hope is not found in where we happened to be born or in whatever group the world has placed us. The only tribe that matters is the tribe of Jesus. In Him, we belong. In Him, we are adopted as God’s children. In Him, we have an inheritance beyond measure.\nIn the same letter, Peter also says, “Once you were not a people, but now you are God’s people” (v.10). This language is borrowed from the book of Hosea. There, God used the prophet Hosea’s marriage to an adulterous woman to illustrate Israel’s unfaithfulness. Israel had broken the covenant they made with God at Sinai, and they did not deserve to be called His people. But the truth is, none of us deserve it. Not one of us is faithful. Not one of us is good enough. After all his ups and downs, Peter finally got the message: Jesus did on our behalf what we could never do on our own, so that we could be included in His tribe. Thanks be to God!\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day3.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 1:13-25, Isaiah 53:7-9, Ephesians 1:3-10",
        "devo_title": "A Call to Holy Living",
        "devo_summary": "\n                    \n                    “Next time, do you think you could fix it with a little less swearing?” Abigail, my 11-year-old daughter, asked. The back of our couch had disconnected from the arms and was being held together solely by the grace of God. I set about fixing it, trying to force the connecting pieces together again and, in my frustration, a few (mild) expletives burst forth from my mouth. My daughter was right to call me out. We generally avoid swearing in our home, as we strive to be considerate with our words, and I was acting out of step with our family’s values. But I was also out of step with a larger calling: one to holy living.\n“As the one who called you is holy,” Peter wrote, “you also are to be holy in all your conduct” (1 Peter 1:15). Perhaps this call fills you with a sense of panic, guilt, or even shame. After all, how many of us can look at these words and think, Nailed it!—I mean, really? And when we’re confronted by the holes in our holiness, what do we usually do? We commit to working harder. We pull ourselves up by our spiritual bootstraps and take our first step. But because we forget to tie them up, we trip and stumble again—and again, and again, and again—until we’re ready to throw our hands up in the air and just give up.\nBut when Peter calls his readers to holiness, when he reminds them that God’s people are to be holy in all our conduct, he doesn’t write expecting them to “just be more holy,” as we so often expect of ourselves. He knows what it’s like to fall short (after all, he did deny Jesus three times). So rather than appealing to the force of will, Peter roots the call to holy living in the gospel.\nThrough Christ, you were “redeemed from your empty way of life inherited from your fathers” (v.18). You were foreknown, chosen before the foundations of the world; you were a beloved child from before the beginning (Ephesians 1:4–5). You were purchased with the precious blood of Christ (1 Peter 1:19), the Lamb of God who silently bore our sins and was struck down because of our rebellion (Isaiah 53:7–8), all according to the riches of His grace, “richly poured out on us with all wisdom and understanding” (Ephesians 1:7–8).\nThat’s what makes the pursuit of holiness, this call to holy living, possible. That’s what makes it a delight, as much as a duty. Yes, without question, we have an obligation to pursue holiness. But the gospel reminds us that in Christ, we have been declared holy—He has done it all! And so, the call to holy living is not a call to make ourselves holy, but to live in light of who we already are: beloved sons and daughters of the Father, adopted into His family through faith in our Lord Jesus Christ. So don’t set your hope for holiness in your own strength. Doing so will leave you disappointed every time. Instead, “set your hope completely on the grace to be brought to you at the revelation of Jesus Christ” (1 Peter 1:13). The gospel is the fuel for our pursuit of holy living; it will never disappoint.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day2.jpg"
    },
    {
        "book_title": " 1 & 2 Peter",
        "devo_passages": "1 Peter 1:1-12, Exodus 24:3-8, Psalm 51:1-19",
        "devo_title": "A Living Hope",
        "devo_summary": "\n                    \n                    It’s hard to describe the moment I first saw my oldest son, Jonah. It was through the screen on my phone as I filmed his birth by C-section. I discovered afterwards that making my short movie was against hospital regulations, but I would hit record again in a heartbeat if I had it to do over.\nThough his mother and I had wondered what our child would look like, when I saw Jonah, red in the face from the primal scream of birth and shivering from the air-conditioning in the operating room, it was as if I’d always known him. Like I said, it’s hard to explain.\nNow I can’t quite remember what my life was like before I had kids. They belong with me and are a part of me. Life could never be the same without them. So, that moment when I first saw Jonah in the hospital, it was as if I’d recognized him from some previous meeting, like I’d always known him. Someday, those of us who know Jesus will finally meet Him face to face. I imagine it will be a similar sensation. We will recognize Him immediately and be unable to remember exactly what life was like before being forever united with our Savior in this way.\nThe apostle Peter encourages us to endure “various trials so that the proven character of your faith… may result in praise, glory, and honor at the revelation of Jesus Christ” (1 Peter 1:6–7). Everything is leading up to that moment, when Christ returns and we finally see Him face to face. To borrow a phrase from the hymn writer Horatio Spafford, it is the day “when faith shall be sight.” It will change everything.\nPeter knew something of this. He had been the disciple to first identify Jesus as “the Messiah, the Son of the living God” (Matthew 16:16), but he ran away and hid when his sight didn’t match his faith—when he saw Jesus being arrested and tried as a blasphemer, when he saw Jesus remain silent amidst taunts and accusations. Peter had been there when Jesus raised people from the dead. He had watched Him feed five thousand with a boy’s lunch. He had seen the Lord walk on the water, and even joined Him on the lake momentarily. But Peter doubted and denied Jesus when what he believed and what he saw no longer lined up.\nWho better than Peter to encourage us to live with Jesus’s return in mind? He knows there will be days when faith and sight don’t align. There will be times when our troubles make it appear to our senses that the world and God’s enemies are right after all, that the hope of the Christian is a fool’s hope. But there is a day coming when all of that nonsense will be put to rest, once and for all. The risen and returning King Jesus will be revealed, and those who have placed their trust in Him will be vindicated. Even now, even in those moments when pressure is mounting on every side, we can have joy because, as Peter put it, “you are receiving the goal of your faith, the salvation of your souls” (1 Peter 1:9), the fullness of which will come when the Son of God returns to earth. Come, Lord Jesus!\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/02/HRT-Instagram-1-2Peter-Day1.jpg"
    }
]