[
    {
        "book_title": " Esther",
        "devo_passages": "Esther 4:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through the book of Esther, we are memorizing the book’s key verse in two parts. This week, we’ll memorize the end of the verse, which reminds us that God has a purpose for our lives.\n“Who knows, perhaps you have come to your royal position for such a time as this.”\n—Esther 4:14b\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/4-Esther-2.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Ephesians 1:9-10",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHe made known to us the mystery of his will, according to his good pleasure that he purposed in Christ as a plan for the right time—to bring everything together in Christ, both things in heaven and things on earth in him.\n—Ephesians 1:9-10\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day13.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 9:23-32, Esther 10:1-3, Leviticus 16:29-31, Ephesians 1:3-14",
        "devo_title": "God’s People Remember and Celebrate",
        "devo_summary": "\n                    \n                    Think for a minute about the holidays people celebrate: Christmas, Easter, Thanksgiving, New Year’s Day, Passover, Independence Day. What do they all have in common? They all commemorate the beginning of a new era. To varying degrees, they all celebrate surviving the past and anticipating better days to come.\nThis word, holiday, is a simplifying of “holy day.” Holy days are days when we stand together before God and thank Him for His faithfulness. They are days when we take stock of the gravity of what we survived, and look ahead with hopeful eyes to a better future.\nThe book of Esther ends with the institution of a holiday called Purim. On Purim the Jewish people celebrated that Haman did not wipe them out. They remembered how God turned the tables on evil, and blessed them with peace. Jewish people still celebrate Purim today. Purim celebrations include reading Esther, giving to the poor, sharing a meal, and exchanging gifts. One common gift is a noisemaker called a “grager,” which is used to block out the name “Haman.”\nThe whole idea of this holiday is for the Jewish people to proclaim, “We’re still here!” Haman tried to blot them out, but he failed. Still, he tried. Tragically, this has been the Jewish people’s plight more than once. Both Pharaoh and Hitler sought to exterminate the Jews from the face of the earth. And they both failed too.\nPurim belongs in a similar category to Passover, the holiday when the Jewish people celebrate their deliverance from slavery in Egypt, and the more recent Jewish holiday Yom Ha’Shoah, the Day of Remembrance of the Holocaust, which carries the mantra “Never forget.”\nThese holidays are more than victory laps. They are serious business. Remembering is important to survival, to knowing where we come from, and to preventing atrocities from visiting later generations. Holy days remind us of just how fragile we are, and how hopeless we would be without God’s intervening hand.\nWhat happens in Esther foreshadows the cross. The possible extermination of the Jewish people is a dark part of Esther’s story. It is not something any of us should forget. We need to remember that great rescue follows great peril. As people who have been saved by grace through faith in Christ, Christians do well to remember what we have been saved from—death and eternal separation from God.\nOur salvation in Christ is no small thing. Just as the Jews in Esther’s time celebrated their deliverance from destruction, so do believers in Christ. We have not been delivered from the unjust lunacy of a tyrant. We have been delivered from the perfectly just wrath of a holy God. This is a heavy thought, I know. But it is also the point of the cross, by which we have been fully and forever set free.\nCelebrate your freedom in Christ by remembering what you have been saved from, and Who has saved you from it.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day12.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 9:1-22, Nehemiah 8:10, Luke 1:46-55",
        "devo_title": "Esther’s People Are Saved",
        "devo_summary": "\n                    \n                    I come from a long line of planners, maybe even over-planners. We assess situations, make a plan, and handle it. My wife is spontaneous and doesn’t mind if we don’t even know where we will sleep tonight. But when I don’t know what’s coming, I go ahead and worry. \nI know what Scripture says about worry (don’t do it), but when things look bad and the unknowns pile up, I get in there and worry like a champ. I really get men like Peter. Remember him standing on the water, looking at the dark waves and starting to sink? Peter liked to know the facts, and standing on that water, the facts as he understood them didn’t add up (Mark 14:22-33).\nWhat I don’t like is not knowing. In other words, I’d rather not need to have faith. Of course, this desire for an easy and comfortable spiritual walk, where everything is clear up front and there is only good news, is not what God has designed. The good that God wants for us is not about our ease, but about growing us in Him. This means that the natural man, the one that doubts, frets, and despairs, has to go. In his place must grow a new man, who believes and gives thanks.\nEsther is a great book for “men of little faith” like myself. God’s name isn’t even mentioned. Take that at face value, and there is plenty of reason to worry and fret. But God often does His greatest work while no one is looking. Even in the midst of the night, and in the early morning hours, He prepares salvation for His people (Exodus 14:21; John 20:1). Take darkness at face value, and we miss seeing His hand at work. At the moment of defeat, He brings victory. In weakness, He is strength. From sorrow, He makes joy, and from death, life (Esther 9:22; John 5:24).\nThe thirteenth day of Adar was the moment of reversal. In the final hours, the tide turned. God sent to the Jews’ aid not only Mordecai, but the officials and satraps and governors of the provinces, and then caused the fear of the Jews to fall on all the people. When all was seemingly lost, suddenly, all was won. \nOne detail in particular stands out to me here: the Jews “laid no hands on the plunder” (Esther 9:16). Why not? When fate has dealt you a fortunate hand, why not capitalize on it? But the Jews did not. As Matthew Henry observed, the Jews refused the spoils “in imitation of their father Abraham, who scorned to enrich himself with the spoils of Sodom.” The riches of the earth, Abraham recognized, didn’t belong to men, but to God, and it was not the kingdoms of this earth that we are called to desire. Even when kingdoms fall into our hands, they are not ours for the taking.\nGod is a God of sudden reversals, and the only proper response is thanksgiving, expressed in restraint and generosity. May we be mindful of God’s work, even when it is hidden from our eyes. May we seek first His kingdom, leaning not on our own understanding, for the joy of the Lord is our strength!\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day11.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 8:1-17, Romans 8:10-11, Colossians 3:1-4",
        "devo_title": "Esther Intervenes for the Jews",
        "devo_summary": "\n                    \n                    It is truly hard to imagine the difficult position Esther found herself in. On one hand, she knew all about Haman’s plot to destroy the Jews. It was not only an evil plot, but one against her own people. And as Mordecai pointed out, she would most likely not escape unscathed herself.\nBut to ask for help from the king was not so easy either. You didn’t just walk into the king’s court, asking questions and requesting favors. Doing so meant risking your life.\nBy the time we get to Esther 8, Haman’s plot has been seen for what it was and he has been hung instead of Mordecai. But King Ahasuerus has already signed off on the destruction of the Jews. The law is on the books and even though Haman has been dealt with, the law is the law.\nShe has to go to the king again. (I love this scene.) Esther goes to him…\n“Then Esther spoke again to the king. She fell at his feet and wept and pleaded with him to avert the evil plan of Haman the Agagite and the plot that he had devised against the Jews” (Esther 8:3).\nIt would be hard to not be moved by Esther’s bravery and love for her people. Her willingness to face death instead of simply enjoying the glory she had as the queen is admirable. She models the kind of heroic life we enjoy watching on the big screen. We hope to be like Esther and we name our daughters after her because of her sacrificial life.\nBut ultimately this story is not about Esther. It is a story about the God who saves His people. And as beautiful as this story is, we enjoy a salvation even greater. \nThink about what Christ has done. Instead of simply enjoying the glory that was His, He emptied Himself of that glory and bravely came to save us in love. Just as Esther wept and pleaded for the Jews, Jesus intercedes for us even now (Romans 8:34). The salvation we enjoy because of the work of Christ, does not merely save us from physical death; it turns death back on itself, so that now even death is defeated. This can only move us toward eternal life.\nThe Jews had the schemes of Haman. We have the schemes of Satan and our sinful flesh. Christ has defeated our great enemy. Just as Esther intervened to save the Jews who were once under the condemnation of the king, we, too, are saved and no longer under condemnation (Romans 8:31). \nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day10.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 7:1-10, Psalm 91:2-3, Revelation 20:11-15",
        "devo_title": "The King Executes Haman",
        "devo_summary": "\n                    \n                    “Comeuppance” isn’t a word you hear much these days. It’s a little archaic and stodgy, but it’s so perfect for some situations. Comeuppance means someone receives the fate they deserve. That’s what today’s story is about, or at least it is in part.\nThe conniving, self-aggrandizing, malicious Haman is finally outed for his plot to destroy the Jews. In a carefully planned and desperate maneuver, Esther invites Haman and King Ahasuerus to a banquet. Because she finds favor with the king, he offers whatever her heart desires, and Esther’s response is not at all what Ahasuerus anticipated—not riches, not fame, not ease. “Spare my life; this is my request. And spare my people; this is my desire” (Esther 7:3).\nThis moment is the hinge on which the story turns. How will the king respond? He is outraged and demands to know who is perpetrating this atrocity. Esther, patient and wise, had waited to reveal this, knowing she needed the king to believe her before she played her final card. “This evil Haman,” declares the queen. And the door slams shut.\nHaman is hanged, in a stroke of providential and poetic irony, on the gallows he had built to kill Mordecai. (I suppose this would be the original gallows humor.) And this, friends, is the perfect comeuppance—a satisfying end for a mastermind of genocide.\nBut this story is about more than good triumphing over evil and a villain getting what he deserves. Those elements of the narrative are meant to resonate with something more and draw our attention to greater themes: the justice of God, His care for His people, and His judgment of evil. \nPsalm 91 describes how God is the refuge of those who trust Him and will deliver them from “the bird trap” (v.3). Revelation 20 describes God’s judgment seat where no one will be passed over and all will be judged for their actions in this life (vv.11-12). Throughout Scripture, we read that God hates sin, loves mercy, upholds justice, stands by the weak, and will never forsake His people. \nThe book of Esther tells the tale of a rescuing God who pulls no punches in upholding justice on behalf of His people. That is how stories are supposed to work. They draw us into events and lives where we see and feel what injustice, fear, hope, and rescue feel like. They show us evil and they show us good. And they give color and light to the lessons the rest of Scripture teaches about who God is and why we can trust Him. \nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day9.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 6:1-14, Proverbs 26:27, Isaiah 52:1-2",
        "devo_title": "The King Honors Mordecai",
        "devo_summary": "\n                    \n                    So much of life seems so very unfair. Why do those who do what is right often seem to suffer so much, or fail to be justly rewarded for what they have done? And, why do those who do wrong so often seem to prosper? These questions have plagued mankind throughout all of human history. Thankfully, Scripture deals with that question head on. The book of Esther, in particular, teaches us that God superintends history in such a way that He is working out His plan in the lives of His people and exercising His sovereignty over the wicked. In the end, God’s mysterious purposes will stand and He will ultimately mete out justice. \nC.S. Lewis once noted that ultimately God will “work backwards and turn… agony into a glory.” We see this principle typified in God’s dealings with Mordecai. By way of contrast, we see God turning against Haman—the one who sought to destroy the people of God and, by way of implication, the promise of redemption in the coming Christ.\nThroughout the better part of this grand narrative, Mordecai seems to have been forgotten and Haman seems to be prospering. But as we come to the end of the story, we see Mordecai, who had acted with uprightness in all his dealings, rewarded for his faithfulness and Haman overthrown for his wickedness. \nWhen he is finally remembered for uncovering a plot against the king, Mordecai is honored—ironically—by the very one who sought to destroy him and his people. The king made Haman clothe Mordecai with the royal robes and parade him through the city on one of the his own horses. This was the ultimate vindication from God. As Proverbs 26 teaches, “The one who digs a pit will fall into it” (v.27). No greater display of God’s superintendence in the lives of His people could have been shown.\nThis is, of course, a picture in redemptive history, a foretaste of the victory that God gives Jesus over Satan. Though the evil one thought that he had destroyed the Son of God on the cross, it was actually the means of ultimate victory and redemption. In the resurrection, God the Father proudly presents His Son before the watching world to see His ultimate purposes of grace and triumph.\nAll those who are trusting in Christ will also know ultimate vindication and triumph. No matter what we endure in this life, Scripture makes clear that there is a day in which every wrong will be made right, and everyone who has schemed against the Lord and His people will be destroyed. That is the ultimate confidence we have as we make our way through this seemingly unjust world of sin and death. There is an overthrow of all wickedness through the death and resurrection of Jesus. \nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day8.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 4:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through the book of Esther, we will memorize the book’s key verse in two parts. We’ll begin with the first part of the verse—a reminder that God’s sovereignty does not depend on us.\n“If you keep silent at this time, relief and deliverance will come to the Jewish people from another place, but you and your father’s family will be destroyed.”\n—Esther 4:14a\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/4-Esther-1.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Psalm 32:7",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nYou are my hiding place;\nyou protect me from trouble.\nYou surround me with joyful shouts of deliverance.\n—Psalm 32:7\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day6.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 5:1-14, Proverbs 16:18, Mark 6:14-29",
        "devo_title": "Esther Approaches the King",
        "devo_summary": "\n                    \n                    Sometimes the road we’re on looks dark. What do we do when it seems God is leading us down that road?\nShortly after their occupation of Poland, Nazi Germany began arresting and incarcerating Polish political prisoners at a camp in the southern Polish town of Auschwitz. One year later, in September 1940, a Polish resistance fighter named Witold Pilecki inserted himself into a Nazi round-up of Poles on the streets of Warsaw. Pilecki, like most Poles, knew that Auschwitz was more than a typical prison camp, but no one knew exactly what the Nazis were doing there. He had to find out.\nPilecki was voluntarily incarcerated at Auschwitz for two years, facing almost certain death, before he overpowered a guard in the middle of the night and escaped in order to inform the world of the Nazi atrocities he witnessed. Pilecki demonstrated tremendous courage in the face of danger for the sake of what was good. He had to enter into the darkness, and trust that the Nazis were too proud to suspect anyone would volunteer to do what he had done.\nWhen Queen Esther approached King Ahasuerus in the inner court of his palace, she demonstrated a similar measure of courage. She risked her life to save her people. For, if one entered the inner court of a king without the gold scepter of the king first being extended to them, execution would surely follow. This was true even for a queen. Yet, Esther needed to approach the king in order to advance her plot to expose Haman—a vizier of the king who intended to exterminate the Jews in Persia—as a traitor to King Ahasuerus.\nAs you read for yourself what happens next, one of the things you see in this story, along with Esther’s courage, is how intoxicating pride can be. Haman was blinded by it, and so often we are too. Proverbs 16:18 says, “Pride comes before destruction, and an arrogant spirit before a fall.” God, in His providence, directed the heart of the king to accept Esther’s request and led Haman to joyfully construct gallows that would eventually lead to his own undoing. \nThe Lord was working in Esther’s crisis. That thought never even occurred to Haman. Esther, on the other hand, had no choice but to trust that God was present and to humbly follow where He led, even though the way seemed dark.\nThe humility and pride on display in this book serve as a warning, redirecting our hearts to Christ. Jesus entered our darkness and exposed it to the light by humbling Himself to the point of death. But from that death came our salvation, which reminds us that God is always working. May the Lord give us the eyes of humility to see this and the courage to follow where He leads, even when the way seems dark. It is not dark to Him (Psalm 139:12).\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day5.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 4:1-17, Isaiah 15:1-3, Romans 5:6-11",
        "devo_title": "Mordecai Appeals to Esther",
        "devo_summary": "\n                    \n                    My kids are playing in the Chick-fil-A playground, and I notice there’s a bully. An older boy is pushing, taunting, and hitting this younger lad. The bully starts hitting his victim with his own shoes, pushing him into the shoe cabinet over and over. Time to put my Icedream cone down. \nI march in. “Hey! Quit it!” The bully and I lock eyes. He wonders if he can do anything to me. He can only say, “You aren’t my dad. You can’t tell me what to do.” He’s right. So, I told him the truth. “You’re right. But I can find your dad and tell him what you are doing to this kid.” Justice was served. His dad heard the news.\nI felt pretty good about myself driving home. While I stood up for a helpless little boy, my actions didn’t cost me much. My ice cream melted a little. But real heroics are costly.\nMordecai hears about Haman’s sinister plan for the Jewish people, and he knows Esther has to do something. She’s the only one who can get to the king. She can stand up for the helpless. And as a Jew, she herself is in danger too.\nDo you resonate with Mordecai’s humility here? He doesn’t force the issue and try to be the hero. He recognizes someone else is better suited for what must be done. Instead of trying to be the hero, he encourages Esther, the one who’s been placed in the position of influence. I wonder who is on the brink of doing great and faithful things for God but only needs a little of our encouragement.\nEsther agrees with Mordecai, even though she may perish by approaching the king. But this doesn’t stop her. “If I perish, I perish,” she says (Esther 4:16). If she helps to save God’s people, even at her own personal expense, she will do it. \nSacrifice and risk for redemption are at the heart of the gospel. Do you humbly see who your hero is? The one who accomplished what you couldn’t?\nBrothers, Jesus is the true and better Esther. His heroics were costly. He perished to redeem us curse-bound people. He gave up His breath for us, in our place, on the cross, paying for our sins. He perished so that we would “never perish but have everlasting life” (John 3:16). But He didn’t stay in perish-mode. He rose again, conquering the curse, and today lives as the King of kings. \nRejoice in your Redeemer! \nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day4.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 3:1-15, Psalm 68:20, Proverbs 16:33",
        "devo_title": "Haman Plans to Kill the Jews",
        "devo_summary": "\n                    \n                    As I write this, images of human hatred and bigotry flash across news outlets—the type of deep-seated hatred that often spills into deadly violence. As I have watched these events unfold, I’ve fought back tears of anger. I’ve also experienced a strange sense of déjà vu, a poignant reminder that things are still not as they should be. \nThe images in our news outlets look eerily familiar to the narratives of biblical history. This chapter of Esther reminds me that such conflicts are nothing new. Even Haman the Agagite’s plot to destroy Mordecai and the Jews mirrors the ancient conflict between these two people groups. The tension is only heightened as Ahasuerus, the king of the Amalekites—ancient enemies of the Jews (Exodus 17:8-16)—is brought into the picture. \nThis helps us understand Mordecai’s refusal to bow down to Haman. Bowing was was normal protocol for a king’s official, but it would have jeopardized Mordecai’s conscience as a God-fearing Jew. \nMordecai’s refusal to bow was the prime opportunity for Haman to finally destroy the Jews living in the kingdom of Ahasuerus, something he had been plotting for years. As the story unfolds, the imminent massacre of God’s people seems inevitable. As Haman and the king await the outpouring of Jewish blood, they celebrate by pouring one another drinks. \nFrom our perspective it often seems like evil has won the day. Nevertheless, narratives like this remind us that our omniscient God will have the final say. “The lot is cast into the lap [of man], but its every decision is from the LORD” (Proverbs 16:33). \nHaman’s authorized exchange, silver for the slaughter of God’s people, is ironically similar to the Gospel accounts of authorities exchanging silver for the slaughter of God’s only Son. Haman and the king may have rejoiced over Israel’s supposed destruction. Satan may have rejoiced at the supposed destruction of God’s Son. However, “Our God is a God of salvation, and to God, the Lord, belong deliverances from death” (Psalm 68:20). \nThis is the great irony of God’s grace and providence. Evil people plot and plan, but history is guided by God’s providential hand (Isaiah 55:8–9). In fact, all of human history finds its resolve in the cross and resurrection of the Son of God, where good triumphs over evil. It doesn’t matter if we are looking back into ancient history or weeping over the weekend’s news, our God is good. His gospel is sure. When Christ returns, every evil plot will be foiled. Things will finally be as they should be.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day3.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 2:1-14, Proverbs 31:10-31",
        "devo_title": "The King Searches for a Queen",
        "devo_summary": "\n                    \n                    God sees us as we truly are. Because we are made in His image, we all have inherent value and dignity. This is where our true worth comes from.\nWe live in a culture that cares more about superficial, surface-level beauty, and putting on a front for others, than it does for truth and authenticity. You might not be surprised to know that this has existed throughout human history. Ever since Adam and Eve traded their perfect relationship with God in order to try to be something else (Genesis 3), we have never been happy with our own identities in our Creator God.\nIn today’s passage, we see this working itself out in King Ahasuerus. He treats women like possessions, and because he’s king he can have whatever he pleases. When we meet this king, he is not a decent man. He is concerned only about himself and his reputation. He treats people as property for his own pleasure. He has no interest in leading his nation to worship and glorify the Lord.\nKing Ahasuerus is consumed with superficiality. We see this in the way he goes about choosing a new queen. The criterion for becoming his queen is built entirely on physical beauty, so much so that the king makes sure the women being groomed for his court are receiving extensive beauty treatments. \nEsther was not technically in line to become queen because of her ethnicity. However, she obviously stood out in the crowd, gaining “favor in the eyes of everyone who saw her” (Esther 2:15). Initially, this had a lot to do with how she looked. But she had so much more than superficial beauty. As we read further we see she also had wisdom, compassion, and courage. The king did not see these things in her at first. But they were there, and he would see them soon.\nThe problem with living in a superficial culture is that we fail to see below the surface to the truth. Regardless of whether our lives look perfect to the world, or if we stand out in the crowd like Esther did, we are all valued children of God. We gain favor in God’s eyes simply by being His image bearers (Genesis 1:26). \nOur true King sees us as we really are, regardless of our outer beauty. Jesus Christ, the Man of Sorrows who was despised and rejected and who had no splendor about Him (Isaiah 53), has shown us our worth by how He has redeemed us. He did not look for our outer beauty and then choose to love us based on how beautiful we appeared. Instead, He saw our sinful hearts and chose to lay down His own life in order to make us co-heirs of the enduring kingdom of God (Romans 8:16-17).\nPraise God that our King is nothing like Ahasuerus, and we don’t need to have the splendor of Esther to be noticed and valued by Him.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day2.jpg"
    },
    {
        "book_title": " Esther",
        "devo_passages": "Esther 1:1-22, Psalm 32:7, Daniel 6:8, Daniel 6:13-18",
        "devo_title": "Vashti Angers the King",
        "devo_summary": "\n                    \n                    I’m always surprised when I find someone who has never seen The Princess Bride. I’m almost embarrassed for them. And I always feel a certain responsibility to make sure they remedy this oversight in their lives. Why? Because The Princess Bride is a perfect story—one where nothing is wasted. It has everything: pirates, sword fighting, giants, power struggles, true love, and rodents of unusual size. Everything.\nI don’t know if you know this or not, but the Old Testament book of Esther is also a perfect story. It, too, has everything. A proud king. A defiant queen. An assassination plot. An ambitious, venomous second-in-command. And a seventy-five foot tall gallows going up in the heart of town, built especially for the sage-like guardian of the beautiful orphan girl who would become queen of the land. The book of Esther tells quite a tale.\nThis historical book tells the story of a king and a kingdom. On its surface, we see a kingdom of this world as we read about Ahasuerus and his rule over Persia. But the true story runs much deeper and higher. Even though God is not mentioned by name in this book, He is the supreme king and hero of this story. His providential hand leads His people from certain destruction to the kind of safety found only in being the object of a king’s affection.\nToday’s reading sets the stage by casting an ominous shadow over a seemingly happy time of feasting and abundance. The king throws a party meant to last for 180 days, but when he summons his queen so that he might show off her beauty to his guests, she refuses to come to him. The queen’s refusal to obey her king reverberates throughout the kingdom and the old saying, “As it goes for the king, so it goes for the kingdom,” comes into play. The king’s embarrassment becomes a moment of weakness the power-hungry seek to exploit, kicking the rest of the story into motion.\nAs you read Esther, enjoy the twists and turns. Appreciate the irony laced throughout. Feel the fear and trembling Mordecai, Esther, and their people must have known as Haman’s gallows took shape. The story itself deserves our appreciation for its complexity, drama, romance, and outcome.\nBut remember that a story like this points to an even bigger truth. The Apostle Paul describes this truth as God’s ability to use what is seemingly insignificant and despised in the world to shame that which the world exalts over God (1 Corinthians 1:27-29).  \nThe book of Esther is a double-edged sword. It is a rebuke to those who are tempted to scheme and plot their way to greatness. But it is also a story of reassurance that no matter how powerful the schemes of man may appear, God can topple them in a moment with ease. May that sword cut you both ways for the glory of God.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/10/HRT-Esther-instagram-Day1.jpg"
    }
]