[
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 50:20",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nIn this week’s verse, Jacob extends kindness and forgiveness to his brothers, demonstrating his trust in God’s ultimate goodness and sovereignty.\nYou planned evil against me; God planned it for good to bring about the present result—\nthe survival of many people.\n—Genesis 50:20\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Lockscreen-Day35-1.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Psalm 31:19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHow great is your goodness\nthat you have stored up for those who fear you\nand accomplished in the sight of everyone\nfor those who take refuge in you.\nPsalm 31:19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day34.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 49:1-33, Genesis 50:1-26, Isaiah 55:8-9, Romans 8:28-30",
        "devo_title": "Joseph’s Kindness",
        "devo_summary": "\n                    \n                    The book of Genesis ends with two graves. By the look of the chapters leading up to this point, it would have been easy to imagine this book ending with many more—Joseph repaying his brothers for their treachery against him, especially after his father Jacob died. But no. Joseph chose kindness. Why? Because he came from somewhere, and that mattered.\nA few years ago, I went back to my hometown to visit to my grandfather’s grave. As I passed the rows of headstones, a strange grief came over me. It wasn’t a sorrow for my grandfather. It was a homesickness triggered by the names carved in the granite markers—names as common to me as Smith or Johnson, but unique to rural Indiana: Tragesser, Ribperger, Tebbe, and Schmidt. I came from somewhere. Those were my people.\nTwo graves. Jacob and Joseph, are laid to rest. When Jacob dies, his body is embalmed like Egyptian royalty, an honor given because of what his son Joseph meant to Egypt. But Jacob didn’t want to be interred in Egypt. He wanted his body to be laid to rest in the cave at Machpelah, where his grandfather Abraham buried his beloved Sarah. Jacob wanted his bones to lie with his family.\nLet’s take a minute to go back and remember how this book began. It began with our first parents walking with God in the garden in the cool of the day. But then they rebelled against God and the bottom fell out. Death entered, waters covered the earth, and people scattered. But just when it seemed the world would be lost to chaos, God sent Abraham and Sarah out to the land the Lord had promised to give them. Abraham’s first and only official acquisition of that land was this cave where he buried his wife.\nNow Jacob’s children were to carry his body back to that place. The story is beautiful and sad, and yet filled with hope because Jacob’s request is born out of a conviction that he belongs someplace, that he comes from somewhere. Abraham’s grave is a symbol of belonging. It binds his descendants together in life and in death.\nThe book of Genesis was written to let us know we come from somewhere, and we belong to Someone. Death entered the world early, but this book spins us forward into a story where light pushes back the darkness, where life carries on beyond the grave, and where God claims a people who have rejected Him.\nWe come from somewhere. The promise of life in Christ is that we, too, will one day be gathered with our forefathers. The difference is that we will not be gathered to them in death, but in life, and for eternity.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day33.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 46:1-34, Genesis 47:1-31, Genesis 48:1-22, Psalm 31:19",
        "devo_title": "Jacob Comes to Egypt",
        "devo_summary": "\n                    \n                    My grandparents on my mother’s side met on the Staten Island Ferry. They both lived on Staten Island and worked similar shifts at different places in Manhattan. One day, George noticed Norma. Then another day, he noticed her again. Then he tried to make sure he was on the same ferry so the frequency of seeing one another would open a door for him to speak to her. Then one day he did.\nThe ripple effect of him noticing her all those years ago is hard to quantify, but fun to think about. Had he not said “hello,” my mom never would have met my dad because she wouldn’t exist. And neither would I, or any of my kids (except the awesome boy we adopted). My grandfather’s simple decision to say “hello” to a pretty girl set in motion so many beautiful outcomes—and many tragic ones too. That’s nothing compared to the decision Jacob makes in today’s passage.\nThe promised land is crumbling under the dry rot of a severe famine, and Jacob’s lost-and-found son Joseph has invited the family to move down to Egypt, where there would be food and a place for them to wait it out. The Lord told him, “Do not be afraid to go down to Egypt, for I will make you into a great nation there. I will go down with you to Egypt, and I will also bring you back” (Genesis 46:3–4). Talk about a loaded promise.\nPicture Jacob sending word to his clan to gather up their things. Picture them rallying for departure—the first clip-clop of a hoof headed south to cross the Sinai Peninsula like a locomotive making that first lurch forward, pulling an entire nation behind. They had no idea what would come of that journey.\nThis is what would happen: they would settle in Goshen and become the enslaved nation Moses would lead out hundreds of years later. They would wander in the wilderness for forty years, following the pillar of cloud by day and fire by night. They would see Moses coming down from the mountain, ablaze with the glory of God, carrying His law on stone tablets. They would cross the Jordan, take the promised land back, and from Jacob’s line, the Messiah would be born.\nSo much pivoted on the fulcrum of this decision to follow the Lord to an unknown land. So much would come of it. To the ordinary person living within the limits of this world, so many situations turn in a way that might seem hopeless. But, as Joseph would later say, what man intends for evil, the Lord uses for good (Genesis 50:20). Our God is never out of control.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day32.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 43:1-34, Genesis 44:1-34, Genesis 45:1-28, John 12:25, Philippians 2:5-11",
        "devo_title": "The Return to Egypt",
        "devo_summary": "\n                    \n                    In seventh grade, I told my mom that I didn’t think my dad loved me. His offense? He wouldn’t let me stay out past ten o’clock. I remember this moment because of the way my mom rose up with a fury like Galadriel’s when Frodo offered her the ring, which clearly let me know I’d crossed a line. I didn’t know how hard my dad worked, or how much he sacrificed for me. I couldn’t see my sin—not with any clarity, anyway.\nLife has a way of bringing clarity. Now that I have an adult relationship with my father, and now that I have children of my own, I understand better the depth of my father’s love. I needed an awakening. Today’s passage reads like an awakening to me.\nJoseph set his brothers up. There’s no other way to say it. He set them up. He hid his gold cup in young Benjamin’s saddlebag, and while his brothers were on their way home, he sent soldiers to chase them down and conduct a search of their belongings, knowing it would rattle them.\nWhy did Joseph do this? We’re not given any one reason, but when we read how the story unfolds, we see that his plan woke something up in them. When Joseph told his brothers he was going to make Benjamin his slave, they pleaded for Benjamin’s return—not for Benjamin’s sake but for their father’s. They told Joseph that their father loved the boy, and that he’d already lost his other favored son. Jacob told them that the other son this wife bore to him (Joseph himself) left and was probably torn apart by beasts. If he lost Benjamin, too, Jacob said, it would be the final beat of his grief-stricken heart (Genesis 44:29).\nAs the brothers pleaded for Benjamin’s return, they wept because of their father’s sorrow. This display of love for Jacob broke Joseph’s heart because it was a love he shared. This was when he revealed his true identity. And when the brothers recognized Joseph, they trembled, possibly because young men don’t often see the weight of their sins until they’re older. But now they could see the mess they made of their family, and they better understood what it cost.\nJoseph tells them to go bring their father. He wants them near. And isn’t it just like God to stir us awake to sins we didn’t have eyes to see when we were younger? But it’s also like God to tell us to draw near to Him while the restoration process takes place, which sometimes takes years.\nGod does not abandon us to our own spiritual poverty; He draws us to Himself. But in that process, He often mercifully decides to show us the depths of our need that we could not see when we were younger. When He does this, it is not because He is ruining us—it is because He is saving us.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day31.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 41:1-57, Genesis 42:1-38, 2 Corinthians 3:5, 1 Timothy 1:16",
        "devo_title": "Joseph Interprets Pharaoh’s Dreams",
        "devo_summary": "\n                    \n                    Do you presume that for every trouble you face, there should come an equal blessing? Have you tried to live by this math? In the words of Shakespeare’s King Lear, “That way madness lies.”\nIn many ways, western Christianity has come to regard struggle as incompatible with the life God intends for us. But when we look at people in the Bible—in both the Old Testament and the New—we see that their lives were full of trouble.\nThink about it. Adam was kicked out of the garden. Noah’s entire world was destroyed. Moses’s anger kept him from entering the promised land. David had an affair with his friend’s wife and then had his friend killed. Peter and Paul were both imprisoned and later martyred. John was exiled to Patmos. In this world, they all had trouble, and so shall we. And nowhere are we promised that our troubles in this life will be balanced with blessing.\nJoseph’s life is the story of one trouble after another. After he was sold into slavery by his jealous brothers, he came to be respected by his new master, Potiphar. But then Potiphar’s wife tried to seduce Joseph, and later claimed that he tried to rape her, which got Joseph thrown into prison.\nBut in prison, Joseph was found to have the ability to interpret dreams. So when Pharaoh began having nightmares, Joseph interpreted the king’s dreams, and in the process, ended up saving both Egypt and his own family from famine and ruin. As a result, Joseph earned both the respect and confidence of the Pharaoh, who made Joseph his second in command over all Egypt.\nAt this point, we might be tempted to say, “See. After all his trouble, things worked out.” But remember, Joseph’s exaltation in Egypt came at great personal cost. And because it did, his story frees us from the madness of trying to balance out all the bad things that happen in this world with the good.\nIn this world we will have both blessing and trouble. Jesus told us this (John 16:33). And trouble and blessing will not always appear to be in balance. That doesn’t matter. Joseph’s position of power in Egypt, as glorious as it was at the time, was never meant to last. And here is where we’re like Joseph; we are not meant to be prisoners of this world, nor are we to be her kings. We were made for another world—one built on the grace of God in Christ, which was preserved through both Joseph’s exaltation and his troubles.\nThis world is out of balance. But take heart. Christ has overcome the world.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day30.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 39:1-23, Genesis 40:1-23, Psalm 1:1-6, Psalm 25:14",
        "devo_title": "Joseph in Potiphar’s House",
        "devo_summary": "\n                    \n                    Joe was one of my best friends during my college years. He was a few years older than me. Our friendship didn’t begin until after he graduated, but as a high school freshman, I looked up to him when he was a senior. Joe came to faith in Christ after he graduated, which was the beginning of our friendship; we were part of the same church. He stood up at my wedding, and I at his.\nPeople loved Joe. They admired him. Joe was magnetic. Talented. Fun. Popular. Good at almost everything he set his hand to. When I read about Joseph in Genesis, I think of Joe. Here is a guy who just seemed to fall backward into blessing and favor. But then came his suffering. My friend Joe’s suffering was not being sold into slavery. His suffering was a cancer that took his life.\nBut what I saw in Joe, I also see in the story of Joseph—that even in the darkest, hardest times, the Lord was near. My friend’s last days showed a man who knew, loved, trusted, and rested in his Lord.\nJoseph in Genesis lives an incredibly complicated story of suffering and triumph, of landing on rock bottom only to rise to the top, of being cut off from his family to one day saving their lives. He had all these negative things going on: situations beyond his control, servitude he could not walk away from, people falsely accusing him of crimes that could cost him his life.\nI can only imagine what it would have been like living in Potiphar’s house. Joseph was there because he was sold into slavery. He was in a low position, but he rose from his lowly station to a place of prominence as a slave. But then he was brought low again, handed over to die by Potiphar’s lying seductress of a wife. In prison, he rose again as perhaps the only man who could bring peace to a Pharaoh tormented by dreams.\nThis roller coaster of a life would have broken most. Why didn’t it break Joseph? Because the Lord showed him kindness. The circumstances beyond his control did not dictate Joseph’s standing where it counted. The Lord was with him.\nWhen I think about my friend Joe fading under the power of cancer, there was still light in him that was never extinguished. The Lord was with him. The Lord showed him kindness.\nHow does any of this apply to us? When our faith is in Christ, the truest thing we can say about our proximity to God in any and every circumstance is that the Lord is with us. He shows us His kindness. How? He gives us His Holy Spirit. In the prison cells and chemo chairs and in the courts of false accusation, this is true: the Lord is with His people—sustaining us unto eternal life, come what may in this one.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day29.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 31:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize Genesis 31:13, Jacob’s reference to when God appeared to him in a dream.\nI am the God of Bethel, where you poured oil on the stone marker and made a solemn vow to me. —Genesis 31:13\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Lockscreen-Day28.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Isaiah 43:2",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nI will be with you\nwhen you pass through the waters,\nand when you pass through the rivers,\nthey will not overwhelm you.\nYou will not be scorched\nwhen you walk through the fire,\nand the flame will not burn you.\nIsaiah 43:2\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day27.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 38:1-30, Deuteronomy 25:5-10, 1 Timothy 5:8",
        "devo_title": "Judah and Tamar",
        "devo_summary": "\n                    \n                    When I was growing up, my mother loved watching soap operas. And I must admit, there were times when I watched them with her. Don’t hold that against me.\nSoap operas are TV shows that are often built around family drama and dynastic conquests. The most popular long-running shows manage to build decades-long story arcs around these families, with affairs and murders and business deals driving the storyline day-to-day, week-to-week, and even year after year. To be honest, if you had shared with me some of the stories we’ve encountered here in the book of Genesis without telling me their origin, I’d be inclined to believe they were part of some television soap opera’s extended universe. But no—these stories are found right here in the pages of Scripture.\nThat Scripture contains these raw and unfiltered dramas is beautiful; we’re exposed to the depths of human sin, and oftentimes, are given a glimpse into our own hearts as we watch others battle with the brokenness sin brings to God’s good creation. Just this week, we have encountered numerous stories of brokenness, but have also seen the goodness of God as He shows grace and mercy to sinners. Most importantly, we see that God’s purposes are not thwarted, even by our worst sins.\nIn today’s story, there is yet another twist of family tragedy. Jacob’s son, Er, is killed by God for his rampant wickedness. As was the custom, one of his brothers was required to marry his widow and have a child with her, to ensure that the deceased brother’s name was passed along. So Er’s brother, Onan, steps in, but his own wickedness leads to his death as well. Judah then bans Tamar from marrying another son, Shelah, because he is afraid of losing another son. By withholding his son from marrying Tamar, he deprived her of the protection she deserved, according to the law, and put his son’s own inheritance in jeopardy by not allowing Tamar to continue its passage to a son.\nIn the end, Judah realizes he is guilty, confessing that his sin is greater than Tamar’s (Genesis 38:26), because he denied her a husband. This is the beginning of his repentance.\nWe are all accountable for our sins. Our sins condemn us. We cannot hide from them, and we certainly cannot hide them from God. Instead of hiding our sins, we should turn to Christ, our Great High Priest and mediator, who stands ready to intercede for us. Our Father has promised to forgive us through Christ. And He has sent the Holy Spirit to seal us and empower us to live in light of this truth. May we not hide from Him, but boldly go before His throne in confession, that we may receive the grace and mercy offered to us.\nWritten by Brandon Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/01/HRT-Genesis2020-Instagram-Day26-Text.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 37:1-36, Job 5:2, Psalm 77:2",
        "devo_title": "Joseph Is Sold into Slavery",
        "devo_summary": "\n                    \n                    My little brother and I have fought many battles. Because he’s eight years younger than me, most of the battles weren’t physical. Mostly, he annoyed me, and I yelled at him. I would purposely annihilate him in sports, video games, and in any other way that my older-brother intellect and physical prowess would allow. Of course, over time, he was able to grow and adjust to my overpowering, and it eventually made him stronger than me. Growing into his ability to beat me at the same video games he once lost was, in his own mind, one of his greatest accomplishments in life. And as his older brother, it pained me to lose to him—a reality he readily rubbed in every chance he got.\nJoseph reminds me of my little brother. As he rose to the relatively inconsequential ranks of video game victory, my jealousy and his pride brought consistent conflict into our relationship. After all, nobody likes to lose to their younger brother. However, for Joseph’s brothers, the stakes were much higher than childhood rivalries. It didn’t go over very well when Joseph informed them that, according to his dream, they would one day all bow down to him. While I can relate to why this angered his older brothers, it is clear that their reaction is prideful, selfish, and downright evil. Their disposition to destroy their brother rather than serve him would haunt them for years, as we will see as Genesis progresses.\nNo doubt, Joseph’s brothers responded sinfully. It would be easy for us to point the finger at them and think of how unimaginable it would be to sell our own siblings into slavery, regardless of how awful they could’ve been to us. Their actions were sinful, and God would deal with them. But we also need to look in the mirror at our inclination toward retaliation.\nWhether with siblings or spouses or neighbors or co-workers, all of us at times despise others, particularly when they win an argument, disrupt our comfort and control, or obtain something we want. Though we may keep most of our hatred beneath the surface, in our hearts we can be tempted to write them off. If left unchecked, the ones we’re supposed to love can become as good as dead in our eyes.\nWhen we look to Christ, we see that no one is expendable. Indeed, our sins condemn us and separate us from God. But He doesn’t send us into spiritual slavery; we choose slavery, and yet all the while, He pursues us. Joseph’s brothers sent him away against his will, but Jesus came to save us despite our own willful rejection of Him. May we respond to Him with gratitude and allow that gratitude to produce empathy in our hearts for those around us, even those whose sin can sometimes hurt us or make us uncomfortable.\nWritten by Brandon Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day25.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 34:1-31, Genesis 35:1-29, Genesis 36:1-43, Psalm 116:1-2, Isaiah 43:2",
        "devo_title": "Return to Bethel",
        "devo_summary": "\n                    \n                    As we have continued reading the story of Jacob this week, it’s been obvious that Jacob’s pursuit of God is wrought with family strife, political dealings, and at times, a blatant lack of concern for the safety and protection of the women in his midst. Indeed, this story begins with Jacob and Rachel’s daughter, Dinah, being raped. Dinah’s situation is much like her own mother’s—she’s the victim of a tangled web of sexual sin and power plays.\nIt is worth reminding ourselves again that Genesis is filled with theological truths and wisdom, as is all of Scripture; however, it’s also a historical narrative, so the events are a historical report of Jacob’s family. Nowhere do we see God approve of the obvious sin being committed by people; rather, we see God working within a messy situation, driving the story forward as He unfolds His ultimate plan of redemption in Christ.\nIn fact, the first time we see God speak in this section, He tells Jacob to build an altar, purify himself, and abandon false gods and idols. Jacob obeys God and settles in Bethel (“house of God”), where God changes his name to Israel (“God contends,” likely in relation to his earlier wrestling with God). Then, God reminds him that he is still heir to God’s promises by telling him to “be fruitful and multiply,” a command He gave to Adam, Noah, and Abraham (Genesis 35:11). God’s plan to fill the earth with God-worshipers wasn’t eradicated by sin in the garden, and it wouldn’t be eradicated by the sin in Jacob’s family.\nWe might be tempted to overlook Esau’s genealogy in Chapter 36 as a bit of historical minutiae or merely a transition to the next part of the story, but it’s actually a capstone to the saga between Jacob and his brother Esau. Though Esau was by birth the heir to the covenant God made with Abraham, Jacob was ultimately the heir to the promise. So when we see Esau settled in another land, the break between he and Jacob is obvious—Esau is blessed by God in many ways, but it is through Jacob that the ultimate covenantal promise would be fulfilled.\nGod’s chosen people would come through Israel and be established as His holy nation. Though God loves all people, He made particular covenants with particular people to create a missional center for His work in the world. This is no different for us in many ways—Jesus calls His Church to carry the gospel to the ends of the earth. Like Jacob before us, we acknowledge that God is with us wherever we go (Genesis 35:3). He loves us, protects us, and calls us to worship Him even in the midst of sinful chaos. May we respond to His call and lean on His covenant.\nWritten by Brandon Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day24.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 31:1-55, Genesis 32:1-32, Genesis 33:1-20, Hosea 12:3-4",
        "devo_title": "Jacob Prepares to Meet Esau",
        "devo_summary": "\n                    \n                    As we saw in our story yesterday, Jacob has been wrapped up in some shady dealings. As he pursued Rachel as his wife, her father Laban tricked him by sending Leah to him instead. This instigated a decades-long game of chess, in which Laban continually took advantage of Jacob and used his own daughters as pawns.\nIt is worth noting that we are not being taught that having two wives is a commendable practice. Rather, we are given a glimpse of a real story from long ago that highlights the rampant wickedness that had come into the world back in Genesis 3. God never approves of the events in the story; rather, He shows mercy to a group of fallen people even in the midst of brokenness. In light of that, we should acknowledge with Jacob that God showed His boundless grace by protecting Jacob and providing for the women involved from the extent of Laban’s evil ways.\nAfter twenty years of service to Laban, Jacob is rightly concerned about cutting bait. He is clear that he wants to make a deal with Laban and move on with his life. However, when he leaves, he is faced with another complication: his brother Esau, who he tricked a few chapters before (Genesis 25), has the power and resources to destroy him and his family. Jaccob is afraid, so he cries out to God for help, acknowledging God’s goodness to him, and begging for that protection to continue. Much to Jacob’s surprise, God graces him with a brother who is warm and compassionate toward him. Once again, he takes note of how God has dealt with him, and he thanks Him.\nJacob’s story to this point is a repeated reminder of God’s mercy and grace. After sin entered the world in Genesis 3, God could have sent down bolts of lightning and destroyed everything. He could’ve flooded the earth and everyone on it, rather than sparing Noah and his family. And yet over and over again, He deals with His people kindly, meeting them where they are and dragging them out of the mire.\nOur Father in heaven always welcomes His prodigal children home and even leaves the porch to run out and meet them (Luke 15:11–32). Through Jesus, we see mercy and grace on ultimate display. In the sending of the Holy Spirit, we are adopted as children and Jesus is warm and compassionate toward us. Like Jacob, may we respond by saying, “I am unworthy of all the kindness and faithfulness you have shown your servant” (Genesis 32:10).\nWritten by Brandon Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day23.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 29:1-35, Genesis 30:1-43, Deuteronomy 21:15-17, Psalm 63:1-4",
        "devo_title": "Jacob Deceived",
        "devo_summary": "\n                    \n                    My wife and I dated for three (long) years before we married. Due to family and life circumstances, we had to wait about two years longer than we’d hoped to finally become husband and wife. We waited, sometimes patiently and sometimes impatiently, for the day we could finally enter into the covenant of marriage together. Even in our dating, we pursued God together and sought to be faithful to one another, but it wasn’t the same. When our wedding day finally arrived, we stood face-to-face and promised to love one another faithfully and unconditionally. By God’s grace, this is still true nearly eight years later. My deepest desire, though tainted by sin, is always to love her, care for her, protect her, and serve her.\nIn today’s reading, the relationships between man and wife include extenuating family circumstances, making my own story seem almost neat and tidy by comparison. In the ancient near eastern culture in which Jacob’s story takes place, we see the cultural background rather clearly. There were customs and stipulations related to marriage, and sometimes those rules come with unintended consequences and outright trickery. Laban quite clearly uses his own daughters as chess pieces to advance his own selfish desire to acquire wealth and free labor.\nIt’s doubtful anyone would confuse this story with a marriage manual. Jacob’s love triangle with Rachel and Leah (and the insertion of Zilpah and Bilhah) is messy indeed—certainly not a pattern any of us would endeavor to follow today. Interestingly, God’s only clear interactions in this story occur when He looks upon the situation with concern and pity for the women involved. Our God is a God of life and justice, and He is clearly moved to compassion by the barrenness of the women and the way they are used as pawns in Laban’s game.\nJacob’s love for Rachel is clear by the lengths he is willing to go in order to marry her, but it is also clearly far from perfect and not without complications. However, God’s love for those involved in this story shows us a glimpse of how much He loves each one of us—fully, completely, and without complication. By sending His Son to save us, the Father has proven that He will go to even greater lengths to reveal Himself to us. The cross reminds us that as His Church and His Bride, we should not be confused by His willingness to sacrifice Himself for us.\nBy the power of the Holy Spirit, we are joined to Christ and look forward to the day when we will gather around His table at the marriage supper of the Lamb (Revelation 19:7–10). There, we will know fully the extent of the unbreakable covenant we have made with him, and that he has made with us. We will know without a doubt that we are not pawns in some supernatural game of chess, but that we are pursued, loved, and cared for by the Creator of the universe. May we rest in that promise today.\nWritten by Brandon Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day22.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 26:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse spoken by God to Isaac, reassuring Isaac of God’s presence with him.\n“I am the God of your father Abraham. Do not be afraid, for I am with you.”\n—Genesis 26:24\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Lockscreen-Day21.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Psalm 37:23-24",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nA person’s steps are established by the LORD,\nand he takes pleasure in his way.\nThough he falls, he will not be overwhelmed,\nbecause the LORD supports him with his hand.\nPsalm 37:23–24\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day20.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 27:1-46, Genesis 28:1-22, Psalm 121:5-8",
        "devo_title": "The Stolen Blessing",
        "devo_summary": "\n                    \n                    If you have never seen an episode of Chopped, you have to check it out. Contestants are given a basket of random food items and are expected to make a five-star dish using all of it. What in the world would you make with dried tarantulas, cherry cola sorbet, and marzipan fruit? Alpaca hot dogs, sauerkraut, and carrot ketchup? The baskets are disasters, but somehow, these professional chefs make something edible and, supposedly, somewhat delicious.\nWhen you read the story of Jacob, you are reading a Chopped basket in story form. Deceit, betrayal, abuse, and theft are what makes up so much of Jacob’s life. But God isn’t stumped by Jacob’s failures. He knows how to turn this basket of Jacob’s doings around.\nAfter stealing the blessing from Esau while wearing an Esau costume, of sorts, Jacob heads out to find a wife—to keep the promise of God afloat in this sin-torn world. Jacob nestles in for the night, and God gives him a vision: “A stairway was set on the ground with its top reaching the sky, and God’s angels were going up and down on it” (Genesis 28:12). As Jacob sees this stairway, God tells him, “I am the God of Abraham and Isaac, and I will be your God too. I will give you more heirs than there is dust on this planet. Every tribe and ethnicity will be blessed through you” (v.15). Consider that. Through him? The liar? The cheat? The guy who was just wearing an Esau costume to deceive his blind father? Yes, him. Why? This is how grace works.\nOur lives are Chopped baskets too. We are an amalgam of bad decisions, wrong turns, and failed cover-ups. But God loves to save sinners. Jesus was nailed to a cross for cheats. He rose from the dead for the kind of people that people love to hate. We are all massive failures apart from the grace of God in Christ the Lord. And just like He told Jacob, He tells us, “I am with you always. I will never leave you or turn my back on you, even till the final trumpet blares.” Jacob didn’t deserve this promise, and neither do we. That’s what makes grace, well, grace. Like Jacob, Jesus takes our pasts, our sins, our failures, and He gives us a glorious future with Him. Hallelujah, praise the Lord!\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day19.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 25:19-34, Genesis 26:1-35, Hebrews 12:14-17, James 3:13-18",
        "devo_title": "The Birth of Jacob and Esau",
        "devo_summary": "\n                    \n                    Keep your friends close and your enemies closer. Okay, but what if both are your brother? At this point in Genesis, the story is hitting a rough patch. God has delivered on His promises for offspring to Abraham and Sarah, Isaac and Rebekah. As we meet the third generation of the promise to Abraham, it’s like we are entering the third full-round of Jenga; things are getting a little wobbly.\nAs heirs to the promise and the twin boys in Rebekah’s womb, Jacob and Esau are already at odds with one another, and Rebekah can sense it. As a model of wisdom, she goes to God for help. “And the LORD said to her: Two nations are in your womb; two peoples will come from you and be separated. One people will be stronger than the other, and the older will serve the younger” (Genesis 25:23). God tells her something that is both heart-breaking and heart-fortifying. Her sons will be at odds with each other, but this will not stop God’s promises; God will establish His holy people and keep His word, even though it will take the older brother serving the younger.\nIf the story of Abraham were solely in the hands of his family, the Bible might not have been nearly as long—maybe only be about half of Genesis. But the story is in God’s hands. Our stories are in God’s hands, too, so we must resist the urge to settle for the quick fixes in our own stories, like Esau did; he wanted a quick bite more than he wanted his long-lasting birthright.\nThe writer of Hebrews warns us to pursue holiness and to not treat the promises and provisions of God as if they’re something cheap, common, and easily consumable—something the equivalent of powdered donuts. We should treasure the promises of God and delight in the ways He is working in our lives.\nThe crucified and risen Lord Jesus bought this life for us; our lives are no longer our own, and as Scripture tells us, it is no longer you who live but Christ who lives in you (Galatians 2:20). If it were not for Christ, we would all go the way of Esau, trading down our joys and God’s best for us. As C.S. Lewis said, “We are far too easily pleased” with the things of this world. So protect your joy. Evaluate your loves. Count your many blessings, and remember what Christ has done for you.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/01/HRT-Genesis2020-Instagram-Day18-Text.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 24:1-67, Genesis 25:1-18, Psalm 37:23-24, Lamentations 3:22-23",
        "devo_title": "A Wife for Isaac",
        "devo_summary": "\n                    \n                    I’m sure you’ve heard the phrase, “The Lord works in mysterious ways.” Today’s reading highlights this reality. When William Cowper wrote the hymn, “God Moves in a Mysterious Way,” I doubt he was thinking about camels, a watering hole, engagements, and arranging a marriage. But it’s true. God often works in bizarre and beautiful ways.\nIsaac finding a wife isn’t just a neat story; it is crucial to God’s promise to Abraham. Grandkids are a part of the plan. For Abraham’s descendants to outnumber the sands, Isaac has to get married. For the Messiah to be born and redeem His wife, the Church, Isaac has to find a wife. Don’t forget to read these narratives with an eye on the meta-narrative of Genesis—of the whole Bible!—that a descendant of Abraham would be born to crush the serpent and save people from the sins and reign forever on the throne (Genesis 3:15). When you see the engagement of Isaac and Rebekah in light of the story of Christ and His Church, it all makes more sense.\nThe oddness of looking for a wife in watering camels is nothing compared to the faithful foolishness of looking for a Savior with water and blood shooting from His side as He hangs from a Roman cross. “A man who finds a wife finds a good thing and obtains favor from the LORD” (Proverbs 18:22). A man who finds an empty tomb obtains salvation from the Lord, too.\nAbraham’s servant was looking for God’s kindness (Genesis 24:14). When he saw it in Rebekah, he knelt low and worshiped God. Does God’s kindness lead you to humbly worship Him? When is the last time God’s provision, God looking out for you, God displaying His care for you led you to kneel low? Maybe we need to recover the physical demonstration of our spiritual affections. Perhaps more than a quick prayer of, “Thanks, God,” is in order. The Lord of all deservers more than a spiritual fist bump. Get low. Let’s humble ourselves before the Holy God, whose kindness is poured out on us in mysterious, marvelous, matchless ways.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day17.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 22:1-24, Genesis 23:1-20, Isaiah 54:1, Hebrews 11:8-12",
        "devo_title": "Isaac Offered Up",
        "devo_summary": "\n                    \n                    When is the last time you made a real sacrifice for someone? Maybe you gave up a seat on the bus, or perhaps you let your kid have the center cinnamon roll. But let’s get real—these are very small things. And yet, we struggle to make these sacrifices. How many times have you lobbied for your Spotify playlist? Driver’s choice, sorry everybody! These aren’t sacrifices, though. Maybe inconveniences. Maybe a temporary foregoing of our preferences. But what Abraham went through on the mountain with Isaac is a supernatural dynamic of faith.\nImagine being Abraham. Desert beard and all. First, the God you’ve just come to know told you to let goods and kindred go and to follow Him to a new land (Genesis 12:1). You did it. Imperfectly, but still, you did it. God then promises you a baby boy, and your wife laughs herself onto the floor (18:12–15). Soon after, a baby’s cry fills your tent. You watch your son learn to walk, speak, and turn into a young man—and then God tells you to put your son on the altar. Your beloved son, the gift from this God you’ve come to know and follow.\nSomehow, you do it. You trust God.\nYou tell your boy that, together, you must head up the mountain to worship God. You tighten the wood on his back. You try to hide the tears crowding the corners of your eyes. You can’t bear hearing your son ask about the sacrifice. “God will provide,” you tell him (22:8)—and you keep telling yourself He will too.\nYour grip on the knife makes your pulse skyrocket, your hands sweat, and your stomach sour. Your lungs can’t get enough air as you close your eyes, unable to look at the son whom you love, raise the blade, and then hear the voice of God calling out to you and telling you to Stop!\nGod points out a ram to take the boy’s place. You untie your boy, embrace him, haul the ram over, and worship the Lord your God because He provided a substitutionary sacrifice of His own (v.14).\nAbraham believed God. He believed that God would raise Isaac from the dead because Abraham held onto God’s promise that his descendants would outnumber the stars in the sky (Hebrews 11:9). Isaac had to live. And God provided another way.\nDo you see how God has provided for you? His Son, Jesus of Nazareth, died in your place for your sins. Do you see how the risen Christ loves and leads you today? What about the Holy Spirit helping you kill sin and grow in holiness? Your church community? The Bible you read today? Brothers, remember that Abraham didn’t rename the place, “The Lord might provide” but “the Lord will provide” (v.14, emphasis mine). He did provide, and He will again. Just keep your eye on the clouds. He’s coming soon.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day16.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 20:1-18, Genesis 21:1-34, Proverbs 21:1, 1 John 1:9",
        "devo_title": "The Birth of Isaac",
        "devo_summary": "\n                    \n                    Airlines lie all the time. Delayed flights, lost bags, fine print shenanigans—they make promises, declarations, expectations, and fail to follow through. Doctors too. They don’t lose your bags, but they make you wait and wait past your agreed-upon appointment time. Restaurants lie too. Sure, the server at the swanky Mexican-Polynesian fusion restaurant said the food would be right out—“in a couple of minutes,” he assures you. Twenty minutes later the frustration of still not having your meal is multiplied by your cranky kids, which basically equals a disaster. So many people make promises and fumble the ball when it’s crunch time. We all do.\nGod always keeps His word. Airlines are subject to weather and human error. Doctors have to work at the speed of their patients’ sickness. Servers are at the mercy of the kitchen. Everyone’s word exists under the influence of outside factors—everyone except God’s. The Father’s word is not no subject to weather, economics, human health, or anything at all under creation.\nGod promised Sarah and Abraham that they would have a son, and a year later, it happens. Isaac is born. It doesn’t matter that Sarah and Abraham are way beyond child-bearing years; God keeps His promise. Even though Abraham’s body, according to the writer of Hebrews, was as good as dead (Hebrews 11:12)—God remained faithful to His word.\nNothing can override the promises of God. Whether a promise made to Sarah in the open-air wilderness, or a promise made to you as you read Scripture and sip coffee in an air-conditioned cafe, know that God will keep the promises written in His Word. The Bible is full of God’s promises to His people, proclamations of trust that can never be delayed or undone.\nDo you remember what the apostle Paul says about all of the promises of God? “For every one of God’s promises is ‘Yes’ in him. Therefore, through him we also say ‘Amen’ to the glory of God” (2 Corinthians 1:20). Every promise is a Christo-centric, “Yes!” Jesus is the answer.\nWhen God promises that whoever calls on the name of the Lord Jesus will be saved (Romans 10:9–10), He means it. When Jesus said to come to Him to find rest for your weary soul (Matthew 11:28–30), He delivers. When Jesus said He would die for the sins of humanity, rise again from the dead, and welcome sinners like us into His kingdom, God always keeps His Word.\nWhat He does not promise is to meet our expectations—don’t get that twisted—but then again, His ways and thoughts are so much better than what we could ever ask of Him or imagine possible. But He does keep the promises He has made to us. From Isaac to Immanuel, and forgiveness to freedom from sin, Yahweh gives His “Yes!” in Yeshua.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day15.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 15:6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse about Abram’s trust in the Lord—a reminder that our salvation comes by faith in God and His Son, Jesus Christ.\nAbram believed the LORD, and he credited it to him as righteousness. \n—Genesis 15:6\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Lockscreen-Day14.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Galatians 3:27-29",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor those of you who were baptized into Christ have been clothed with Christ. There is no Jew or Greek, slave or free, male and female; since you are all one in Christ Jesus. And if you belong to Christ, then you are Abraham’s seed, heirs according to the promise.\nGalatians 3:27–29\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day13.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 18:22-33, Genesis 19:1-38, Ezekiel 16:49-50, Romans 1:18-25",
        "devo_title": "Judgment on Sodom and Gomorrah",
        "devo_summary": "\n                    \n                    There are passages that part of me wishes weren’t in the Bible. God’s judgment on Sodom and Gomorrah is among them. Every time I read it, it makes me uncomfortable… which is probably the point. The way the Bible describes the sinfulness of the people in Sodom and Gomorrah should terrify us. Human sin and pride is ugly.\nThat ugliness is on full display here, but so is God’s simple response to it: “They were haughty and did detestable acts before me, so I removed them when I saw this” (Ezekiel 16:50). He would completely destroy them, raining burning sulfur, demolishing “the entire plain, all the inhabitants of the cities, and whatever grew on the ground” (Genesis 19:24–25).\nIf we ever wondered how God feels about sin, all we need to do is look to this event.\nBut here’s what makes this more uncomfortable for me: the Bible takes this example and takes it to another level. In fact, it seems that the ugliness of Sodom and Gomorrah’s sin is merely a snapshot of what is going on in the heart of every human being. Every single one of us is just as prone to sinful actions. All of us “suppress the truth” in our hearts and by our unrighteousness (Romans 1:18). All of us have failed to glorify God and show Him gratitude. All of us have “exchanged the truth of God for a lie,” and so we are all without excuse before Him (vv.21,25).\nHopeless. Helpless. Doomed.\nBut what we shouldn’t miss in all of this is the compassion of God. God hates sin. He hates pride. But even in the case of Sodom and Gomorrah, He said, “If I find fifty righteous people in the city of Sodom, I will spare the whole place for their sake” (Genesis 18:26). Just as the awfulness of Sodom and Gomorrah’s evil is a snapshot of a larger reality, so, too, is this snapshot of God’s mercy—and in the gospel we see this mercy on full display. In Sodom, there were none that were righteous, not even one. In the entire world, there are none who are righteous, not even one (Romans 3:10). But Jesus came to make the unrighteous righteous by crediting His perfect righteousness to anyone who trusts in Him.\nSo despite the darkness, this passage, like so many others in the life of Abraham, should give us hope. God hates sin, and He does not ignore it. He will judge it all, including the evil that we see in the world right now. But for the sake of those He has declared righteous, He is waiting, so that as many as possible might turn from their sin and put their trust in Him.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day12.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 17:1-27, Genesis 18:1-21, Galatians 4:21-31, Galatians 5:1-6",
        "devo_title": "Covenant Circumcision",
        "devo_summary": "\n                    \n                    What would you say is the most hopeless verse in Genesis? There are so many to choose from, so it’s not like it’s an easy decision. But no matter which you choose, I think one that should be among them comes in Genesis 18, when Abraham received three visitors who once again swore that he and Sarah would have a child. Hearing this, “she laughed to herself: ‘After I am worn out and my lord is old, will I have delight?’” (v.12).\nWhenever I read this, there is so much anguish that comes through. She’s too old, too “worn out” to have a child. Pure, perfect hopelessness (if it isn’t contradictory to say). But what is at the root of this hopelessness? She wanted a child, wanted this promise to be true. But Sarah was a realist. She looked at the situation from her perspective. She was almost 100 years old; far too old to have a child. She and Abraham had missed out. It was too late. So, the realist became the hopeless.\nAnd if God’s promises depended on ordinary means, she would have been right.\nBut God said to her, and to us, “Is anything impossible for the LORD?” (Genesis 18:14). Could the one who made everything, who spoke all of creation into existence with a word, really be incapable of allowing a child to be born to parents “too old” to have children? Could the all-powerful God of the universe really be unable to do the impossible?\nAre we like Sarah in this regard? How often do we assume God is incapable of doing what He says He will do—not what we think He should do, but what He actually says in Scripture—and become hopeless when we don’t see it happening? How often do we take God’s promises and turn them into commands for ourselves, so that we put ourselves under the constraints of the Law with its old way of thinking instead of pursuing freedom in Christ? If it’s true that “for freedom, Christ set us free,” why do we submit to “a yoke of slavery”? (Galatians 5:1).\nBecause we’ve been taught that what seems too good to be true usually is. We’ve been trained from birth to be realists, to be hopeless. Somewhere in the depths of our hearts, we don’t really believe that all things are possible for God, so we go a step further and assume nothing is possible for God. But God wants us to see that the opposite is true. Nothing is impossible for Him. All things are possible for Him and with Him. And if we had any doubt, all we need to do is look a year down the road in Abraham and Sarah’s story, to the birth of Isaac, where Sarah laughs once more, but with joy instead of despair (Genesis 21:1–6), and her realism is replaced with rejoicing.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day11.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 15:1-21, Genesis 16:1-16, Romans 4:1-5, Romans 4:9-25, Galatians 3:15-18, Galatians 3:27-29, Galatians 4:1-7",
        "devo_title": "The Abrahamic Covenant",
        "devo_summary": "\n                    \n                    I think one of the worst things we can teach one another is to believe in ourselves. I’m not talking about having appropriate self-confidence, I am talking about encouraging each other to live as though everything depends on us. That seems pretty foolhardy, if not downright prideful, doesn’t it?\nThe more I dig into the major themes of Scripture, and how God began to reveal His plan to rescue and redeem the world, the more I see that come through, especially in the life of Abram. Many of us know the famous line in response to God once again promising that Abram would have a son, “Abram believed the LORD, and he credited it to him as righteousness” (Genesis 15:6). And many of us also know what happened after: Abram believed God would keep His promise and give him an heir, but he also faltered, forgetting what God had told him earlier, words that were foundational to his faith:\n“Do not be afraid, Abram. I am your shield; your reward will be very great” (vv.1–2).\nBut Abram was afraid. His wife Sarai was afraid too. And out of their fear, they acted arrogantly. They acted as though God’s plan depended on them and on their actions, and so they did what was right in their own eyes, and it led to disaster—as it always does.\nThis is why I fear encouraging anyone to believe in themselves. When we put our trust in our own abilities, we wind up creating a giant mess. This is so much of what Paul wanted to get across to the Galatian and Roman churches, and to us as well. We cannot forget that our standing before God doesn’t come from our attempts to make it happen; we can’t earn our way into redemption (Romans 4:1–5). Redemption is built upon faith in Jesus as the One who God’s covenant pointed to: the seed of Abraham, the Son through whom Abraham would have may descendents. And by faith, we are brought into Abraham’s family “according to the promise” (Galatians 3:27).\nAll of it comes from one place and one place alone: faith in the one who said to Abram, “Do not be afraid, Abram. I am your shield; your reward will be very great” (Genesis 15:1–2). Basically, God said, “Believe me. Trust me. I will do what I said I will do.” Like Abram, we are all tempted to doubt this. But if the gospel is true, we don’t need to be afraid. We don’t need to take our salvation into our own hands. We need to believe, to trust that God is our shield, and live out of that trust. And when we do, the reward is great indeed.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day10.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 12:10-20, Genesis 13:1-18, Genesis 14:1-24, Hebrews 7:11-22",
        "devo_title": "Abram and Lot",
        "devo_summary": "\n                    \n                    I always get weirded out when I see people paint a picture of Abram as a man solely of great virtue and integrity. Actually, I get weirded out whenever I see this happen with any person in Scripture. Not because he, or any of those we call “heroes” of the faith (Hebrews 11), lacks virtuous qualities, but because I believe the Bible wants us to remember that the heroes of the faith were, more or less, goobers like the rest of us.\nAbram, to me, has always been the perfect example of this. When God made His promise to bless him and make a great nation from his descendents (Genesis 12:2), it wasn’t because Abram was perfect. In fact, no reason is given for why Abram—not someone else, say, his neighbor—is chosen by God. If anything, we’re left with questions about his chosenness, because what did Abram do almost immediately after receiving God’s promise? He lied about his wife, Sarai, claiming she was his sister, and gave her to Pharaoh in exchange for safety in Egypt (vv.10–20), a mistake he repeated several years later with King Abimelech (Genesis 20:2).\nBut what always gets me is how, despite all this, Melchizedek, the mysterious priest Abram met on the way to rescue Lot, could say, “Abram is blessed by God Most High, Creator of heaven and earth” (Genesis 14:19). He wasn’t blessed because of his character or integrity. He wasn’t blessed because he deserved it. He was blessed because God Most High chose to bless him. Abram was a goober, but God blessed him because He wanted to bless him.\nI need to remember this because it is true for me also. I am not blessed by God because I am better or more faithful or whatever we’re all tempted to think about ourselves (or others, for that matter) at times. I am blessed because God has chosen to bless me. And I know that I do not have to worry about Him changing His mind because the blessing He has given me has been guaranteed by another priest, a greater priest who was like Melchizedek (Hebrews 7:15–22): Jesus, the one who guaranteed His blessing to us by faith in His death and resurrection.\nYes, God blesses goobers like Abram. He blesses goobers like you and me too.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day9.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 11:1-32, Genesis 12:1-9, Psalm 2:1-12, Luke 1:51",
        "devo_title": "The Tower of Babel",
        "devo_summary": "\n                    \n                    One of the things I love about good storytelling is how certain themes carry throughout a narrative. Most stories track with themes like hope, love, and sacrifice—you can see them in everything from Star Wars to Harry Potter to and everything in between). They run throughout the Bible, too, though they aren’t the only themes. One I always see exploding off the pages of Genesis is the danger of pride, specifically in God’s response to it.\nThink about the incident in Babel, for instance. All of humanity united as one, all able to speak the same language and understand one another perfectly—it’s the stuff that utopian fantasies (and Star Trek) are made of. However, what united them was their arrogance and rebellion against God (Genesis 11:4–5). In response, God changed their languages and scattered them, which resulted in them breaking apart into many people groups, no longer able to be united in their false worship. This theme is picked up again in the Book of Psalms:\n“Why do the nations rage and the peoples plot in vain? \nThe kings of the earth take their stand, \nand the rulers conspire together against \nthe LORD and his Anointed One” (Psalm 2:1–2).\nAnd when Mary sang her Magnificat (Luke 1:51), she praised God for how He “scattered the proud because of the thoughts of their hearts,” which is something we tend to gloss over around Christmastime when we read this passage.\nBut like so many other examples of good storytelling, the themes in Scripture don’t standalone. Yes, God despises pride, but His judgment of it is accompanied by something else—a promise, one of blessing and hope. This is powerfully reflected in God’s words to Abram in Genesis 12: “I will make you into a great nation, I will bless you, I will make your name great, and you will be a blessing.” What’s so incredible about this promise, though, is that it wasn’t made to just one man, but to a man who becomes a family, which became a great nation, which then became a family of people from all nations blessing the whole world.\nHow?\nBy faith in one Man, Jesus Christ, who lived and died and now lives again for us. He took God’s judgment of our pride upon Himself, and in exchange, blessed us with His perfection its place. Jesus undoes the curse of Babel, and brings people from all nations and all languages and all backgrounds together as one, united not in their pride, but in worship of God.\nWritten by Aaron Armstrong\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day8.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 1:31",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Genesis, a declaration of God’s satisfaction with the work He accomplished while creating the world.\nGod saw all that He had made, and it was very good indeed. \n—Genesis 1:31a\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Lockscreen-Day7.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Isaiah 54:10",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“‘Though the mountains move\nand the hills shake,\nmy love will not be removed from you\nand my covenant of peace will not be shaken,’\nsays your compassionate LORD.”\nIsaiah 54:10\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day6.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 9:1-29, Genesis 10:1-32, Isaiah 54:9-10, Hebrews 11:7",
        "devo_title": "God’s Covenant with Noah",
        "devo_summary": "\n                    \n                    “Be fruitful and multiply and fill the earth” (Genesis 9:1). These words should seem familiar. Very familiar. Here in Genesis 9, God speaks them to Noah and his sons, but He issued the same commands to Adam and Eve in Genesis 1:28. Now that the waters of the great flood have receded, life is going to start again. It’s a new beginning. A new creation, so to speak. And so, God gives the new first family their marching orders, just the same as before.\nWhat follows in this passage is nothing short of heartbreaking. Noah tends a garden, as Adam did before him, but this garden is a vineyard, and Noah gets drunk on the wine it produces. Then, one of Noah’s sons does something so horrific, we’re not entirely sure what it is. The Bible simply tells us Ham “saw his father naked” (Genesis 9:22).\nIt may be that Ham wanted to multiply the shame of his father, since he went and “told his two brothers.” Or it could be that “saw his father naked” is a euphemism for an indecent sexual act committed by Ham against his father. One more possibility is that Noah’s “nakedness” is a reference to Noah’s wife (who is unnamed in the text). There’s biblical evidence for this sort of language. A more literal reading of Leviticus 18:7 uses a husband’s “nakedness” to refer to his wife’s exposed body, rather than his own. She belongs to him, just as he belongs to her (see Genesis 2:23). In this scenario, Ham committed an indecent sexual act with his own mother while Noah was inebriated and unable to stop him. He would have done this in order to usurp his father as leader of the family. But regardless of which understanding is correct, the headline is the same: humanity had been given a fresh start, only to squander it in sin.\nWhat I find amazing when I read this passage is not the depths of human depravity. (I live my own brand each and every day.) Rather, it’s that God knew this would happen. He knew it before the rain stopped falling from the sky and the ark came to rest in Ararat. He knew it before He told Noah to build a boat in the first place. He knew it before Adam and Even had first invited sin into the world. He even knew it before time began. Yet, God carved a path of salvation for humanity all the same—for Adam and Eve, Noah and Ham, and all of us who are like them in more ways than we’d like to remember.\nIn his memoir All Is Grace, the late Brennan Manning wrote, “God loves you unconditionally, as you are and not as you should be, because nobody is as they should be.” If we really believed God loved us like this—the way He has shown us countless times in Scripture and in our lives—the world would be a much different place, don’t you think? We might actually start to behave as we “should be” in response to God’s love, rather than as a misguided mechanism to earn it. We might all become a lot more like Jesus. And so, as we read this dark passage about grotesque sin being committed in the shadow of the world’s first second chance, the question before all of us is this: Do you believe God loves you? How you answer makes all the difference in the world.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day5.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 6:1-22, Genesis 7:1-24, Genesis 8:1-22, 1 Peter 3:18-22",
        "devo_title": "The Flood",
        "devo_summary": "\n                    \n                    Just out of college, I shared an apartment with three good friends. The apartment itself was the first floor of an old, run-down, probably-not-up-to-code house, and it was small—so small that I had to store most of my worldly possessions three hours away. Books, photos, furniture, and a few sacred odds and ends from my twenty-odd years of life were squirrelled away in boxes in the basement of my sister’s house.\nThen, one day I got a phone call from my sister. She was in a bit of a panic. Her area had been the target of heavy rains for the previous few days and that morning she had awoken to a small lake in her basement. Everything that wasn’t up off the floor had been soaked, which meant that most of my belongings were forever ruined. That weekend, I made the trek to her house to survey the damage, and what I could salvage fit neatly on the floorboard of the passenger’s seat in my car with room to spare.\nWater is amazing. It gives new life and washes clean. But it also has the power to destroy whatever lies in its path. In the sixth chapter of Genesis, God used a flood to wash the earth clean. It was the end of the world—or it would have been had God not rescued Noah and his family.\nWhy Noah? The Bible says that “Noah walked with God” (Genesis 6:9). He was righteous, though that doesn’t mean he was unbroken and without sin. It means that he trusted God and lived his life in a way that reflected God’s good heart. At the time, this was a fairly unique trait for a human being. Wickedness had overtaken the earth, and “every inclination of the human mind was nothing but evil all the time” (v.5). So God decreed a fresh start for His world, and the rains came in obedience to His command.\nWhen we open our Bibles and begin reading from the beginning, we only get a few pages in before we have to wrap our minds around the judgment of God. And wrap our minds we must. What does it say about our Creator that He could wipe out so many? What does it say about humanity that we could sow such evil? The flood is a stark reminder that things are not as they should be. Every moment of every day, God could destroy the world, and it would be perfectly just for Him to do so. He is our Maker, and humanity is (still) living in outright rebellion.\nEven after the waters receded, God’s evaluation of the human race was pretty bleak: “the inclination of the human heart is evil from youth onward” (Genesis 8:21). This evaluation still stands. It’s never been rescinded, and the wages of sin is still death (Romans 6:23), remember?\nThe flood narrative is there to show us how things could be. It’s there as a reminder of what we would face apart from God’s grace. You and I have been given the Noah treatment. We’ve been saved from the flood so that, by the grace of God that is ours in Jesus Christ, we might, like Noah, walk with God.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day4.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 4:1-26, Genesis 5:1-32, Hebrews 12:22-24",
        "devo_title": "Cain and Abel",
        "devo_summary": "\n                    \n                    I have three small boys, and because my wife, Laurin, and I believe in the power of books, we do lots and lots of reading at our house. And because only one of our boys is reading on his own, it’s storytime in our living room several times a day and every night before bedtime.\nThe thing about reading to three boys, age five and under, is that they don’t really want anything new. They ask to hear the same stories rehearsed again and again, with the same pace, same inflection, and same silly voices. They don’t want to mix things up, not in the slightest. In fact, whenever we get a new book from the library, it usually takes some solid convincing that it’s worth their time. So, to say they know their favorite books by heart would be an understatement.\nThe most familiar stories in the Bible can be like that. We’ve read them, read about them, and heard them preached so many times, it can seem there’s nothing new to discover. But that’s only how it seems. I can’t count the number of times I’ve read the story of Cain and Abel, but not too long ago, I found myself staring at the page in front of me, reading and rereading a familiar passage: “Then the LORD said to Cain, ‘Why are you furious? And why do you look despondent? If you do what is right, won’t you be accepted? But if you do not do what is right, sin is crouching at the door. Its desire is for you, but you must rule over it’” (Genesis 4:6–7).\nGod knows Cain is plotting to murder his brother, but His response is neither outright condemnation of Cain nor a defense of Abel. Instead, the Lord’s concern is for Cain’s heart. He wants the son of the man He formed out of dirt to rise above the sin lurking within him. God lays it out plain for Cain, saying, in essence, “Sin is out to get you, but you must overpower it!”\nWhen I read what God had to say to Cain in this moment, I’m struck by a few truths. The first is that sin is complicated. God actually personified sin, comparing it to a predator that stalks its prey. Sin is a force, an enemy lying in wait. It’s not neutral, and it’s all around us in this cursed world. We must be on our guard, and as God instructed Cain, we must master it. The second thing I take away from this passage is that the reality of sin does not let us off the hook. Cain was still responsible for his actions, and so are we.\nLastly, I see in God’s concern for Cain an example for us all. You see, every sin has at least two victims—the person sinned against and the sinner. Every sin we commit robs us of our true humanity. We were created to reflect God’s image, and when we break God’s laws and act in ways contrary to His heart, we lose something. Every. Single. Time. That truth ought to be enough to stop us in our tracks when we are tempted, and it ought to fill us with compassion for those who are overcome by the sin crouched at their doors.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day3.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 3:1-24, Romans 5:12-21, Romans 16:20",
        "devo_title": "The Temptation and the Fall",
        "devo_summary": "\n                    \n                    The Bible doesn’t tell us a lot about what life was like for Adam and Eve after they were exiled from the garden of Eden. We know that Adam had to work a lot harder to provide food for his family (Genesis 3:17–18). We know that Eve experienced pain in childbirth, and her relationship with Adam was strained (v.16). We know that one son was murdered (4:8), while another son—the murderer—became a wanderer on the earth (v.12). In a very real sense, Adam and Eve lost two sons in one day. But beyond those details, the Bible doesn’t tell us what daily life was like for Adam and Eve.\nWe’re told Adam lived to the ripe old age of 930 (Genesis 5:5), and based on his age when his son Seth was born (v.3), which was some years after Eden became off-limits, we can deduce that Adam had more than eight hundred years to think and remember and regret the events of Genesis 3. I realize God had said the punishment for eating fruit from the tree of the knowledge of good and evil would be death (2:17), but somehow a centuries-long life of regret seems almost worse. Imagine feeling personally responsible for every broken thing in the world. Imagine rehearsing and replaying that moment of dread: “So the LORD God called out to the man and said to him, ‘Where are you?’” (3:9). Imagine knowing, in a very real and tangible sense, that every heartache, every loss, and every tear in the world could have been avoided if only you would have trusted God. If only.\nThere was nothing Adam or Eve could do. What’s done is done, so to speak. But that doesn’t mean the world’s first couple was without hope. God could fix what they had broken. There had been a hint that God might do something about the curse of sin and death. He had promised a child would come to crush the serpent’s head (Genesis 3:15). He had also provided skins to cover the nakedness Adam and Eve felt that day. Skins, of course, point to a sacrifice. Though the Bible doesn’t tell us what sort of skins they were, it seems a death was required to cover their shame.\nLife for Adam and Eve after the fall took a lot of faith. They had glimpses of what God could do but didn’t quite know how or when He would bring relief to the world. But one thing was certain: they were powerless to fix their own plight. They needed to trust their Creator—the very thing they failed to do in the garden. Though our lives look very different, our situation is the same. We can do nothing in our own strength to remedy the curse of sin and death. Though we can see clearly with hindsight that the promised child was Jesus of Nazareth and the sacrifice we really needed was His death on the cross, we, like Adam and Eve before us, are still wholly dependent on our Maker.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-2019Wrapped-Instagram-Day2.jpg"
    },
    {
        "book_title": " Genesis",
        "devo_passages": "Genesis 1:1-31, Genesis 2:1-24, 2 Corinthians 4:6, Hebrews 11:3",
        "devo_title": "The Creation",
        "devo_summary": "\n                    \n                    I love the month of January. I know that’s not a popular opinion, what with the post-Christmas malaise, the cold weather, and short days. But in my mind, January is like an open field after a freshly fallen snow without a single boot print. It’s a fresh start, a new beginning. The possibilities seem endless. Or at least that’s the way it seems to me as December’s short days draw to a frosty close.\nSomewhere around noon on New Year’s Day, however, the illusion of a new beginning begins to crack. The problems I had in the previous year have somehow followed me into my fresh start. The world remains just as broken as it was before the ball dropped in Times Square. Except for the arbitrary page on the calendar, nothing has changed. Not really anyway. So, when my initial disappointment with the new year wears off, I’m left feeling homesick for a place I’ve never been, a place the Bible calls Eden.\nOver the centuries, the early chapters of Genesis have caused much debate in academic circles and church small groups alike. How old is the earth? What are we to make of the six “days” of creation? What was life like before the fall of humanity? What does it mean for people to have been made in the image of God? But what I’m most interested in as I read the beginning of our family history in Genesis 1–2 is the beauty of life in God’s presence.\nThe Bible tells us that our destiny in Christ is a return to life in God’s presence. It was what we were meant for, what we were created to know and experience. In fact, everything we read between the opening chapters of Genesis and the closing chapters of Revelation describes life under the curse of sin and death. It’s all a big interruption in the goodness, beauty, and truth God gave us when He created this universe. We are living in the parentheses—that part of the story that deviates from the Author’s original intent. In the span of eternity, it will seem but a blink of an eye.\nWe were made for Eden, but that’s not to say we were made to laze around paradise, eating grapes and sunning ourselves, while monkey butlers massage our feet. We were given a mission: “Be fruitful, multiply, fill the earth and subdue it.” In other words, God commissioned Adam and Eve to extend the borders of Eden to the rest of the world, to make the whole earth a place where God could dwell with humanity.\nIf you keep on reading in Genesis, and then press on into Exodus and Leviticus, and still further into the Old Testament Historical Books, Psalms, and the Wisdom Literature, into the Minor Prophets, not stopping when you hit the New Testament but continuing through all four Gospels, Acts, the Epistles, and Revelation, you’ll find that God never rescinds this command. That is why Jesus prayed, “Your kingdom come. Your will be done on earth as it is in heaven” (Matthew 6:10). One day, this prayer will be fully and completely answered, but in the meantime, God has called us to make small steps toward this certain future. These early chapters of Genesis, then, are not the outlier in the grand story of redemption; they are our marching orders.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/12/HRT-Genesis2020-Instagram-Day1.jpg"
    }
]