[
    {
        "book_title": " Job",
        "devo_passages": "Job 19:27",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the last verse of Job 19:25–27, Job’s declaration that his hope lies in his Redeemer. This week we will memorize Job 19:27.\nI will see him myself;\nmy eyes will look at him, and not as a stranger.\nMy heart longs within me.\nJob 19:27\nFind the corresponding memory card in the back of this book.\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/4-Job-Lockscreen-4.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 38:31-35",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading. Each Saturday, we will read a section from God’s response to Job in chapter 38.\n“Can you fasten the chains of the Pleiades\nor loosen the belt of Orion?\nCan you bring out the constellations in their season\nand lead the Bear and her cubs?\nDo you know the laws of heaven?\nCan you impose its authority on earth?\nCan you command the clouds\nso that a flood of water covers you?\nCan you send out lightning bolts, and they go?\nDo they report to you: ‘Here we are’?”\nJob 38:31–35\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day27.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 42:1-16, Psalm 40:10-13, Lamentations 3:19-26",
        "devo_title": "The Restoration of Job",
        "devo_summary": "\n                    \n                    When my wife, Laurin, and I watch football, we root for our favorite team, but we also root for overtime. As Laurin likes to say, “Free football!” I usually say something like, “We’ve entered overtime all tied up, making the previous four quarters utterly meaningless.” I’m joking, of course, but there’s a bit of truth to my logic. Every single game starts out with a tie—the score is always zero to zero—and if a game continues into overtime, it’s tied up again. It’s like both teams have to start all over.\nReading this last chapter of Job can feel a bit like this. Since Job’s health and finances are restored and he’s blessed with ten more children, the state of things at the end of the story is much the same as it was at the beginning. Did any of the chapters in between even matter? What was the point?\nWe might be tempted to think that the point has something to do with justice. After all, Job was righteous, so it’s only fair that everything he lost should be restored. But this was Job’s logic for most of the book. God, in His response to Job’s complaints, never suggests that Job is “owed” anything. Instead, He asks, “Who is this who obscures my counsel with ignorant words?” (Job 38:2) and “Will the one who contends with the Almighty correct him?” (40:2). Job, in his accumulated wisdom, says in the end, “I reject my words and am sorry for them; I am dust and ashes” (42:6). As much as we’d like to turn the book of Job into a fairy tale with an obvious moral and a “happily ever after,” we are never invited to do so.\nJob’s fortunes are not returned to him because he did the right thing and earned God’s favor. (He hadn’t lost it in the first place.) There is nothing in the book to suggest that when we experience suffering we, too, can turn our luck around by following three easy steps. Nothing of the sort. Rather, Job is restored because of God’s grace, pure and simple. Job was right in the beginning when he said, “The LORD gives, and the LORD takes away” (1:21). God is God—and He is free to deal with us as He chooses, as scary as that may seem. But the truth of the matter is, we are all recipients of God’s amazing grace.\nThis grace is seen most vibrantly in Jesus, through whom His followers have received “every spiritual blessing in the heavens” (Ephesians 1:3). In Job, we catch a glimpse of this outpouring. Chapter 42 does not bring us into an overtime quarter where the score is essentially reset. Instead, notice that the numbers of sheep, goats, camels, oxen, and donkeys at the end of the book are twice what they were at the beginning (compare 42:12 with 1:3). In addition, Job is blessed with ten new children, ostensibly doubling the number of children he will have in eternity. Even Job’s long life—140 years—is twice the typical lifespan noted by Moses in Psalm 90:10.\nThe doubling of Job’s blessings is not meant to be a commentary on the man’s righteous standing before God. Instead, it is meant to show us that the God who commands the morning and knows when the mountain goats give birth is also the God who loves His children lavishly (38:12, 39:1). We cannot begin to count the blessings that are ours because of Jesus. In fact, “What no eye has seen, no ear has heard, and no human heart has conceived—God has prepared these things for those who love him” (1 Corinthians 2:9).\nJob is a book about the cup of suffering we all drink in one season or another, but it is also a book about God’s love, a love that overflows our cups and fills the oceans.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day26.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 40:1-24, Job 41:1-34, Mark 4:35-41, James 1:5-8",
        "devo_title": "God’s Second Speech",
        "devo_summary": "\n                    \n                    If you could ask God any question, what would you ask Him? Would you ask about a certain situation in your life—why something is the way it is? Would you ask Him to explain some great mystery of the universe, or something more personal but mundane?\nFor Job, the one question in his mind was simply “Why?” Why had God permitted so much terrible suffering into his life? Why was there so much heartache and pain when he had endeavored to live a righteous life? We might find these to be fair, even noble, questions, but the posture of Job’s heart wasn’t humility; it was pride. In Job’s mind, God owed him an answer. What Job really wanted was to correct and rebuke God.\nPerhaps you’re in a difficult situation right now. Maybe you feel you’ve been wrongly treated by God, and He needs to answer for it. God’s reply in chapters 40 and 41 is a helpful response to someone who thinks he knows better than God. He points to two massive, untamable, dangerous creatures—the Behemoth and the Leviathan—and asks Job if he can capture or tame them. Can Job manipulate or contain the strongest and most fierce of all of God’s creatures? Can you?\nThe obvious answer is “no.” God declares, “No one is ferocious enough to rouse Leviathan; who then can stand against me?” (Job 41:10). God’s direct question to Job is really rhetorical, “Would you really challenge my justice? Would you declare me guilty to justify yourself?” (Job 40:8). Again, the answer is a definite “no.”\nWhat God wants us to see is that while there are circumstances and events in our lives that may seem unjust, the Lord is never wrong in how He chooses to act. He doesn’t owe us answers. What we need to remember is that His care for us does not disappear in the midst of suffering.\nEven while enduring the anguish of the cross, Jesus did not abandon us in the midst of our greatest need. If He died to deliver us from our sin, He certainly won’t abandon us in lesser afflictions.\nTo follow Jesus is to accept the invitation to trust Him. This is what faith is: trusting God, even in the midst of storms and trials. While we may not understand our circumstances or why they’ve occurred, God is still just, and His purposes in our lives are always for our good and His glory. So when we find ourselves in hardships again, maybe we shouldn’t ask, “Why, God?” Maybe we should ask less and listen more. Then we might be able to hear Him say, “Do you trust Me?”\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day25.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 38:1-41, Job 39:1-30, Jeremiah 31:35-36, Revelation 3:14-20",
        "devo_title": "God’s First Speech",
        "devo_summary": "\n                    \n                    This is the moment we’ve been waiting for in this study: God has finally come to talk with Job. But where we might have expected God to start explaining His overarching purposes for Job’s suffering, God takes a different approach. Instead of standing as the defendant, answering for His actions, God takes on the role of the prosecutor. Turns out God has some questions He wants answered. What God does in Job 38–39 is lay out the scope of creation, asking Job what part he had in making it all happen. Effectively, God puts Job in his place.\nBefore we get to the reason why God takes this approach with Job, we might do well to consider these chapters as a testimonial to the unbridled greatness of God in creating all things. We gain a better perspective on ourselves and our issues when we consider the realities of creation fashioned by the Creator’s hand.\nFrom the size and movement of our planet to the boundaries of the vast ocean waters, we see God’s hand at work in things we cannot comprehend (Job 38:12–15). From the heights of the stars to the depths of the lowest trench, we are left to ponder the expansive work of God (v.16–21). At God’s instruction, the wildest creatures in the animal kingdom are perfectly cared for and ordered, all without a bit of help from us (ch. 39).\nFor the most part, we live without an awareness of our place in the grand scheme of creation. We believe and behave as if we rule the universe. We act as though we possess wisdom enough to determine what is good and fair. But if we allow the untamable realities of God’s creation to shape us, we’ll see we aren’t as great or wise as we thought we were.\nWith untethered appraisals of ourselves, we can grow pretty confident. And yet, in comprehending the discretionary power of God in the whole of nature, we’re left with no choice but to acknowledge we’re not as brilliant or powerful as we thought. God’s question, “Who put wisdom in the heart or gave the mind understanding?” leads us to realize our limitations in the sight of our Creator (Job 38:36).\nAnd this is right where we should be. Jesus said the kingdom of heaven requires us to become like children (Matthew 18:3), not theologians. So how do we get there? Perhaps a little time spent outdoors, considering the vastness of the natural world around us would be a start. There in the silence, we might learn how to listen to God, to ask Him about His creation and His ways. Indeed the heavens declare His glory. May we learn to praise Him and worship Him for who He is and all He has done.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day24.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 36:1-33, Job 37:1-24, Jeremiah 9:24, Romans 5:20-21",
        "devo_title": "The Mercy and Majesty of God",
        "devo_summary": "\n                    \n                    “What is God trying to teach you in all of this?” That question rang in my head as I listened to a friend talk me through one of the darkest seasons of my life. To be slandered and lied about was deeply difficult, and deeply wrong. My friend’s question bothered me because I didn’t want to learn anything in that moment; I simply wanted vindication.\nIn my suffering, I was taking the attitude of Job. His posture showed that he believed God should answer for the apparent injustice that had befallen him. God should take the stand as the defendant and give an answer for why He had treated “righteous” Job so poorly.\nBut Elihu suggests another posture. When faced with suffering and hardship, our hearts should not rise up and require an answer from God for the apparent injustice we’re facing. Rather, we should look to God, assuming that our current suffering is due to His justice. In this way, we may be corrected, turn, and do what is right.\nElihu points Job to the mystery of God’s perfect power and justice in all that He does, calling him to humility rather than arrogant demands for an answer. Elihu’s logic for this kind of perspective comes from the powerful work of God in creation. God powerfully and righteously sends down rain to benefit the land, but also to blessed those whom He loves and punish the wicked (Job 37:13). The trouble is, we’re not wise enough, nor do we possess enough knowledge to be able to discern fully which is which. “Do you know how God directs his clouds or makes their lightning flash?” (v.15). Our entitlement of heart leads us to believe that when God thunders, He’d better give an answer to us as to why He thundered.\nElihu shares two things with us: First, God is perfect in His justice and power. And second, we aren’t all-knowing. We will never understand God’s ways perfectly; therefore, we must be humble before Him (v.23–24). We must remember that our God does great things that we cannot possibly comprehend (v.5).\nAt first, His work might not make much sense to us, which is exactly why we must humbly embrace the foolishness of the cross. Jesus’s death was the greatest injustice in the history of humanity, and yet it was the place where God’s justice and mercy met. When we are tempted to puff out our chests and demand an answer from God, we would do well to remember He has already given humanity an answer. He spoke loudly and clearly of His love, justice, power, and mercy at Calvary.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day23.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 34:1-37, Job 35:1-16, Psalm 28:1-9, Psalm 55:16-17",
        "devo_title": "Elihu’s Appeal to Wisdom",
        "devo_summary": "\n                    \n                    At some point, every Christian will doubt the goodness of God. We all walk through periods of pain, darkness, or loss that can make us wonder if God loves us, if He cares about us, and if He will keep His promises to us. It should not surprise us when this happens, but we need to know what is true so we can preach to ourselves in our doubts and pain.\nIn his classic book Spiritual Depression, Dr. Martyn Lloyd-Jones suggests that many of our worst problems come when we listen to ourselves instead of talk to ourselves. He offers the example of Psalm 42, where the psalmist says, “Why, my soul, are you so dejected?” (v.5). Lloyd-Jones’s point is that if we only listen to ourselves, we will continually doubt God’s goodness. But if we preach truth to ourselves, we will begin to see our faith in God’s promises reaffirmed.\nToday’s readings give us good news to preach to ourselves. As Elihu continues his speech, he points to an essential truth about God, one we all must remember. He says, “But when God is silent, who can declare him guilty? When he hides his face, who can see him? Yet he watches over both individuals and nations” (Job 34:29).\nGod’s silence does not mean that He is indifferent to our suffering. Our not sensing His presence does not mean He has abandoned us. Elihu’s declaration is true: the providential hand of God is always in operation, even when we do not necessarily see it at work.\nDavid helps us to remember this through his words in Psalm 28. He begins his prayer by asking the Lord to hear him instead of remaining deaf to his cries. He begs the Lord to listen to him. Then halfway through the psalm, he blesses the Lord, saying, “He has heard the sound of my pleading” (v.6).\nYou might wonder how David could ask God to hear him, to not ignore him—then turn around to say that he is confident God truly does hear him. The answer is found in David’s statement in verse seven: “The LORD is my strength and my shield; my heart trusts in him, and I am helped.” David trusted in the Lord. He believed God’s Word, and was certain of His power to save and deliver him.\nOur hard times can be disorienting. When we are facing a job loss, sickness, divorce, depression, or a wayward child, we may struggle to know who we are and what is real. This is why we need to remind ourselves of the truth in these dark nights of the soul. We must remember that God loves us and is for us. We must be convinced in the depths of our hearts that God does not take us through the fire to burn us, but instead to refine us.\nIf you are in the furnace of affliction today, take heart. Your God loves you. Your God is with you. Your God will not leave you or forsake you. Hold on to that today.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day22.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 19:26",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nWe are memorizing Job 19:25–27, Job’s declaration that his hope lies in his Redeemer. This week we will memorize Job 19:26.\nEven after my skin has been destroyed,\nyet I will see God in my flesh.\nJob 19:26\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/4-Job-Lockscreen-3.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 38:19–24",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading. Each Saturday, we will read a section from God’s response to Job in chapter 38.\n“Where is the road to the home of light?\nDo you know where darkness lives,\nso you can lead it back to its border?\nAre you familiar with the paths to its home?\nDon’t you know? You were already born;\nyou have lived so long!\nHave you entered the place where the snow is stored?\nOr have you seen the storehouses of hail,\nwhich I hold in reserve for times of trouble,\nfor the day of warfare and battle?\nWhat road leads to the place where light is dispersed?\nWhere is the source of the east wind that spreads across the earth?”\nJob 38:19–24\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day20.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 32:1-22, Job 33:1-33, Psalm 118:8, Mark 12:28–31",
        "devo_title": "Elihu Speaks to Job’s Condition",
        "devo_summary": "\n                    \n                    These days, we suffer no lack of would-be coaches and advisors. While everyone needs mentors and trusted confidants, we could foolishly fill our days with coaching sessions and online courses from self-styled experts who believe they can help us with everything from our spiritual lives to our physical fitness. And that doesn’t include all of the free “counsel” we receive via social media.\nIn a world of unsolicited advice, today’s readings remind us where we can find genuine wisdom. We should all be thankful Job’s friends didn’t have Twitter accounts. After Bildad, Zophar, and Eliphaz go back and forth with Job in a conversation that seems to go nowhere, the young Elihu steps into the fray.\nInitially, Elihu is “timid and afraid” to speak to Job, assuming the other men’s words would be wiser because they are older. But after witnessing their conversation, Elihu changes his mind, declaring, “It is the spirit in a person—the breath from the Almighty—that gives anyone understanding” (Job 32:8). The word Elihu uses for “spirit” can refer to wind, breath, the spirit within a person, or the Holy Spirit. Since Elihu speaks about a “breath from the Almighty,” we can assume he means that genuine wisdom comes from the Holy Spirit, from God Himself.\nSolomon echoed Elihu’s words when he said to his son, “Trust in the LORD with all your heart and do not rely on your own understanding” (Proverbs 3:5). Solomon recognized that human beings are naturally foolish and easily led astray. Instead of trusting in our fallen reasoning and intuition, we ought to seek wisdom from the Lord.\nThe Spirit reveals the Lord’s wisdom to us in a number of ways, but especially through Scripture. We make the most progress in godly wisdom when we are consistently reading God’s Word. In fact, we cannot and will not grow in wisdom without it. As we immerse ourselves in the Bible and submit to its teaching, the Lord trains our minds and shapes our character.\nWe also grow in wisdom from the Spirit as we walk alongside our Christian brothers, especially those of mature faith. What God has worked in their lives can be passed on as a blessing to us. In God’s kind providence, we don’t have to walk through the Christian life alone.\nDo you lack wisdom? Then seek the Lord. In James 1, we’re told we can ask Him for wisdom, and He will bestow it freely (v.5). Through His Spirit, the Lord keeps that promise to us over and over again.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day19.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 30:1-31, Job 31:1-40, Psalm 42:4, Matthew 27:45–46",
        "devo_title": "Job Speaks About His Condition",
        "devo_summary": "\n                    \n                    Recently, I came across a magazine article that examined the growing epidemic of suicide among young men. It reported that three-quarters of the suicides in Britain were committed by men. The article referenced a poll where one-third of people between the ages of 35 and 44 said that, at some point in the past year, they had felt like life was not worth living.\nMany men suffer and don’t bring their pain out into the light of day. The pain can be compounded for Christian men who read commands in the Bible like “Rejoice in the Lord always!” (Philippians 4:4) while their lives are characterized by sorrow. The difficulties can become unbearable when we look back and remember times of joy but don’t know how to get there again.\nIn our reading today, Job descends into greater despair as he suffers from his losses and defends his righteousness against the attacks of his friends. He points to others who found themselves in similar situations and asks, “Have I not wept for those who have fallen on hard times? Has my soul not grieved for the needy?” He’d sympathized and wept with those who struggled, but now when he’d “hoped for good” in his own life, “evil came” to him instead (Job 30:25–26).\nPsalm 42 reveals a writer in mourning. The psalmist looks back on times when he’d rejoiced with others, leading them in procession to the house of God for worship (v.4). Yet when he wrote this particular psalm, he was “dejected,” “in turmoil,” and “depressed.”\nThe psalmist longs to appear before God, thirsting after Him like a deer panting after flowing streams. He addresses his own soul, reminding himself to hope in God once again. As for Job, he appeals to God for vindication, knowing that he stands no chance of absolving himself before the accusations of his so-called friends.\nThen, there is Jesus. On the cross, echoing the words of Psalm 22, he cries, “My God, my God, why have you abandoned me?” (Matthew 27:46). From the perspective of every person standing there that day, He has been abandoned by God. Yet, three days later He will rise again. The world sees an abandoned man, but the Father vindicates His Son through His resurrection.\nIn the same way, our sorrow and our enemies do not speak the last word about us. Jesus Christ bore our sins in His own body on the tree, then rose from the dead so that we might be brought into right relationship with God. Christian, your pain does not define you. Your depression, your struggles, and the accusations of those who hate you have no bearing on what is truest about you. You are defined by your Savior, who loved you and gave Himself up for you.\nIn your trials, follow the example of the psalmist and speak to your own soul, remind yourself of what’s true. Say to yourself, “Why, my soul, are you so dejected? Why are you in such turmoil? Put your hope in God, for I will still praise him, my Savior and my God.”\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day18.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 28:1-28, Job 29:1-25, Proverbs 1:7, 1 Corinthians 1:28–31 ",
        "devo_title": "Where Is Wisdom Found?",
        "devo_summary": "\n                    \n                    I absolutely love how Job 28 opens, with Job recounting the amazing ingenuity of human beings. We mine the metals in the earth and use them to carve pathways where there were none before. We use fire to light up the darkness and bake bread out of plants that sprout up from the ground. We separate the common from the precious, we make the rough world ornate and functional. And this was from the perspective of a man who lived thousands of years ago.\nSince then, we have invented microchips, airplanes, satellite communications, buildings that punch through the clouds, submarines that touch the ocean floor, and the supercomputers we call phones most of us are carrying around in our pockets and purses. We are a creative, intuitive, brilliant species when you get right down to it.\nBut intelligence, or the capacity to invent, does not translate into wisdom. Wisdom does not come from ingenuity. It does not come from mere intellect. It does not originate from within. Wisdom comes from God. It belongs to God. Wisdom exists because of God; it is tied directly to His character and His design for creation.\nMaybe there are times in your life when you can relate to Job—things are happening to you that you can’t explain and wish would end. But they are beyond your control. You’re left to endure, to pass through whatever your storm happens to be, hoping and praying for relief. What do you do in those situations?\nJob’s friends tried to bring reason to Job’s situation. Their prevailing wisdom was that Job must have caused his own suffering, and if he could only be wise enough to discern (or humble enough to confess) what he had done, he would find a way out. But Job reminds us that wisdom comes from being able to see a situation clearly, from a multitude of angles—and only God possesses perfect wisdom.\nGod understands the way to wisdom,\nand he knows its location.\nFor he looks to the ends of the earth\nand sees everything under the heavens (Job 28:23–24).\nOnly God possesses perfect wisdom. What does this mean for those of us who cannot see everything under the heavens? It means wisdom, for us, looks like seeking to see things with as much breadth as possible, and humbly acknowledging that there are aspects of such matters we may never grasp in this life. It also means trusting that even when we cannot see or discern as much as we might like, God is working all things according to the good of those who love Him and are called according to His purpose (Romans 8:28).\nThanks be to God for this, especially when our search for wisdom leads us to conclude that there is much we cannot see.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day17.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 25:1-6, Job 26:1-14, Job 27:1-23, Psalm 119:9–16, 1 John 1:8–10",
        "devo_title": "Bildad’s Third Speech and Job’s Reply",
        "devo_summary": "\n                    \n                    When I was in 7th grade, I had a math teacher who would send kids who caused trouble into the hall for the remainder of class. It looked awesome, and I wanted to go out there. So one day, when the teacher stepped out of the room, a bunch of kids got out of their seats to goof off. I did not. But when the teacher came back into the room, he said, “Anyone who was up while I was away, go out into the hall.” Though I had not gotten up, he didn’t know that. So I took advantage of the opportunity and went, by myself, into the hallway.\nA few minutes later, he came out into the hall and took me down to the principal’s office to get paddled (this was a different era). And I had to take it without objection because though I knew I had not sinned in the way he thought, I also knew what I’d done was far from right.\nIn today’s text, Bildad argues that no man is righteous. Okay, Job says, “fair enough. But God’s mercy is unsearchable. Whatever Bildad thinks Job has done, he hasn’t. Job knows God measures righteousness perfectly, and Job’s hope lies not in being sinless, but in God’s mercy.\nHow do we, as sinful people, live rightly before God? Yes, we try to conduct ourselves in a manner worthy of the grace we’ve been shown. But Job shows us something more here—something profound in its simplicity. He studies God. How can we live rightly before God? Study Him. Learn His ways. How does He listen to His people? How does He feed us and clothe us? How does He defend us against the wicked? How does He restore us to Himself? We read His Word, learn His ways, and then cling to them when everything else falls apart around us.\nRather than pulling away from God in times of affliction, Job draws near. He meditates on the character and acts of God. Even though Job cannot understand why God has allowed such calamity to come upon him, he resolves to maintain his integrity before the Lord by honoring His holy name.\nWe’re getting deep into this book, and maybe you’re feeling a bit of fatigue from some of the repetition. As you read these chapters, look at how Job studies not his own affliction, but the God he loves. He clings to the One who made him, even if He’s also the One who permitted Job’s affliction. As Job says, “What is the hope of the godless” (Job 27:8)? Look for the through-line of Job’s hope. It’s there, and it’s in God’s character.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day16.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 22:1-20, Job 23:1-17, Job 24:1-25, Romans 8:1-2, Galatians 6:7-10",
        "devo_title": "Eliphaz’s Third Speech and Job’s Reply",
        "devo_summary": "\n                    \n                    Have you ever gotten into an argument with someone, and then argued the disputed matter until you were so weary that you lost the will to fight? Maybe a late-night conflict with a spouse, or a misstep with a co-worker. You go round and round, use all your words, state and restate your case, listen and re-listen to the other person’s position. But in the end, you just set the conflict down because it doesn’t seem to have a resolution.\nThat’s where we find Job and his friends. They have moved into a level of debate that has left Job weary to the bone. They’re getting nowhere in terms of trying to crack the code on his suffering. Did he do something wrong? If so, what? What else could it possibly be? Job says he’s tired of arguing (Job 23:2–3).\nStill, Eliphaz argues that Job’s suffering must come as a result of something he’s done wrong, which raises the question: Do our works—both bad and good—matter to God, and if so, how? There’s a part of me that would like it if the moral to the story was that Job did bad things, so God punished him. Then we’d have the tidy morality tale that says God protects “good people” from suffering and really lets “bad people” have it.\nBut the Bible isn’t a morality tale. It is a love story. So the question about whether our works matter to God is complex. We’re getting it backward if we think God’s blessings flow from our behavior. It’s the other way around. Our behavior is meant to be a response to God’s mercy.\nRomans 8:1 tells us there is no condemnation for those who are in Christ, meaning, when our faith is in Him, we cannot be condemned by our bad works, not even by ourselves. And yet Galatians 6:7–10 tells us to care about our conduct because it reflects a Spirit-filled life. Of course our good works matter to God. But they have no power to save us. God cares about our conduct because our conduct reflects the degree to which we understand the depth of His love for us. \nThe gospel says that because of Christ, believers will never pay for a single sin. God has already accepted full payment in the sacrifice of Christ. To demand two payments would be both unnecessary and unjust. \nOur works matter to God because He chooses to work through His people—often in spite of our shortcomings, and often through our seasons of affliction and limitation. Serving the Lord through our good works brings Him joy because it means we are cooperating with His love and mercy; we are living as His ambassadors of grace in a world that needs it. \nWe do not obey to get love. We obey in response to the mercy we’ve been shown. May we never reverse that equation.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day15.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 19:25",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nOver the next three weeks, we will memorize Job 19:25–27. This week we will memorize the key verse for this plan, Job 19:25.\nBut I know that my Redeemer lives,\nand at the end he will stand on the dust.\nJob 19:25\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/4-Job-Lockscreen-2.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 38:16-18",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading. Each Saturday, we will read a section from God’s response to Job in chapter 38.\n“Have you traveled to the sources of the sea\nor walked in the depths of the oceans?\nHave the gates of death been revealed to you?\nHave you seen the gates of deep darkness?\nHave you comprehended the extent of the earth?\nTell me, if you know all this.”\n—Job 38:16–18\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day13.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 20:1-29, Job 21:1-34, Psalm 37:34-36, 2 Peter 3:9-13",
        "devo_title": "Zophar’s Second Speech and Job’s Reply",
        "devo_summary": "\n                    \n                    Scan the most popular podcasts and streaming series on Netflix, and you’ll find a common thread: justice. People are interested in cold cases and unsolved murders, because they want justice to have its day. In our right minds, we want justice for all. God does too. But God also wants mercy to have its day. And like Jonah after him, Job is making a wrong turn at the fork in the road.\nJob looks at his life and then looks down the street at the God-haters as they clink their glasses and settle in for another lavish feast, enjoying their lives. Job is perplexed. He wonders, “Why do the wicked continue to live, growing old and becoming powerful?” (Job 21:7). In other words, “Why do they get to keep on living and thriving? Bring down the judgment, Lord!” Job scoffs at the sinners down the street because his vision is being narrowed by his own unrelenting suffering. He is beginning to forget what is true of God, and His doubts are starting to bubble to the surface. Trials have a way of shaking us, so that what we really believe deep down spills out.\nSo, what about Job’s questions? Why do the wicked continue to live? Why doesn’t God just wipe them out already? Because God is compassionate, merciful, gracious, slow to anger, and abounding in faithful love (Exodus 34:6). Or, as Peter tells us, God is patient with sinners, just like He was and is with us, because He doesn’t want any to perish but all to come to repentance (2 Peter 3:9). The wicked who prospered in Job’s day may not have been suffering with poverty or scraping the open sores with jagged bits of pottery, as Job was (Job 2:8); they were in far worse shape. They did not know God.\nThe wicked live because God is giving them time to repent. Salvation is being held out with every passing minute. Real life is being offered. God gave you time to come to Him, for your faith to spring from the soil; He’s doing the same for others. And, He wants to use you to bring them into His kingdom. Until then, “Wait for the LORD and keep his way, and he will exalt you” in due time (Psalm 37:34).\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day12.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 18:1-21, Job 19:1-29, Isaiah 50:7-10, John 3:17-18",
        "devo_title": "Bildad’s Second Speech and Job’s Reply",
        "devo_summary": "\n                    \n                    She almost drowned. No more than six years old, she was struggling with the current and drag of the ocean. The waves kept crashing, and though her little legs were fighting and her arms were still clinging to her board, she was running out of energy. Her mom, watching from a pile of rocks, screamed for help. Before the waves slammed the girl into a pillar, I was able to grab her. We then paddled over to her mother, who said, “Thank you. Thank you for saving her.”\nEven as waves were crashing into him, as he flailed in his faith, Job still knew: “I know that my Redeemer lives” (Job 19:25). He may not have understood why he was suffering. He may not have been privy to the conversations taking place in the unseen realm between his adversary and his God. It didn’t matter though. Job knew that his Redeemer was alive and well, and in that he had hope.\nDo you?\nIf it hasn’t already, suffering will come knocking on your door soon. It may have already arrived. Or it may have just left after a long season. Regardless, none of us is immune to pain. Know this, my brothers: God alone is our Redeemer. He is making all things new, redeeming them so that suffering will one day be unknown in this world (Isaiah 43:18–19; Revelation 21:5). In the meantime, He will bear you up, and He promises never to leave you or forsake you (Hebrews 13:5). Even when you walk through the darkest valley, He is right there with you. And He’s no stranger to suffering (Hebrews 4:15).\nJesus was nailed to the cross for you. He suffered the penalty of our sin, enduring the pain and the agony until His body was nothing more than a lifeless corpse—because He loves you. Never doubt His love and care. No matter how painful your trial, Jesus has experienced a pain far greater. Suffering has a way of clouding our thinking, of making us forget what is true. When that happens, remember the dark clouds that hovered over Golgotha, and remember the Suffering Servant. He now lives. He rose from the dead, ending the curse of sin, and He stands at the right hand of the Father, holding out the promise that one day, anyone who has placed their trust in Him will rise too.\nWritten by J.A. Medders\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day11.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 15:1-35, Job 16:1-22, Job 17:1-16, Romans 12:9-15, James 5:8-11",
        "devo_title": "Eliphaz’s Second Speech and Job’s Reply",
        "devo_summary": "\n                    \n                    Do you remember the television show America’s Funniest Home Videos? It showcased real people attempting a lot of foolish things, all while their friends and family cheered them on, laughing at them and filming the events for posterity. It’s worth noting that if a friend tells you to stack one ladder on another so you can paint the second story of your house, first ask if they will pay your hospital bills. Counsel can be good, and it can be bad; it can revive or it can ruin. Job knows this firsthand.\nJob’s friends turned on him. They probably thought they were helping. After all, they had already grieved with him. Maybe they even thought, How long are we supposed to sit quietly with him? He needs to fess up already. So, Eliphaz grabs the mic and accuses Job of sin, reasoning that Job’s trials are his own fault. He even manages to crush the rest of his friends in the process, saying, “I have heard many things like these. You are all miserable comforters. Is there no end to your empty words?” (Job 16:2–3).\nIf we aren’t careful, we can be miserable comforters to our friends. We can’t speed up anyone’s season of suffering. When we become impatient, exasperated, or just fed up with the trials of another, we become what we hope would never come our way in our time of need. An accuser. A tempter. A liar.\nRash counsel and rushed advice can injure those who hear. If we don’t give careful consideration to our counsel, we will throw spiritual platitudes and canned Christianese at our friends as they walk through real pain, suffering, and heartache. It will make us feel better because we’re involved, but we will crush our friends as they hear our words. Yes, we are commanded to bear one another’s burdens, but not to fix them. The Lord tells us to pray and encourage one another, not blame one another.\nIf we, like Job’s friends, try to figure out our friends’ suffering, we run the risk of jumping to wrong conclusions because you and I are not God. We ought to point one another to the risen Christ, who also endured awful advice from His friends (Matthew 16:21–28). We should pray for our friends to find comfort in the Wonderful Counselor. Jesus knows what to do, and the Holy Spirit will give our friends the comfort they truly need.\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day10.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 13:1-28, Job 14:1-22, Psalm 71:19-21, John 5:24-25",
        "devo_title": "Job Challenges the Advice of His Friends",
        "devo_summary": "\n                    \n                    One of the most difficult aspects of pastoral ministry is being well acquainted with the frailty of human life. I write this as our church family just buried Ed, a 94-year-old veteran of World War II. The man survived the enemy attack on the shore of a foreign battlefield and lived his entire life with shrapnel in his body from that incident. Ed’s life wasn’t always easy, but he was tough as nails. A true hero, Ed was one of the last members of the Greatest Generation. But despite being the hero he was, like all men, his death was a tender reminder that we are all fragile.\nStill, there is a certain refuge in death for the weary. As I sat at his funeral, I found comfort in the Christian doctrine of the future resurrection of the dead (Matthew 27:52). For Ed, and for all who are in Christ, death does not have the last word. Our fragility does not lead to our finality. In Job 14, we are reminded of what everyone in the ancient world believed: life continues after death.\nAnyone born of woman \nis short of days and full of trouble. \nHe blossoms like a flower, then withers; \nhe flees like a shadow and does not last. \nDo you really take notice of one like this? \nWill you bring me into judgment against you?\nWho can produce something pure from what is impure? \nNo one! (Job 14:1–4).\nIn light of the hope of eternity, human life difficult and brief. And because no human being is able to live outside the earthly limits God has set, we must set our hopes on life beyond the grave. From the depths of the earth, God will raise us again in Christ Jesus.\nIn John 5, Jesus reminds us that whoever hears His Word and believes that He is the life-giving Savior from God will pass from death to life (vv.24–25). There is a day coming when the dead will hear the voice of the Son of God, and those who hear will live. The same God who brought life into existence with His Word, will call forth new creation with His voice. The same Jesus who commanded dead Lazarus to come forth from his grave, will call all of His children forth to eternal life.\nI find great hope in the beautiful poem that the grieving theologian C. S. Lewis penned to be etched on the grave of his beloved wife Helen Joy Davidman: “Like cast off clothes was left behind in ashes, yet with hope that she, re-born from holy poverty, in lenten lands, hereafter may resume them on her Easter day.”\nWhen I think of Ed, I am reminded that his death is not a goodbye—it’s “See you soon.” This is the hope of what God’s promised in His Word. This is the gospel of Jesus Christ. When our flesh fails, God will be faithful to His Word. As Isaiah 40:8 reminds us, “The grass withers, the flowers fade, but the word of our God remains forever.”\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day9.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 11:1-20, Job 12:1-25, Proverbs 4:18, 1 Peter 2:21-25",
        "devo_title": "Zophar’s First Speech and Job’s Reply",
        "devo_summary": "\n                    \n                    The English writer and philosopher Aldous Huxley once said, “There are things known and there are things unknown, and in between are the doors of perception.” I would argue that much of perception has to do with personal perspective. Consider a photograph, for example. A photographic image is only able to capture a moment in time, and only one perspective of that moment in time. Beyond the frame of the photograph, most of that moment is cropped out. In other words, your perception of that moment in time is limited by what is presented in the picture.\nIn many ways, this helps us understand the sharp challenge that Zophar aims at his friend, and Job’s response in Job chapters 11 and 12. From Zophar’s point of view, Job’s suffering is the result of his own secret wickedness. In one sense, we know that all suffering is a result of sin, and the brokenness we experience in this world is caused by sin. However, the irony of Zophar’s challenge, “Can you fathom the depths of God or discover the limits of the Almighty?” (Job 11:7), is that he presumes God’s purposes in Job’s suffering are obvious, transparent enough that he can rebuke Job and call him to repent.\nBut remember, Zophar has a limited perspective. Much of his indictment against Job is based on his own limited experience. Wisdom always has two sides: the known and the unknown. True wisdom understands that only God is able to view things from all vantage points. God’s wisdom is not always clear to us, especially in difficult times. During those times, it is important not to doubt God’s wisdom and providence over our lives.\nWe never have the whole picture, only our limited perspective. Based on the testimony of God’s character revealed in Scripture, we should fight to believe that God is ultimately sovereign over everything in life for these reasons: His glory and, ultimately, our good.\nTherefore, we should always aim to be attentive to what God may be doing in order to gain insight into His character and will. One of the most comforting truths to remember is that we have a good Shepherd, Jesus Christ, who is the overseer of our souls. Jesus is the true and greater Job, who innocently suffered, yet overcame and still intercedes for His friends. Not only did Jesus suffer for you, He did so by entrusting Himself to the Father. Unlike Zophar, who lodged critiques at Job, we have a Savior who knows suffering well, and is therefore able to empathize with us, offering true comfort and compassion.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day8.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 1:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize Job’s initial response to his suffering.\nNaked I came from my mother’s womb,\nand naked I will leave this life.\nThe LORD gives, and the LORD takes away.\nBlessed be the name of the LORD.\nJob 1:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/4-Job-Lockscreen-1.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 38:4-7",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading. Each Saturday, we will read a section from God’s response to Job in chapter 38.\n“Where were you when I established the earth?\nTell me, if you have understanding.\nWho fixed its dimensions? Certainly you know!\nWho stretched a measuring line across it?\nWhat supports its foundations?\nOr who laid its cornerstone\nwhile the morning stars sang together\nand all the sons of God shouted for joy?”\n—Job 38:4–7\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day6.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 8:1-22, Job 9:1-35, Job 10:1-22, Nahum 1:3, Romans 3:23-26",
        "devo_title": "Bildad’s First Speech and Job’s Reply",
        "devo_summary": "\n                    \n                    Every single one of us has a deep sense of justice hardwired in our hearts. Indignation stirs in our spirit when we witness the guilty go free. The football stadium roars in anger when a referee calls an unwarranted penalty on the home team. The child passionately pleas their case when a parent punishes them for something they didn’t do. These reactions to injustice are a testimony to our inner conviction that God is just and has ordered the world to reflect His justice.\nIn Job 8, Bildad stands as an example of this truth. In light of the suffering that has come upon Job, his friend becomes aroused by anger and asks him how long will they have to hear his lament of suffering? Bildad roots his question in the character of God: “Does God pervert justice? Does the Almighty pervert what is right?” (Job 8:3). There must be a reason this suffering has fallen on Job, right? Perhaps Job’s children have sinned? If Job or his children were pure and upright, wouldn’t God bring restoration?\nIf we were to honestly read this passage with a humble view of ourselves, we would quickly see that no one—not even ourselves—could stand before the just God of the universe as pure and upright. And thus, our sense of justice condemns our own hearts. Our hearts confirm the witness of the apostle Paul in his letter to the Romans: “All have sinned and fall short of the glory of God” (Romans 3:23). The testimony of Scripture is clear: the Lord will by no means clear the guilty.\nHow then do we respond? In despair, like Job? In anger, like Bildad? Thanks be to God, there is another way! God has not forsaken us in our sin. The suffering of Job points forward to Jesus, the truly innocent sufferer who consumed the just penalty for sin that we deserved (vv.24–26). No, God does not pervert justice! God’s Son paid for sin on the cross so that we may be forgiven. Because of this, God remains just even as He justifies those who have faith in Jesus Christ. This is the beauty of the gospel of grace. God is fair, and we deserve His justice because of the sin in our hearts. Jesus Christ takes what we deserve and gives us what we do not deserve: forgiveness.\nEven if Bildad’s sense of justice is correct, his impatient anger against Job is rooted in a religious understanding that is devoid of grace, and therefore, devoid of comfort for his friend. Even if we sympathize with Job’s despair, we understand that in the bigger picture, his suffering does not have the last word! In Christ, we experience the justice of God to which Bildad appealed, and we receive the comfort from suffering for which Job longed. In Christ, the guilty go free, because He takes the punishment we deserve. Let us run with urgency to our heavenly Father and thank Him for His mercy.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day5.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 6:1-30, Job 7:1-21, Romans 8:18–25",
        "devo_title": "Job’s Reply to Eliphaz",
        "devo_summary": "\n                    \n                    In the classic holiday TV special A Charlie Brown Christmas, Linus complains to Lucy at having to memorize lines for the Christmas play. It goes something like this:\nLinus: “Give me one good reason why I should memorize this.”\nLucy: “I’ll give you FIVE good reasons!” (She holds up five fingers, one by one, making a fist.) “One! Two!\nThree! Four! FIVE!!”\nLinus: “Those are good reasons! Christmas is not only getting too commercial, it’s getting too\ndangerous!”\nClassic. I mean sure, five is good. But like Linus, sometimes we just need one good reason to keep going. Just one. And sometimes, like Job, we look high and low and still struggle to find just one.\nWhat strength do I have, that I should continue to hope? \n What is my future, that I should be patient?… \n Since I cannot help myself,\n the hope for success has been banished from me (Job 6:11,13).\nIt’s easy to watch A Charlie Brown Christmas every year. There’s a sweetness to the truths that are communicated. They remind us of all that’s good and true (plus, it’s got an awesome soundtrack). It’s not so easy to read Job’s story. And why? Well, because the truths it presents have a brutal quality to them. There are no beautiful primary colors, no awesome soundtrack in the background. No, Job’s story is stark—a very grown-up tale—and as such, it challenges more than it comforts. Job comes face to face with something called hope, and he has to choose whether or not to use it.\nPaul gives the believers in Rome (and us) this working definition of hope: “Yet hope that is seen is not hope, because who hopes for what he sees? But if we hope for what we do not see, we eagerly wait for it with patience” (Romans 8:24–25). Yep, probably not what most of us want to hear. We want just one good reason, something we can see, something tangible, But that’s not hope.\nHope is keeping on when you’re all out of reasons. Hope is patiently groaning along with all of creation for the redemption, not only of our bodies, but of all things (v.23). Hope is not a warm, fuzzy, childish cliché, but a dogged, determined, childlike faith in the God we cannot see, who gave us His one and only Son. If you stop and think about it, that’s all reason we’ll ever need.\nAnd that’s what hope is all about, Charlie Brown.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day4.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 4:1-21, Job 5:1-27, Romans 5:1, 1 Corinthians 3:18-23",
        "devo_title": "Eliphaz’s First Speech",
        "devo_summary": "\n                    \n                    If people know of C.S. Lewis, chances are good it’s due to his Chronicles of Narnia series with books like The Lion, the Witch, and the Wardrobe. But Lewis was also an amazing philosopher and ethicist. One of his lesser known books is a collection of essays titled, God in the Dock.\nThe word “dock” refers to the place where the accused sits in a courtroom. Lewis contends that in ancient times, men approached God as an accused criminal would approach a judge. But for the modern man (which includes us), things are reversed. We sit in the judge’s seat, and God is on trial. God is in the dock, having to answer for everything from wars and weather patterns, to the rise and fall of the stock market, to the flow of traffic in our daily commute. Lewis writes: “The trial may even end in God’s acquittal. But the important thing is that man is on the bench and God is in the dock.”\nHow often do we put God on trial, in the dock? If we’re honest, probably more often than we’re comfortable admitting. After all, “Can a man be righteous before God? Can a man be more pure than his Maker?” (Job 5:17).\nThe answer here is “No.” Full stop. As smart and savvy and progressive as we may consider ourselves to be, there is a Judge over all, over everything—and it most certainly is not us. Let me repeat that: We are not the judge.\n“So then, are we the accused?” you might ask. The answer here is a resounding “YES,” but with a clarification regarding God the Judge. He is righteous, and if we know Jesus, He judges us through the blood of His Son. As Paul tells us in Romans 5, “Since we have been declared righteous by faith, we have peace with God through our Lord Jesus Christ” (v.1).\nYou and I, in the dock, throwing ourselves upon God’s mercy, are forgiven, acquitted, set free. We no longer live as men who stand accused, but as sons who belong to Christ, and Christ belongs to God. Full stop.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day3.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 3:1-26, Philippians 3:7–11, 2 Timothy 2:8–13",
        "devo_title": "Job’s Lament",
        "devo_summary": "\n                    \n                    Over the years it has become the stuff of well-timed, late-night comedy and internet memes. The attack took place back in 1994. It shocked the watching world, and it left Olympic figure skater Nancy Kerrigan injured and unable to compete for some time. The enduring footage of the attack shows a crumpled Kerrigan in a dark hallway, crying and repeating one question over and over: “Why?”\nAlthough the attack, even years later, remains shadowed in some mystery, it appears to have been initially motivated by jealousy on the part of her rival, Tonya Harding. Nancy Kerrigan had done nothing wrong. The only thing she was guilty of was consistently outperforming her competitors.\nJob was not an Olympian, but his circumstances were not altogether different from Kerrigan’s. In a very real sense, he’d outperformed his fellow men in terms of integrity before God. He chased hard after the good and kept his distance from evil. But after an attack, seemingly out of nowhere, on his family, property, and even his own body, Job was left crumpled on the ground repeating a variation on that same word: Why? He lamented, “Why was I not stillborn; why did I not die as I came from the womb?” (Job 3:11).\nSearching for a reason for our suffering can be downright frustrating at best, and debilitatingly depressing at worst, because satisfactory answers are often hard to find. And the one place we think might hold keys to our questions—Scripture—asks us to suffer more by faith than by sight. In other words, we’re called to trust even when, and possibly most especially when, we don’t understand.\nI have no doubt the apostle Paul (another overachiever of sorts) had moments when he asked, “Why?”—times when he tried to squint through the glass darkly. But he confessed it was all worth it in order to know Christ “and the power of his resurrection and the fellowship of his sufferings” (Philippians 3:10).\nWhy? is a completely valid, human question. But the more important question is “Who can I turn to for hope?”\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day2.jpg"
    },
    {
        "book_title": " Job",
        "devo_passages": "Job 1:1-22, Job 2:1-13, Psalm 22:1-11",
        "devo_title": "The Setting of the Test",
        "devo_summary": "\n                    \n                    A few weeks ago, my wife, Laurin, and I traveled to Georgia, rented a small moving truck, and loaded it up with furniture a friend of ours had refinished for us. As we prepared to leave, I reached into the pocket of my jeans and handed Laurin my car keys, then returned my hand to the same pocket to fish out the key to the truck. But it wasn’t there.\nPanicked, we searched the ground all around the truck. I retraced my steps through the house. I even called the fast-food restaurant where we had eaten lunch. But we couldn’t find it; the key seemed to have vanished. After a couple hours of looking, I begrudgingly called the rental company’s 24-hour toll-free number and admitted I’d lost the key. They told me they’d happily send out a locksmith and, even more happily, charge me a small fortune for the service.\nStanding there in the driveway beside our immobile truck, I thought about the loss of money and the loss of time we would endure because of the loss of this key, and I shifted into full blame mode. It was the rental company’s fault for handing me just a single key without a keychain, so easy to lose. It was Laurin’s fault for not bringing her own set of car keys, because with the weight of my own keys in my pocket, I never noticed the missing truck key. And it was my own fault for not being more careful.\nWhen something bad happens, we want to get to the bottom of it. Why did this happen? Who caused this? How do we avoid this next time? Our missing key was trivial. We were on the road in a few hours, and the rental company never even charged me for the locksmith. But when we have a true loss in life—our health, a loved one, a marriage—the blame game takes on deeper meaning.\nIn these early chapters of Job, we get a glimpse into the heavenly realm. We get to witness what Job and his friends did not: that every single calamity in Job’s life was seen and permitted by God. The same is true in our lives. Of course, we must remember that God is never the author of evil (Psalm 5:4), we live in a broken, fallen world (Romans 5:12), and choices have consequences (Proverbs 14:12). But God is sovereign (Job 42:2; Proverbs 16:4). Nothing enters our lives that has not first passed through His hands. As Job himself asked rhetorically, “Should we accept only good from God and not adversity?” (Job 2:10).\nThe book of Job can be difficult to read, because it doesn’t provide easy answers to the problem of human suffering. In fact, these opening chapters add a new difficulty to work through: God’s role in allowing suffering into our lives.\nWhile God’s sovereign rule over heaven and earth may leave us asking, “Why, Lord?” alongside Job, it is God’s sovereignty that should be our greatest comfort. He has decreed a day when all evil, pain, and suffering will cease (Revelation 21:4). And in moments of despair, He promises to be near to the brokenhearted (Psalm 34:18). Suffering is bigger than any easy answer we can muster. Thankfully, we can bring our suffering to God, who is bigger still. He who did not spare His own Son the suffering of the cross will not leave us nor forsake us (Hebrews 13:5; Deuteronomy 31:6).\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/03/HRT-Instagram-Job-Day1.jpg"
    }
]