[
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 6:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through these Minor Prophets together, we will memorize key verses from each book. This week’s verse beautifully and simply details how God calls His people to live.\nMankind, he has told each of you what is good\nand what it is the Lord requires of you:\nto act justly,\nto love faithfulness,\nand to walk humbly with your God.\n—Micah 6:8\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/4-MP-4.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Psalm 46:1",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod is our refuge and strength,\na helper who is always found\nin times of trouble.\n—Psalm 46:1\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram27.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 7:1-20, Psalm 103:8-9, Romans 6:12-14",
        "devo_title": "Micah’s Prayer Answered",
        "devo_summary": "\n                    \n                    Before having children of my own, I  thought I knew a lot about parenting. It seems I knew more about parenting then than I do now, after fourteen years of fatherhood.\nA few months ago we had one of those parenting days. It was Sunday, and our kids had been terrible all day. They were terrible before church. They were terrible on the way to the church. They were terrible at church. They were also terrible on the way home from church, and then terrible at lunch. Had we gone to the pool that afternoon, they would’ve been terrible there, too. \nWe could not figure out what was going on, but I was losing it. By that evening I’d had it. The smallest infraction that might have been overlooked on any other day, now had the effect of a nuclear bomb. And there were bombs going off all over our house at bedtime. Then I truly lost it. I yelled and hollered in a way I never had before, and it made my kids cry as they lay in their beds.\nI felt awful.\nBy the time all my self-righteous indignation had worn down, they were asleep and I was left in despair. I kept trying to justify my anger but I couldn’t, and then I just felt terrible again. The idea of waking them up and apologizing for my sinful anger kept running through my head. But I could not do it.\nMaybe you haven’t done this as a parent, but maybe you have as a husband or friend. You said or did something unkind to someone, then the day was done and you were left wide awake to feel the weight of the guilt of it. It’s a pretty dark place. It’s hard enough to face your sin, but to know that your sin has truly hurt someone else is just downright painful.\nIt’s a dark place, and the need for light is real.\nIn the midst of delivering God’s prophecy against Israel, Micah gets very personal. He confesses his own sin. Then he says that God will be a light to him in a dark place (Micah 7:8), and that God will plead his cause and vindicate him (v. 9). In other words, Micah turned toward God in humble repentance, knowing that God would be there for him, gracious and forgiving.\nIt took me awhile to get there, but that is where I ended up: humbled. Instead of wallowing in my guilt all night, I went to God and repented. The gospel was the light I needed in that dark place, knowing that Jesus has already pleaded my cause with His blood, and I am already vindicated because of His completed work on the cross—not because of my own works.\nI still looked forward to apologizing to my kids the next morning. But when I went to bed that night, I went in the full security of the gospel, which is good news for sinners.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram26.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 6:1-16, Jeremiah 22:3, Colossians 3:12-17",
        "devo_title": "God’s Lawsuit Against Judah",
        "devo_summary": "\n                    \n                    If there ever was a temptation to neglect God’s justice and holiness, Micah 6 offers a strong corrective. Without a doubt, it is true that “God is love,” as John reminds us in his letters (I John 4:8). But when we skip over the justice and righteousness of God, we lose a sense of the very real, very tough truth: that God is just, righteous, and holy, and that in our sin, His people have fallen short throughout the ages (Romans 3:23).\nGod’s prophet, Micah, tells us, “It is wise to fear [God’s] name” (Micah 6:9). Fear seems like such an odd word to describe a part of our relationship with God. But throughout the prophets’ writing, and especially in the book of Proverbs, we read over and over again of how important it is to have a healthy fear of God. Solomon, the wisest man who ever lived, encourages us: “The fear of the LORD is the beginning of wisdom, and the knowledge of the Holy One is understanding” (Proverbs 9:10). \nCertainly, Solomon was well aware of the beauty and wonder of God’s unmerited grace and goodness—the same God who poured out favor and lavished wisdom upon Solomon, though Solomon would ultimately stray far from God’s direction. When we neglect to fear the Lord and follow His commands and His ways, we place ourselves in a position that is at odds with His holiness.\nWhile legal proceedings worked a little differently in the ancient Near East, it’s not difficult to grasp the gravity of the circumstances in Micah 6. Being in a metaphorical courtroom on the opposite side of the table from God is not a good situation to be in.\nThis is not because we serve and worship a vindictive or vengeful God, but rather because we serve a just, holy, and righteous God. Yes, His goodness, mercy, and love have covered the sins of those who call on Jesus’ name. But Micah reminds us of the very real consequences of our sinful choices: they always put distance between us and God, between us and our family and friends.\nWhat God required of His people in Micah is still required of us: “to act justly, to love faithfulness, and to walk humbly with [our] God” (Micah 6:8). While we often have trouble living, thinking, and speaking consistently in this way, we are blessed beyond belief to have a great High Priest and Advocate, who stands with us and for us when we break God’s law.\nWe are wise to fear God in His greatness and power, and we are wise to draw near to God because He promises He will always draw near to us. When we do, He provides the power and mercy we need to pursue our calling and love Him in the midst of our trials and challenges.  \nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram25.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 5:1-15, Psalm 72:1-11, Luke 1:26-33",
        "devo_title": "From Defeated Ruler to Conquering King",
        "devo_summary": "\n                    \n                    Growing up, every Christmas Eve at 10:45pm, I could be found seated with my family in a front left pew of our church, waiting for the candlelight “Lessons and Carols” service. Every year the same rich, familiar texts were read, and the same songs were sung. The same feeling of sleepy hopefulness and joy would waft through the sanctuary, or so it seemed to me. It was a simple tradition with strong roots, not least of all because it was laced with prophecies and promises of the coming King.\nIt was in these services that I first heard (maybe the only time I heard) the sentence “Bethlehem Ephrathah… one will come from you to be ruler over Israel” (Micah 5:2). It was a Christmas promise, a candlelight lesson to precede a carol, and it was so much more. These words are a Christmas promise for all time, a promise of a coming eternal King who will conquer enemies and rule to the ends of the earth forever. He is a King who will bring peace.\nWhat exactly does “peace” mean? It means all false gods and idols will be removed; no more will people worship the work of their hands, whether an accomplishment or a physical product. It means God’s people will be shepherded, cared for, protected, and directed. It means God’s people will not be run down or defeated by enemies any longer. The poor will be lifted up and oppressors thrown down. And all this will have no end, either in time or in place; it will be eternal and cover every inch of the earth.\nThis is a Christmas promise: the line of Judah will continue, and the King will sit on the throne of David as God’s chosen One. We know this to be Jesus. But this is not a Christmas promise contained in lessons and carols. It is not a soft glow and gentle melody. And it is not bound to two days in December.\nThis promise roars through all time. The King is coming, the Son of the Most High. We celebrate Jesus’ humble beginnings on Christmas, but we should also rest in the promise of His peace every day. We sing of His birth in December, but we should live under His reign, always. We remember when our King came to earth the first time, and we should look forward eagerly to His return. For His kingdom will have no end. In that promise we have peace, and when He returns we will have perfect peace. \nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram24.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 3:1-12, Micah 4:1-13, Psalm 25:8-9, 1 Corinthians 10:31",
        "devo_title": "From Exile to Victory",
        "devo_summary": "\n                    \n                    I have always loved being in the mountains. Over the years, I’ve had the privilege of living in the Blue Ridge Mountains, hiking the Sangre de Christo Mountains, traveling through the German Alps, skiing the French Alps and the Rockies, and flying around the seemingly endless Alaskan Mountain ranges. There is something mystical and majestic about these natural structures that tower over the rest of creation. In addition to their natural majesty, Scripture actually has quite a lot to say about the theological significance of mountains.\nThe garden of Eden sat on the top of a mountain (Ezekiel 28:14-16). This is why God later appeared to Moses at the top of Sinai and Elijah at Horeb. It also explains why He ordained that both the King’s house and the temple would be built high on top of a mountain of Jerusalem. Mountains capture something of the transcendence and exaltation of the Most High God. It should, then, come as no surprise to us that when the prophet Micah speaks of the gospel age and blessings, he does so by way of drawing off of the illustration of a mountain.\nIn order to pave the way for spiritual mountain imagery, the Lord first has Micah prophesy of the judgment the nation deserves on account of their corrupt religious leaders. Having laid bare the many injustices of His prophets and priests (Micah 3:5-11)—the fact that they hated good and loved evil (Micah 3:2)—the Lord promised to plow Zion as a field and leave Jerusalem “a heap of ruins” (Micah 3:12). They would be like a pile of discarded wood. God promised He would level Israel to the ground for all of the greed, idolatry, and falsehood of their religious leaders.\nAgainst this background, Micah then prophesied of the forthcoming gospel blessings, when “the mountain of the Lord’s house will be established at the top of the mountains and will be raised above the hills” (Micah 4:1). Then the peoples and nations will come to the heavenly Zion to hear the Word of God and to worship the living God in truth. \nThe writer of Hebrews picks up on this and explains that the mountain of mountains is Mount Zion—”the city of the living God, the heavenly Jerusalem” where we come to “an innumerable company of angels… the general assembly and church of the firstborn who are registered in heaven… God the Judge of all… the spirits of just men made perfect… Jesus the Mediator of the new covenant” (Hebrews 12:22-24). It is there that we “will walk in the name of the Lord our God forever and ever” (Micah 4:5). \nMountains are glorious on their own. But to walk on the mountain of the Lord with the Lord will be a glory like no other. This is a glory in which all who call on the name of Christ are destined to walk.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram23.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 1:1-16, Micah 2:1-13, Psalm 46:1-11, Hebrews 6:13-20",
        "devo_title": "Micah’s Lament",
        "devo_summary": "\n                    \n                    April 20, 2010, was an ordinary spring day for oil rig workers stationed off the southeast coast of Louisiana in the Gulf of Mexico. All was well until the rig exploded, killing eleven workers and causing one of the greatest environmental catastrophes in the history of the world.\nThe explosion on the Deepwater Horizon may have been a surprise to most of the workers on the rig that day, but it wasn’t a surprise to one person. Earlier that morning, rig operator Jimmy Harrell had argued with a senior BP official about what materials should be used to fix a leaky pipe. Harrell suggested a proven, yet expensive, option. However, the BP executive chose the cheaper, unproven, less reliable option. Tragedy, of course, followed, with oil washing up on the shores of the mainland for years to come. \nIn the first chapter of today’s reading, God speaks through His prophet Micah to warn the people of His imminent judgment. God cannot turn a blind eye toward the sins of His people simply because they are His. Israel’s world is literally going to be torn apart, and God is being intentional with His people, informing them of the judgment due to them because of their disobedience. Micah warns them, “All this will happen because of Jacob’s rebellion and the sins of the house of Israel” (Micah 1:5). God’s people are not going to be pillaged because they were in the wrong place at the wrong time, or because of the greed of surrounding nations. No, God wants His people to know that their immanent destruction is of their own doing and because of their own sin. Still, His warning goes unheeded.\nBut in chapter 2, God offers a ray of hope amidst the lament and despair. He says through Micah, “I will indeed gather all of you, Jacob; I will collect the remnant of Israel. I will bring them together like sheep in a pen, like a flock in the middle of its pasture” (Micah 2:12). He tells them there is One who will break open the way for them, and then lead them into freedom.\nIndeed, a deliverer came and freed the remnant from captivity; and Jesus, our Deliverer, has already come to free us from our oppressive slavery to sin from which we once lived. But even while we’ve been set free through the cross, resurrection, and ascension of Christ Jesus, we still struggle to find contentment in that freedom. We often struggle to rest in Him, returning to our old ways, despite their ugliness and oppression. \nBy grace, may we heed and reflect on God’s message through the prophet Micah. May we look forward to God’s coming judgment, and turn our hearts toward Him in repentance. And may we learn to cling to the finished work of Jesus Christ, resting in our deliverance secured in Him. \nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram22.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Hebrews 4:16",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nTherefore, let us approach the throne of grace with boldness, so that we may receive mercy and find grace to help us in time of need.\n—Hebrews 4:16\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram20.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 4:1-11, Acts 11:15-18, Romans 5:6-11",
        "devo_title": "Jonah’s Anger",
        "devo_summary": "\n                    \n                    When a parent asks their child, “Do you think you did the right thing here?” the answer is almost always a whopping “no.” Do you think it was right to push your little brother off the bed? Do you think it was okay to sneak into the kitchen in the middle of the night and eat all the Pringles? Is it right to hit your friend? \nNo, no, no.\nAnd when God asks Jonah if it’s right for him to be angry, we know the correct answer.\nJonah is ticked at God’s grace. He can’t believe that God would be so gracious and kind to the city of Nineveh. As Jonah stews in his anger, God asks him if his anger is justified. \nNo answer. Not yet.\nAfter witnessing a revival in Nineveh, Jonah heads back home. While resting, God provides shade for Jonah and puts him at ease. Everything is going Jonah’s way. Finally. But then, the Lord sends a worm to destroy the plant, toppling Jonah’s temporary comfort and happiness. Things aren’t going Jonah’s way anymore. \nJonah rants and raves against the plant, and God asks Jonah if he’s right to be angry. Jonah thinks so. But God reminds Jonah of his place in the universe. The prophet had nothing to do with the plant. He didn’t plant it or grow it. It doesn’t truly belong to him. Jonah only cared about the plant because of what it gave him. His anger came when his comfort was removed and his selfishness exposed.\nJonah only cared about Jonah. God cared about the city of Nineveh, filled with people made in His image. Jonah was angry because Jonah was the most important thing to Jonah. And if I’m honest, most of my anger is about one person: Me, Me, Me.\nIs your anger me-filled? You will live in a state of anger if you only care about you. Jonah cared more about his shade than he did the revival that broke out in Nineveh. Do you care more about the kingdom of God than the barista getting your coffee order right? Do you get more upset by the traffic in your city or the fact that thousands in your city don’t know the risen Christ? Is your anger right?\nOur emotions reveal our greatest passions. May the crucified and risen Christ, His kingdom and His name, be our greatest passion.\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram19.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 3:1-10, Jeremiah 18:7-10, Nahum 1:2-11",
        "devo_title": "Jonah’s Preaching",
        "devo_summary": "\n                    \n                    I’ll never forget David. I met him one morning before our worship service. He made it very clear that he wasn’t comfortable visiting our church. In fact, this was the first time he had set foot in a church, period. After the service, he pulled me aside and made a hesitant comment about my sermon on Jonah that I will never forget. He said, “The gospel you preached just seems too good to be true. If you knew me, you would understand why.” I simply responded, “David, it may seem that way, but let me assure you, it is true.” \nHe returned the next week and the next. A month later, he walked into my office with tears streaming down his face and earnestly called out to God for salvation. David had come to realize the depth of his sin, and experienced the overwhelming grace of God in Christ.\nThe message of God in the book of Jonah is a message of grace. In chapter 3, Nineveh’s evil had come up before God. It was in the depth of their depravity that the Ninevites were met with the eternally significant words of the prophet: Repent, or God will destroy this city! This may not seem like a message of grace. But we have to remember, every warning before final judgment is an act of mercy. \nIt is simply astonishing that, in response to Jonah’s call for repentance, the people of Nineveh believed God. In fact, the entire city put on a fast and covered themselves in sackcloth, expressing grief, humility, and remorse. \nAs Christians, we can become so familiar with God’s grace that we lose sight of how amazing it is. The city of Nineveh was notorious in the ancient world for their wickedness. Of the city, the prophet Nahum declared, “Woe to the city of blood, totally deceitful, full of plunder, never without prey” (Nahum 3:1). By all self-righteous standards, Nineveh was the least deserving of God’s grace. But this narrative reminds us that it doesn’t matter if you are a Ninevite or my friend David; the grace of God is not deserved. That is what makes it grace.\nEveryone can call out earnestly to God. In fact, everyone must call out earnestly to God. We are all great sinners, but thanks be to God, Christ is a great Savior. It’s true when you come to terms with the deep depravity of your heart, the gospel may seem too good to be true. But it is true. Let us never lose sight of the power of the gospel.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram18.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 2:1-10, Psalm 88:4-5, Hebrews 4:16",
        "devo_title": "Jonah’s Prayer",
        "devo_summary": "\n                    \n                    I recently spent a month in Australia—away from my family, across the world. It was a tough time for me. Satan had a field day, tempting me in several ways. I often felt like Jonah in today’s passage, calling out to the Lord in distress.\nJonah and I were in different spots. His struggles and loneliness came from his running from the Lord’s call. Mine came from a work and study trip. Jonah knew God was sovereign, but he also knew he was on the boat because of disobedience, avoiding God’s call for him to go to Nineveh. So he jumped overboard rather than facing the God he was running from. He took his chances in the open sea rather than turning his eyes to the heavens. \nJonah feared the uncontrollable. I was no different while on my trip, and even today. So often I find myself trying to white-knuckle it, trying to convince myself to simply feel better. I try to take things into my own hands, just like Jonah. And like me, Jonah didn’t turn to God, the only One who can give any of us true rest.\nIt’s easy to judge Jonah. We pretend as though we’d answer the Lord’s call and go wherever He called us to go. But I know in my own life, I’m often just like the runaway prophet. \nEvery one of us is in the same spot as Jonah. We all need the Lord every day, and yet we often run from Him, jumping into the sea instead of lifting our eyes to the heavens. But if, like Jonah, we call out to the Lord, He will answer. God doesn’t ignore our cries for help. He doesn’t tell us to ask someone else to fix our desperate situations. He hears our cries and proves Himself faithful. “Therefore, let us approach the throne of grace with boldness, so that we may receive mercy and find grace to help us in time of need” (Hebrews 4:16).\nWhat in your life feels like the storm that rocked Jonah’s boat? In what ways have you jumped overboard, choosing the chaos of the sea over the peace of heaven? Call on the Lord. Lift your eyes and approach Him with assurance. He stands ready to bring you to dry land.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram17.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 1:1-17, Psalm 104:24-26, Matthew 12:38-42",
        "devo_title": "Jonah’s Call",
        "devo_summary": "\n                    \n                    I once had a job that started at 4:30am. Imagine how early I had to set my alarm so I could have enough time to get up, get dressed, and get to work. It was early! I genuinely hated my job. Working there was taking me in a direction I did not want to go. Every time my alarm went off, I wanted nothing more than to hit snooze, roll over, and go back to sleep.\nIn the story of Jonah, God was like an alarm clock telling Jonah to get up and go to work. Jonah didn’t want to go. And he didn’t just choose to hit the snooze button; he decided not to show up at all. In fact, he tried to run as far away from the job as he could. \nWhen Jonah hopped on a boat to escape God and dodge the call to preach to Nineveh, a violent storm nearly sank his getaway vehicle. As this great storm threatened to destroy the ship, Jonah was sleeping so deeply he wasn’t even phased by the storm. How in the world was Jonah so dead asleep? Though we’d be guessing, of course, it’s possible Jonah was actively avoiding God’s call even in his sleep. Often we sleep not only because we’re tired, but because we’re trying to shut ourselves down completely—physically, spiritually, and relationally. God was calling Jonah to wake up to the needs of the people God asked him to serve. This was what Jonah was trying to sleep through—not just the storm.\nJonah did not want to obey God’s command to do the work he was called and equipped to do. As with other reluctant servants in Scripture, it’s easy to scoff at Jonah for being disobedient. But let’s be honest for a minute, friends. How many of us have been instructed by God to “get up” and go do something? How many of us, like Jonah, think we can escape not only the call on our lives, but also the presence of the One who calls us?\nIn Jonah’s story, we see there is no getaway vehicle that can outrun God’s faithful presence. The gospel of Jesus tells believers that though we may run from God, He faithfully chases us with His grace. \nWhen we find ourselves hitting the snooze button on God’s alarm clock, perhaps it’s time to wake up. Perhaps it’s time to trust in the One calling us, and go where we believe He’s sending us. Even in our disobedience, we will never be able to outrun the steadfast, constant, and gracious love of God that strengthens us. \nWritten by Jevon Washington\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram16.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Obadiah 1:1-21, Genesis 27:41-42, Ezekiel 25:12-14",
        "devo_title": "Future Blessing",
        "devo_summary": "\n                    \n                    It takes real courage, or mule sense, to take five small children on a hike up a mountain. But it takes a special kind of self-reliance to haul the kids up the mountain without knowing the length of the trail. Hiking in the North Cascades, we shared big hopes to see mountain lakes and snow-capped peaks. And as the pater familias—“the father of the family”—I knew exactly who should be the one to choose the trail to lead us there. \nAfter what seemed like hours of hot trudging back and forth and up and down over the switchbacks, my family was starting to wilt. We pressed on, in spite of the children’s protestations, and made it to the end of the trail. What I’d thought would be a quick quarter-mile walk turned into what I now assumed was a seven-mile journey.\nWhen we got back to the trailhead, ice cream promised to the children, I saw that I was wrong in both coming and going. I had chosen the wrong trail in the first place, and then underestimated its length; the trail was actually four miles long. Despite my confidence at the outset, and my wife’s loving support, I had misread everything.\nDo you trust yourself? This can be a complex question to answer, but I reckon most of us trust ourselves to a great degree. I find that my proclivity is to trust my own judgment, my own opinions, my own perspective. And this is often what gets me in trouble, because all of these things—judgment, opinions, perspective—are the fiercest arenas of spiritual warfare. Here, the flesh and the Spirit battle. \nWe love to arm ourselves with worldly securities, with finances and influence, possessions and talents. To have such things is no sin, but to trust in them causes great peril. When we trust in our own strength, in our own fleshly accumulations, we find that all our allies have driven us to our borders, deceived us, and even conquered us (v.7). \nWhen we lean on our own understanding, the pride of our hearts deceives us (v.3). We become like Edom, the recipient of Obadiah’s message of judgment. \nMatthew Henry observed: “Those that make flesh their trust, arm it against themselves.” The folly of Edom was this trust in self, in the strength of arms, in strongholds and lofty dwellings. Their faith was in a kingdom of this world.\nFaith always leads to practice. Worldly trusts inevitably lead to worldly living, and for Edom, the natural fruit of their self-trust was disregard for their neighbors, Israel. In arrogance, Edom stood by aloof and idle as Israel suffered, gloating over the calamity of God’s people, and believing it to be a means for their own gain. \nThis is a persistent and natural temptation for all of us, no matter how we dress it up. But thankfully, the new kingdom will be the Lord’s (v.21), and His kingdom is not built upon earthly trusts. What a great blessing, to see this prophecy already fulfilled in our own day! Though partial fulfillment was evident in Israel’s return to the land of Palestine, the final fulfillment is in Christ, who has come to upend all false and worldly faith. \nThe kingdom of the world is now the kingdom of God and of His Christ (Revelation 11:15). May we, with grateful hearts, honor Christ alone as King. May we yield all our trust to Him, and may His kingdom come and His will be done, on earth as it is in heaven.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-instagram15.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 5:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we walk through these Minor Prophets together, we are memorizing key verses from our reading. The key verse for the book of Amos reminds us that justice and righteousness are pleasing to the Lord.\nBut let justice flow like water,\nand righteousness, like an unfailing stream.\n—Amos 5:24\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/4-MP-2.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Psalm 47:8",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod reigns over the nations;\nGod is seated on his holy throne.\n—Psalm 47:8\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram13.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 8:1-14, Amos 9:1-15, Psalm 53:6, Ezekiel 37:25",
        "devo_title": "Judgment and Restoration",
        "devo_summary": "\n                    \n                    Throughout my childhood and teenage years my family moved around a lot. I have no memory of living in a house longer than three years until I was 35 years old, so I have never really associated home with an address or an ornate front door knocker. I often wonder what it’s like for people who have lived in the same house their whole life: same address, same phone number, same neighbors, same drive to school, not to mention the same school. There is something about that life, one with a place called “home,” that I can’t relate to very much.\nI think moving gets in your blood and eventually becomes normal. It might be unhealthy, but this is normal to me. This gypsy life does have its benefits: you develop a knack for making friends quickly; you never feel lost (or you always do and it just becomes a familiar feeling); and you accept that change is a part of life. But there are plenty of downfalls, too—mainly that commitment becomes a struggle, a long-range view of the future is nonexistent, and roots are hard to plant.\nOne of the great promises of the gospel is that we will be rooted—home at last, forever in the place we belong, where we are fully known and fully loved. \nWe can try to take it upon ourselves to put down roots that can’t be pulled up, to try and make ourselves secure. But on a spiritual level, this is not something we can do on our own. As today’s text points out, this is something God must do. \nGod will plant His people, and they shall never again be uprooted. This is a gift from God—having a place, a story, a history, an identity, all from Him. How often do we toil to create our own place and security? How often are we let down because it just isn’t what we’d hoped?\nWhat is the uprooting that you fear most? God’s promise of a home is beyond any space we could call our own apart from Him. The place He establishes for us will never be taken away. He will never uproot us from His promises, and He will never leave us or forsake us.\nWritten by Jason Tippetts\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram12.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 6:1-14, Amos 7:1-17, Psalm 47:1-9, Acts 4:13-20",
        "devo_title": "Woe to the Complacent",
        "devo_summary": "\n                    \n                    It sounded like the water sprinkler from my front yard.\nOnly problem was, we were well over a mile from our house, working our way up a narrow and winding trail on the front range of the Rocky Mountains. Switchback after switchback, the going was slow, but the views were more than rewarding. My wife and I were comfortably lost in casual Sunday afternoon conversation.\nAfter a couple more seconds, it registered that we should not be hearing anybody’s sprinkler at this altitude and time of day. That’s when we both saw it.\nOut of the corner of our eyes, my wife and I both saw the rattlesnake’s head and torso rising up out of the tall grass. Its tongue was flickering, and from about 4 feet off the trail to our right-hand side, its eyes had drawn a bead directly on us.\nI turned to my wife and our eyes locked in unison before we booked it down the path.\nTalk about an adrenaline rush. Whew, buddy!\nMy heart and demeanor jumped into high gear, from slightly careless and complacent, to ultra-vigilant and alert. I have thanked God dozens of times for protecting us from that close call.\nWhile the comparison is not perfect, I think I understand a bit more clearly Amos’s message from our reading today: “Woe to the complacent!” Granted, we were simply taking an afternoon stroll, whereas Amos was addressing a people who had grown spiritually and morally corrupt in the midst of comfort and luxury. So, big difference in context. However, to be jarred rapidly out of your comfort zone is something that I am freshly familiar with.\nIf I’m honest with myself, my spiritual life can often be this way. Have you ever noticed that in your own life? It’s when we’re most comfortable materially and most secure socially that we begin to invest less and less into our spiritual well-being and our relationship with God. \nThere’s an old adage which says the truth ought to “afflict the comfortable and comfort the afflicted,” and that is exactly the paradigm we see in Amos and many of the other Minor Prophets. \nThe Lord gave the prophet a vision of the impending destruction that was the result of the people’s wayward behavior. This was an act of divine kindness. It was like the sound of the rattlesnake on the path. \nWhen God uses affliction or trouble to wake us from our complacency or slumber, it is always a gift of mercy, lest we wander off into what can hurt us. And when Amos heard the warning and cried out, “Lord God, please forgive!” (7:2), the Lord heard his prayers, and they were answered immediately. Our God is a God of rescue and grace.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram11.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 5:1-27, Micah 6:8, Philippians 4:8-9",
        "devo_title": "Seek God and Live",
        "devo_summary": "\n                    \n                    I can remember the first time I heard “Blowin’ in the Wind.” I mean really heard it.\nBob Dylan was not new to me, but I was digging in deep now. So I bought Bob Dylan’s Greatest Hits, his first compilation album. The first song was “Rainy Day Women #12 & 35,” which is a rollicking good-time song. But then it came on, and for the first time I really heard it.\nA lament.\nI did not have that category in hand to dignify the song and my feelings along with it. All I knew was how I felt while listening. It was a protest song. It sounded like the most beautiful indictment of injustice I’d ever heard…\nHow many roads must a man walk down\nBefore you call him a man\nAs far as I was concerned, it sounded like one of the Old Testament prophets decrying the injustice of God’s people who had been given so much.\nWhen God, through the prophet Amos, rails against Israel in chapter 5, it is a lament—a lament over their sins of injustice and their lack of seeking after Him in a life of repentance and holiness.\nMore than once in that chapter is the command to seek the Lord, and then there is that famous verse 24: “But let justice roll down like waters, and righteousness like an overflowing stream.” But here is what’s most interesting to me: while the people appear to be doing what is commanded of them by God, He still does not seem very impressed by them.\n“I hate, I despise your feasts,\nand I take no delight in your solemn assemblies.\nEven though you offer me your burnt offerings and grain offerings,\nI will not accept them;\nand the peace offerings of your fattened animals,\nI will not look upon them.\nTake away from me the noise of your songs;\nto the melody of your harps I will not listen” (Amos 5:21-23).\nWhat is going on here?\nWell, that famous verse 24 gives us a clue. God wants justice and righteousness. Israel may be doing all of the outward requirements of the law, but what they really need is an internal change of the heart.\nImagine a church full of people who sing wonderfully, listen to the sermon, give their tithes, and practice the sacraments rightly. But they cannot get along and be kind to others, much less to the vulnerable. And morally speaking, they are a mess. That’s a good picture of Israel. They needed to be changed from the inside out.\nWe can easily fall into the same trap. We think doing all the right things—church attendance, quiet times, tithing, etc.—will buy us favor with God. But Amos chapter 5 points to the futility of such thinking. We need to hear this lament, and then “seek Him and live.”\nWhen we seek Jesus, as revealed in the gospel, we see not only the futility of our efforts to earn God’s favor, but also His provision of a changed life. This kind of freedom allows us to pursue justice and righteousness, not to gain His favor, but because we already have it.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram10.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 3:1-15, Amos 4:1-13, Psalm 65:5-8, Romans 11:1-6",
        "devo_title": "God’s Discipline",
        "devo_summary": "\n                    \n                    When I think of the Minor Prophets, I’m reminded of jolly ol’ Saint Nick. Santa Claus is a never-harm-a-fly, squishy, happy old man who gives out toys and delights to children all around the world. And sadly, a lot of people think of the Almighty God in this way too. Many picture God as some old man in heaven with rosy cheeks and a big beard; the worst He’ll do is give you a lump of coal.\nAmos is an armageddon against all Santa-like thoughts of the Almighty God.\nThe prophet Amos proclaims a side of God we don’t gravitate toward. Amos reminds us of God’s war helmet, His military boots, and His might to tear down the nations. Forget the fuzzy red hat. In Amos, God is rocking the regalia of a five-star general to the infinite power. The God of Armies is His name. He is the King of kings and the Lord of lords. He is the great master and commander. God would make Alexander the Great break out in a cold sweat. Napoleon would hide under his bed when facing this God of Armies.\nGod’s might is unmatched. No one can be delivered from His disciplining action. Israel knows this first hand. Their rebellion against the God of Armies brought the swift strike of discipline—and love.\nRemember, “For the Lord disciplines the one he loves” (Hebrews 12:6). God disciplines His children because He loves us. If He didn’t love us, He’d let us do our own thing. But like every loving parent—the kind who doesn’t let their kid run wild without boundaries—He reins us in, even if it takes a strong tug on the arm, or a nail through His own wrist.\nThe God of Armies loves us to a degree that leaves us slack-jawed. The God of Armies carried out His wrath on Jesus, instead of you and me. The God of Armies is not against us—He is for us. By faith in Christ’s death and resurrection, we are with Him. We are on His side. \nThe God of Armies loved us so much that He sent us His Son, Jesus of Nazareth, to die in our place and for our sins. The Minor Prophets remind me of Christmas for this reason too—we need the incarnate Messiah to save us from our sin and from the wrath of the God of Armies. And this is precisely what Christ does.\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram9.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 1:1-15, Amos 2:1-16, Psalm 33:13-22, Isaiah 42:10-13",
        "devo_title": "Judgment on Israel and Her Neighbors",
        "devo_summary": "\n                    \n                    Fire is both beautiful and dangerous. There is something about it that seems to draw us in. When I sit in front of a fire pit on a crisp dark night, I find that I am often mesmerized. But while fire attracts with its stunning movement and color, it also repels with its dangerous heat. It’s a fascinating paradox: you cannot get too close to it without being injured, and at the same time, you cannot look away. \nIt is no coincidence that in the Bible, God’s presence is often made manifest in fire. His holiness and wrath against sin cause us to approach Him with humility and reverence as broken sinners. And, in the first few chapters of Amos, the writer marshals the attention of the rebellious Israelites by using fire as a primary metaphor in his message. For Amos in particular, the imagery of fire is predominately used for judgment. It is abundantly clear in Amos chapters 1 and 2, that in response to Israel’s repeated rebellion, “God will not revoke the punishment” (1:3). Our God roars from Zion!\nAnd yet, even as God has decided to judge the world for sin, His gavel falls only after a season of patient endurance. Thankfully, in the sweep of biblical history, we are able to see that God is slow to anger (Psalm 103:8). Like the Israelites of the Old Testament, we can cry, “Lord, have mercy.” And thankfully, God answers that cry, extending mercy to those who honor and fear Him (Psalm 33:18-19). \nWith the coming of Christ, the fire of judgment has been lit. The question for all of us is this: Will we cry out to God for mercy in Jesus Christ? Every person that has ever lived will acknowledge that Jesus Christ is Lord. That means that either we repent and confess Him by faith now, or we will confess Him in shame and terror on the last day. We will either be consumed in fiery wrath on the last day, or we can become the products of fiery refinement today. Our response to the gospel determines our outcome in the final day of fire.\nThe good news of the gospel is this: it is by grace through faith in Christ alone that we are delivered from death (Ephesians 2:8). He is calling out to us. “The Lord roars from Zion and makes his voice heard from Jerusalem” (Amos 1:2). And while we approach God with both humility and reverence, as Christians we can also rest in His steadfast love. \nO Lord, be upon us, even as we hope in you.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram8.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 2:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we walk through these Minor Prophets together, we will memorize key verses from our reading. The key verse for the book of Joel calls us to true repentance. \nTear your hearts,\nnot just your clothes,\nand return to the Lord your God.\nFor he is gracious and compassionate,\nslow to anger, abounding in faithful love,\nand he relents from sending disaster.\n—Joel 2:13\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/4-MP-1.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Romans 5:20-21",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut where sin multiplied, grace multiplied even more so that, just as sin reigned in death, so also grace will reign through righteousness, resulting in eternal life through Jesus Christ our Lord.\n— Romans 5:20-21\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram6.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 3:1-21, Isaiah 33:20-22, Jeremiah 33:1-11",
        "devo_title": "Israel Blessed",
        "devo_summary": "\n                    \n                    In his song “Jubilee,” Michael Card captures the essence of the gospel’s comfort when he writes:\nTo be so completely guilty,\nGiven over to despair;\nTo look into your Judge’s face,\nAnd see a Savior there!\nWhen we realize who God is, in all of His righteous judgment, and then turn to see all that He is for us in Christ Jesus, we stand in astonishment, knowing that the God who “sits to judge all the nations” is also “a refuge to his people” (Joel 3:12,16).\nGod intends to bless His people with all His rich and bountiful blessings. In order to stir up the reality of this truth in our minds and hearts, the Lord sets the stage, painting the picture of all the nations being brought before Him in judgment in the valley of Jehoshaphat, in order to “enter into judgment with them there” (v. 2).\nIn that valley, the Lord holds the nations in contempt for all the ways they have oppressed His people (vv. 4-8), and then calls the nations to appear before Him as in a battle. The outcome is most certainly judgment and desolation (v. 19).\nJoel draws a strong contrast between the nations and the people of God (vv. 16-21). Instead of executing judgment in the “winepress” of His wrath (v. 13), the Lord promises to make “the mountains drip with new wine” (v. 18). Instead of making a desolate wilderness out of His enemies (v. 19), the Lord promised to send a streambed and a fountain forth from His house for the blessing of His people (v. 18). Borrowing language that reminds us of the blessings of God in the garden of Eden, the Lord symbolizes the spiritual blessings He will give His people in Christ.\nWhat makes the difference between Israel and the nations? Why has God promised to be a refuge to His people when they deserve exactly the same treatment as that of the nations? The answer is discovered in the references to Judah—“the streambeds of Judah” that will leave “Judah inhabited forever” (Joel 3:18-21). Jesus is the Lion of the tribe of Judah, the One who drinks the bitter cup of wrath in the place of His people, so they can drink the sweet wine that flows from the mountain of His grace. \nGod’s promises are good and true because of who He is. As we look to Him by faith, we will find not just the face of our Judge, but the face of our Savior as well.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram5.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 2:18-32, Zechariah 10:6, 1 Thessalonians 5:2",
        "devo_title": "God’s Promise of His Spirit",
        "devo_summary": "\n                    \n                    “Because I said so.” \nThis was a sentence I loathed as a child. Whenever my parents or teachers said it, I could feel my hackles rise, and I don’t even have hackles. It felt like such an in-your-face display of authority. Why must I do this thing? Because they said so. That didn’t feel like a reason. It felt dismissive, even if their position of authority gave them every right to command me without providing what I deemed a proper explanation.\nToday’s passage from Joel essentially says, “Because I said so”—but with a twist. Instead of it being a blunt or dismissive command, it is a promise. Because I said so. Who? God. That is, after all, what the entire sentence is hinging on: The person who makes the promise determines its validity and efficacy. And in this case, God is the one making the promise.\nIsrael was under duress from invaders, as judgment for their own rebellion against God. They were in captivity, facing starvation, and had lost their home. So, as they’d done throughout the Old Testament, they cried out to God, and, as He’d done throughout the Old Testament, God listened. He offered them a glorious promise of feasting and health, of vindication, and of fullness. The people could “rejoice and be glad, for the Lord has done astonishing things” (Joel 2:21).\nThey could rejoice because He said so—the same God who had done astonishing things dating back to the creation of the world. This passage echoes of those things. It echoes of Jubilee (Leviticus 25)—a freeing and redeeming time—when God promised Israel, “I will repay you for the lost years” (Joel 2:25). It echoes of the burning bush and of Sinai (Exodus 3;19-24). These are markers, reminders of God’s sovereignty, which prove that He is the Lord and there is no other (Joel 2:27). \nThroughout the Minor Prophets, God threads these I AM—or “Because I said so”—phrases so people will know the promises are true. He reminds the hearer repeatedly, “I am the Lord.” Why? Because in times of trial (and in times of ease) we forget. We forget who we are and whose we are. We forget what God has done in the past and lose sight of His help both now and in the future. \nBut God knew this about us, and so He promised the pouring out of His Spirit (Joel 2:28,32)—“the Spirit of adoption, by whom we cry out, “Abba, Father!” (Romans 8:15), and the seal of God upon those who love Him (Ephesians 1:13). He gave us His Spirit to remind us of what’s true.  \nGod has promised us restoration and redemption. But He also promises us Himself. And just like He did for Israel through the prophet Joel, He promises to deliver us to fullness, joy, and health, too—a Jubilee to those who belong to Him. That is our future promise. And though we don’t know when it will come true, we can trust Him to bring this, and all of His promises, into fruition, because He said so. \nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram4.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 2:12-17, Zephaniah 1:7, Romans 5:18-21",
        "devo_title": "God’s Call for Repentance",
        "devo_summary": "\n                    \n                    Toward the end of Star Wars: Episode III – The Revenge of the Sith, Obi-Wan Kenobi and his former apprentice, Anakin Skywalker, face off on the shores of a sea of lava on the molten planet of Mustafar. You may remember the scene—it’s one of the only good ones in the prequels.\nObi-Wan pleads with Anakin. He knows he has the higher ground, that Anakin has no chance of defeating him. And so in an effort to prevent Anakin’s self-destruction, Obi-Wan begs him to stop, saying, “You were the chosen one! It was said you would destroy the Sith, not join them!”\nIn the book of Joel, we see the people of God rebelling against His compassionate rule yet again. A plague of locusts has stolen the wine and grain that the people of God rely on for the sacrifices of atonement they make to Yahweh. “The day of the Lord is near,” God says through Joel, and with the day of the Lord comes the righteous judgment of all people (Joel 1:15). But in the face of imminent judgment and destruction, God cannot let His people stay where they are in their rebellion.\nAnd so once again, through His prophet Joel, God calls out to His people: “Turn to me with all your heart, with fasting, weeping, and mourning. Tear your hearts, not just your clothes, and return to the Lord your God” (Joel 2:12-13a). The Lord is pleading with His people to repent and return to their rightful place, worshiping Him as His chosen people.\nLike a loving Father with a wayward child, God’s heart breaks for His rebellious people. In His justice, He cannot withhold His judgment, and in His grace, He calls them to repentance. “Who knows?” the prophet writes, “He may turn and relent and leave a blessing behind him, so you can offer grain and wine to the Lord your God” (v.14).\nEven when we trust in the finished work of Christ to free us from our slavery to sin, we still rebel against the goodness of God. Even as we grow in Christ’s likeness, we forget that the day of the Lord is coming and that we will face judgment. But in love, the Holy Spirit within us cries out, reminding us of who we are as children of God, and calling us to repentance. “For he is gracious and compassionate, slow to anger, abounding in faithful love, and he relents from sending disaster” (v.13b).\nTear your hardened heart, and let the grace of God soften it, making it whole in Christ.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram3.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 1:15-20, Joel 2:1-11, Psalm 43:4, Romans 10:13",
        "devo_title": "The Day of the Lord",
        "devo_summary": "\n                    \n                    People rarely read the Minor Prophets. That’s no secret. They’re mostly short books, so they’re often flipped right over on accident, and they’re usually not real peachy. The book of Joel isn’t much different.\nJoel is a textbook prophet, though. The prophets’ ultimate job was to pronounce, on behalf of the LORD, blessing and judgment on God’s people. If they obeyed God, they’d be rewarded. If they disobeyed, they would experience His wrath. We should not avoid these parts of Scripture because they’re terrifying or seem less important than, say, the book of Psalms or the Gospels. But every word of God’s Word has a word for us. Yes, even the book of Joel.\nNo doubt, it can be difficult to read passages like today’s and find them applicable to us. But that may be, at least in part, because we don’t understand the goodness of God’s warning of judgment. None of us like to be disciplined, but as we’re told in Hebrews, our Father’s discipline is for our good. Good dads discipline their children (Hebrews 12:6-11).\nIn this passage, we see words like “tremble” and “devastation,” but we also see the promise of God’s salvation. God disciplines because He loves, and He judges because He cares about righteousness. His awesome presence ought to cause holy fear and trembling, and yet, we also know that He is good and merciful to those who love Him. \nRemember the words of Romans 10:13: “Everyone who calls on the name of the Lord will be saved.” This is why Jesus was sent into the world. In love, the Father sent Him for our salvation. He saw our sin, and sent His Son to die for it. He heard our cries, even the cries we didn’t know how to let out (Romans 8:26-27).\nIf His coming brings fear in your heart, if His discipline feels too strong, you’re invited to cry out to Him. He is not detached. He listens. He hears. He responds. Call on His name.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram2.jpg"
    },
    {
        "book_title": " Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 1:1-14, Isaiah 17:10-11, Acts 2:17-21",
        "devo_title": "Joel’s Prophecy",
        "devo_summary": "\n                    \n                    The book of Joel opens with bugs. Lots and lots of bugs. Locusts, to be precise. And they are eating everything in sight. They are like a giant eraser, wiping clean the chalky fields of Israel. The Lord wants His people to know the plague is meant to wake them up to their need to repent. Devastation and desperation have this effect on people. It will cause us to cry out to the Lord for salvation (Joel 1:14).\nJoel is one of the Minor Prophets in Scripture. What are the Minor Prophets, you ask? For starters, they are books, not people. There are twelve of them: Hosea, Joel, Amos, Obadiah, Jonah, Micah, Nahum, Habakkuk, Zephaniah, Haggai, Zechariah, and Malachi. These books are called “minor” because of their length. Compared to the “major” prophets—Isaiah, Jeremiah, Lamentations, Ezekiel, and Daniel—they are relatively short. But they are no less important than any other part of God’s holy Word.\nBooks like Joel confront, head on, the fracturing effects of sin and present a God who is committed to rooting it out, no matter how deep it runs. We need that. Occasionally, as we see in these opening verses from Joel, God roots out sin by bringing us low. I don’t know about you, but I often need to be humbled before I have ears to listen to the Lord.\nJoel and the other Minor Prophets talk a lot about judgment, but they also talk about hope. Today, we see the judgment of God from this side of Christ’s finished work on the cross. We take comfort in knowing God’s wrath has been satisfied through Jesus’ life, death, and resurrection.\nIt is tempting to want to distance ourselves from really studying the wrath and judgment of God. It can be uncomfortable to look at. But when we turn aside from examining God’s righteous judgment, we lose sight of His holiness and majesty, and in the process also lose a sense of the magnificence of Christ’s sacrifice on our behalf.\nThe Minor Prophets help us with this. If we come to these books—books like Joel—with a humble posture, they will break our hearts in the best way. They show the darkness of sin and leave us desperate for a salvation none of us could accomplish on our own. The Minor Prophets remind us of our hope in Christ, as they also remind us that apart from Him, we have no other hope.\nAs you read through these books, perhaps a good verse to keep at the ready, in order to remember both our desperation and God’s salvation in Christ, is Joel 1:14:\nAnnounce a sacred fast;\nproclaim an assembly!\nGather the elders\nand all the residents of the land\nat the house of the Lord your God,\nand cry out to the Lord.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/09/HRT-MinorProphets-Instagram1.jpg"
    }
]