[
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 24:15",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing this beautiful verse of commitment:\nBut as for me and my house, we will serve the LORD.\n—Joshua 24:15 \nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/4-HHymns1.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Matthew 11:28-30",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n“Come to Me, all of you who are weary and burdened, and I will give you rest.  All of you, take up My yoke and learn from Me, because I am gentle and humble in heart, and you will find rest for yourselves. For My yoke is easy and My burden is light.”\n—Matthew 11:28-30\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram20.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 23:1-16, Joshua 24:1-33, Matthew 11:28-30, Hebrews 4:1-13",
        "devo_title": "Joshua’s Farewell Address",
        "devo_summary": "\n                    \n                    “Always” and “never” are two words people should use judiciously. We rarely understand their implications or the demand they put on us. “I will always be here for you.” “I will never forget you.” Well, until I’m not or until I do. People too often fail to live up to the demands of these words.\nNot so with God. When He says “always,” it means always, and when He says “never,” it means never. The last chapters of Joshua exemplify this clearly for us.\nJoshua has reached his end. He is “old and advanced in years” (Joshua 23:10). He is on death’s doorstep and he cares about what will happen to the people when he is gone. So he calls Israel together and addresses them. He reminds them that God has always been faithful, always kept His promises. Joshua reminds them that God will always keep His covenant and never forsake them if they remain faithful to His Word. Joshua recounts how they never won a battle without God and always needed Him. \nThe people responded, as you would expect, with a promise they could not keep. They would always be obedient to God, always be faithful, and never abandon His ways for the false gods around them. But we know this was not the case. People’s promises die faster than the bodies that utter them. Time, mortality, and sinful human nature rendered Israel’s promise moot. \nThe people fell away after the fall of their leader. Israel had taken on a burden they could not bear—the burden of perpetual obedience in their own strength, the burden to follow God’s law in lockstep. Joshua’s leadership, no matter how great, was not enough to show them how to do this. Something more was needed, and that is the very point of this book (and the entire Old Testament). It all points forward to the One Man for whom always and never are not too great a burden.\nJesus said His yoke was easy and His burden was light, not like the Old Testament law. He did not do away with the law, but rather fulfilled its demands: perfect obedience, flawless sacrifice, and honoring God in every way. Jesus did what Joshua could not. He provided the way—He was the way—to permanent rest in a perfect Promised Land.\nWhen we read of leaders like Joshua, we should see faint, distorted reflections of Jesus. Joshua points forward to the One who will always keep His promises, will never forsake His people, and will one day bring us home to the eternal Promised Land. \nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram19.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 22:1-34, 2 Corinthians 1:21-22, Psalm 7:8-11",
        "devo_title": "Altars of Remembrance",
        "devo_summary": "\n                    \n                    We are called to love our neighbors as we love ourselves. But it can be hard to live in solidarity with others, even with people we know we are tied to.\nAfter the dust had cleared from all the fighting, Joshua told the tribes to go settle the lands allotted to them. On their way home, the tribes who settled east of the Jordan built a monument near the river so massive that it almost started a civil war. It was a simple misunderstanding, really. But after all we’ve seen in this book so far, it is not hard to imagine that everyone would have been on edge.\nHere’s what happened. The tribes of Reuben, Gad, and the eastern half of Manasseh comprised the Israelites who settled on the east side of the Jordan. Everyone else settled on the west. If you’ve ever lived in a place divided by a river, perhaps it has been your experience that the neighborhoods on the other side seem further away than those on your side that are the same distance away.\nThat sense of being cut off would have been doubled for the Israelites who did not have the convenience of bridges. Reuben, Gad, and the eastern half of Manasseh didn’t want to feel cut off from the rest of their people. They didn’t want to be forgotten. And they, themselves, didn’t want to forget the rest of their countrymen to the west. So they built a large monument by the Jordan River—big enough for tribes on both sides to see from a great distance.\nThe tribes west of the Jordan mistook the imposing monument as a possible sign of aggression from the eastern tribes—as a boundary they should think twice about crossing. When the western tribes confronted the eastern tribes about this, they learned that the altar was not built as a symbol of division, but as a gesture of solidarity with their countrymen in Canaan.\nIt is easy to misread the intentions of others. Imagine the conversations the western tribes had about the monument the eastern tribes built, as suspicions arose and as they wondered if they were going to have to engage in a civil war after all they had just been through together.\nJoshua’s instruction to the people in Joshua 22:5 is the same command God has always given His people: love the Lord with everything we have and everything we are. From this flows the command to love our neighbors as we love ourselves. Sometimes loving our neighbors well means risking difficult conversations in the hope of finding peace and clearing up confusion or conflict.\nWe all do things that can be misconstrued by others as being malicious. And every one of us has, at some point, misunderstood the actions of others—sometimes assuming the worst, only to find out later that our assumptions were way off.\nThe second greatest command, Jesus tells us, is to love our neighbor as we love ourselves (Matthew 22:39). What situation in your life warrants an awkward conversation? What would it take to risk that conversation in the name of peace and love? What will it cost not to?\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram18.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 20:1-9, Joshua 21:1-45, Exodus 21:12-14, Hebrews 2:14-15",
        "devo_title": "The Lord Fulfills His Promises",
        "devo_summary": "\n                    \n                    In recent years, there has been no small debate in the media over what have been called “sanctuary cities”—that is, those cities scattered throughout the United States in which illegal immigrants have been allowed to live without fear of extradition. Whatever we may think of this concept in our current political climate, the reality of such “sanctuary cities” carries echoes of the “cities of refuge” mentioned in Joshua 20.\nAfter Joshua led Israel to take possession of their promised inheritance—having given God’s people physical rest from their warfare—the Lord told Joshua to appoint cities of refuge which would serve as safe-havens for anyone who unintentionally took a life (Joshua 20:1-6).\nIt is not immediately clear what to make of these “safe-havens” for the accused. However, it begins to make sense as we put together several details unfolded in the passage. What it says is this: an individual who has been accused of murder—and who is either merely accused or guilty of unintentional bloodshed—can flee to a city of refuge. The elders of the city shall then protect the accused party from the wrath of the avenger of blood (usually a relative of the one who has been murdered). The guilty party needs to then remain in the city until the death of the High Priest, after which he can return to his home in peace and safety. \nThe hinge on which this entire passage turns is that the death of the High Priest is regarded, in some sense, as an atonement for the blood that was shed. The accused party is set free by the death of the High Priest. \nSinclair Ferguson sums up the gospel significance of this so well when he says, “Jesus, who has the same name as Joshua, provides us with a city of refuge in which we can hide from the consequences of the guilt of our past actions, and not only a city in which we can hide but an open door into liberty and life because He is the High Priest—the High Priest beyond all other High Priests, who has died in order to deal with our sins.”\nGod not only gave Israel a partial rest in the promised land, a type of the eternal rest to come for believers. He also gave them this law to remind them that guilty sinners need rest from the guilt of their sin. Just like those who fled to the city of refuge for that rest, so now we flee to Jesus to find rest from the guilt, condemnation, and judgment of our sin. \nWe flee to Christ and we are safe. \nWritten By Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram17.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 19:1-51, Genesis 49:1-28, Acts 13:16-25",
        "devo_title": "Joshua’s Inheritance",
        "devo_summary": "\n                    \n                    The birthday cake has just been cut, the kids are ready, and the screaming ensues—“I want the first piece!” Being first feels right to a kid. We can all create great stories about how we deserve the privilege of being first. \nFirst is attractive because you know there will be enough. There is no danger of getting left out when you’re at the front of the line. First means you will get your piece of the cake. \nBut we all know that to insist on being first is selfish and glares of pride. I often think I would rather be next. Not first, but next—perpetually next. That way I won’t look as arrogant, and I can look over the shoulder of the person in first place and still know there is enough for me. Being next appears less selfish and I know I’ll still get my piece cake.\nJoshua was neither first nor next. He was actually beyond last. Joshua 19:49 reads, “When they had finished distributing the land into its territories, the Israelites gave Joshua son of Nun an inheritance among them.” The land had been given; the cake had been handed out. Joshua missed the joy of being first and even the expectation in being next.\nLand was the economy of life in that time; no land equaled no life. But maybe Joshua had the audacity to hope for a different land, a different life. Maybe he understood the joy and sacrifice of being the parent at the birthday party—the one whose job is to serve cake to dirty-faced kids who each would love to be first, and who have great sales pitches for why first place suits them best.\nWe’re told the land for the tribes was divided by lot (Joshua 14:2), which was a common way to keep the ‘sales pitches’ in check and acknowledge God’s place in distributing the land. Joshua’s inheritance, however, was given by the people. As the leader, Joshua modeled selfless living before the tribes, and they saw the example he set. They saw how Joshua served God and how they benefited from his faithfulness. So the elders honored his leadership and sacrifice by giving him an inheritance of his own. In God’s economy, there was still plenty left for Joshua.\nLike a parent who serves his children before himself, Joshua was a leader who waited. In his waiting, Joshua trusted the God who sustained him. Joshua knew the greater inheritance was not in the land or in the praise of the people he led. His inheritance was that the God of all creation knew his name.\nThe patience of waiting is a grace to be learned. As followers of Christ, we hope for a greater inheritance than we will experience in this land. That hope is evident in our contentment to be beyond last, knowing that the God of creation knows our names too. As heirs with Jesus, we will not be left out.\nWritten By Jason Tippetts\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram16.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 17:1-18, Joshua 18:1-28, Hebrews 9:1-14",
        "devo_title": "Tribal Divisions",
        "devo_summary": "\n                    \n                    When I was in college, I spent a semester living in Israel. It was amazing. One of the things that took some getting used to was how old everything there was. It was common to visit places that had been around for thousands of years. I remember one day going to a crusader castle that was built only 1,000 years ago, and thinking it looked so new compared to everything else. But most of these old places had one thing in common: they were ruins.\nHow strong does something need to be, and how long does it need to last for you to regard it as permanent?\nJoshua 17 and 18 mark the halfway point of the account of the distribution of land to the twelve tribes of Israel. And in Joshua 18:1, something very important happens: the people set up the Tabernacle at Shiloh. Before there was a kingdom of Israel, before David took Jerusalem, before Solomon’s temple was built on Mount Zion, there was Shiloh—situated roughly 24 miles north of Jerusalem, near the geographic center of the promised land.\nAfter centuries of slavery and decades of wilderness wandering, the people of Israel must have felt the surge of a sense of permanence when they first set up the tabernacle. They were home at last. And that home must have seemed permanent too. Shiloh stood throughout the time of the judges, on into the days of the prophet Samuel, who grew up there under the care of Eli the priest (1 Samuel 1:1-25). Shiloh would house the Ark of the Covenant, where the presence of the Lord dwelt, for over three hundred years (c. 1444-1116 B.C.). For perspective, the Tabernacle stood in Shiloh for almost 100 years longer than the United States of America has existed.\nFor Joshua’s generation, and many to follow, Shiloh was the destination of countless pilgrims who esteemed the city as the spiritual center of things—God’s own town.\nBut now it is a ruin.\nThe city fell to the Philistines over 3,000 years ago. Knowledge of the actual site of the tabernacle is lost to history. Only rubble remains where the center of things once stood.\nThe people of Israel’s true and better inheritance was not a place made of wood and stone. Neither was God’s eternal presence meant to be contained in a box of gold. Even as we read about the long awaited distribution of land to the twelve tribes of Israel, we remember that nothing of what they built remains.\nBut the God who loved Israel and led them does remain. He will never become a ruin, and neither will those whose faith is in Him. \nThe grass withers and the flower fades, but the word of the Lord stands forever (Isaiah 40:8).\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram15.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 1:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing the key verse for the book of Joshua:\n“Haven’t I commanded you: be strong and courageous?\nDo not be afraid or discouraged, for the Lᴏʀᴅ your God is with you wherever you go.”\n—Joshua 1:9\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/4-HJoshua2.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "2 Peter 3:13",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut based on His promise, we wait for the new heavens and a new earth, where righteousness will dwell.\n—2 Peter 3:13\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram13.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 15:1-63, Joshua 16:1-10, 1 Peter 1:3-5, John 10:7-18",
        "devo_title": "Judah’s Promised Inheritance",
        "devo_summary": "\n                    \n                    Every year at Thanksgiving and Christmas, we show gratitude for the people in our lives by gathering together around good food and good gifts. Sometimes you ask for a simple gift and you get something extraordinary and beyond what you asked for. Other times, you ask for a $25 gift card to your favorite bookstore and you receive a $25* (*on sale for $5) tie or scarf. Gift-giving is a mixed bag, but gift-giving (and receiving) is still a blessing.\nIn our passage today, we are in the throes of the Israelite war, as we have been for much of the book of Joshua. God’s people are battling other nations, and God is giving them victory. To the victor go the spoils, and the Israelites are getting spoiled.\nIn a way, it seems odd that God’s people are fighting at all. Why doesn’t God just wipe out their enemies and move on? Why are the Israelites knee-deep in carnage?\nOne reason is this: God doesn’t want us to be robots. He wants us to step into battle, even spiritual battle, with boldness. Caleb, one of the men who received a great inheritance, was uniquely brave when he spied out the land back in Numbers 13. God fought for him and with him, yes, but He also expected Caleb and his colleagues to be brave.\nToday, we are often prone to fear. If a situation looks bleak, we’ll probably take the easier route. But Caleb can teach us a valuable lesson: bravery comes from trusting in the Lord. God fights for His people, and Caleb knew he was stepping into a battle God Himself would win.\nAs a reward for his courage, Caleb received a wonderful inheritance from God. God is not stingy with His people. He does not send us into hard places and then laugh at us when things don’t go well, nor does He ignore our obedience. God is with us, and He cares about our actions.\nSometimes we don’t think we’re receiving the kind of gift we deserve from God. Maybe we don’t like the outcome of a situation, or maybe we just don’t see it. But as John Piper has rightly said, “God may be doing 10,000 things in your life and you’re aware of three of them.”\nMaybe you’ll never receive a big land or monetary inheritance like Caleb. Maybe you’ll never even know all the gifts God has given you. But that doesn’t mean you don’t spy out foreign lands and head into battle with courage. Because regardless of what you see in this life, one day you will receive the greatest inheritance of all: eternity with your Maker.\nWritten By Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram12.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 13:1-33, Joshua 14:1-15, 2 Peter 3:13, Romans 4:13-17",
        "devo_title": "Israel’s Promised Inheritance",
        "devo_summary": "\n                    \n                    Joshua 14 makes a statement I wish meant more than it actually does: “After this, the land had rest from war” (Joshua 14:15). The rest was short lived, and I wish it wasn’t. Scripture does this—it stirs in us a longing for a more complete and satisfying resolution than the one we’re often given in the moment. And then it promises that one day that resolution will come.\nThe Steven Spielberg / Tom Hanks mini-series Band of Brothers tells the story of the 101st Airborne’s Easy Company, some of the first paratroopers in history. The series follows them through World War 2—from basic training, through D-Day, Bastogne, Market Garden, and all the way to taking Hitler’s Eagle’s Nest.\nBy the time we make it to the end of the ten-hour series—when the allies have secured victory in Europe—Easy Company (and all the other soldiers, and seemingly the land itself) is depleted and weary from war. Victory is theirs, but the cost is never far from view.\nReading through Joshua wearies my heart like that. It is a tale of war. It is unsettling. It would be too simplistic to take a “good guys vs. bad guys” view of this book, since God’s people were not always good, and since their opponents were certainly not all war-mongering barbarians. The conquest of Canaan presents us with a world that was groaning under the weight of the fall. It comes across—to me, anyway—as a hostile, dangerous, unwelcoming place. A war-weary place.\nThe end of Joshua 14 includes what scholars refer to as one of Joshua’s four “land-grant narratives,” in which a portion of land was given to an individual person (Joshua 14:6-15; 15:13-19; 17:3-6; 19:49-50). In this passage, Caleb reminded Joshua that Moses promised Caleb would be given an inheritance of his own (Deuteronomy 1:36). In that exchange between Caleb and Joshua, Caleb insisted that even though he was now 85 years old, he was still strong enough to defeat the Anakim—a formidable group who still lived in the land he would inherit. Caleb said the Lord would be with him as he drove out his foes.\nJoshua gave the land to Caleb. And the result, apparently, was that Caleb did drive out the Anakim, since all we’re told is that he settled Hebron, and then the land had rest from war (Joshua 14:15).\nWhen we read that the land had rest from war, we know from history that the rest did not last. Still, for the people of Israel, the ability to rest from war even for a little while must have come as a needed, though bittersweet, relief. They had defeated their enemies, but they were never far removed from the cost.\nThis mention of rest from war at the end of Joshua 14 is a perfect example of how Scripture stirs a hunger in us for a world that is not broken. There will come a day when our world will rest from war. When people will live at peace. When we will be at peace. That day may not be now, but it is coming. As sure as Christ sits at the right hand of God as the Lord of Heaven and Earth, rest will come. The land, and all who live upon it, will rest from war. Forever. Amen.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram11.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 12:1-24, Deuteronomy 29:7-8, Nehemiah 9:22, Psalm 136:16-21",
        "devo_title": "The Land East and West of the Jordan",
        "devo_summary": "\n                    \n                    Joshua 12 is one of those passages we might tend to treat as “fly-over” territory. What can we really learn from a lengthy list of names? Surely, Joshua could have condensed this passage to a few sentences and just given us what we needed to know. \nThe passage reads like a land survey. It marks out the territorial possessions of Israel in the north, south, east, and west of the land. The land was divided up before Israel actually conquered it. Just as God promised to give it to them, He faithfully delivered. All they needed to do was follow, and claim what He has set before them. In all, Joshua led the conquest of a total of 31 kings and kingdoms. The lands were of varied topography – valleys and mountains, wilderness and forest and city. It was a fruitful land, all given by God. Joshua gives a list of historical kings. This isn’t fabricated mythology; it is real history. \nIf we take 2 Timothy 3:16 seriously, we know that this passage is “breathed out by God.” It is “profitable for teaching, for reproof, for correction, and for training in righteousness.” How does Joshua 12 do all these things?\nHow does this passage offer training in righteousness? It shows us that God alone is righteous in all His ways, even in the allotment of lands and in the judgment of kings and nations. This passage records of the conquest of an idolatrous land. God directed Joshua to establish righteousness in the land. This passage asks us: how ought we walk in light of God’s righteousness? How are we also to drive out idolatry from our own hearts? Do we leave some territory unconquered? Is there still a Philistia in my heart?\nHow does this passage offer correction? First, it corrects us for dismissing the value of some passages of Scripture over others. God gave us this passage because we need it. Second, it reminds us that the records of Scripture aren’t myth or legend. We need to remember that they are real space-and-time history. Third, this passage raises questions about what God intends for the land of Israel today. An understanding of God’s providence in history ought to shape how we see our own world.\nHow does this passage offer reproof? We are slow to receive God’s gifts as He offers them. Like Israel, we want to skip steps, make shortcuts, take for granted what He has set before us, and as a result, we often make poor use of the grace He has freely provided. Lord, have mercy.\nWhat does Joshua 12 teach us? God is faithful; He fulfills His covenant promises. God’s promises aren’t merely mystical; they are historical, reliable, and sure. The records of lands, kings, and nations declare: His steadfast love endures forever!\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/11/HRT-Joshua-instagram10.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 10:16-43, Joshua 11:1-23, Psalm 110:1-7, Ephesians 1:3-14",
        "devo_title": "The Lord Gives the Land to Joshua",
        "devo_summary": "\n                    \n                    When I was growing up, I couldn’t remember any wars. I was born during the Cold War and was too young to remember the Gulf War.\nThen 9/11 happened. And as a consequence, so did the war in Afghanistan. I was in high school when the Twin Towers fell (sophomore math class, to be exact), and it felt surreal. Death. Destruction. Senseless violence.\nIt seems like war is inevitable. Nearly every person alive today has lived during a war, and many have served in one. Of course, this is what sin does—it brings division and conflict and pain. Wars exist in a post-Genesis 3 world. This passage in Joshua is a stark reminder of that truth.\nIn light of the death and destruction at the hands of the Israelites, one question comes to the surface: why is God commanding all this violence? Isn’t He supposed to be bringing peace? The easy answer is to say that God is good and that His ways are higher than ours; He made a promise to His people and He intended to keep it. And while that explanation is true, it doesn’t make the stench of death any less pungent.\nIt’s important to remember, however, that the stench of death won’t fill the air forever. God promised to give His people land, but that was only a preview. One day, every one of His people who’ve ever lived will inherit a better land.\nIn Revelation 22, the last chapter of the Bible, we see this land:\n“Then he showed me the river of living water, sparkling like crystal, flowing from the throne of God and of the Lamb down the middle of the broad street of the city. The tree of life was on both sides of the river, bearing 12 kinds of fruit, producing its fruit every month. The leaves of the tree are for healing the nations, and there will no longer be any curse. The throne of God and of the Lamb will be in the city, and His slaves will serve Him. They will see His face, and His name will be on their foreheads. Night will no longer exist, and people will not need lamplight or sunlight, because the Lord God will give them light. And they will reign forever and ever.” (Rev. 22:1-5 HCSB)\nJoshua’s land was apparently spectacular, but it wasn’t perfect. Trees still died. Grass still turned brown. But in the true, final land that all believers will inherit, the tree of life will stand in the land, ensuring that nothing dies again. Death itself will be dead.\nGod’s promise to Joshua was fulfilled in a sinful world. Death was inevitable. Evil had to be dealt with. But God also promises that one day, death will not be inevitable. Evil will take the final deathblow.\nLike Joshua and the Israelites, the land will be ours. But unlike them, we will never leave. We will dwell with God there, in the New Heavens and New Earth, for eternity. He promised. And as the Bible shows us, again and again, God keeps His promises.\nWritten By Brandon D. Smith\n \n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram9.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 9:1-27, Joshua 10:1-15, Ephesians 1:18-23",
        "devo_title": "The Day the Sun Stood Still",
        "devo_summary": "\n                    \n                    “In the beginning, God created the heavens and earth…”\nWhenever I read something that sounds a little unusual or difficult to comprehend in the Bible, I usually jump back to Genesis 1:1. It helps me, because if I’m willing to admit that God created all of space and time, everything seen and unseen, then it’s not a far jump to assume He has the power to alter fundamental constants—like the sun standing still, for example.\nBrilliant thinkers, Christian or otherwise, have been divided about what exactly happened in Joshua 10. Some think that the sun literally stood still in the sky for the duration of the battle. Others think it’s a figurative explanation for a really long day.\nRegardless of what you believe about that day, one thing is certain: it was an incredibly unique day in redemptive history. God fought on His people’s behalf and He somehow changed the ebb and flow of the natural world to insure their victory.\nThe book of Joshua confronts any notions we may have of a distant, uninvolved God. I don’t know about you, but it’s easy for me to slip into this way of thinking where I assume God is all-powerful, but He’s a little too busy to keep up with all of my struggles and battles. Whether intentionally or unintentionally, this way of believing tends to keep God at arm’s length.\nThe fact of the matter is that God does care about your daily life, your mundane challenges, and your overwhelming circumstances. Scripture teaches us time and time again that God breaks into creation to care for, shepherd, and lead His people.\nNext time life throws you a curveball or a seemingly insurmountable hurdle, remember the way of God in Joshua. We don’t always have to be David fighting Goliath. We can be Joshua and the Israelites succeeding and overcoming because God has moved heaven and earth on our behalf.\nI don’t know exactly what happened on that day in Joshua 10, but I do know this: God is willing to break into creation to lead and provide for His people. This is what He did when He sent His Son. \nGod’s plans are far greater than ours, and His provision extends far beyond anything we could ever accomplish by our own power. Thank the Lord that we serve a God who acts.\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram7.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 1:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nThis week, we’re memorizing a command and a promise from the Lord to Joshua:\n“This book of instruction must not depart from your mouth; you are to recite it day and night so that you may carefully observe everything written in it. For then you will prosper and succeed in whatever you do.”\n—Joshua 1:8\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/4-HHymns1.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Hebrews 8:10",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nBut this is the covenant that I will make with the house of Israel\nafter those days, says the Lord: I will put My laws into their minds\nand write them on their hearts.\nI will be their God, and they will be My people.\n—Hebrews 8:10\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram6.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 7:1-26, Joshua 8:1-35, Deuteronomy 9:26-29",
        "devo_title": "Israel Cannot Stand Alone",
        "devo_summary": "\n                    \n                    One time I went camping as a young boy. Our leaders warned us of the dangers of the forest, but not much of that stuck in my mind. The only exception was when they told us not to keep food out in the open overnight—because it would attract bears. \nAt the time that didn’t sound too bad to me. I was thinking of a fruit-eating, singing bear like Baloo from The Jungle Book. But Baloo, I was told, was not the sort of bear we would encounter. It was not unheard of for bears to kill people, our leaders said. It would be in our best interest not to attract them by leaving food within reach. So, I made it my mission to search our campsite and make sure all food was put away. I didn’t know much about camping, but I knew I did not want to wake up to a bear trying to eat me.\nJoshua chapters 7 and 8 introduce us to a man named Achan of the tribe of Israel. He has stolen pagan artifacts and hidden them in his camp. Similar to the scene in the movie Heavy Weights, where sugar-addicted children hide enormous amounts of carb-loaded sweets and whatever else their hearts desire under beds, Achan saw a glimmering idol, desired it, took it, and hid it.\nThrough Achan’s sin, he attracted the species of bear to the camp of Israel known as God’s wrath. Though the stash of things he stole was in his possession alone, it affected the nation as a whole. In their disobedience and sin, Israel had violated God’s covenant. This blatant violation caused Israel to suffer a loss in battle.\nDisobedience toward God brings calamity. Obedience to the loving commands of God brings blessing. Achan’s sinful act of disobedience that affected the whole camp is a reminder of the righteous act of obedience by Jesus. Jesus took God’s wrath toward sinners upon Himself—a wrath that didn’t belong to Him. This perfect sacrifice resulted in blessing for all who are in Christ’s family.\nAchan hid what was not his, thinking he was adding to his own riches. But the riches we need are revealed in Jesus. In Christ, God’s riches abound, and those who trust Him alone for salvation will spend an eternity experiencing them. In our obedience to trust Christ, we can know with certainty that Jesus’ obedience guarantees our blessing, not our defeat. We are given Him, forever.\nWritten By Jevon Washington\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram5.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 6:1-27, 1 Kings 16:34, Colossians 2:11-12, Exodus 3:1-6",
        "devo_title": "The Conquest of Jericho",
        "devo_summary": "\n                    \n                    When Moses stood before the burning bush, God was clear: the ground was holy because He, God almighty, was there. Likewise, when Joshua stood before the heights of Jericho, the Lord was there and the place was holy.\nGod’s holiness is the primary context for understanding the destruction of Jericho. Joshua’s commission to devote to destruction the whole of the city came from God Himself (Joshua 5:14-15). Indeed, even the manner of conquest reinforces the theme of God’s holy sovereignty: Israel was not to conquer by human might, but by the observance of the Sabbath principle. Seven times they marched around the city, not with taunts, but in silence. They were not doing battle; God was.\nOn the seventh day they marched around the city seven times. In prime position was not the commander Joshua, nor the fiercest warriors, but the priests and the ark of the covenant—a sign of God’s presence with them. Joshua might have easily used the words uttered by King Abijah, “Behold, God is with us at our head, and His priests with their battle trumpets to sound the call to battle against you” (2 Chronicles 13:12), or the words of the prophet Jeremiah, “the Lord is with me as a dread warrior” (Jeremiah 20:11). It is a fearful thing when God goes to war.\nI get a bit uneasy at the thought of all that happened there at Jericho. Why was the judgment so fierce? We might be tempted to weigh these events on human scales, but our sinful hearts are all too eager to make light of sin. A holy God can make no such accommodation. Nevertheless, God had been patient. Despite the frequent abominations of idolatry, child sacrifice, gross immorality, occultism, and witchcraft, He had waited 400 years to execute judgment on a wicked people (Genesis 15:16). \nThe inhabitants of Jericho knew who God was (Joshua 2:8-11; 5:1), but apart from Rahab, they were unwilling to acknowledge their sin and His holiness. If God spared Nineveh in the days of Jonah, could He not also spare Jericho? Yet each day, when Israel marched, and the shofar sounded before the walls, the people of Jericho stayed within their ramparts.\nJeremiah declared, “Also I set watchmen over you, saying, ‘Hearken to the sound of the trumpet.’ But they said, ‘We will not hearken’” (Jeremiah 6:17). Jericho would not hearken. They were obstinate in the face of a holy God. The fall of Jericho was a sobering warning: God is holy. He does not trifle with sin. Though He is gracious and patient, when men persist in unrepentance, there comes a day of judgment. \nI am grateful for the conviction this passage brings. Like Rahab, we live in an idolatrous culture, and we are not sinless. But if we have put off the body of the flesh by the circumcision of Christ, if we have been buried with Him in baptism and also raised with Him through faith in the powerful working of God, then our hearts may rejoice in thankfulness for His abundant mercy (Colossians 2:11-12). Like Rahab, we have been saved alive in Christ (Joshua 6:25). \nOh, what mercy that God, the holy almighty One, would spare even us!\nWritten By Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram4.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 4:1-24, Joshua 5:1-15, Exodus 25:10-22",
        "devo_title": "The Ark Crosses the Jordan River",
        "devo_summary": "\n                    \n                    Sometimes a certain song will come on and, all of a sudden, I’m transported in my mind to a time and place where something significant happened in my life. Or I’ll drive down a particular stretch of road and remember an event that happened there. I’m not necessarily looking for the memory, but it seems to be tied to the song or the place.\nIt is fascinating, isn’t it, that God made us this way? We are meaning-makers. There is something eternal in us that knows to link moments and places in our past to the significance of our present and to our hope for the future.\nIn Joshua 4-5, Israel stood in a place they had long-anticipated: the banks of the Jordan River. Those waters represented the end of their wilderness wanderings. God, because He is an artist, parted the waters so Israel could cross over on dry ground, effectively bookending their wilderness wanderings with the same miracle performed twice.\nAs they crossed the dried-up floor of the Jordan, with the ark of the Lord leading the way, the Lord told Joshua to instruct the men to pull twelve stones from the riverbed—twelve stones no person should have ever had access to, were it not for the powerful hand of God. They stacked the stones into an ebenezer, or a monument, designed to elicit questions from their meaning-making children who would want to know what that strange and deliberate pile meant.\nWhat did those stones mean? They pointed to the past. They meant God had preserved Israel through famine, slavery, wilderness, and war to bring them to this place from which they would serve Him. They meant that it is a fearful thing to fall into the hands of the living God (Hebrews 10:31), since many of their countrymen died before they could cross over. They meant that these people were tied to Abraham’s God by a covenant oath.\nBut those stones also pointed to their future. The memorial reminded the people of their ongoing relationship with God. They were stones that reminded the people that God was not finished accomplishing His redemptive plan. Those stones prompted memories of the God to Whom they belonged.\nThose stones carry meaning for us as well. God delivers His people. In Christ, all our sorrows will be taken. In Christ, we will cross over from this wild place to a Kingdom of light and life and joy and peace. The people in the book of Joshua lived between a promise made and a promise kept—between the promise that God would bless the world through Abraham’s offspring, and the empty tomb of Christ, that grand miracle that provides otherwise impossible passage from this life to the next. \nThe empty tomb, with its stone rolled away by the very finger of God, is our ebenezer now.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram3.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 2:1-24, Joshua 3:1-17, Numbers 13:25-33, Hebrews 11:31",
        "devo_title": "Joshua Sends Spies to Jericho",
        "devo_summary": "\n                    \n                    Recently I spent a few days in New York City. Having previously lived in Chicago, I smugly assumed I had the whole rush hour public transit situation completely under control.\nThat was, of course, until I found myself heading up a staircase out of the subway, completely against the flow of pedestrian traffic. I have never felt more like a fish trying to swim upstream. I had to carefully shoulder my way through the crowd to the top of the stairs and back to street level. Thankfully, other than my pride getting a little scuffed up, I didn’t sustain any injuries.\nI’m still not sure if I made a mistake and went up the wrong stairwell or if I was just reverse-commuting across town at the wrong time of day. Either way, one thing is certain: I was definitely struggling to move against the predominant flow of everyone around me.\nMoving against the flow is a difficult task. It takes faith to trust that you’re moving in the right direction, and it takes courage to sustain the course. I’m not so certain that my subway predicament was the result of a faithful or courageous spirit, but I am convinced that Rahab was able to stay the course because of her belief in the God of Israel and her courage to finish what she started.\nRahab risked much by harboring the spies. She risked her comforts and possessions, her life and the lives of her family. If any of the leaders in Jericho had learned of her actions, she most likely would have faced a punishment worse than death. To say that treason was frowned upon is putting it lightly.\nBut Rahab had heard of the great deeds of the LORD and she knew He was the only true God. To follow Him, to honor Him, and to trust Him was to risk much. She was swimming against the flow of what her neighbors and friends would have thought sensible and right. She knew that her national allegiances needed to take a back seat to what was fitting in the eyes of the only true God, but she had to risk everything to link arms with His people.\nHave you ever had to make a hard or unpopular decision? Maybe it was amongst friends, or perhaps it was at work. Have you ever been challenged to move against the predominant way of thinking or acting? Maybe God is calling you to make a stand, take a risk, or love in a vulnerable way.\nFollowing God doesn’t mean we spend our whole lives protesting culture. Sometimes, like Rahab, we just have to make quiet but resolute decisions to move in a different direction. Rahab didn’t start picketing Jericho. Rather, she bravely and faithfully followed God. \nNot every season requires us to swim aggressively upstream, but some do. If this is one of those seasons, lean on God in faith. He will supply the courage and provision that you need. If you leap out in faith like Rahab did, you might just be surprised by the wonders He works through you. \nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram2.jpg"
    },
    {
        "book_title": " Joshua",
        "devo_passages": "Joshua 1:1-18, Deuteronomy 31:1-6, Psalm 1:1-3",
        "devo_title": "Joshua Succeeds Moses",
        "devo_summary": "\n                    \n                    You remember that scene in The Fellowship of The Ring when the travelers emerge from the Mines of Moria? They are devastated, forlorn, almost hopeless. Gandalf, their leader, was dead. What were they to do? How would they finish their journey and accomplish their mission?\nThat must have been how the people of Israel felt when Moses died. Who would lead them? How would they face the conquest to take the Promised Land? They stood on the brink of an unknown land populated by warrior peoples and even giants. They had just wandered in the wilderness for more than forty years. Their future was far from certain.\nExcept it wasn’t uncertain because God had made a covenant. He had declared that He would uphold His side – to make Israel a great nation in this land – if they upheld theirs. (If they didn’t and decided they no longer needed to obey, the consequences would be dire.)  But the nature of God’s promise meant that the person leading Israel wasn’t the key to their success; obedience to God’s law and trust in His Word was.\nWell before Joshua led Israel across the Jordan River into battle, God had made a promise: “I will give you this land, just be strong and courageous.” He promised to go ahead of the people and fight for them. The battle was His. The people simply needed to trust and obey. \nBut camped on the border of the future, Joshua needed reassurance. And God gave it to him. He didn’t give Joshua strategy or a battle plan or a pep talk. He gave Himself. He said, “Remember My Word. Keep it with you at all times. Never forget it and always obey it. Do this and the land will be yours. Be strong and courageous because I am with you and am going before you” (Joshua 1:8-9, my paraphrase).\nStrength and courage in the Lord and obedience to God’s Word – these are the themes of Joshua. It is not a book about a man as much as it is a book about God establishing His people. Joshua is the man God appointed to lead Israel. But his leadership rests fully on faith and obedience.\nThis is stunning in its simplicity. What are God’s people called to when facing adversity? Or when we are called to lead above our capacity? Or when we have a challenge ahead of us that seems insurmountable? We are called to be strong and courageous because God is with us. \nOur strength is not our own. Our successes are not our own. God’s hand guides and works as we follow His Word in obedience, and it will root us and establish us.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/10/HRT-Joshua-instagram1.jpg"
    }
]