[
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 13:22",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a reminder of God’s grace and compassion. \nRemember me for this also, my God, and look on me with compassion according to the abundance of your faithful love.\n—Nehemiah 13:22\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/04/4-Nehemiah-3.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "2 Corinthians 1:20-22",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor every one of God’s promises is “Yes” in him. Therefore, through him we also say “Amen” to the glory of God. Now it is God who strengthens us together with you in Christ, and who has anointed us. He has also put his seal on us and given us the Spirit in our hearts as a down payment.\n—2 Corinthians 1:20-22\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day20.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 13:1-31, John 14:2-3",
        "devo_title": "Remember Me, My God",
        "devo_summary": "\n                    \n                    When it comes time for the accolades to be handed out, no one likes to be overlooked or forgotten. I, for one, don’t like it when my hard work isn’t recognized. As I jokingly complained to a former college professor about being passed over for an honor (one I believed I had every right to expect to win), he kindly responded to me, “God sees you.” Those words sucked the hot air right out of my bloated ego balloon. \nIn Nehemiah’s case, it wasn’t a matter of a puffed up ego that was driving his repeated petition to God in this chapter. Nehemiah feared that the exiles’ constant lack of faithfulness to the Word of God would somehow end up on his record. As he brought this account of his leadership to a close, Nehemiah wanted to be clear that he was a leader who was faithful to the Word of God, even when the people he’d led couldn’t go five minutes without forgetting that very Word. \nNehemiah wanted it made known that he was zealous for the holiness of God above all. And so he said to the Lord, “Remember me…my God, and look on me with compassion according to the abundance of your faithful love” (Nehemiah 13:22). But God did see Nehemiah and his heart. The fact that we have an account of Nehemiah’s work recorded in Scripture proves that God recognized Nehemiah’s faithful leadership. \nThere may be times when we wonder what the point is in holding fast to God’s Word. In those moments, we need to be reminded that God sees us. When we feel there’s no use in being faithful to God when earthly culture (and even many within the Church) has abdicated the truth, this chapter in Nehemiah motivates us to be people of holiness because God knows us and He sees us. We are reminded to “fight the good fight”—even when everyone else seems to have abandoned the battle—because our Father pours out His favor on His children.\nWe should look to Jesus, who came to a culture of faithlessness, hypocrisy, and immorality, and remember that it was zeal for His Father’s house that consumed Him (John 2:17). Although He cried out as one abandoned by God on the cross, Jesus’ victorious resurrection validated the words His Father had spoken over Him: “This is my beloved Son, with whom I am well-pleased. Listen to him!” (Matthew 17:5). \nBrothers, look to Jesus and do not grow weary in doing good. If no one else around you will keep the faith, press on. Even if everyone else abandons the gospel, let it be the passion of your own life. God sees you, and the reward He offers through Christ Jesus is great. He will remember His children, with favor!\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day19.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 12:27-47, Hebrews 13:15, Revelation 19:1-8",
        "devo_title": "We Dedicated the Wall",
        "devo_summary": "\n                    \n                    When my daughters were infants, they were dedicated at the church we attended. In a brief, happy ceremony, the pastor spoke words over them in front of the congregation, dedicating them to the Lord and calling the church to invest in raising them to follow Jesus. It was a beautiful moment, each time. \nWhen the church I grew up in and the Christian company I work for each broke ground for new buildings, they held ceremonies to dedicate the structures to the work of the Lord. The projects were prayed over and a biblical charge was given to everyone present, reminding us of the gospel’s greater mission.\nThe dedication of Jerusalem’s wall was nothing like these instances at all. Yes, the work was dedicated to the Lord and prayers were prayed. But this was no ceremonial groundbreaking, featuring men in suits awkwardly wielding monogrammed brass shovels. Nor was it a baby dedication wedged in at the beginning of a Sunday morning service. This was a dedication. \nThe Levites—the tribe dedicated to the service of the temple and worship before God—led thanksgiving and singing with harps, cymbals, and lyres, and with singers and musicians gathered from all around. That’s a full band.\nThey purified themselves and the city so that it literally gleamed, but more importantly, so it reflected God’s law and their desire to honor Him. Then they encircled the city with praise and prayer and thanks, with one column going to the left and the other to the right around the wall. And their rejoicing could be heard far and wide (Nehemiah 12:43)—hardly the sedate ceremony we so commonly call “a dedication.”\nThis raucous, joyous celebration of Jerusalem’s rebuilding is but a foretaste of what Scripture tells us is to come. In Nehemiah’s day, a crowd of thousands lifted praise that could be heard from far away. One day, a numberless multitude will gather in praise with a sound like thunder. In Jerusalem, they offered sacrifices as a pleasing offering before God. In the days to come, a ceaseless sacrifice of praise will be lifted up. The old Jerusalem was worthy of passionate worship before God. One day, the new Jerusalem will teem with worshipers and pulse with praise. \nNehemiah and those with him knew they were commemorating and dedicating something profound and miraculous—a city established by God’s redeemed people, in God’s promised land, and under God’s protection. They could not have known how this would echo into the millennia to follow, as an appetizer for the unbridled, perfect celebration of a wedding between Christ and His Church—the same celebration every believer will have the joy to participate in one day.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day18.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 11:22-36, Nehemiah 12:1-26, Isaiah 48:1-11, Philippians 3:18-20",
        "devo_title": "The Priests Served Us",
        "devo_summary": "\n                    \n                    I played football in both my freshman and sophomore years of high school. I quit after my sophomore year because I had not yet hit my growth spurt and didn’t get any playing time. That, and I thought my time would be better spent working a job and hanging out with friends. \nSnider High School has had one of the most successful high school football programs in the state of Indiana since the 1980s. Russ Isaacs was an assistant coach from 1983 to 1990, and a head coach from 1991 through 2009, my senior year. He is the winningest football coach in Indiana high school football history with a record of 194–32. \nCoach Ike was an incredible coach because he is a remarkable human being. But his success and winning record are a result of an established culture of sound leadership and coaching within his staff. He has left a legacy of leadership in the Snider High School football program. In fact, the team’s current head coach used to work under Coach Ike as his defensive coordinator. When I read the long list of priests in Nehemiah 11 and 12 and the legacy of leadership God established for the people of Israel, Coach Ike and his legacy of leadership come to my mind.\nIt is tempting to gloss over these two chapters in Nehemiah. It just looks like a list of names, because that’s what it is. But it’s also a lot more than just a list of who’s who. These names found in Nehemiah 11 and 12 reflect a legacy of leadership that the Lord established over His people and for their good.\nThese men served the people of God, often to their own detriment, and despite other opportunities that may have been available to them at the time. In Isaiah 48, the prophet writes of God’s leaders saying, “For they are named after the Holy City, and lean on the God of Israel” (v.2). God’s leaders must learn to lean on Him for His guidance and leadership, instead of trying to muster it up in their own strength. \nHas God called you to lead His people through your local church? Those of us who serve as ministry leaders, pastors, elders, deacons, or in other church leadership roles must understand that our capacity to serve will only go as far as our reliance upon the Lord to carry us. While we are still broken sinners in need of the grace of God to lead us, we must lean on the Holy Spirit for His wisdom and guidance. \nDo you lean on the Lord to lead His people? Or do you lean on your own understanding and gifts? May we learn to lead the people of God by relying on the grace of God. And may we leave a legacy of leadership defined by love-fueled service, not pride-fueled greed.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day17.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 11:1-21, Deuteronomy 7:9, Hebrews 11:13-16",
        "devo_title": "We Resettled Jerusalem",
        "devo_summary": "\n                    \n                    I’ve often put the various places I’ve lived on a comparative scale of desirability. I’ve lived in cities, on an island, in the mountains, and in the foothills. Every place where I’ve lived has had its own unique beauty and appeal, and its own particular downsides. \nIn the Old Covenant, the land of Israel had its various geographical locations, together with all of the accompanying pros and cons. One might suspect that every one of God’s people would have wanted to live in Jerusalem, since it was the city of the great king. However, this was not so. After the city was rebuilt and made habitable again in the days of Nehemiah, many of the people refused to return and live there.\nThe refusal of the people to move to Jerusalem was owed, in part, to the fact that the people had become comfortable where they were. They had little interest in being fully concerned with the work of the Lord that occurred in Jerusalem. The rulers went up to govern in the judicial courts. Several of the Levites returned there to do the priestly work at the temple precinct. Other Levites stayed behind to continue the priestly work in other parts of Israel. \nBut many of the people remained outside the city because of a desire for worldly comfort. Surely, more spiritual commitment was expected from the inhabitants of Jerusalem than from other inhabitants of Israel. Matthew Henry explained the failure of those who refused to seek habitation in the city of God, when he wrote: “Those who care not for being holy themselves are shy of dwelling in a holy city; they would not dwell in the New Jerusalem itself for that reason, but would wish to have a continuing city here upon earth.”\nJerusalem foreshadows the city of God that He has prepared for His people in the hereafter. The writer of Hebrews picks up on this spiritual typology of Jerusalem when he writes, “Here we have no continuing city, but we seek the one to come” (13:14). Abraham, the father of believers, teaches us the principle of seeking after a dwelling place in the heavenly city—even while he dwelt in tents with Isaac and Jacob in the land of promise (11:9). \nGod has prepared a heavenly city for His people. He has done so on account of the fact that “He is not ashamed to be called our God” (Hebrews 11:16). We ought to be a people who long to dwell with the God who has prepared and secured a city for us through the saving work of His Son. Jesus is the building of the heavenly Jerusalem by His death and resurrection. No matter where we live in this life, we are pilgrims pressing on to the city that has the firmest of foundations, whose builder and maker is God.\nWritten by Nick Batzig\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day16.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 9:38, Nehemiah 10:1-39, John 14:15, Hebrews 4:15",
        "devo_title": "We Promised to be Faithful to God",
        "devo_summary": "\n                    \n                    We have been trekking through a book full of twists and turns, a story that mirrors the basic facets of our daily lives—God’s promises, our doubts, and the enemy’s schemes. Nehemiah’s story is a story we can all relate to. Until, perhaps, today’s passage comes along.\nLike a disjointed puzzle, we are presented with a stack of names and ordinances and promises that we have a hard time piecing together into a coherent picture. What do these names have to do with anything? How can we, in the 21st century, relate to farming contracts in the ancient world?\nIn some ways, we can’t. Nehemiah’s story is a story stuck in history and a key piece to pushing God’s bigger story toward the coming of Christ. In all our reading, studying, and reflecting on Nehemiah, we shouldn’t forget that this is an event that actually happened to real people, in a real place.\nHowever, as we’ve already pointed out, the story mirrors our daily lives. This passage in particular details how all of God’s people came together to rejoice in God’s faithfulness in helping them accomplish the rebuilding of the wall. Together they agree to give a portion of their crops and earnings to the Lord, to thank Him for His grace, and to remind themselves that they have nothing without Him.\nFor us today, this principle is not much different. Everything we have belongs to the Lord: our family, our jobs, our money, our time, and even the breath in our lungs. We don’t need to build a wall to remember and appreciate this. As these ancient people gathered together to thank God for His faithfulness, we also should gather together every week with God’s people, receiving grace and pouring out praise to our faithful God. We have nothing without Him, and so everything we own is His.\nMay we say with Nehemiah’s generation, “We will not neglect the house of our God” (10:39). He has been faithful to us. And so may we learn to love Him and His commands, and remain faithful to Him in turn (John 14:15).\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day15.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 6:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a prayer for continuing to do the work God sets before us.\nBut now, my God, strengthen my hands.\n—Nehemiah 6:9\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/04/4-Nehemiah-2.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Romans 1:16-17",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor I am not ashamed of the gospel, because it is the power of God for salvation to everyone who believes, first to the Jew, and also to the Greek. For in it the righteousness of God is revealed from faith to faith, just as it is written: The righteous will live by faith.\n—Romans 1:16-17\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day13.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 9:1-37, 2 Corinthians 1:20-22",
        "devo_title": "Our Nation Confessed Our Sin",
        "devo_summary": "\n                    \n                    I once heard of a theologian who was asked by one of his students, “How much time should we pray and read Scripture each day?” The story goes that the student had in mind a certain amount of time for each—say, one hour in prayer and one hour in study. His teacher responded, “The better way is to spend two hours reading the Scripture on your knees in prayer.” What a simple but profound insight. How true it is, because the Scriptures often give shape to our prayer.\nIn my experience, I have come to understand that when I sit down to read Scripture, Scripture also tends to “read me,” so to speak. God’s Word reminds me of who I am—a sinner unable to perfectly live in faithfulness to God’s Word. However, Scripture also reminds me of who God is, namely, a Holy God who is perfectly faithful to His Word, but also gracious to those who repent of their unfaithfulness. \nOne of the reasons I find Nehemiah 9 to be one of the most moving passages of prayer in all of Scripture is because this prayer moves through the Bible itself, reminding the people of God’s faithfulness from Genesis to Kings—in spite of Israel’s unfaithfulness. And it is through Bible-shaped praise, confession, and petition that God’s people are reminded that He has made a name for Himself, a name that endures from generation to generation to this day (v.10).\nIsn’t it amazing that when we repent of unfaithfulness, God stands ready to forgive? Isn’t it good to remember that God is slow to anger and abounding in steadfast love? (Nehemiah 9:31; Psalm 145:8). Isn’t it comforting to remember that even when we, as God’s people, are faithless, our God will not forsake us?\nThe good news of the gospel is that the story of God’s faithfulness does not end in Kings or in Nehemiah. In the New Testament we are reminded that all of the promises of God find their “yes” in Jesus Christ (2 Corinthians 1:20). Jesus is the perfect Israelite who was completely faithful to God’s Word. And because of Jesus’ sacrificial death for our unfaithfulness and sin, we can be forgiven. Because of Jesus’ resurrection and ascension to the right hand of God, we can boldly approach His throne with confidence (Hebrews 4:16).\nBecause of the gospel, when I prayerfully read Scripture I am able to see that God has been faithful to His people from generation to generation. Because of the gospel, when Scripture reads me, I can openly pray and confess my unfaithfulness, knowing that He is faithful to forgive me and cleanse me of all unrighteousness (1 John 1:9). This is how Scripture shapes our prayer. It gives us the words to shout, “Oh God! You made a name for yourself that endures to this day” (Nehemiah 9:10).\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day12.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 7:73, Nehemiah 8:1-18, Romans 1:16-17, 2 Timothy 3:16-17",
        "devo_title": "Ezra Read God’s Law to the People",
        "devo_summary": "\n                    \n                    If you’ve ever lost something precious only to find it once again, you know the feeling of joy that can overcome you at its rediscovery. Every time I return back to the home I left in the San Francisco Bay area, I find myself both laughing and crying—and both seem fit emotions for those moments. \nThis is especially true if I go to a ballgame at AT&T Park, the home of the San Francisco Giants. There is euphoria at the smell of the ballpark-favorite garlic fries. There are tears at hearing a crowd of 40,000 sing Journey’s “Lights” in the eighth inning. There is elation at Buster Posey knocking a game-winning home run. All of these sights, smells, and sounds are precious to me, and yet I get to experience them far too infrequently these days. \nI imagine the people of Israel were met with many conflicting emotions as they made their way home to Jerusalem. They had returned to rebuild the walls of their city and the temple within those walls, but there was something else that needed to be rebuilt: their spiritual life. In order for God’s people to reestablish their identity of faith, they needed to be reminded of the central truth of what made them unique among all nations.\nIt wasn’t a temple (other nations had those). It wasn’t a powerful city (Babylon could have sufficed). It wasn’t even a strong leader (Alexander the Great was coming). What made Israel unique among all the nations was that God had spoken directly to them and given them His Word. For too long that Word had been neglected, but on this day, Israel reestablished among themselves the chief importance of God’s Word for all of life. \nHowever, hearing the book of the law read to them was not met without conflicting emotion. “For all the people were weeping as they heard the words of the law” (Nehemiah 8:9). But convicted as they were, that day was not one for mourning and weeping; it was a holy day to the Lord. It was a day of returning to the city, yes, but it was also a day of God’s people turning their hearts back toward Him in repentance. And so Ezra and Nehemiah instructed them: “Do not grieve, because the joy of the LORD is your strength” (v.10).\nIn everything that occurs in Nehemiah 8, we are forced to think about the place of God’s Word within our own lives. Too often we neglect, forget, or flat-out ignore the fact that God Himself has spoken to us and for us. Instead of listening to the Word preached, examining the Word in community, and applying the Word personally, we make the Bible less than a priority in our lives. Because of that, we often find our lives in ruins and wreckage, when in reality, we have God’s inspired Word to lead us in every day and in all ways (2 Timothy 3:16).\nPerhaps we need to rediscover God’s Word in a fresh way. Ezra’s preaching, as well as Israel’s commitment to once again read, listen, and understand Scripture, allowed for spiritual renewal among them. When we turn to Scripture we will find that same renewal is waiting for us as well. \nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day11.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 7:1-73, Exodus 28:29-30, Psalm 34:19-22",
        "devo_title": "The Exiles Came Back Home",
        "devo_summary": "\n                    \n                    The number 42,000 sounds like a lot of people. It’s about double the number that attend a sold-out NBA or NHL game. It would pack out most MLB stadiums and be a huge concert turnout. It’s quite a crowd.\nBut 42,000 is a small city—barely a city at all, in fact. It’s really more of a town. And that is the entire number of the exiles who returned to Jerusalem. Millions departed Judah in captivity, and 42,000 returned. When we think about it in these terms it sounds feeble and small. It is more sad than celebratory.\nYet this small number is no more sad than the seed that dies and shrivels and cracks to give life to a new plant (Matthew 13:1-22). For that is what these 42,000 exiles were: new growth of God’s people in God’s promised land. They were a fresh start and a kept promise and measure of God’s faithfulness. \nWhile the list of names upon names (fifty verses worth) might seem cumbersome and meaningless as we struggle to read them, they are a record of a legacy. Every family represented had roots in Jerusalem and would grow there again because God was faithful. Every priest and Levite would once again serve God in the temple because God brought them home to do so, and they took this responsibility seriously. They sought to keep God’s law in selecting leaders. Those who “feared God more than most” (Nehemiah 7:2), and those of the correct lineage were selected according to God’s priestly dictum and manner (Urim and Thummim), so that God’s house would be unsullied. \nThese 42,000 had paid the price for their ancestors’ unrighteousness, and they had every intention of clinging to the God who had never let go of them. They clung to the words of David from Psalm 34, that “the Lord redeems the lives of His servants and all who take refuge in Him will not be punished” (v.22). Because they were small in number and barely established, God’s people held to the promise that “one who is righteous has many adversities, but the Lord rescues him from them all” (v.19). How could they not? They’d already been rescued from Egypt, from invaders, and now from exile too. \nFrom this humble restart Israel would be established again. Families would resettle, the temple would be rebuilt, and hope would come again—hope for a Messiah, One who would gather the exiles from every tribe and nation around the globe. For God will always bring His people home and redeem the righteous. \nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day10.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 6:1-19, Isaiah 9:6-7, Jeremiah 23:5-6",
        "devo_title": "We Completed the Wall",
        "devo_summary": "\n                    \n                    In August 2016, I was beginning a third year of full-time graduate school, working a full-time job, and serving in our church’s student ministry. It was a busy season, and I was stressed. Around that time, my wife began experiencing a sort of persistent anxiety she never had before, and it even resulted in a few rough panic attacks. With the help of a doctor and a counselor, she was able to fight the anxiety, and I was able to support her through it. \nWhile supporting Susie, I was a strong, encouraging husband, but it’s like my body was just storing up my own stress to be released later. A few weeks after Susie’s panic attacks subsided, I got sick. I felt anxious like I never had before, and I became unduly overwhelmed. It felt like I was drowning in work, school, and life in general. In the face of what seemed insurmountable work and life circumstances, I was not relying on the Lord to be my strength. I was relying on myself.\nIn Nehemiah 6, the wall was finally rebuilt despite attempts to sabotage the work of Nehemiah and the others. The conspirators—Sanballat, Tobiah, and Geshem—sent a message to Nehemiah in an attempt to lure him away from his work at the wall and to do him harm. They did not want him to succeed in the work the Lord had set out for him to do. \nBut Nehemiah saw through the veiled attempts to undermine him. He said of the man who delivered the threatening message, “He was hired, so that I would be intimidated, do as he suggested, sin, and get a bad reputation, in order that they could discredit me” (v.13). Nehemiah was given a task by God. He was not going to let the intimidation of man prevent him from obeying God. And so in the midst of many attempts to distract and discredit him, Nehemiah says, “But now, my God, strengthen my hands” (v.9).\nThe Lord has called you to a work. Whether it is parenting your children, teaching a squirrely third grade class, manufacturing auto parts, or leading a church—He has called you to a work that He intends for you to use for His glory, not your own (Ephesians 2:10). Others, including Satan, may try to assail you. In the face of these attacks, you can choose to trust in your own strength for deliverance. Or you can rely on the Lord to strengthen your hands.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day9.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 5:1-19, Exodus 22:25, 2 Corinthians 8:9",
        "devo_title": "I Stood Against Social Injustice",
        "devo_summary": "\n                    \n                    There seems to be no limit to the injustices that occur in the world. Sadly, this is also the case in the Church. When I was a boy, my dad used to say, “Nick, no one will hurt you so much as people in the Church.” I have found this to be true in my experience over the ten years I have been in pastoral ministry. The thing that makes injustice within the Church so burdensome is the fact that we expect better of the people of God. \nMany claim to have left Christian community on account of the injustices and offenses of the members of the Church. But while professing believers have often done much harm to other members of His body—and also hindered the spread of the gospel—God will always remember His people on account of Christ, the perfectly righteous representative of His people. That truth is seen in Nehemiah 5. \nIn the days when Israel was rebuilding the walls of Jerusalem, God sent a famine on the land. Because of the famine, many rulers of God’s people were taking advantage of their brethren. They oppressed the sons and daughters of their brothers on account of a shortage of food. When the people complained, Nehemiah rose to stand up for the poor and the oppressed. He did what any of us should do when we see people in the Church taking advantage of others’ unjust gain. Scripture says Nehemiah was filled with righteous anger (Nehemiah 5:6) and brought civil charges against the leaders who were oppressing the people (vv.7-13). He then ensured that the religious leaders would hold their rulers responsible to provide a full restoration of the possessions they had taken.  \nNehemiah showed himself to be an upright and generous governor. When other governors took from the people for selfish gain, Nehemiah refused to live in luxury at the expense of the impoverished members of the Church. Unlike the other rulers, Nehemiah refused to place heavy burdens on the people. His heart was filled with love for the people of God and a desire to see all of them provided for. He hoped the Lord would see him and his faithfulness. And so he said, “Remember me favorably, my God, for all that I have done for this people” (Nehemiah 5:19).\nIn all these ways, Nehemiah was a type of the One to come. When Jesus came to Israel, the rulers and leaders were oppressing the people. When He came to the temple and saw the way in which those who sold sheep and oxen for the sacrifices were extorting money from His people, He was filled with anger, throwing over tables and driving out the money-lenders. When He observed the way in which the religious leaders were placing heavy burdens on God’s people, Jesus stood and said, “Come to Me, all who labor and are heavy laden and I will give you rest” (Matthew 11:28). \nJesus refused to please or comfort Himself. Instead, He was homeless throughout most of His public ministry and died naked on the cross for the sins of His people. In all that He did, Jesus gave up all that He had for the redemption and care of the people of God. May we learn to follow in the footsteps of Jesus, the greater Nehemiah.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day8.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 2:17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Nehemiah.\nSo I said to them, “You see the trouble we are in. Jerusalem lies in ruins and its gates have been burned. Come, let’s rebuild Jerusalem’s wall, so that we will no longer be a disgrace.”\n—Nehemiah 2:17\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/04/4-Nehemiah-1.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Psalm 8:1",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nLORD, our Lord,\nhow magnificent is your name throughout the earth!\nYou have covered the heavens with your majesty.\n—Psalm 8:1\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day6.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 4:1-23, Genesis 28:15, Ephesians 1:18-23",
        "devo_title": "We Kept Rebuilding in Spite of Opposition",
        "devo_summary": "\n                    \n                    Right now, I and the other elders at our church are searching for a new building. Our children’s ministry space is maxed out. Our pastors are all crammed into a tiny office. We’re running two Sunday morning worship gatherings and are desperate to not add a third. Still, these are good problems to have for a 7-year-old church, I suppose.\nAs we’ve been searching for a new location, we’ve run into dead ends at every turn. Some places are too expensive, others are too small, and still others are gobbled up by investors before we get a chance to look at them. We often want to say alongside the Israelites in today’s passage, “Listen, our God, for we are despised!” (Nehemiah 4:4).\nAs we’ve seen so far, the Israelites were tasked with rebuilding the wall, and things haven’t gone as easily as they would have liked. Most recently in the story, we see their enemies try to Trojan-horse their efforts, so to speak, and then sneak in unnoticed. But God proves His faithfulness in thwarting their attempts, and the rejuvenated Israelites get back to building.\nNehemiah’s story is not a story about a man and his people building a wall, though that’s the historical aspect of it. The message from the book of Nehemiah is also not about church building projects like the one my congregation is undertaking. No, it’s primarily about trusting in God’s faithfulness when opposition seems overwhelming.\nWe know in our daily lives that Satan is constantly in opposition to our obedience to God. Our flesh wars against us, pressing us to seek quick fixes rather than cultivating lasting joy. More than that, we let these things cause us to doubt God’s goodness and faithfulness. To put our passage today another way, we wonder, God, can’t you see? Can’t you hear? We are being attacked on every side!\nBut God is not in the business of quick fixes. He is making all things new (Revelation 21-22), and He is patient with sinners (Romans 2:4; 2 Peter 3:9), calling us to enter into His deliberate but still unfolding plan (Matthew 28:18-20; 2 Corinthians 5:11-21). May we not grumble against Him, but remember the faithfulness of our “great and awe-inspiring Lord” (Nehemiah 4:14). May we remember and give thanks for Christ Jesus, who went to the cross to absorb God’s wrath for us—for the joy set before Him (Hebrews 12:2)—and to give us peace until He returns.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day5.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 3:1-32, Romans 12:3-8, Psalm 8:1",
        "devo_title": "We Began Rebuilding the Walls",
        "devo_summary": "\n                    \n                    Do you ever feel like you’re waiting for meaningful work to come into your life? That your present situation is beneath you in some way, but one day you’ll find your true calling?\nRead Nehemiah 3. Every word. All the way through. It might take some effort, but it’s nothing compared to the work the people in the chapter are doing.\nNehemiah 3 is about how the work gets done. This chapter is filled with people’s names and the sections of the wall and gates they worked on. It’s a strange little chapter if you’re reading it looking for something poetic or sentimental. But it is a powerful record of people rising to the occasion to rebuild what enemies had once torn down. It is also a powerful statement about calling.\nThink about these people for a minute. Take Jedediah son of Harumaph from verse 10 as an example. We’re told he worked on the broad wall—the outer city wall—between Rephaiah son of Hur and Hattush the son of Hashabneiah. Can you imagine them there—Rephaiah, Jedediah, and Hattush—working away in the dust and sun? Can you hear the chatter between them as they take their water breaks and compare their busted knuckles and blistered palms? Can you hear them talking about what things will be like when the wall is finished?\nThese guys were doing real work. Hard work. They are in this chapter not for being celebrities or for splitting the atom, but for moving rocks—a job so difficult that criminals are sentenced to do it as punishment. Why does God’s Holy Word contain a record of men stacking rocks?\nOne reason, I believe, can be found in a little detail we’re given about Jedediah, and also about Meremoth (v.21), Benjamin and Hasshub (v.23), the priests (v.28), Zadok (v.29), and Meshullam (v.30). Do you see what they all have in common? These people were all working on the parts of the wall that were right outside their homes. They were doing the hard work that was in front of them.\nMore often than not, this is our calling in life: to do the work that is in front of us, and to do it faithfully. Though we might be tempted to go around the world trying to find our calling in life, more often than not the place where we’re needed most is right outside our own front doors.\nIt is no small thing to have your name included in the Bible. Though some in this chapter are called out for their idleness—like the Tekoite noblemen (v.5)—most of the names in this chapter are there to honor the work of these men and women who worked to rebuild their hometown out of the ruins in their own neighborhoods.\nLook outside your own front door. What work is there to do? How can you help? Maybe that’s your calling right now.  \nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day4.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 2:11-20, Isaiah 62:8-12, Ephesians 2:19-22, James 2:14-26",
        "devo_title": "We Prepared to Rebuild the Walls",
        "devo_summary": "\n                    \n                    There are often times in the Christian life when we face the tension of obeying God’s Word in our current culture. In His Word, He speaks; the Bible calls us to a life of bold obedience. However, there are times when in pursuing God’s call, we are confronted with conflict. There are times when our obedience to God places us in direct opposition to the world. These times call us to have faith and courage, to remember that God is sovereign over all things. This is the truth that fuels our faith.\nIn the latter section of Nehemiah 2, the prophet returns to Jerusalem with a burden to rebuild its walls. King Artaxerxes grants Nehemiah’s request, and even through the citizens are willing to work, he quickly finds opposition by some.\nWhile Nehemiah knows the king of the land is behind these efforts, he ultimately attributes the authority behind this task as coming from God. Nehemiah understands that, in light of God’s sovereign providence, the dire situation is not insurmountable. He believed “the God of the heavens is the one who [would] grant [them] success” (v.20).\nTherefore, because this is a divinely orchestrated blessing, Nehemiah is rightly convinced that those against the plan to rebuild are ultimately in opposition to the work of God. In light of this, he responds with courageous and prayerful obedience by carefully planning his course of action. And the people agreed saying, “‘Let’s start rebuilding,’ and their hands were strengthened to do this good work” (v.18).\nWhat exactly fueled Nehemiah’s faith? It was the Word of God. It was the authority behind his bold and seemingly insurmountable task of rebuilding the walls. But isn’t it true that when God calls His people to a task, it is God who makes His people prosper? He promises, and we respond. We can either respond in bold faith, trusting in Him, or we can respond in fear, shrinking back at the opposition in front of us.\nIn many ways, Nehemiah is a heroic figure whose courage and resolve serve as an example to bolster our faith. He shows us what it looks like to live by faith, trusting in God. This same God reveals Himself to us in His Word and in the person of Jesus Christ, and calls us to respond in faith and obedience. And in His sovereignty, He has the power and authority to bring about His good and perfect will.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day3.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 2:1-10, Psalm 137:1-9, Hebrews 12:18-24",
        "devo_title": "The King Sent Me to Jerusalem",
        "devo_summary": "\n                    \n                    There is a holy sort of confidence that comes from knowing that you are working under God’s calling on your life. It’s not prideful or arrogant, and it’s certainly not a confidence that expresses itself in brash talk or seeks to put down others.  \nWe catch a glimpse of this holy confidence in the life of Nehemiah. For a myriad of socio-political reasons, Nehemiah’s undertaking should have been an impossible one. Power, money, and the dominant culture and thinking in his day would have surely been working against him in rebuilding Jerusalem. Yet Nehemiah set out with courage and passion because he knew the “gracious hand of God” was on his life, a fact that he mentions and remembers in his heart several times (Nehemiah 2:8). \nAll too often, we falter in our own missions because we forget or neglect the power of our calling. More than Artaxerxes’s commissioning, Nehemiah knew he had been sent out under the authority and presence of God. This gave him courage to be bold in his pursuit of God’s causes, and it also offered reassurance when he encountered resistance.\nWhen you go out this day, remember Who is sending you. Like Nehemiah, keep your focus fixed there—not on the problem or challenges in front of you, but on God’s power to change the unchangeable, to conquer the unconquerable, and to restore the unrestorable. \nFor those of you who already possess a deep sense of God’s calling and hand on your life, remember to steward it well. That holy confidence comes with divine expectations; it’s not a gift that you’re meant to wield for your own purposes or gain. In fact, Scripture is laced with examples of leaders who misused the influence of their calling. This repeatedly backfires, and usually carries with it a great deal of collateral damage. \nFor those of you who have lost your sense of calling, or perhaps are seeking it for the first time, take heart: Nehemiah’s mission came in the midst of some dire circumstances. Also, keep watch: God’s vision and mission for this season of life may look different from what you anticipated. When your spirit senses His commissioning, take hold of it and refuse to let it go, and rest assured that His gracious hand is on you.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day2.jpg"
    },
    {
        "book_title": " Nehemiah",
        "devo_passages": "Nehemiah 1:1-11, Deuteronomy 30:1-5, Deuteronomy 30:11-15, Hebrews 7:25",
        "devo_title": "My Prayer to the God of Heaven",
        "devo_summary": "\n                    \n                    I have a friend whose house burned to the ground. Practically everything his family owned was reduced to ash. Yet in the midst of his shock and uncertainty for what lay ahead, my friend said that he felt strangely liberated. Losing all their worldly possessions meant his family was free to start over.\nIf you were given the opportunity to reboot your life, what would you do, and why? Would you work to recapture what was lost, or would you try to build something completely new and different? Would you try to become someone completely different?\nThis situation is where we meet Nehemiah. The Babylonian exiles have essentially burned life as his people knew it to the ground. The walls of Jerusalem lay in ruins hundreds of miles away. As the people of Judah surveyed their situation under Persian rule, they were essentially asking themselves: Who are we now, and what happens next? Do we try to go back, or is there no such thing as home anymore?\nFor Nehemiah, Jerusalem was more than a place. It was a symbol—a physical location on a map that pointed to a spiritual belonging. He and his people didn’t just belong to that city. They belonged to the God who had led them there so many years earlier. Their identity was tied to the temple of the Lord shining from that city on a hill in Zion. So when the opportunity to repair Jerusalem’s fallen walls became a possibility, Nehemiah prayed, “Please, Lord, let your ear be attentive to the prayer of your servant” (Nehemiah 1:11). Then he set his face like a flint toward home and went back to rebuild.\nAs you read the book of Nehemiah, remember that true belonging is about more than a physical place to store your stuff or lay your head. For the Christian, we are tied to the ancient story of God’s redeeming work, which has its roots all the way back in the fall of man in the Garden of Eden. Even if everything around us burns to the ground, we still have a home in the presence of God. Even more, we have an identity. We are His people, and that is something no exile, catastrophe, or war can threaten or change.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Nehemiah-Shareimage-Day1.jpg"
    }
]