[
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 4:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nThis week, commit to memory this verse of restoration and hope from the last chapter of Ruth.\nThen the women said to Naomi, ‘Praise the Lord, who has not left you without a family redeemer today. May his name become well known in Israel.’\n– Ruth 4:14\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/4-HRuth2.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Matthew 6:26",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n“Look at the birds of the sky:\nThey don’t sow or reap or gather into barns,\nyet your heavenly Father feeds them.\nAren’t you worth more than they?”\n-Matthew 6:26\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-instagram13.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 4:18-22, Matthew 1:2-16, Romans 15:12, Luke 3:32-38",
        "devo_title": "Beneath the Tapestry",
        "devo_summary": "\n                    \n                    Reading the genealogies in Scripture can often feel like reading the Yellow Pages. (Social media Luddites will remember that big yellow book that arrived every year on the front porch.)\nIf we are honest, we are tempted to skip over the lists of names in the Bible because we struggle to recognize their importance. Yet, there are many reasons why God deemed it necessary to include those lists in His Word for our good. One is the fact that they tell a crucial part of the redemptive history. This is seen most clearly in the way the book of Ruth comes to an end.\nIn the verse immediately before the genealogy, we read that the people rejoiced at the birth of Ruth and Boaz’s son, saying, “‘Naomi has a son!’ And they named him Obed. He was the father of Jesse, the father of David” (Ruth 4:17). \nNaomi’s sorrow had been taken away by the faithfulness of God. This woman who had returned home without her husband or sons, with one daughter-in-law and no hope of having anymore children, had her bitterness of soul taken away through God raising up Boaz to marry Ruth and give her a child. Ruth’s blessing was Naomi’s joy.\nBut the narrative would not be complete without the genealogy. The end of this book leaves the story of Naomi and Ruth pressing forward into the redemptive metanarrative (i.e. the overarching story) of Scripture. Ruth would be the mother of Obed and the grandmother of King David. \nThe triumph of Ruth is not merely found in the fact that she received a husband and son. The triumph of Ruth is that God’s grace would place her in the line of the Redeemer. God’s grace is so great that He can take a Gentile widow (who had no claim to the covenant promises) and make her an important figure in the history of redemption. \nRuth is one of five women in Jesus’ genealogy (Matthew 1:2-16). Two of whom were prostitutes, one was a pagan, one was an adulterer, and one was a virgin. By His grace, God wove together this beautiful tapestry of redemption, using the disreputable and despised. And this is how God continues to work today. \nEven though we are not waiting for the Redeemer to descend from one of our own children, we, who have received Jesus Christ by faith, have received the same grace as Ruth. Our names are written in the Lamb’s Book of Life. It is grace—sheer undeserved and unmerited grace-—that makes the tapestry of God’s redeeming work so glorious.\nGod takes the most unworthy people and makes them to sit before Him as princes and princesses. He did it for Ruth, and He continues to do it for all who trust in the Son of Ruth—Jesus Christ. \nWritten By Nick Batzig \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-Instagram12.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 4:13-17, Psalm 127:1-5, Proverbs 24:27",
        "devo_title": "A Life Restored",
        "devo_summary": "\n                    \n                    Becoming a father was an eye-opening experience for me. I was young, immature, and unwise. I could barely eat a bowl of cereal without spilling milk down my shirt, and I was supposed to feed a child? Then God gave us a second little one. Good grief! Let’s just say that I was confused about God’s plan for me.\nI’d like to say I’m a perfect Instagram parent who is always smiling with my perfect, smiling kids. But the Lord knows that’s the farthest thing from the truth. It’s often a struggle. But as my daughters have gotten older, God has taught me that children are a great blessing, and that I need to rely on Him to have even a remote chance of leading and loving them well.\nBoaz and Ruth were older when they had Obed, so Ruth’s mother-in-law Naomi was even older! She was bitter, and afraid she’d have no child to redeem her family. She was dying for a child to redeem her distress. \nNot only did God give her a long-awaited baby through Boaz and Ruth, He gave her a baby who would “sustain her in her old age” (Ruth 4:15). Obed was a blessing far beyond Naomi’s wildest dreams. His birth taught her that God surely would provide, even when everything looked hopeless. This baby would serve to change her heart toward God.\nAs the Bible goes on, we see that Obed wasn’t merely a redeemer for Naomi; he was another child in the line leading to the One who is called “a Savior, who is Christ the Lord” (Luke 2:11). Obed’s birth led to the birth of the world’s Redeemer—the One who would give us new birth (John 3:3).\nIt’s tempting to look back at Naomi’s situation and scold her for being impatient or for doubting God’s faithfulness. But we all do it, everyday, when we choose lesser gods over Him. Our lack of faithfulness reflects our doubt that God’s Word is faithful and true. As a parent, I’m constantly overlooking God’s grace to me through my children. When they disobey or drive me up the wall, it pushes me to rely on God a little more. And I love God more today than I did three years ago because of what He has taught me through my girls.\nThough our children are blessings, they aren’t the true and better blessing of Jesus, the Child sent into the world to redeem it. “Like arrows in the hand of a warrior are the sons born in one’s youth,” says Psalm 127:4. I hope that, despite my doubting in God’s faithfulness to me, I’m able to launch my daughters into the world like gospel-lit arrows, always remembering that it is God’s Son who determines their path.\nWritten By Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-instagram11.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 4:1-12, Psalm 74:1-3, Leviticus 25:23-28",
        "devo_title": "Renowned In Bethlehem",
        "devo_summary": "\n                    \n                    Where in your life are you thinking about giving up? You’re looking at a situation that once seemed filled with promise, but now you just can’t see how anything good could come of it. And you’re tempted to kill your hope, to take your lumps and move on. Don’t do it. There’s so much you cannot see.\nToday’s text reminds us that there is always more going on than we can know, and because there is, there is always room for hope.\nI am not a poker player, but we’ve all seen movies or read stories about a perfectly played poker hand. Sometimes the hand wins because of the cards, but most of the time it’s because of the way the cards are played. Today’s text, which describes an ancient custom of claiming inheritances, reads like a perfectly played hand.\nThe player? Boaz. The stakes? Ruth’s future. Read the text and let me describe the custom.\nThe city gate was essentially the town hall. Boaz goes to the gate to look for Elimelech’s next of kin, Ruth’s “redeemer.” Boaz arrives with a strategy. He finds Elimelech’s next of kin and invites him to sit down with him. The man knows this gesture means Boaz wants to talk business. Boaz then gathers ten elders—respected men in the town—to serve as witnesses to this conversation.\nBoaz starts laying out his plan by saying nothing about Ruth. He just talks about Elimelech’s land. “You’re first in line. Do you want to buy it?” Then Boaz shows one of his cards. “I will gladly redeem it if you don’t want to.”\nNow, the next of kin knows he would have to take on caring for Naomi, Elimelech’s widow, if he buys the land. But since Naomi is past childbearing years, he wouldn’t have to divide his inheritance with any children he might have with her. So he says yes, thinking the land will go to his existing heirs.\nThen Boaz plays the rest of his hand: If the next of kin buys the land, he will also “inherit” Ruth, in order to give her dead husband an heir. For the next of kin to take Ruth into his home, he would have to deplete his own children’s inheritance to buy this land, knowing it would not be passed down to his own sons, but to Ruth’s.\nBoaz has painted the next of kin into a corner where the only way out is to deal honestly with what he really wants. If the redeemer doesn’t want to pay the cost and be bound to the custom of the law to give Ruth a son, this is his chance to decline. And because the elders of the city are listening, Boaz has put the man in a position where he must give his answer on the spot. And the answer he gives will be final.\nIt’s a brilliant play. Boaz has Ruth’s well-being in mind. If the next of kin really wants to do for Ruth what Boaz wants to do for her, Boaz seems willing to call that good. But if there is any hint of reluctance in the next of kin, Boaz has already offered himself as an easy out for the man. Either way, Ruth will end up with a man who truly wants her.\nThe next of kin doesn’t want to absorb the cost of buying land that will not go to his heirs, so he declines in front of everyone, and names Boaz as Ruth’s kinsman-redeemer. Boaz takes the man’s sandal with his heart set on marrying the girl.\nBack at the hut, Ruth knows none of this. What if she’s killing the hope in her heart while all this is going on? That would be a shame, wouldn’t it? Boaz was doing “above and beyond all that she could ask or think” (Ephesians 3:20). The elders who witnessed Boaz’s commitment proclaimed, “May you be renowned in Bethlehem!” (Ruth 4:11). Little did any of them know how true that statement was.\nThis is how God works in us, through us, and for us. How much is God doing in your life that you can’t see? It’s a trick question. How could you possibly know?\nWhere are you thinking about abandoning hope? Don’t do it. There’s so much you don’t know.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-instagram10.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 3:14-18, Proverbs 31:10-11, Matthew 22:23-33",
        "devo_title": "Waiting as Obedience",
        "devo_summary": "\n                    \n                    Naomi gave Ruth a mother-in-lawly piece of advice: Wait. See what happens. \nAnd I bet Ruth gave a subtle eye roll, for not a one of us likes to wait, no not one. But Ruth was obedient and her story continued its winding path, one that later led to the newborn cry of a baby grandson who would grow to be the king who chased hard after God’s heart. There was no way Ruth could’ve known that back there among the barley bundles. She had to wait. \nI once heard the writer Barry Lopez use the phrase “the insouciance of cows.” I’m not a big fan of fancy words. But I like Lopez, and furthermore I like his writing, so I looked up that five-dollar jobber. Insouciance means “a relaxed and calm state”—a feeling of not worrying about anything.\nMy grandfather had a dairy farm in North Texas, so my brother and I spent growing-up summers around cows. We soon learned that these creatures are not in a hurry about anything, ever, at all. It would seem they’re fine to wait indefinitely, much to the consternation (fancy word, sorry) of my grandfather, who was always behind on something, and therefore always trying to hurry things up. But as he experienced on a daily basis, there is an earthly reality known as “the insouciance of cows” and all the cussing, stomping, fist-shaking, and spitting in the world won’t change that.\nWhat if you heard me use the phrase “the insouciance of Jesus”? Knowing what you know now (because I’ve told you) about the word, would that ring true with your image of the Jesus of Abraham, Isaac, and Jacob? The Jesus of the living and the dead?\nJesus didn’t walk this good earth not caring about anything, but rather not worrying about anything. And this is a crucially important distinction. There was a characteristic of restraint in Him that, far from being burdensome, was incredibly liberating. \nJesus waited on God the Father for direction at every turn. He only did what He saw the Father doing, and only said what He heard the Father saying (John 5:19). Jesus’ restraint demonstrated obedience far beyond mere lip service to the Father—the Father who spoke at every turn, Don’t worry. Trust me. The resulting picture we have is that of the Son of God relaxed and calm; in a word, insouciant.\nI’m not sure the insouciance of cows has anything to do with the state known as wonder. I suppose it’s possible, but I’m not certain. But I do believe the insouciance of Jesus was filled with anticipation, this braced-on-the-edge-of-his-sandals excitement for what God was going to do. \nRuth had to live in this posture of waiting as well, wondering what in this world was going to happen next. And so do we. And to this, God still seems to always respond with this rather parental advice: Wait. See what happens.\nSo we wait.\nThe daily, visible practice the discipline of wonder-working-waitingness is maybe at least one way the watching world can spot an obedient Christian. And trust me, they’re still watching.\nWritten By John Blase \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-Instagram9.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 3:1-13, Ephesians 5:22-32, 2 Corinthians 11:2",
        "devo_title": "In Search of a Redeemer",
        "devo_summary": "\n                    \n                    “Take me under your protecting wing.” \nTo take someone under your protecting wing is to make an outsider an insider. I’m trying to think of the last time I asked someone to take me under their wing. \nOne of my black pastor friends has agreed to partner with the church I serve so our churches can do ministry together in our city. I always ask to meet him at restaurants he’s familiar with, but are off my radar. So we eat together in places I might never otherwise go. I start going to them myself after awhile. One of the effects of being taken under my friend’s wing is that I begin to feel like an insider. \nIn today’s text, Ruth’s mother-in-law, Naomi, wants to put Ruth under someone’s protective wing – someone who can give her a place among Israel’s people. Naomi says, “My dear daughter, isn’t it about time I arranged a good home for you so you can have a happy life?” (Ruth 3:1 MSG). Go get cleaned up. Put on your best dress and some perfume. Be at the right place and the right time. Signal your availability for marriage. Let’s get you married! \nNaomi’s plan might not work for you, but it was a perfect plan for Ruth. It was exactly what she needed right then and there. She was ready. She just needed a push, a mentor. \nWhat she really needed and wanted was a protecting wing — a true Redeemer. Husbands are imperfect redeemers. Wives are too. But they’re both a picture of one. They’re what we might call a type of redeemer, but they can’t fully bear the weight of what a perfect Redeemer is meant to be: someone who can give us eternal belonging. Still, they point us in that direction. \nRuth needed the Protecting Wing, the Redeemer, the Perfect Captain. And she had the courage and tenacity to put herself out there and actually ask for it. She didn’t pull back. She risked it all, and went for it. And she found in Boaz a man who could take her from standing on the outside, to a place of belonging. \nBut what God was doing through Ruth was even greater than what Boaz did for her. God was making her an eternal insider in the story our of Redemption. What God did—by working through Naomi to join Ruth and Boaz—didn’t just lead to Ruth’s redemption. It formed a link in the lineage of Christ Himself, who would bring us under God’s protective wing, making us insiders in the Kingdom of God.\nThis passage in the book of Ruth reminds us of what the gospel is: the story of outsiders being made insiders. When our faith is in Christ, that is what we are.\nWritten By Doug Serven\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-Instagram8.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 1:16",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nThis week, commit to memory Ruth’s declaration of fidelity to her family and to God.\n Wherever you go, I will go,\nand wherever you live, I will live;\nyour people will be my people,\nand your God will be my God.\n-Ruth 1:16\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/4-HRuth.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Psalm 36:7",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nGod, Your faithful love is so valuable\nthat people take refuge in the shadow of Your wings.\n—Psalm 36:7\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-instagram6.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 2:18-23, Deuteronomy 7:7-9, Psalm 41:1-3",
        "devo_title": "Unexpected Kindness",
        "devo_summary": "\n                    \n                    “God helps those who help themselves.” \nA biblical principle? Nope. It’s not found in the Bible at all, though some people think it is. It’s actually an old adage popularized by Benjamin Franklin, who seemed to have been paraphrasing the Greek thinker, Aesop.\nA close examination of the Gospels reveals that Jesus never really made a distinction between the deserving and undeserving poor (those meriting or not meriting help because of their behaviors or attitudes). Jesus simply talked about the poor—no qualifiers attached. His love and care for each person in need was abundantly evident. Jesus instructed His followers to care for “the least of these” for, in so doing, they were offering worship to God (Matthew 25:40).\nThroughout redemptive history, God has consistently revealed to His people that it is important to care for the poor. Today we read of the kindness and generosity that Boaz shows to Ruth and her family, and we also see the specific charge God gives to the Israelites in Deuteronomy.\nIn Scripture, and in our daily living, we can observe two postures common to giving and charitable work. I know I’ve personally adopted one or the other at different times.\nThe first posture of giving presupposes ownership. When we give from a place of ownership and possession, we tend to think like this: “I work really hard, and I try to do the right thing; therefore, I deserve nice things. Poor people don’t work as hard as me, and they don’t make good choices. They’re lucky I choose to give from time to time.” \nThe second posture of giving looks like thanksgiving. When we give from a place of humble gratitude to God, we tend to think like this: “Man, I don’t deserve any of these nice things. God’s image rests on all humanity. That some should suffer while I thrive is a complete mystery. I get to give because God has given me these resources to steward and offer as a means of His love.”\nGod knows that giving is good for us, even though it can seem so counterintuitive and countercultural. But it’s part of His nature. \nGod helps those who cannot help themselves. He helps them precisely because they are stuck. He delights in caring for us. That has been the story from the very beginning. God chose a people not for their might or magnificence, but because of His mercy.\nWe are called to give wisely and lovingly. We are called to give caringly and compassionately. We are called to give because, in so doing, we imitate God. Somehow by giving away more and more, we become more whole. This is a mystery indeed, but as we empty our pockets, our hearts and lives are filled in ways we would have never thought possible.\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-Instagram5.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 2:4-17, Deuteronomy 28:8-9, Psalm 36:7-9",
        "devo_title": "God’s Hand at Work",
        "devo_summary": "\n                    \n                    There is Ruth, working the fields. The sun is fading. She is physically slight when I picture her out there, harvesting to provide for herself and Naomi. She works by the sweat of her brow.\nIt would not be hard to imagine she felt small among the workers—small, with many things to be afraid of. Will I do this work well enough for us to survive? Will I, a widow with no one to protect me, be safe among the men I must work alongside?\nBut then Ruth is noticed by her employer. He hears her story of tragedy and need. And he learns of her care for Naomi, which moves him.\nThe story does not say this, but Ruth might have felt even more fear when Boaz spoke to her. Maybe he sent for her and she had to walk over to him, worried about her future, for this was the man who held power over her hope of survival—for both her and Naomi.\nBut Boaz speaks to her tenderly. He calls her “daughter.” And then he brings her under his care. He makes sure she stays with the other women and works alongside them. He makes sure the men do not lay a hand on her. \nYou can hear and see the relief in her response to him: “Why have I found favor in your eyes, that you should take notice of me, since I am a foreigner?” (Ruth 2:10).\nBoaz responds with what can only be thought of as a blessing—a hope that probably felt like a prayer over her weary head. “May the Lord repay you for what you have done. May you be richly rewarded by the Lord, the God of Israel, under whose wings you have come to take refuge” (Ruth 2:12).\nLittle Ruth, with so many reasons to fear, finds herself noticed, cared for, and protected.\nBut this story is not just about Ruth. This could be a story about little Matt. Or little Chris. Or little Jonathan. You do not have to look hard for the mercy of the gospel in this story. How often have I felt small and feared the world around me? Then, when noticed by the One who can truly provide for me, I’ve asked, “Why have I found favor in your eyes, that you should take notice of me?” How often have I then remembered that, because of the work of Jesus, I am under the protective wings stretched as wide as the mercy of the cross, itself. \nThanks be to the One whose “faithful love is so valuable that people take refuge in the shadow of [His] wings” (Psalm 36:7).\nWritten By Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-Instagram4.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 1:19-22, Ruth 2:1-3, Job 27:2-6, Philippians 3:8-11",
        "devo_title": "A New Name",
        "devo_summary": "\n                    \n                    Many things can make us bitter against God. A job loss, a failed marriage, a church split, broken relationships, the death of a loved one, illness. When we experience these, we often think God should have fixed it. He should have helped. \nHe could have saved us but He didn’t. So we become bitter. We think ill of Him and speak ill of Him. We shake our fists and curse Him under our breath, and sometimes even reach the point of rejecting Him all together.\nIn Ruth 1, we see Naomi and Ruth experiencing loss to an extreme degree. They are left with no husbands, which, in that culture, meant no security and even no identity. They were on their own, destitute and lost. So Naomi declares her new name to be Mara, which means “bitter.” For, she says, “God made me bitter. He brought me back empty” (Ruth 1:21).\nLike all good stories, though, this one has a twist. It is a twist on our understanding of “bitterness.” Mara doesn’t reject God. She doesn’t shake her fist. She responds more like what we see from Job; though God made her bitter, she did not lose her integrity, give up on following Him, or speak ill of Him. Her bitterness was one of pain and brokenness, but not one that lacked faith. She knew God was God and clung to Him regardless. We see this in her response to Ruth.\nRuth was, in many ways, a fruit of Mara’s pain. She was a reminder of loss. Yet Mara claimed her as a daughter. When Ruth sought her permission to go and find a means of livelihood, Mara blessed her on her way, saying, “Go, my daughter.” This small phrase shows both love and hope. \nMara loved Ruth and kept living life. Her bitterness did not steal her capacity for feeling, for faith, or for life. It was not the bitterness we so often picture. Such a response to suffering echoes Paul’s words in Philippians 3, where he says he “considers everything to be a loss in view of the surpassing value of knowing Christ” (3:8). \nSuffering hurts. It brings bitterness to the soul, but that bitterness does not have to rob us of life or faith, even if it robs us of happiness. We can still love, we can still follow, we can still live.\nAnd notice one more thing. When Mara (Naomi) responded to her suffering this way, something extraordinary happened; the door was opened for Ruth to meet her redeemer, Boaz. And, through meeting Boaz, the plot was set in place for the Redeemer of the world to be born – the Redeemer of whom we say we everything is loss compared to knowing Him.\nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-Instagram3.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 1:6-18, Hosea 2:18-23",
        "devo_title": "She Stayed",
        "devo_summary": "\n                    \n                    I think most of us have asked at some time, “What is God’s will for my life?” Quite often the advice I have received sounded like this: “Do what brings you joy,” or, “If God has opened a door of opportunity, walk through it.” But rarely has anyone said to me: “Embrace the path that is full of struggle, grief, and loss.” Yet the life of faith is often just such a path. \nFor Ruth, every external indicator beckoned her to return home. Even her dear mother-in-law, Naomi, pleaded with Ruth and Orpah, “Turn back!” Why, then, did Ruth stay? She was going to a land she did not know. She was leaving everything familiar—her own land, her sister, and her family.\nNaomi’s insistence clarifies the nature of Ruth’s decision. Ruth did not follow in hopes of personal gain. Naomi told her she could offer no luxurious living, no hopes of a new husband. She offered poverty, loss, and bitterness (Ruth 1:12-13). Yet Ruth took the path of greatest resistance because she had in view gains that were more than earthly. Ruth’s famous declaration, “Your people will be my people,” was rooted in her oath, “Your God will be my God” (Ruth 1:16). \nThis was not merely a human promise to follow Naomi, but a covenant vow to serve the God of Israel. Ruth remained with Naomi because her affections were set upon Naomi’s Lord, even though her decision might mean a life of hardship. \nWhere do you set your affections? Do you look for God’s guidance only in the promises of earthly success? Do you make this world’s luxuries the measure of God’s will? Too often, our hearts are fickle, valuing Christ only when our faith serves our desires. But when tribulation or persecutions arise, do we fall away?\nGod the Gardener promises that even in the desolate places, He brings forth life. Though He leads us into the wilderness, there He will speak tenderly to us (Hosea 2:14). Indeed, in that day, even the earth shall answer, even the grain, even the wine and the oil. The desert and the parched land will be glad, and we will lie down in safety (Isaiah 35:1; Hosea 2:18). \nMay we hold fast to Christ, forsaking all worldly affections, that we may see the eternal harvest and gain those profits which will last forever.\nWritten By Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Ruth-instagram2.jpg"
    },
    {
        "book_title": " Ruth",
        "devo_passages": "Ruth 1:1-5, Deuteronomy 25:5-10, 1 Timothy 5:4-8",
        "devo_title": "Family Ties",
        "devo_summary": "\n                    \n                    What is your theology of suffering? You have one. We all do. We may never have thought about it, but we all have presumptions we carry regarding how to think about and deal with pain and loss.\nThe book of Ruth opens with the story of a woman named Naomi, whose heart is broken. When we meet her, she is married to Elimelech. They are living in Bethlehem with their two sons, Mahlon and Chilion, when famine strikes. Elimelech decides they should uproot and go east to Moab to survive. Out of the gate, this family is facing two huge hardships: the loss of sustenance and the loss of their home.\nThen, in Moab, Elimelech dies, leaving Naomi a widow in a foreign land. Her sons marry local Moabite women, but before a decade passes, both of her sons also die. Now she is a widow in a strange land with no sons—only two daughters-in-law who are also widows.\nNaomi’s loss looks devastating. How would you have responded to this? If that were me, I might easily be asking, “Is God involved in my life? Has He failed to be good?”\nWhen tragedy hits, we’re left to try to figure out what to do with it. This is where we all get seriously theological. If there is a God, what sort of God is He? Where is He in our pain?\nThere are really only four options. We could say:\n1. There is no God, and that’s just the nature of things. Struggle and suffering are problems we endure, try to learn from, and move past.\n2. There is a God, but He’s not involved. When we cannot understand how a Divine Being could exist in the same cosmos as our pain, we’re tempted to chalk it up to the Creator being distant, disinterested, or off doing other things.\n3. There is a God who is involved, but He’s cruel. Here, the Divine Being is like the Greek gods, doling out karma, and sometimes we’re the casualties. This god is the bad guy.\n4. There is a God who is involved, and He is good—even in the midst of our suffering, even when we don’t understand Him.\nNaomi embraced that last option, and held on for dear life. We call this faith.\nWhen God set out to tell His people their story, He included the story of Ruth—this seemingly small vignette about two single women in the midst of extreme uncertainty, dealing with crushing loss. Why do we need this story? For one reason: It shows us that God is working in small stories just as much as He is in grand, sweeping epics. \nIn the small story of Ruth, God works through loss and love, famine and harvest, foreigner lands and family, to preserve a genealogy that would lead directly to King David and Christ Himself.\nWe need this story to help us recognize that God is always doing more than we can see, even in our pain. We need to remember that one person’s story is never only about that one person. Your story is not solely about you, and neither is mine just about me. Our stories belong to God, who is always doing immeasurably more than we ask or think (Ephesians 3:20). \nTo Him be the glory as we study Ruth.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Ruth-instagram1.jpg"
    }
]