[
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Malachi 4:2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Malachi.\nBut for you who fear my name, the sun of righteousness will rise with healing in its wings, and you will go out and playfully jump like calves from the stall. \n—Malachi 4:2\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/4-MinorProphets2019-3.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Psalm 132:8-9",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nRise up, LORD, come to your resting place,\nyou and your powerful ark.\nMay your priests be clothed with righteousness,\nand may your faithful people shout for joy.\n—Psalm 132:8–9\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day20.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Malachi 4:1-6, Isaiah 60:19-22, Revelation 21:9-27",
        "devo_title": "The Day of the Lord",
        "devo_summary": "\n                    \n                    The book of Malachi is caught in the middle. It’s in the middle of our Bibles, and its prophecies were spoken in the middle of redemption history—after God brought His people back from exile but before the angel Gabriel announced the coming of Christ. The prophet called the people of God to remember what God had done for them in the past but also flashed a light ahead to the great and amazing things God would still do. But for the moment, they were in the middle.\nAs I read through Malachi for this He Reads Truth study, I felt at home. I, too, live in the middle, caught somewhere between the already and the not yet. Christ has come, but He’s coming again. I have holy Scripture in my hands, typeset and bound in a leather cover, to read and to study and to build my life upon. But God is still at work, and I am looking forward to seeing more of His promises fulfilled with my own eyes—either in the natural years that are given me to walk this earth or with eyes that are awakened from death and made new at the Lord’s coming.\nThe final words of Malachi are fitting for a faith that lives in the in-betweens. He tells the people of Judah to remember the law of Moses, those ancient rules that set Israel apart from their neighbors and were, in part, the basis for their special relationship with Him (Malachi 4:4). But He also tells them about something that will happen in the future—Elijah will come before the Day of the Lord (v.5).\n“Elijah” was John the Baptist (Matthew 11:7–10), and he did indeed prepare the way for the coming of the Lord. But there is still a future coming, a Day of the Lord that will be history’s final Day of the Lord. Whether or not Elijah will come again in some form is yet to be seen, but that the Day is coming is certain. When it does, there will be no more middles, no more alreadys-and-not-yets. There will only be judgment and salvation.\nFor those who have rejected the grace of God in Christ, the warning is dire: “all the arrogant and everyone who commits wickedness will become stubble. The coming day will consume them” (Malachi 4:1). But for those who know the Lord, Malachi has this promise: “But for you who fear my name, the sun of righteousness will rise with healing in its wings, and you will go out and playfully jump like calves from the stall” (v.2).\nThe fire of judgment or the warmth of the sun. Destruction or healing. Death or life. The choice, from Genesis to Revelation and all down through human history, has always been the same.\nWe may feel caught in the middle, but the time for remaining in the middle is drawing to a close. Let’s heed Malachi’s instruction to remember—maybe not looking back exclusively to the Mosaic Law, but to Christ, who fulfilled that law and died on our behalf. And let’s do so with thankfulness, because the work of Christ also invites us to look ahead to the promise of His coming kingdom, when all things will be made new (Revelation 21:5).\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day19.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Malachi 2:17, Malachi 3:1-18, Matthew 11:7-15, Hebrews 12:7-11",
        "devo_title": "Judgment at the Lord’s Coming",
        "devo_summary": "\n                    \n                    This past spring, when the buds started bursting, the birds started singing, and the world seemed to be reborn a thousand shades of brilliant green, I discovered that my lawn was more weeds than grass. The beautiful, vibrant, lush yard my family and I had enjoyed the previous autumn returned from its winter slumber too weak to combat a militant strain of common weeds native to Middle Tennessee.\nI called my lawn guy, and, as if it were a medical emergency, he came over to the house immediately. (I’m not joking—our lawn guy is that dedicated to grass. He loves the stuff.) Stepping from the cab of his truck, he was already shaking his head. “Winter weeds,” he said. “You can fight ‘em, but you should’ve fought ‘em last fall.” As I’m learning, one of the tricks to starting off well with grass is to apply weed killer and feed to the lawn in mid-fall, before the cooler weather sets in. Doing so prepares the yard for the coming year. Otherwise the spring rains and sunshine grow weeds faster than grass.\nIn God’s economy, preparation is a form of grace. The people of Judah, home from exile but still under the thumb of a foreign king, were awaiting the Day of the Lord, when God would reign from Jerusalem, blessing Israel and punishing the nations of the earth. The way they saw it, everyone else had it coming.\nBut that’s not the way God saw it: “I will come to you in judgment, and I will be ready to witness against sorcerers and adulterers; against those who swear falsely; against those who oppress the hired worker, the widow, and the fatherless; and against those who deny justice to the resident alien” (Malachi 3:5). God shows no favoritism when it comes to His righteousness. The people of God would be judged, just like everyone else.\nHowever, remember when I said preparation is a form of grace? Before God promised judgment, He also promised a messenger to prepare the way before the Lord (Malachi 3:1). The messenger would remind the people of God’s invitation: “‘Return to me, and I will return to you,’ says the Lord of Armies” (v.7).\nWe know this messenger as John the Baptist (see Matthew 11:10), who did indeed prepare the way for Jesus. He preached the coming kingdom of God and called the people of Israel to repent. And guess who were among Jesus’s earliest disciples? The disciples of John (John 1:35–46; 3:26–30). Their hearts were ready. Their priorities were already being aligned with the kingdom. And they paid attention to what John said about the coming Messiah, so that when the Lamb of God arrived, they were ready to follow Him.\nThere is no longer a man dressed in camel’s hair with a leather belt about his waist standing in the Jordan, his breath stinking of locusts and wild honey, calling people to repent. But that doesn’t mean we have been left without a way to prepare for the Lord’s return. We have the Scriptures and we have one another. So let us be people who savor His Word as instructions for life. Let us be people who help each other prepare our minds and hearts for the coming kingdom.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day18.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Malachi 2:1-16, Psalm 132:8-10, Hebrews 8:8-13",
        "devo_title": "Warning to the Priests",
        "devo_summary": "\n                    \n                    Far too many people have been there, myself included. I’m talking about that moment when you discover an invaluable covenant has been broken. Perhaps it was a marriage, a bond of friendship you thought was unbreakable, or an important business deal you were counting on.\nWhen a trust has been broken, every area of your life is affected. The worst part, though, is the burn of betrayal you feel in your gut. It’s unrelenting and unquenchable. It keeps you up at night and destroys your appetite. It’s the sort of ache that can immobilize you mentally, spiritually, and even physically if not addressed with care.\nIt may be that you, too, have been there. It may be that you’re walking through something like what I’ve described right now. If you are, I want you to know that you can go to the Lord with every bit of pain you feel, with every unanswered question, and with every doubt. He is the God of all comfort (2 Corinthians 1:3), and He is able to sympathize with us because He has been on the receiving end of betrayal as well.\nEven after God’s people had experienced the hardship of exile as a direct result of their sin, they returned to the land of promise only to slide back into disobedience once again. The priests were performing their duties without heart—offering up lame and blind animals, and defaming the reputation of God in the process. And the disdain for the Lord’s commands didn’t stop with the Levitical priesthood. Men were marrying foreign wives and worshiping their gods. Some were even divorcing the wives of their youth to do so.\nWhen I read this passage from Malachi, I expect to hear God say, “And that’s why you’re going into exile again—this time for good! I’ve had it! I can’t take it anymore!” But He doesn’t say that. Yes, He’s angry. (At one point, He even says He’s going to spread the dung of the sacrificial animals on the faces of the priests so they can be hauled out of the camp and discarded just like refuse [Malachi 2:3].) But we know this isn’t the end of Israel’s story.\nEven though there is no one who perfectly obeys the covenants and loves God with the intensity He deserves, God doesn’t give up on His people. Instead, He sends His Son to be an Israelite. Jesus becomes the perfectly obedient son of Abraham, of Jacob, of David. And He becomes the perfect priest and the perfect sacrifice, once and for all. In this way, Christ takes every broken covenant and makes them whole, perfectly fulfilling the law and completing the task Israel never could.\nWe have all broken faith. We have all been betrayers. But in Christ’s obedience, there is good news for all who are united with the Lord in His life and His death: His righteousness is now our righteousness. And though we don’t deserve it by our own merit, God is now able to look upon us and say, “He walked with me in peace and integrity and turned many from iniquity” (Malachi 2:6). Amen.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day17.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Malachi 1:6-14, Psalm 87:1-7, Ezekiel 36:16-23",
        "devo_title": "Disobedience of the Priests",
        "devo_summary": "\n                    \n                    Scripture Reading: Malachi 1:6-14, Psalm 87:1-7, Ezekiel 36:16-23\nToday’s devotional is one that came in fits and starts. A lot of time was spent staring at a blank document, that infernal blinking cursor mocking me as it flashed in time at the top of the page. I read and reread our passage from Malachi, praying over it and trying to think of a unique or memorable way to connect the disobedience of the priests in post-exilic Judah to our own lives today. But every parallel I could think of seemed to fall apart before my fingers could finish typing.\nThe priests in Malachi’s day were offering blind and lame animals to the Lord and treating His altar with contempt, even referring to the sacrificial system as a nuisance (Malachi 1:13). A direct comparison won’t do. We don’t bring livestock with us to church. We are not required to offer up the blood of an animal for purification. Christ’s blood has already paid the price for our sin.\nAnd it would be a stretch to compare the worship of the Old Testament sacrificial system to our modern worship services on Sunday morning, as if the lesson we should take from the Lord’s rebuke of the priests here in Malachi should be something like “Always wear your Sunday best, sing with gusto, and remember to sit up straight during the sermon.”\nIn reality, this passage is not less applicable to us because we are so far removed from its context, but ought to instead hit us powerfully in the chest. You see, in Christ, God has made us priests, and our priesthood far surpasses the Levitical priesthood of Aaron and his descendants. Scripture calls us a “royal priesthood” (1 Peter 2:9)—we are sons and daughters of the King called to serve in His presence.\nSpeaking of presence, you may have noticed there is no longer a temple in Jerusalem where God’s presence resides. Instead, God’s presence abides within every believer. We are His temple (1 Corinthians 3:16), and our priestly duties remain with us wherever we go in this world.\nJust as our priesthood and our temple-bodies are superior, so too are the sacrifices we are commanded to offer. Animals—even spotless, perfect, unblemished ones—will no longer do. Christ’s death on the cross has made them obsolete anyway. Instead, our sacrifices consist of our whole lives. Each one of us is to be “a living sacrifice” as an ongoing act of worship (Romans 12:1).\nIt would never do to take God’s rebuke of the priests in Malachi and simply apply it directly to ourselves. But there is a deep truth we need to hold onto, a glimpse into the spiritual reality we have been called into. God’s complaint was not really about blind animals. It was about the hearts of His priests. They took their sacred privileges and made them common by maintaining a posture of disrespect and dishonor toward God (Malachi 1:6). As a result, they were failing in the most sacred responsibility as God’s image-bearers: to magnify the name of the Lord. We have that same responsibility, and since our priestly role has been expanded and amplified (Revelation 5:10), we ought to read this passage as a warning.\nGod promises, “My name will be great among the nations, from the rising of the sun to its setting” (Malachi 1:11). It is for this reason we have been created, and for this reason we have been called. So in everything we do, day in and day out, give the Lord the honor due His name. We live in His presence continually, so let’s live like it, wholeheartedly devoted to Him.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day16.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Malachi 1:1-5, Acts 20:32-35, Romans 9:6-21",
        "devo_title": "The Lord’s Love for Israel",
        "devo_summary": "\n                    \n                    Scripture Reading: Malachi 1:1-5, Acts 20:32-35, Romans 9:6-21\nI know he really doesn’t mean it. I know he doesn’t understand the weight it holds. And I know he’s just saying it because it’s a provocative word he heard his older brother use. But still, whenever I hear my two-year-old son say “I hate [fill in the blank here with anything from cereal to his fire truck pajamas to the bathtub],” it breaks my heart a little bit. Boys as young as Jude aren’t supposed to know about hate—not yet anyway.\nHate is one of those words that grabs your attention. It’s stronger than dislike, bigger than mere preference. To hate a thing is to place little or no value on it. We reserve our hatred for the worst of the worst—at least what appears to be the worst in our own eyes.\nIt’s one thing to be hated by another person, whether or not that hatred is deserved, but can there be anything worse than being the object of God’s hatred? Yet, that’s precisely what God says about Esau: “I loved Jacob, but I hated Esau” (Malachi 1:2–3). Ouch, right?\nMalachi is a book about God’s love for His people. It was written after the exile, when the people of Judah had begun to return to the land of promise. The temple had been rebuilt, but it wasn’t as awe-inspiring as the one Solomon constructed (Ezra 3:12). In addition, enemies surrounded them on every side, and they weren’t really free from the grip of foreign powers. With all this on their minds and before their eyes, the people were beginning to doubt God’s love for them.\nAnd God’s response is to point across the border of Judah into the neighboring country of Edom, where Esau’s descendants live. The Edomites haven’t been taken into exile. They haven’t suffered the losses or known the devastation that God’s people had. To any observer, based on present circumstances, it would seem that God favors Esau over Jacob. But God says that Esau’s day is coming, and when their cities are destroyed, they will not be rebuilt (Malachi 1:4). God’s people, on the other hand, had been chosen to be His vehicle of blessing for the world. He isn’t about to give them up. He loves them.\nThe use of hate in these verses catches our attention, but it shouldn’t. God’s love should instead. By all rights, God ought to hate all of us. The history of our world is a history of disobedience, of people and nations rejecting the gracious invitations of God. And Israel is, by and large, no different. That’s what the exile was all about, after all. Yet despite their sin and ours, God still chooses to love. He loved Jacob, so that through Jacob the promised Messiah would come and bless the whole world. In this way, God’s love for the people of Israel would extend to people from every tribe, tongue, and nation—even to those of us who smell an awful lot like Esau.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day15.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 13:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Zechariah.\n“I will put this third through the fire; I will refine them as silver is refined and test them as gold is tested. They will call on my name, and I will answer them. I will say: They are my people, and they will say: The Lᴏʀᴅ is our God.”\n—Zechariah 13:9\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/4-MinorProphets2019-2.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "John 10:27-28",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“My sheep hear my voice, I know them, and they follow me. I give them eternal life, and they will never perish. No one will snatch them out of my hand.”\n—John 10:27-28\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day13.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 14:1-21, John 1:5, Revelation 22:1-5 ",
        "devo_title": "The Lord’s Triumph and Reign",
        "devo_summary": "\n                    \n                    Everyone wants to be a king.\nSome of us want to be the king of our workplace, or the king of our house. Some of us want to be the king of our fantasy football league, or the king of our neighborhood’s Christmas light displays. Some of us treat the highway as our own little kingdom, demanding that our minions ask our permission before they change lanes or slow down.\nKings stand above everyone else, receiving praise and reverence from everyone around them. Nothing is withheld from kings, after all. They never come in second place, and they never have to acquiesce to another’s needs. It’s good to be king.\nIn 1 Samuel 8, Israel wants to install a king to make them like other nations. Despite God’s warnings, they were adamant: Enough with this judge stuff; give us a king! So God gave them their hearts’ desire in King Saul. For most of the monarchy, it was hit-or-miss. Most of Israel’s kings were nowhere close to David—a man after God’s own heart—but even David failed. Asa, Jehoshaphat, Hezekiah, and a few others had decent reigns overall. Ahaz, Manasseh, Amon, and Jehoiakim? Not so much. The people wanted a king instead of the King, and they often paid for it. Because of sin, Lord Acton’s words ring true: “Power tends to corrupt, and absolute power corrupts absolutely.”\nAs we saw in Zechariah 13 and are reminded of here in Zechariah 14, God plans to wipe away all sin and death and injustice. And the Israelites here are promised a kingdom with God on the throne. Regardless of any king of earth that they’d look to, there would be only one King for eternity.\nRevelation 22 gives us hope in this promise: that we will be reunited with the tree of life, which our ancient parents were driven away from (Genesis 2–3). This is both a literal promise—the tree will be there, as it actually was in the garden—and a theological promise of everlasting life. The eternal kingdom will be the true and better garden of Eden. “On that day the Lord will become King over the whole earth—the Lord alone, and his name alone” (Zechariah 14:9). God’s plan of redemption never failed; indeed, God has always been working to heal His creation, erasing sin and death and all of its devastating effects. Though many kings have failed God’s people, the true King will be on His throne, and no one will ever breach His gates again.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day12.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 13:1-9, Matthew 26:26-35, 1 John 2:1-2",
        "devo_title": "God’s People Cleansed",
        "devo_summary": "\n                    \n                    In the previous chapter, God told His people that He would deliver them one day. That sounds good, right? Except, of course, part of God making all things new means cleansing and purifying us of sin. When we read this chapter, we see a grim hope for those who turn away from God or prophesy against Him.\nBut because God is good, loving, and just, one day sin and evil and death will be no more. He will eradicate all ungodliness from creation, and we will live for eternity with Him without any fear of slipping back into sin or losing a loved one to cancer or war. The end of Revelation gives us a clear picture of this:\nThen he said to me, “It is done! I am the Alpha and the Omega, the beginning and the end. I will freely give to the thirsty from the spring of the water of life. The one who conquers will inherit these things, and I will be his God, and he will be my son. But the cowards, Faithless, detestable, murderers, sexually immoral, sorcerers, idolaters, and all liars—their share will be in the lake that burns with fire and sulfur, which is the second death” (Revelation 21:6–8).\nWhen thinking about Christ separating believers from unbelievers for eternity, we cannot help but think of the terrifying D-word: death. But death is inevitable, right? We often try to find a way to comfort the loved ones of the deceased. “It’s just the way it is,” we say. “It’s a part of life,” we assure them. “It’s sad, yes, but also expected; death comes for all of us.” But death is not natural—it’s actually unnatural. Sin brings death, but sin is not meant to exist. And to eliminate death, God must also eliminate sin.\nThrough Christ, we will be cleansed of all unrighteousness so that we can live forever with God, no longer worrying about sin, death, or even false prophets coming into our fold. God will bring justice, and He will fulfill His promise here in Zechariah 13—that His people will be delivered out of the fire and that He will hear their voice.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day11.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 12:1-14, Genesis 12:1-3, John 3:14-17",
        "devo_title": "Judah’s Security",
        "devo_summary": "\n                    \n                    On a cold December day in 1944, American armed forces were surrounded in the now-famous “Battle of the Bulge.” Sensing an opportunity to force the Americans to surrender, the Germans sent a message to General Anthony McAuliffe demanding they lay down arms and give up. Encircling the cold and weary American troops who were defending the town of Bastogne, the Germans threatened total annihilation should anyone not surrender to them, assuming their own victory was imminent. Instead the Germans received an unexpected, single-word response to their presumed domination; General McAuliffe simply wrote back “NUTS!” and refused to surrender.\nThe “pronouncement” that God speaks in chapter 12 of Zechariah’s prophecy contains that kind of secure confidence. Envisioning a time when all the armies of the world would be arrayed around the holy city of Jerusalem, God declares they are no match for His strong arm.\nGod describes that day as a day when everyone will come against His people. His people will be like a heavy stone—so heavy, that when the nations try to lift it, they will end up injuring themselves (v.3). He will fight for His city by bringing the armies of His enemies into a panic (v.4). He will cause His wayward people to turn back to Him in repentance (vv.5–6). He will save and defend His people from those who came to destroy them (v.9).\nBut the means of that salvation will not be cause for a ticker-tape parade and national celebration. The pronouncement declares that the people will mourn. As the fog of war lifts and the reality of what saved them comes into view, they will “look at me whom they pierced” (v.10). Clarity comes in the Gospels when we see that our own salvation comes from the Savior’s death.\nThe future day that Zechariah proclaimed was the day when Christ would rescue His people from their sins through His own death. At the hands of His own people, Jesus laid down His life to conquer the three-fold foe of Satan, sin, and death.\nThis momentous truth brings out a response that we must embrace. As John Stott so eloquently put it, “Before we can begin to see the cross as something done for us, we have to see it as something done by us.” When we see that we have pierced the Son by our own sins, and we repent and embrace Him, we find the absolute security of God. His grace causes us to mourn, but His grace also enables us to stand in His mercy and power.\nThe cross was the definitive victory of God over all His enemies, and over the enemies of His people. There is coming a day where every knee will bow and every tongue will confess that Jesus is Lord to His glory (Philippians 2:10–11). Even though we fear that the world, the devil, and our sins will overcome us, God responds with a decisive victory in Christ. We have no reason to fear!\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day10.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 11:1-17, John 10:25-30, Acts 1:15-20",
        "devo_title": "Israel’s Shepherds",
        "devo_summary": "\n                    \n                    Somewhere along the line, this statement was made: “People always elect the government they deserve.” It certainly rings a bell of truth. If left to ourselves, we will always put leaders in place who match and affirm our own values. Even under the authority of God, there comes a point where He turns people over to their own desires and allows them their destructive autonomy.\nThe shepherds of Israel, her leaders, were taking advantage of the people for their own power and profit (Zechariah 11:5). Instead of leading the people to God, they exploited them to achieve their own wicked ends. So God invokes Zechariah to act the part of their shepherd with two staffs in hand—one to represent the covenant, and the other, the union between Judah and Israel (v.7).\nIn a display of stubbornness, the flock reveals that the problem wasn’t simply with their leadership. The people refused to be led by anyone or anything but their own wickedness. Bad shepherds were removed, and faithful shepherds labored, but the people wouldn’t have it. They wouldn’t have the Lord lead them. Zechariah shows God’s own frustration by breaking the staffs representing God’s favor and their unity as a people (vv.10,14). Even the wages that were given to Zechariah for pastoring the people were an insult; they paid him what they would have paid a slave. The leadership of God was cheap to His people. The result was clear: God would give Israel over to “a foolish shepherd… who will not care for those who are perishing, and he will not seek the lost or heal the broken. He will not sustain the healthy, but he will devour the flesh of the fat sheep and tear off their hooves” (vv.15–16).\nThis message should awaken us today; either we will humble ourselves to the voice of Jesus, the “Good Shepherd,” and follow Him, or we will refuse God’s mercy toward us and choose to follow whatever leader we want—one that will affirm and compound our waywardness. Make no mistake, there is no third way. It’s either embracing God’s grace for us in Christ and following Jesus, or rejecting God’s provision and facing the reality of being handed over to our destructive desires.\nWhile it may ring true that people always elect the government they deserve, it is the sheer grace and mercy of God that He provides a better “government” for us in Christ. Jesus, the Good Shepherd, grants eternal life to all those who humble themselves and place their trust in Him. He gives the deepest security to those who rest in His hand (John 10:28). We certainly do not deserve the gracious leadership and care of Jesus, but by God’s mercy, we don’t have to experience the curse of abusive shepherds. We are free to enjoy the delightful leadership of the only Shepherd who will lead us to green pastures of eternal life.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day9.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 10:1-12, Isaiah 14:1, John 6:22-35",
        "devo_title": "The Lord Restores His People",
        "devo_summary": "\n                    \n                    As a children’s pastor, there’s perhaps nothing that has tested my faith in God’s provision quite like recruiting volunteers. Frankly, when you’ve been told, “No,” several times over the course of a day, it can be discouraging.\nA few years ago, I participated in a conference call with a group of children’s ministry leaders in our church’s denomination. The topic of conversation was—you guessed it—recruiting teachers. The moderator asked, “What have you found to be most successful?” One leader piped up quickly, “I find the most success when I am the most passionate and prayerful.” That children’s minister emphasized the last word in his sentence, and it was convicting to me. You see, it’s not just that people are more likely to volunteer when they sense a leader’s passion. More importantly, God has designed ministry so that it only moves forward when we depend on Him—when we trust Him and pray.\nThat’s why Zecharaiah is so frustrated with Israel’s leaders. They’re bad shepherds who have led the people to trust in deceitful idols (Zechariah 10:2; see also Ezekiel 34:1–10). They’d been passionate and involved, but they hadn’t led the people to green pastures. They led them to pasturelands that were rocky and dry; they tried to feed the sheep in a desert land ruled by idols that couldn’t provide. We get the same results in our own lives when we depend on passion and effort but fail to stop and receive provision and restoration from God’s Spirit.\nThankfully, there was hope for the remnant of Israel, and there is hope for us too. We find that hope by calling upon God in prayer. Zechariah’s prophecy is a reminder that God can make even dry ground lush again:\n“Ask the Lord for rain\nin the season of spring rain.\nThe Lord makes the rain clouds,\nand he will give them showers of rain\nand crops in the field for everyone.”\n—Zechariah 10:1\nGod promised to punish Israel’s bad shepherds and restore the remnant of His people, causing them to rejoice with gladness (vv.3,6–7). God promised to strengthen them so they’d be a strong army with a brand new identity. They would live securely “in the Lord” (v.12). God provides for us as well in the name of Jesus Christ—He is our provision. He is the bread of life (John 6:22–35). Whatever discouragement you’re facing today, He is the Provider. You can depend on Him.\nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day8.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 2:10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThroughout the book of Zechariah, there is an emphasis on both the people returning to God and God returning to His people. This week, we will memorize a verse celebrating God’s presence among His people.\n“Daughter Zion, shout for joy and be glad, for I am coming to dwell among you”—this is the LORD’s declaration. \n—Zechariah 2:10\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/4-MinorProphets2019-3.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Micah 6:8",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nMankind, he has told each of you what is good\nand what it is the LORD requires of you:\nto act justly,\nto love faithfulness,\nand to walk humbly with your God.\n—Micah 6:8\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day6.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 9:1-17, Psalm 100:1-5, Isaiah 62:3",
        "devo_title": "The Coming of Zion’s King",
        "devo_summary": "\n                    \n                    What do we want from our government leaders? What do we want from governors, kings, and presidents? Most of us have a laundry list of things we’d like to see the government do: repeal bad laws, bring justice to marginalized groups, overhaul broken programs, help the economy, provide better healthcare, lower our taxes, and so on.\nShortly after Israel returned from their captivity in Babylon, God promised to return to the land and claim it as His own (Zechariah 9:1–8). The prophet Zechariah told the people that God would give them a new government and a new King (vv.9–13), one who would make the people incredibly prosperous and bring justice and victory for Israel (vv.14–17).\nGod Himself would fight for this King until peace between Israel and the nations was finally secure. According to Zechariah, the new King would put away battle bows and war horses; there would be no more need to fight because His rule would extend from sea to sea (Zechariah 9:10). Like King David of old, the new ruler would shepherd the people like a flock of sheep (see Psalm 100:3), and they would thrive under His leadership, sparkling in the land like jewels in His hand (Zechariah 9:16–17; Isaiah 62:3).\nGod’s promises to bless the people in this passage are simply incredible. Israel certainly anticipated the new King’s rule, and the greatness and prosperity this Messiah would bring. But many in Israel—and particularly the religious leaders—rejected King Jesus when He arrived (Luke 19:39). How could this be? How did they miss the promised King?\nThey missed Him for the same reasons we sometimes miss Him today. We want the kind of prosperity that’s offered by politicians more than we want the promises of God. Sure, we want the eternal glory that God promises His people, but we don’t want the suffering that comes first. We want power and vindication, but we fail to see that God’s righteousness comes to us wrapped in weakness. King Jesus came humbly, riding on a donkey (Zechariah 9:9). He didn’t achieve the forgiveness of sins and secure salvation through military might, but rather through the blood of the covenant (v.11), His own blood that He shed for our sins when He was crucified and condemned as a criminal in our place.\nIf we want to be embraced by the best King—the one who offers us eternity—we will learn to embrace His humility ourselves (Philippians 2:5–11). King Jesus says it this way: “If anyone wants to follow after me, let him deny himself, take up his cross daily, and follow me” (Luke 9:23).\nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day5.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 7:1-14, Zechariah 8:1-23, Jeremiah 31:33, Micah 6:7-8",
        "devo_title": "Fasting and Feasting",
        "devo_summary": "\n                    \n                    Why do we practice spiritual disciplines? Why do we pray and read our Bibles? Why do we fast and keep Christian celebrations like Easter and Christmas? Do we keep up with spiritual practices in order to earn favor from God?\nIn Zechariah 7, the people of Bethel send a delegation to the temple to seek the Lord’s favor. They ask, “Should we mourn and fast in the fifth month as we have done these many years?” (Zechariah 7:3). In essence, the people wanted to know: “What do we need to do to keep God on our side?”\nGod answered them through His prophet: “When you fasted and lamented in the fifth and in the seventh months for these seventy years, did you really fast for me? When you eat and drink, don’t you eat and drink simply for yourselves?” (7:5–6). God’s response through the prophet is meant to be a rebuke. Zechariah knows that the people are just currying favor, attempting to ingratiate themselves to God through their devout behavior.\nHow often are we just like them? We may be outwardly religious, but inwardly we’re more in love with the benefits God gives than we are in love with Him. Here’s the truth: God wants more than our personal piety. He wants our hearts.\nAs verses 7–10 make clear, God demands justice. He wants His people to treat widows, orphans, refugees, and the poor with compassion. He demands the same from us. The Bible says it again and again: “Mankind, he has told each of you what is good and what it is the Lord requires of you: to act justly, to love faithfulness, and to walk humbly with your God” (Micah 6:8). “Pure and undefiled religion before God the Father is this: to look after orphans and widows in their distress and to keep oneself unstained from the world” (James 1:27).\nOf course, none of us can live up to the exacting standards of God’s justice (Zechariah 7:11–14). So, God gives the remnant of Israel a promise. He says, “I will return to Jerusalem” (8:3–8; see also Jeremiah 31:33). God tells them that He’s coming as the Savior to make them faithful and holy again.\nWe know God has come to us in Jesus Christ, so we should hear these promises as an encouragement. Christ has made us new, and He will make us fruitful (Zechariah 8:12). He’s given us His Spirit so we can love our neighbor. Let your hands be strong and build up one another. Because the Spirit dwells within us, we can practice justice and mercy. And when we do, even our fasting and feasting will be holy and joyous (v.19), not because they’re earning us favor with God. But because these religious acts now come out of the overflow of hearts that love Him.\nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day4.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 5:1-11, Zechariah 6:1-15, Matthew 16:18, Galatians 3:13-14 ",
        "devo_title": "Crowning of the Branch",
        "devo_summary": "\n                    \n                    By the time you get to chapter 5 of Zechariah, you have at least half a dozen visions, and almost all of them are more than a little odd. But arguably, the strangest of all may start here, where we see something is “going out.” We are told it is a basket, and that in the basket is the “iniquity of the land,” which sounds like great news. Then we find out there is a woman in the basket—and she is wickedness personified.\n“Then the angel who talked with me came forward and said to me, \n‘Lift your eyes and see what this is that is going out.’ And I said, ‘What is it?’\nHe said, ‘This is the basket that is going out.’ And he said, \n‘This is their iniquity in all the land’” (Zechariah 5:5–6, ESV).\nSpeaking of odd, the first thing I thought of when I read those verses was Bruce Springsteen. The other day, my ten-year-old son asked me, “Why do you like Bruce Springsteen so much?” I gave a quick answer of, “Well, I’ve been listening to him ever since I was about your age.” And while that’s true, the more I’ve thought about it, I think the real answer is empathy; I keep listening to him because of his ability to empathize with other human beings.\nSpringsteen’s songs are full of empathy. Sometimes I understand all too well the joys and the heartbreaks he sings about. Other times, I understand other people better—their joys, heartaches, and failures—because of his songs. And sometimes I understand their sins better too.\nOne of his songs that is full of empathy and never ceases to move me is “Racing in the Street.” It’s told from the perspective of an aging man who goes to work every day, and in an attempt to recapture the glory of his youth, he participates in street races. This is what he lives for. His wife is also aging and is disappointed with the life they have. You can gather from reading between the lines that these are not wealthy people by a long shot.\nIt’s a powerful tune full of regret, grit, and resolve. And it was the first thing I thought of when I read Zechariah 5:5–6. I thought of that song because of the last couple of lines: “Tonight, my baby and me, we’re gonna ride to the sea / And wash these sins off our hands.”\nWithin all of us, we know something is not right and needs to be fixed. Actually, we know there are sins that need to be removed. And we know something bigger than ourselves (and the sea) is needed to do it.\nMy first thought was that line from Springsteen. But my second thought was of Jesus. Because we cannot wash the sins from our hands, it is nothing but a relief for us to know He washes us clean through His work on the cross. All of us will have times of feeling like we need to clean ourselves up and wash away our sin, guilt, and shame. That is when we need to remember our iniquity has already been removed from us.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day3.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 3:1-10, Zechariah 4:1-14, Romans 3:21-26, 1 Corinthians 1:28-29",
        "devo_title": "Zechariah’s Visions",
        "devo_summary": "\n                    \n                    In Brandon Sanderson’s fantasy novel, The Way of Kings, the high prince Dalinar discovers a long lost teaching called “The Immortal Words” in an ancient text. Within it are a set of ideals for living and an honor code for a group of ancient warriors: Strength before weakness. Life before death. Journey before destination.\nAlmost everyone around Dalinar thinks he is crazy for trying to live by these ideals, especially in the midst of war. He trusts that these ideals are from “the Almighty” and that living by them honors both the Almighty and those under his command, men and women he has sworn to protect, and his enemies.\nI found all three of these teachings fascinating. But the last one has kept my attention for weeks now: journey before destination. At the same time, a slave named Kaladin is also learning this ideal from another slave; it’s explained to him in this way: “There are always several ways to achieve a goal. Failure is preferable to winning through unjust means… In the end, all men die. How you lived will be far more important to the Almighty than what you accomplished.” In other words, the ends don’t justify the means. How you get something done is just as important—if not more important—than what you get done.\nWhen God speaks through Zechariah to Zerubbabel about the rebuilding of the temple, He makes sure he knows it will not be easy. But then He says something very interesting: “Not by strength or by might, but by my Spirit” (Zechariah 4:6). God wants to make it clear that as important as the rebuilding of the temple is, how it is completed is also important. And while they will have to work hard to rebuild it, it will be done by the power of the Spirit.\nI know this would’ve been hard for me to buy into, because it’s hard for me to buy into now. I want to muster up my own power and strength when something needs to get done. I’ve been thinking about all of this because I want my family to be a family that honors God, one another, and everyone we meet. But my temptation is to want this Christian ideal—this destination—without the Christian journey. I rely on rules and my ability to exert power and control over people and situations. My temptation is to not trust the power of prayer or the power of God’s Word to mold us into the family God would have us be. But think about it: If we want our families and ourselves to be molded into the image of Christ, then we must trust that His Spirit can do the work far better than we ever could in our own power.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day2.jpg"
    },
    {
        "book_title": " Zechariah and Malachi",
        "devo_passages": "Zechariah 1:1-21, Zechariah 2:1-13, Psalm 35:27-28, Revelation 21:22-27",
        "devo_title": "A Plea for Repentance",
        "devo_summary": "\n                    \n                    Have you ever started a project but didn’t see it to completion? Perhaps it was the renovation of a bathroom? Or maybe you bought an old car and swore you would fix it up? Or you bought a copy of War and Peace that now sits collecting dust on the shelf?\nMaybe it was outside forces that stopped you midway through—difficulties that made finishing seem insurmountable. Maybe you just lost the desire to keep working. Maybe, like me, you just lost the fire to keep going.\nMy project was for our family to work through an overview of the entire biblical story over a few months at the dinner table. We got through Moses, but busy school nights and lagging interest did us in. And I honestly just lost the desire to keep going when the enthusiasm waned.\nZechariah wrote the first part of his book a few decades after the first group of Jewish exiles had returned from Babylon. They had begun the work of building the temple, but that work had begun to wane. The enthusiasm God’s people had after their initial return from exile had all but disappeared. So God speaks to the prophet Zechariah and His first words to him are bone chilling: “The Lord was extremely angry with your ancestors” (Zechariah 1:2). In other words, “You need to remember why you ended up in Babylon, with a destroyed temple.”\nBut His next words for His people are a kind invitation: “Return to me… and I will return to you” (v.3). It’s a plea, asking them to not be like their forefathers, who also asked to turn away from sin and to Him instead. They did not listen. Thankfully, this time God’s people respond in repentance.\nNot long ago I was talking to my class of eighth grade students about repentance, and when I asked them to define it, they told me it was being sorry for what you have done. “That’s true,” I told them. But there is more.\nWhen I was a kid, my fourth grade Sunday school teacher once told us repentance was like a soldier marching in one direction and then turning and going in the opposite direction. It’s doing a one-eighty, an about-face. So when the Israelites repented, they were not only sorry; they actually began to do what they were supposed to do.\nRepentance is hard. It’s hard to hear that you’ve done wrong, that you’ve sinned and need to change. It is hard because there are always forces working against us. And it is hard because the very sin problem that caused the need for repentance is still with us as we move forward.\nThe whole time I was reading this story, I thought about the temple that we, all of mankind, tore down and God rebuilt—Jesus. Repentance is hard, but looking back to that story and what God has done to deliver us can ignite a fire of enthusiasm within us to pursue the work of His kingdom.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/08/HRT-MinorProphets2019-Instagram-Day1.jpg"
    }
]