[
    {
        "book_title": "Daniel",
        "devo_passages": "Jeremiah 36:3, 2 Kings 23:36-25:30, 2 Kings 17:23",
        "devo_title": "Daniel: Introduction",
        "devo_summary": "\nBY Rebecca Faires\n\nI like to think of myself as the Domestic Empress of my home. Seven of us live here, but deep down I know this old place never truly lights up and sings unless I’m here. This house is my kingdom, and I preside with varying degrees of justice, mercy, and basil-scented floor cleaner. We each feel like we are the center of our own world, and I’m sure my husband has some equally-exalted secret title for himself.\n\nIt’s like the children’s game “King of the Mountain”—each child clamors and grasps to be the one at the top of the heap. We want to build our tower to heaven to prove that we are the best, and we’ve been doing it for all of human history.\nLong ago, before the flood, before Joseph’s coat, and before Abraham’s covenant, Nimrod— “the first powerful man on earth”— established Babel (Genesis 10:8-10). “Now the whole earth had one language and one speech… and they found a plain in the land of Shinar” (Genesis 11:1-2). There they built a tower, a stairway to heaven, but God confused their languages and they scattered before it could be completed. The Tower of Babel fell into ruins until many years later, when King Nebuchadnezzar used that very place to build his city of Babylon, symbolically putting on the old tyrannical culture of Nimrod: whatever they saw, they took (Genesis 6:2).\nBabylon was founded amidst this culture of usurpation. Even their mythology relied on one god usurping another god in a fruitless chain of hostile takeovers. The Mesopotamian culture promised no hope of an afterlife, so their only consolation lay in achieving lasting fame through conquest and exploit.\nGod’s chosen people, Judah, found themselves a tiny pawn in this Mesopotamian world of usurpation. In 606 BC, the Babylonians captured Judah, and Daniel was included in this first captivity. Afterward, the Medo-Persians toppled the Babylonians, but they were later destroyed by the Greeks under Alexander the Great. Finally, the Greek empire fizzled out and gave way to Rome.\nGod’s people were tossed back and forth under enemy rulers and in camps of exile. They struggled to obey God’s laws and maintain their Jewish heritage while living like strangers in strange lands. Obedience and preservation of culture in exile are the big themes for the book of Daniel.\nAs we dig into this book and read familiar stories (Daniel in the Lion’s Den! I’m so excited!) and strange unfamiliar passages (What in the world are the seventy sevens?), bear in mind that these people were struggling to hold on to their identity in a world where the rulers seemed both petty and all-powerful. Reading scripture on our smartphones in coffee shops, it’s possible to overlook our connection with the people of Israel in the 6th century BC. But the lion’s dens of the 21st century are very real.  \nThe reality is that you and I are exiles too. Even though we know who wins all the wars and who triumphs over all the kingdoms, the here and now can get pretty hairy. We live in a climate that is hostile to the culture of the Gospel (1 Peter 1:1). The reason Daniel is so remarkable is that he held firm and didn’t give way to eating the king’s food and submitting to the ban on prayer. He is remarkable because his heart, like ours, was naturally hostile to the way of the Gospel. It is easy to give way to pagan culture when we are at war within our own selves, and our sinful nature loves to let the difficult work of following God slip away.\nWhen we are faithful and when we are faithless, our God reigns. Whatever the circumstances we find ourselves in, He is the one true King. “For His dominion is an everlasting dominion, and His kingdom is from generation to generation” (Daniel 4:34b).\nAs we study this book, may we, like Daniel, yield our hearts to God’s Word instead of giving way to the temptation and persecution of our world.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram1.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Psalm 137:1-6, Jeremiah 28:1-17, Jeremiah 29:4-14",
        "devo_title": "The God Who Gathers And Restores",
        "devo_summary": "\nBY Amanda Bible Williams\n\nI imagine myself standing there on the curb, staring at the flames pouring out of the windows of our beloved home. My family is with me and we are safe, but our life is changing before our very eyes. Home as we know it is gone.\nI can picture Hananiah, the false prophet from Jeremiah Chapter 28, standing there with us, proclaiming to us his “everything’s going to be okay” gospel. “Two years!” he declares triumphantly. “Two turns of the calendar and everything will be just the way it was.” Meanwhile, we are hurting and homeless. Everything is most definitely not okay.\nThere is a problem to be acknowledged. There is work to be done. There is faith to be lived out, not merely proclaimed.\nThis imaginary scenario helps me grasp the weight of the false prophet’s empty promises. A gospel that does not call me to relationship with God is no gospel at all.  \nAs we read yesterday in 2 Kings, the people of Israel were in an ongoing battle. But this battle was not just between the kingdom of Babylon and the wayward kings of Judah. The battle was for the hearts of men and women—for the hearts of the very children of God.\nThe people of Israel were in exile. Their temple had been burned and their religious symbols desecrated. Hananiah, however, didn’t seem overly concerned. Rather than calling the people to faith and repentance, he gave them a truthless pep talk.\nBut Jeremiah knew better. He had heard the words of the prophets who had come before him, warning that there would be consequences to their rebellion against a holy God. Jeremiah understood there was a problem to be acknowledged, a work to be done in the waiting, a faith to be lived out.\nWhile Hananiah’s false prophesy presented the notion of a detached God and an “everything’s going to be ok” gospel, Jeremiah’s revealed the promise of the God who pursues, engages and rescues— the God who doesn’t simply replace what sin and its consequences burn away, but who restores the very heart of the sinner. As the people of Israel sat weeping by the waters of Babylon as they remembered their homeland (Psalm 137:1), they were not forgotten by their God. They were called back and gathered up.\nJeremiah’s God is Daniel’s God, calling for His people to return, inviting them to repentance, and promising full restoration in His perfect time.\nYou will call to Me and come and pray to Me, and I will listen to you. You will seek Me and find Me when you search for Me with all your heart. I will be found by you”—this is the Lord’s declaration—“and I will restore your fortunes and gather you from all the nations and places where I banished you”—this is the Lord’s declaration. “I will restore you to the place I deported you from.”\nJeremiah 29:12-14\nFriends, as we move forward into the book of Daniel and discover the parallels between his exile and our own, may we remember this call from the Lord. May Daniel’s story give us a new lens through which to see the good news of the Gospel. And as we see Daniel stand firm, actively clinging to his faith in a hostile culture, may we remember that Christ is the greater Daniel, the most faithful exile of all.\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram2.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 1:1-7, 1 Peter 2:11-12",
        "devo_title": "Identity Crisis",
        "devo_summary": "\nBY Raechel Myers\n\nHow important is a name?\nThink about it for a minute: If you are a parent, you probably gave a lot of thought to what you would name your children, didn’t you? Or, maybe you’ve named a pet, a company, a blog post, or a boat. If you’ve been married, I bet changing (or not changing) your last name took some getting used to. (Be honest—how many checks did you have to throw away because you signed your “old” last name on them?) I know a family who built a new house on a new street and were actually tasked with naming their street. No pressure. It only took them two months to agree on something.\nA name means a lot, doesn’t it? Maybe because it feels permanent. Maybe because names are such an enormous part of our identity. But, I would venture to say, as important as names are to us now, names were even more important to Daniel and crew then.\nHow do I know this? Because names are a serious theme throughout biblical history. In the culture of the Ancient Near East, a name was an indicator of a person’s character. Angels appeared in dreams to name John the Baptist (Luke 1:13), Isaac (Genesis 17:19) and Jesus (Luke 1:31). When Jacob had an encounter with the Lord, his name was changed to Israel (Genesis 32:28). Abram and Sarai became Abraham and Sarah after the Lord promised they would be the patriarch and matriarch of many nations (Genesis 17:5,15).\nAnd let us not forget, the Name above all Names (Philippians 2:9). The name that is not to be taken in vain (Exodus 20:7). The Name at which every knee should bow and every tongue confess that Jesus Christ is Lord (Phil 2:10-11).\nSo, yes. Names are a big deal. And changing names is an even bigger deal—particularly for these “good-looking” Jews plucked out of Jerusalem to be trained to serve in the king’s court.\nCheck this out:\n\n\n(I know. I love a good chart, too.)\nEach of the four Jewish exiles were given names by their fathers which relate with the one, true God. But, as a part of their acculturation—in order to make them forget the God of their fathers—the chief official gave them new names that reject their upbringing and instead savor the idolatry of false gods.\nOf course translations of the names will vary slightly from commentary to commentary, but look at the wildly intentional similarities! Matthew Henry says the name changes were intended to “wean them from the [religion of their fathers] and instill [that of their conquerors] into them.”\nAs temporary residents of a foreign land, Daniel, Hananiah, Mishael, and Azariah involuntarily found themselves in a true identity crisis—how can we serve God and Babylon? Is that even possible?\nNebuchadnezzar did everything he could conceive of to “take the Jerusalem out of the Jews,” but as we will see in the coming chapters, it will go nothing like he’d hoped. These faithful men will remain steadfast in the midst of a cultural cesspool of idolatry. But I guess that’s getting ahead of things a bit…\nFor now, let’s ask ourselves:\nHow different is the Babylonian exile from where we stand today?\nAre you struggling to serve both the true God and a false god?\nIn what ways might we be expecting others to do the same?\nWhat is your “identity crisis?” What does God say about how we should conduct ourselves and why? (Read 1 Peter 2:11-12)\n\n“They are focused on earthly things, but our citizenship is in heaven, from which we also eagerly wait for a Savior, the Lord Jesus Christ. He will transform the body of our humble condition into the likeness of His glorious body, by the power that enables Him to subject everything to Himself.”\n-Philippians 3:19-21\n \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/chart640.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 1:8-16, Proverbs 21:2-3, 1 Peter 2:15-16",
        "devo_title": "Godly Determination",
        "devo_summary": "\nBY Andrea Lucado\n\nI have two main types of sin in my life. One is the white-knuckle kind of sin that requires gritting my teeth through every second of the temptation, and still, I often fall victim to it in the end. Because if I’m honest, deep down I don’t want to not do this type of sin.\nThe other type of sin is the kind I sort of breeze by, compared to the white-knuckle version. This is the kind of sin I hate most. I’ve been there, done that! I know what it does to my relationship with God, and I simply don’t want it this time. God has entered my heart on this issue and given me motive to obey. I have a conviction stronger than my own resolve—I have godly determination.\nThis is what Daniel had when King Nebuchadnezzar ordered him to eat a diet that went against Jewish law, including non-Kosher meats and wine that was used as an offering to Babylonian gods. \nScripture says, “Daniel determined that he would not defile himself” (Daniel 1:8). So he asked a guard watching over him and his three pals to feed them vegetables and water instead, and the guard agreed. After only ten days, it was apparent that Daniel and his friends were stronger and in better shape than the men who had fed on the king’s rich diet.\nLet’s not get side-tracked here. These verses in scripture are not a diet plan for you. They are not an argument for vegetarianism. They are much richer than that. So before you clean out your fridge, let’s feed off of some deeper truth found here.\nVerse eight says Daniel was “determined.” The translation of “determined” in this context means “set upon his heart.” This was not a white-knuckle resolve. This determination of Daniel’s was a godly conviction. It was not Daniel’s remarkable willpower (I mean, I would take a burger over vegetables any day) that allowed him to stand strong; it was God working in him and through him.\nThis is good news for us. I think we can often look at the story of Daniel and compare ourselves to him. Wow, I would never be brave enough to stand up for my convictions like that. I wish I could be as strong as he was. Then we hang our heads and sulk away.\nBut Daniel is not the point of the book of Daniel. Look at verse nine: “God had granted Daniel favor and compassion from the guard.” \nWho granted Daniel favor and compassion from the guard? God. God did!\nAnd that is the point. God had a plan that he accomplished through his faithful servant Daniel. Because of God, Daniel remained true to his faith and was set apart in the kingdom, even in captivity.\nI don’t think Daniel would have ever survived Babylon if he had tried to white-knuckle his way through those years. And I don’t think our souls can survive if we’re trying to white-knuckle our way through own lives. Just as Daniel lived, so do we: by God’s strength, by God’s grace and for God’s plan.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram4.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 1:17-21, 1 Samuel 12:24",
        "devo_title": "Blessed Obedience",
        "devo_summary": "\nBY Kaitlin Wernet\n\nMy dog will do anything for green beans, hot dogs or chocolate. Even together. I know. Chocolate is terrible for dogs, I know. Before you begin to think I’m the worst pet owner, I promise I do not serve my dog any of these things purposely.\nOkay, maybe once or twice, but only when times are hard.\nWhen she had a bellyache and wouldn’t eat anything for days, green beans did the trick. When she’d run away down the street, the only thing that would send her galloping back was my voice yelling “HOT DOG!” (Or maybe it was my classy demeanor. Who knows?) And the chocolate? The only thing the dog could hunt was a Reese’s peanut butter cup.\nSo, when I think of obedience, I think of my dog. She isn’t the most well-mannered, but girl knows how to get what she wants.\nPuppy obedience school runs on a principle our human hearts know too well:\nIf ______, then _______.\nIf you sit, stay and roll over, then you’ll get a treat.\nIf you run, hydrate and eat well, then you’ll lose weight.\nIf you read, study and work hard, then you’ll ace the test.\nAs we read about the young men at the end of Daniel 1, the same seems to be happening. They have probably prayed, listened, kept faith and now they are blessed! But see, when I hear that, my heart fills in the blanks for me: If I pray harder, obey more and read the Bible, then I’ll be blessed. I begin to confuse blessing with a means to getting what I want, and I’m left feeling defeated.\nHere’s the thing: our failure to perfectly follow Christ has already been defeated on the Cross. The connection between faith and works can become muddled and sticky, especially when we involve our own sinful, yet well-intentioned, minds to straighten it out. However, we can rest assured that, from God’s holy perspective, faith and works are never in opposition because His design for both is purposeful and good. Daniel and his friends didn’t follow a prescribed regimen for holiness. By God’s grace, they humbled themselves as His servants, so He would exalt them at the proper time (1 Peter 5:6).\nWhen my dog isn’t running away for prepackaged meat treats, she spends the other half of her time perusing my closet. Other than maybe catching my contagious love for fashion, I don’t know where she learned this, because I absolutely did not teach it to her. Especially the part where she likes to welcome guests with a presentation of my dirty laundry.\nEach day, she picks items of clothing, sinks her teeth gently into the fabric and parades it downstairs to her favorite spot. She sits in her scented souvenir pile each day, never hurting it, only lounging. Now that I think of it, this too, is my fault.\nBecause I leave my closet door cracked slightly, she can push it open with her nose.\nBecause I feed and love her, she wants to surround herself with my scent.\nBecause I allow this to happen, she can go straight to the reward, without an “if” or “then.”\nThe same is true for us.\nOur obedience is always and only prefaced by God’s goodness and grace to us. The only “if, then” statement in the Bible we need to worry about is the one that was completed by Jesus—He turned our “if” into a “because”!\nBecause we are in Christ, we get to seek first the reward: the Kingdom of God!\nBecause we are in Christ, our obedience is no longer driven by lack but by taking joy in The Giver!\nBecause we are in Christ, His blessings are given with specific Kingdom purposes.\nBecause we hold this as truth, we get to obey him by fearing the Lord and worshipping Him faithfully with all of our hearts (1 Samuel 12:24).\nFriends, whether in exile or eating chocolate, we can only obey because of God’s grace.\nMay our obedience flow from the reward we already have in Christ. Amen.\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram5.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Jeremiah 29:11-14",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nWe can all use a grace day, can’t we? Take this day as an opportunity to catch up, pray, and just rest in the presence of the Lord. Pray the scripture below for a specific woman in your life and for yourself.\n“For I know the plans I have for you”—this is the Lord’s declaration—“plans for your welfare, not for disaster, to give you a future and a hope. You will call to Me and come and pray to Me, and I will listen to you. You will seek Me and find Me when you search for Me with all your heart. I will be found by you”—this is the Lord’s declaration—“and I will restore your fortunes and gather you from all the nations and places where I banished you”—this is the Lord’s declaration. “I will restore you to the place I deported you from.”\n–Jeremiah 29:11-14 HCSB\n\n \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram6.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 3:17-18",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a call to faith-filled courage.\n“If we are thrown into the blazing furnace, the God we serve is able to deliver us from it, and he will deliver us from Your Majesty’s hand. But even if he does not, we want you to know, Your Majesty, that we will not serve your gods or worship the image of gold you have set up.”\n– Daniel 3:17-18 NIV\nWrite this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/4-daniel-3-1718.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 2:1-49, Isaiah 44:6-8",
        "devo_title": "The Everlasting Kingdom",
        "devo_summary": "\nBY Kaitlin Wernet\n\nMy reign as a bossy big sister began at two-years-old.\nI was all corkscrew curls and chubby cheeks, and I was thrilled over my new brother’s birth—or rather, my rise in ruling status to that of “big sis.” Upon returning from the hospital, my mom rocked the blue bundle that was baby brother while my dad cradled a cake, the celebratory centerpiece of our party of three-turned-four.\nDad turned on the video camera to capture the occasion, but my attention had already been taken by the yellow and green flowers on the cake. Were they real? A bouquet of flowers on a cake? I had to find out!\nMy eyes gleamed with delight as I seemingly reached for my baby brother, but instead took a sharp nosedive into the lovely bouquet of of flowers that, whaddya know, came straight from a tube of icing. The whole scene was captured on camera: horrified toddler, messy hands, confused parents, screaming baby.\nI continued to establish my dominance as bossy big sis throughout toddlerdom, but I didn’t get any better at ruling. In fact, one day I decided to extend my authority to the preschool playground by announcing my attack on the nearby anthill. Armed with my weapon of choice (light-up sneakers), I began to stomp on the anthill, yelling all the fight words I had learned from The Lion King. You can guess how that turned out.\nMy power was limitless in my own imagination, but in reality I was easily defeated by my own weaknesses— like my notions of grandeur on the playground and my insatiable love for cake.\nNebuchadnezzar had some notions of grandeur of his own. Arguably the most powerful man of his time, the Babylonian king had the world at his fingertips—which is why he could say things like this: “If you don’t tell me [my] dream and its interpretation, you will be torn limb from limb, and your houses will be made a garbage dump” (Daniel 2:5). Yikes.\nNebuchadnezzar’s dream in question, in Daniel Chapter 2, did more than confound the king; it exposed his vulnerabilities. Daniel—relying on wisdom from the Lord, the true King—interprets Nebuchadnezzar’s dream, explaining that the large statue made of various metals represented the four dominant kingdoms at the time: Babylonian, Medo-Persian, Grecian and Roman. Daniel also explained the dream’s punchline: all these powerful, earthly kingdoms would crumble under the kingdom of God.\nThose listening, the mighty king himself included, must have thought this sounded like crazy talk! In the midst of rising and falling kingdoms, they couldn’t comprehend a time where not one of the competing powers was on top. The constant need to gain and maintain power was their utmost goal, but it was also their greatest weakness. Daniel, however, spoke of a different kind of power, one that was not of this earth and would never falter. “The God of heaven will set up a kingdom that will never be destroyed” (Daniel 2:44).\nEarthly power will never reverse our inherent flaws. We’ll see Nebuchadnezzar continue to learn this difficult lesson. Our weakness ultimately cannot be strengthened by anything on this earth—not power, not position, not morality, not our own attempts at justification— only Christ (Romans 4:25).\nApart from the Kingdom of God, we’re just playing Goldilocks in temporary realms, trying to find a place where our sin fits just right. Unless we house our souls in the Everlasting Kingdom of Heaven— the Kingdom ruled by the God who reveals all mysteries (Daniel 2:28)— we’ll always walk away with messy hands, a false sense of control, and possibly a whole lotta ant bites.\nFriends, let this be our cry today, as we proclaim from the bottom of our weakness our allegiance to Christ the King and His Kingdom:\nOn Christ, the solid rock, I stand;\nAll other ground is sinking sand,\nAll other ground is sinking sand.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram8.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 3:1-30, Isaiah 43:2",
        "devo_title": "But If Not, He Is Still Good",
        "devo_summary": "\nBY Rebecca Faires\n\nIt was 1940, and the German Wehrmacht had the British Expeditionary and French forces surrounded at Dunkirk, on the northern coast of France. The British Navy couldn’t rescue them, and they couldn’t fight their way out. It looked like no one was going to survive.\nThe British and French would be safe if they could just get across the English Channel and out of France. But there was no time or resources to stage an evacuation. A British officer sent a three-word telegram to the war offices in London:\n“But if not…”\nThis powerful phrase communicated to the people at home the true straits of the men stranded at Dunkirk: As with Shadrach, Meshach, and Abednego, the situation looks hopeless, and we pray God will save us. But if not, we will still be faithful.\nUnder the cover of fog and night, in small fishing boats, pleasure cruisers, and all manner of small watercraft, piloted by the good people who lived on that coast, 338,000 men were saved.\nThe testimony of those three brave men stepping into Nebuchadnezzar’s furnace still looms large in our collective imagination, and their words still have the power to teach us. Thankfully, God protected those three men from the flames—and the troops at Dunkirk—but both were prepared to die. They knew we serve a God who is greater than kings and armies. Though the powers of this world threaten us, taunting, What god will be able to rescue you from my hand?, we serve the God who can save.\nGod doesn’t promise to save us from the flames. But He has promised to be with us as we walk through the fire— and either to rescue us in this life, or through death for our eternal salvation (Isaiah 43).\nThat’s both comforting and scary, right? Those brave words spoken by brave men sound amazing, but I’m a little nervous when it comes to getting my own hair singed.\nLord, give us confidence in your words. Forge courage for us in the midst of a hostile world. Steel our nerves for long, hard days of quiet faithfulness. Resolve our hearts to follow you in momentous decisions and small choices. Build in us a brave resistance to evil.\nThen, when the day of testing comes, we can bravely go in the fire and know that whether we live or die, we serve a God like no other—a God who is able to save.\nBut if He does not, we will serve Him still.\n\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram9-1.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 4:1-37, Proverbs 16:18",
        "devo_title": "No Lost Causes",
        "devo_summary": "\nBY Amanda Bible Williams\n\nI blame reality television.\nAnd I don’t just mean just reality TV shows—I mean reality TV shows, and cable news, and YouTube, and Twitter, and Instagram and every other 21st century wonder that tricks me into believing I’m qualified to judge someone I’ve never even met. I’m never quite as irritable as when I’m watching people do things I cannot even begin to understand, much less justify or defend. And yet I can’t turn away! It’s the proverbial train wreck going on all around us—noisy and graphic and consuming and we just can’t stop looking.\nObviously technology isn’t really to blame here. I’m a grownup, and I make my own decisions. I decide what I will consume and how I will respond. But I’m a sinful grownup. And I know my saved-by-grace-alone self enough to know it could just as easily be me on the other end of that unfortunate YouTube video gone viral or that reality show that’s unbearable to watch.\nGrace is the great leveler — we all need it, heaping amounts of it, all the time.\nWhat am I really saying when I write off another person in my heart? Am I saying they’re beyond repair, that they’re not worth waiting for, praying for, hoping for? Am I saying the Gospel isn’t big enough for them, that God’s arms of compassion and grace aren’t long enough to reach them?\nWere I Daniel, I would have thought all those things about Nebuchadnezzar. As a person who knew the God Nebuchadnezzar didn’t, such destructive choices would have been tough to watch.\nI mean, look at this guy: when he wasn’t spending his time expanding his kingdom, he was admiring it, worshipping it, and ordering others to do the same. He was changing men’s names to what HE thought they ought to be, fitting what he saw as the square peg of their unimportant existence into the round hole of his own, selfish worldview. For crying out loud, he nearly had people killed for not being able to describe his own dreams back to him! Had a licensed psychologist been handy, I’m pretty sure ole Nebu would have been diagnosed with Grade A narcissism.\nEnter the God of Israel. The God who sees, pursues, loves, forgives. With the one, true God on the scene, not even the narcissistic king was a lost cause.\nIt started with a dream. Nebuchadnezzar has another inexplicable dream, and he calls Daniel in to interpret it. So Daniel does, explaining that Nebuchadnezzar himself was the magnificent tree and that God was going to humble him in a dramatic and effective way.\nWhat happens next is the stuff not even reality TV shows are made of — the king very literally goes crazy, becoming like the wild animals and beasts of the field. Nebuchadnezzar is humbled to the point of losing himself completely, but when his sanity is restored, his spirit is also restored.\nBut at the end of those days, I, Nebuchadnezzar, looked up to heaven, and my sanity returned to me. Then I praised the Most High and honored and glorified Him who lives forever:\nFor His dominion is an everlasting dominion,\nand His kingdom is from generation to generation.\n(Daniel 4:34)\nThis is an exclamation point moment! The king who had the whole world at his fingertips bows low before the God of heaven and proclaims, “All the inhabitants of the earth are counted as nothing” before the Most High King (Daniel 4:35). Counted as nothing! This, coming from a man who most definitely prized being counted as something.\nIn a remarkable example of God’s boundless goodness and grace, Nebuchadnezzar is transformed from destructive pride and self-exaltation to restorative humility. And our response should be? Praise be to the King of Heaven! “All His works are true and His ways are just. He is able to humble those who walk in pride” (Daniel 4:37).\nFriend, you and I need God’s grace and Christ’s sacrifice just as much as anyone else on this vast, sinner-filled earth. When we are caught up in the confusion and noise around us, unable to look away from those our hearts are prone to judge, may we remember the beautifully disarming image of pompous king Nebuchadnezzar returning from the field to praise the God of heaven. And may we pray:\nFather, capture the hearts of those lost in kingdoms of their own making — ourselves included — and seize our affections for you and you alone, the only true King. Amen.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram10.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 5:1-31, 1 John 2:15-17, Genesis 3:6, Matthew 4:3-8",
        "devo_title": "Hollow Pursuits",
        "devo_summary": "\nBY Vivian Mabuni\n\nI learned to read with lightening speed the small print on the back of every type of packaged food. My daughter’s food allergies prevented her from eating soy, eggs, dairy and peanuts. Though the foods took on different shapes and flavors, those possibly life-threatening ingredients managed to make their way into what seemed like everything.\nIn today’s Daniel reading, we are introduced briefly to the pride-filled king, Belshazzar. His irreverent act of drinking from the gold and silver cups, sacred vessels—made by Solomon (1 Kings 7:48-51) and later taken from the Jerusalem Temple by Nebuchadnezzar (2 Chronicles 36:10)— smacks of sacrilegious arrogance.\nWe find woven in Scripture three similar themes or ingredients of sin. John warns against loving the world’s system and summarizes the sin in three parts: lust of the flesh, lust of the eyes, and pride of life (1 John 2:15-17).\nThe same ingredients appear in the very first act of disobedience in Genesis, when Adam and Eve eat from the tree of the knowledge of good and evil. Take a look at Genesis 3:6: “The woman saw that the tree was good for food” (lust of the flesh), “and that it was pleasant to the eyes” (lust of the eyes), “and a tree…to make one wise” (pride of life).\nJesus, when tempted by Satan in the wilderness after fasting 40 days, faced the same three opportunities to sin. Look at Matthew 4:3-8: Satan said to Jesus, “Command that these stones be made bread” (lust of the flesh). He showed Jesus “all the kingdoms of the world, and their glory” (lust of the eyes). He also mocks Him, saying, “throw Yourself down. For it is written, He will give His angels charge concerning you” (pride of life).\nBelshazzar, after the terrifying appearance of the hand, offers anyone who can decipher the writing on the wall similar ingredients of the world’s system: pleasures, possessions, and position (Daniel 5:7,16). But these things are ultimately hollow; when we put our trust in them, we are found wanting. The writing on the wall says as much (Daniel 5:26-27).\nSin looks different from person to person, but it is rooted in the same self-focused pride we see in Belshazzar. Like those pesky food ingredients my daughter must avoid, evidence of sin seems to be everywhere we turn. Our sinful hearts are bent toward pride and self-sufficiency, but God’s truth offers freedom.\nSisters, our perspective is renewed as we invest in reading and studying God’s Word. Note how Jesus responded when tempted in the wilderness: “It is written…” He continually looked to His Father and His Word for strength and sustenance. Our hearts become recalibrated to True North as we lift our eyes off of self and circumstances. When we trust God with our very life-breath, we can stand firm in the knowledge that He controls the whole course of our lives (Daniel 5:23b).\nFather, help us. Lift our eyes off our circumstances and our hollow pursuits. Renew our minds through Your Word. Help us to see You clearly and know You more intimately. Help us walk in Your ways, filled with Your Spirit, with hearts surrendered and lives wholly Yours. Amen.\nVivian Mabuni is an author and speaker, and a sushi, white Christmas lights, coffee-with-friends-lover. She has been on staff with Cru (formerly Campus Crusade for Christ) for 26 years and serves with Epic Movement, the Asian-American ministry of Cru. Vivian is the author of Warrior In Pink: A Story of Cancer, Community and the God Who Comforts.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram11.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 6:1-28, 1 Peter 5:8-9, 2 Timothy 3:12-15, Philippians 4:6-7",
        "devo_title": "Prayer in the Face of Lions",
        "devo_summary": "\nBY She Reads Truth\n\nLong before he was ever thrown into the lions’ den, Daniel’s enemies had been on the prowl, circling him (1 Peter 5:8). The local leaders and high officials, whom the king had given Daniel authority over, were thirsty for his blood. These “devouring lions” were evil men who sought to destroy Daniel and the growing success he’d found, though they could find no fault in his character or person (Daniel 6:4-5).\nBut Daniel’s faith was steadfast and reflected the character of his God, so much so, the evil men believed it to be a snare. Dizzy with jealousy and afraid of losing power, they plotted to bring him down because of his dedication to the Lord.\nSometimes our faithfulness brings us promotion in the world, just as Daniel found increasing favor with the king (Daniel 6:3). Other times, our faithfulness makes us public enemy number one. As Paul notes in his first letter to Timothy, “Everyone who wants to live a godly life in Christ Jesus will be persecuted” (1 Timothy 3:12).\nBut God does not abandon us in our battles. He invites us into prayer. Prayer intersects our humanity with His holiness; it’s where we ask courageously, wait patiently, and surrender faithfully to the roar of God’s goodness. So it was with Daniel. He remained faithful to God in prayer even as the king signed an ordinance condemning those who would petition (pray) to any other “god” but himself for 30 days.\nThirty days—not forever, but long enough for Daniel’s enemies to hang him by a spiritual loophole. But Daniel’s faith, the very faith they were hoping would bring about his demise, had been strengthened through years of a daily rhythm of prayer and thanksgiving. So when the king’s edict went out, Daniel was utterly unrattled.\nWhen Daniel learned that the document had been signed, he went into his house. The windows in its upper room opened toward Jerusalem, and three times a day he got down on his knees, prayed, and gave thanks to his God, just as he had done before.\n(Daniel 6:10)\nFor Daniel, it was business as usual. He knew his God was greater than any earthly king and, ultimately, victorious in every situation. So, turning his face toward home, he did what he’d always done: Daniel got down on his knees to pray and thank the Lord.\nAs for those actual lions in the pit with Daniel, they were turned into lambs—gentle, tamed, and silenced in the presence of God’s power and protection. Daniel’s God had delivered His faithful servant and made His glory known to an unbelieving nation. But make no mistake: it was God’s power that prevailed, His power closed their mouths.\nThe God who rescued Daniel is the same God who rescues us. Scripture tells us that Jesus is the Lion of Judah who becomes the Lamb of God (Revelation 5:5-6). He took our pain and suffering upon Himself, “was pierced for our transgressions, and crushed for our iniquities” (Isaiah 53:4-5). And then He arose from the pit victorious!\nFriends, when we suffer in the name of Jesus, we do not suffer alone. Jesus assures us this world will bring trouble, but He comes to bring us peace (John 16:33). We will never face a lion’s den without the Lion of Judah by our side.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram12.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Isaiah 43:2-3a",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nWe can all use a grace day, can’t we? Take this day as an opportunity to catch up, pray, and just rest in the presence of the Lord. Pray the scripture below for a specific woman in your life and for yourself.\n“When you pass through the waters, I will be with you;\nand through the rivers, they shall not overwhelm you;\nwhen you walk through fire you shall not be burned,\n   and the flame shall not consume you.\nFor I am the Lord your God,\n   the Holy One of Israel, your Savior.”\n-Isaiah 43:2-3a ESV\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram13-1.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 4:34b",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a call to remember the power of the Most High.\nFor His dominion is an everlasting dominion,\nand His kingdom is from generation to generation.\n— Daniel 4:34b, HCSB\nWrite this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/4-Daniel-4-34.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 7:1-28, Psalm 104:1-5",
        "devo_title": "The Son of Man",
        "devo_summary": "\nBY Andrea Lucado\n\nGrowing up as a pastor’s daughter, my church was like my own personal playground. My sisters and I spent many hours there and we knew each hallway, back staircase, and classroom. We used to play in the closet where the felt figures and flannel boards were kept for Sunday school. I remember sticking felt Daniel to the board with the felt lions. I remember Shadrach, Meshach, and Abednego and the little felt fire.\nHowever, I do not recall there being a felt version of the bear-like beast holding three ribs between his teeth or a beast with ten little horns, one of which had little eyes. Those were mysteriously missing from our church’s felt-figure collection.\nThis is probably because the felt-figure manufacturing company knew that no Sunday school teacher in his right mind would be teaching on the prophecies of Daniel to small children. Daniel himself was afraid of the visions he saw (Daniel 7:15).\nCan you imagine what a five-year-old would tell her mom after being picked up from class? “Mommy! We learned about beasts and rivers of fire and giants who stepped on everybody and HORNS!”\nChapter 7 of Daniel marks a notable shift in this book, a shift from historical account to end-times prophecy, or, what theologian types call “apocalyptic literature.” Sounds fun, right? Ok, I know, I know. There’s no way around it—chapter seven is when the book of Daniel gets weird.\nWeird, but not un-interpretable and not impossible. Scripture does not include dreams and visions to throw us off or confuse us. The prophecies of Daniel are purposeful and, ultimately, hopeful.\nWe can break down Daniel’s dream in this chapter into three parts:\n\n The four beasts\n The Ancient of Days\n The Son of Man\n\nThe Ancient of Days is God, and He is holding the book of judgment, which makes me squirm a little. The Son of Man is Jesus. And the four beasts symbolize four kingdoms: Babylon and Medo-Persia (who both ruled during Daniel’s day), Greece, and the last beast, which represents a more general kind of evil, an evil that has been present throughout all of history and continues to reign today. (I encourage you dig into that last one on your own, because it is really, really interesting!)\nThe part when Jesus arrives on the scene gives me chills. Until He shows up, everything in the vision is terrifying and warlike and confusing. The beasts, the horns—utter chaos. Then, the scene quiets down, the Son of Man arrives on a cloud and approaches the throne of the Ancient of Days. All eyes turn toward Him. The narrative focuses on Christ.\nJesus interrupts a world gone awry.\nHe did this with His birth, and He will do it again in the Second Coming. This is why Daniel 7 and the chapters that follow matter so much for us. The prophecy, friends, is not over. We live in the midst of it. Jesus came once, and He is coming again, to do away with the fourth beast once and for all.\nFor now, we live in the tension of prophecy yet to be fulfilled but eagerly anticipated.\nWhat we see in this vision is not meant to scare us; it is meant to give us hope for victory. It promises that despite the chaos, violence, pain, and suffering, the Kingdom of our Christ is coming. And when it does, He will reign.\nForever and ever, He will reign.\n“His dominion is an everlasting dominion  that will not pass away, and His kingdom is one  that will not be destroyed” (Daniel 7:14).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram15.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 8:1-27, Romans 8:31-39",
        "devo_title": "Good News in Unlikely Places",
        "devo_summary": "\nBY Raechel Myers\n\nBecause the Bible is true, even the parts that are confusing or hard to understand are good news.\nYou’ve probably heard us say this before at She Reads Truth, but do you think we can find it to be true in today’s difficult-to-understand passage? Is there good news in Daniel chapter 8?\nAgain today, we’re talking visions. And again today, we’re pulling our reading from the “apocalyptic literature” shelf (a real crowd-pleaser!). This time, the vision is focused on a ram, a goat, and more horns than a marching band. (I couldn’t help myself, you guys.)\nOne fascinating little side note: in Biblical literature, a horn almost always has to do with power, dominion, and authority. Consider:\n\nthe horns blown to take down Jericho’s walls (Joshua 6:5).\nthe ram’s horns caught in the thicket to be Abraham’s sacrifice instead of Isaac  (Genesis 22:13).\nDavid calls the Lord the horn of his salvation (Psalm 18:3).\n\nThe horns in Daniel’s vision are no exception, but they’re still a little tricky to make sense of.\nFortunately for us, Gabriel appears to Daniel in verse 15 to explain what he saw. Here is the gist of the angel’s explanation:\n\nThe two-horned ram represents the kings of Media and Persia (v. 3-4, 20).\nThe shaggy goat represents the king of Greece (v. 5-7, 21).\nSpecifically, the large horn between his eyes is understood to be Alexander the Great (v. 8, 21).\nHistorically, after Alexander the Great’s death in 323 B.C., four smaller rulers (horns) rose in his place, but none were as powerful as him (v. 8, 22).\n\nGabriel goes on to talk about the little horn, “an insolent king, skilled in intrigue,” who causes “deceit to prosper.” This horn is widely believed to be Antiochus Epiphanes (who reigned much later, from 175–164 BC). A wicked ruler and persecutor of the Jews, he is historically renowned for desecrating the temple by sacrificing pigs on the altar and setting it up as a shrine to Zeus. He was a bad guy after a long string of bad guys, in what amounted to a prophetic foretelling to Daniel of centuries of persecution ahead for the Jews.\nTo be honest? This is a whole lot of crazy awful. And, I imagine, it was the last thing Daniel hoped to learn in a vision. He’d been praying for deliverance, something this dream promised he’d never see in his lifetime. You know those “good tidings of great joy” the same Gabriel would later deliver to Mary? This was not that. Not even close.\nTerrible leaders and violent conquerors lay ahead, and things are going to get a whole lot worse for God’s people before they get better. No wonder verse 27 tells us Daniel “was overcome and lay sick for days.”\nMaybe you feel like Daniel today. Maybe you’re also learning firsthand that God’s deliverance is rarely quick or tidy. Perhaps you’re beginning to understand, like the Israelites learned, that God doesn’t always take us out of pain or heartache. Instead, He gives us the grace and everything we need to persevere in heartache (2 Peter 1:3).\nIn one sense, our world is not what it used to be; in another, it’s exactly as bad as it’s always been. Headlines leave us confused and distraught like Daniel, knowing things may very well get worse before they get better. \nOur omnipotent God is able to turn nations on a dime, just as He mercifully and quickly delivered Shadrach, Meshach, and Abednago from the flames. But even if He does not, He is able to preserve His people in the midst of their persecution.\nI suppose Daniel 8 is good news then, isn’t it? Because the Bible is true, we can look all manner of persecution in the face and have confidence that nothing in the present or future can separate us from the love of God in Christ Jesus (Romans 8:38-39).\nAnd so, as believers who suffer or endure persecution, we can rise up and go about the King’s business just as Daniel did. Even when we don’t understand. Even when we are overwhelmed. Because the greatest evils in the world will come face to face with the Prince of princes and “will be shattered—not by human hands” (Daniel 8:25).\nThanks be to God. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/SRT-Daniel_instagram16.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 9:1-27, 1 Kings 9:6-9, Ephesians 2:1-5",
        "devo_title": "God’s Perfect Timing",
        "devo_summary": "\nBY Rebecca Faires\n\nWhen I was fourteen, I fancied myself an actress. To prepare for my future in the theatre I attended every play I could. But I grew up in rural Michigan, so the plays I could attend were mostly just other school productions.\nOne especially unfortunate night I sat through a ragged performance of “The Pajama Game.” After two acts of awkward silences, off-key solos, and one actor with a very inappropriate interpretation of Factory Worker #2, the lights came up and I breathed a huge sigh of relief. I could cross this musical off my list and go home!\nBut no one else left. There was more musical to go. So very much more. I had to sit in that hot gymnasium on hard bleachers and subject myself to another painful hour of bleating song and dance.\nHave you ever thought something terrible was almost over, but it was only just beginning? It’s such a sinking feeling.\nThis is just what happened to Israel. Daniel and the Israelites were in exile in Babylon, but as Daniel read through the history of Jeremiah he found this great part: “When 70 years for Babylon are complete, I will attend to you and will confirm My promise concerning you to restore you to this place” (Jeremiah 29:10). Daniel did some quick math: YES! The seventy years are almost over! Our exile is coming to an end! We get to go home! Huzzah!\nBut then Daniel did a little looking around and thinking. What was the purpose of this exile? Why did God let Babylon capture us?\nIt’s the same old reason, isn’t it? The same thing that got them into trouble last time, the same thing that gets us into trouble— grimy, sinful hearts.\nThe purpose of the exile was for God’s people to get their act together—to repent, pray, and confess— only, they weren’t doing that. On the whole, Israel was still in the same rut that got them sent into exile in the beginning. But the seventy years were almost over! What if they hadn’t learned their lesson yet?\nThey had not. The lesson of repentance is one we are still learning to this day. But Daniel was convicted by God’s Word, so he prayed, confessed, and interceded for God’s people. That is exactly what should happen when we read God’s Word! The Bible redirects us to truth and drives us to prayer.\nLet this be our response every time we read God’s word: pray.\nGod heard Daniel’s prayer and He answered with a promise: I will restore Israel in my perfect time. Seven is the number of fulfillment and completion. God was preparing the way for both the judgment of the wicked and also the coming salvation—Jesus!\nOur God is always at work in all of time, space, and history. When it seems to us that the timing is wrong, or something is taking too long—like that horrible musical, or an exile in Babylon, or a hard relationship, or a lingering sickness—remember: God is always at work and His timing is right.\nOur impatience with God’s timing throughout history is well-documented and epic. And God’s timing is still perfect. He doesn’t need us to approve, but in the midst of our waiting, He invites us to pray, confess, and repent.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Daniel_instagram17.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 10:1-12:4, Ephesians 6:12, 2 Corinthians 10:3-5",
        "devo_title": "The True Battle",
        "devo_summary": "\nBY Missy Fuller\n\nChapter ten opens in a vulnerable spot for our beloved Daniel. It’s about 536 BC, just a few years after Cyrus, the king of Persia, issued a decree allowing the exiles from Judah to return to Jerusalem and rebuild the temple (Ezra 1:2-4).\nDaniel is in his mid-eighties, physically unable to make the long journey to the land that was once Judah. In great distress, he mourns the difficulty facing those who have returned to Jerusalem. He fasts and prays for three weeks, seeking wisdom about the future of his people, God’s holy nation.\nThree weeks seems like a long time to pray for a little wisdom. Why couldn’t God have answered him right away?\nThe angel tells Daniel his prayers were heard—on the first day. He’d been sent to Daniel right away, but the prince of the kingdom of Persia opposed him for 21 days (Daniel 10:12-13). The angel was detained for the exact amount of time Daniel was waiting for an answer.\nDuring those three weeks of fasting, Daniel probably felt as if his prayers weren’t heard. But they were! God had immediately sent His messenger with a vision for Daniel—an exact answer to his prayer!\nSpiritual warfare is real. Daniel’s answer was delayed because the prince of the kingdom of Persia opposed the messenger. This wasn’t a human prince, but a demonic spirit (possibly Satan himself), influencing the Persian Empire and opposing God’s purposes.\nThe angel was detained by evil spiritual forces while our man Daniel was on his knees praying earnestly for wisdom. Yes, Satan attempted to oppose God’s plan, and God allowed that. God fulfilled greater spiritual purposes that we will likely never know, but He also allowed this delay to sanctify Daniel.\nWhat happens after fasting and praying for three weeks? Kneeling before the throne of heaven, seeking His face without ceasing? You’re changed. God had allowed this spiritual battle to commence as He worked to sanctify Daniel, drawing him close.\nThe angel reveals to Daniel God’s plan for His chosen people—a prophecy of the future so detailed it could only come from the One who holds it in His hands. The answer to Daniel’s prayer for wisdom was eternally significant. When evil forces work hard to thwart God’s purposes, we can be sure something significant is at stake.\nTwo years ago, I sat hunched over the edge of my desk chair, sobbing in my office. God had opened the door for me to start pursuing a seminary degree—a desire He’d grown in my heart for many years. Now, it was time. But I was suddenly crippled with fear.\nHow could I keep up with classes, a full-time job, ministry obligations, let alone any sense of community? Three weeks into my seminary education, I was about to quit.\nGod had called me to something big, but suddenly it didn’t feel practical anymore.  By His grace alone I didn’t quit—I wanted to, but didn’t. And the exact same thing happened the following three semesters. A few times it was financial, a few times practical, but four semesters in a row, I almost quit. \nIt took me four semesters to realize one thing: we have an enemy who wants to destroy what God is doing (John 10:10). All of it. Every good thing, every calling God has placed on our lives, the enemy wants to destroy it. \nLet us not forget that our struggle is not against flesh and blood on this earth. It is against the powers that work hard to thwart God’s purposes (Ephesians 6:12). God wants us prepared for battle, standing firm. He has given us weapons to demolish strongholds—His Word and prayer—and we need to be ready for the days of evil, which, according to Daniel 11, are still to come. \nLook once more at the promise at the end of the vision. After all the wars and turmoil, all the fighting and oppression and annihilation, look at this promise: “Those who are wise will shine like the bright expanse of the heavens” (Daniel 12:3).\nFor God, who said, “Let light shine out of darkness,” has shone in our hearts to give the light of the knowledge of the glory of God in the face of Jesus Christ.\n(2 Corinthians 4:6)\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Daniel_instagram18.jpg"
    },
    {
        "book_title": "Daniel",
        "devo_passages": "Daniel 12:4-13, 2 Peter 3:8-13, Revelation 1:4-8",
        "devo_title": "Go On Your Way",
        "devo_summary": "\nBY Amanda Bible Williams\n\nI’m a hopeless lyric geek. Nearly everything reminds me of a song.\n“Go on your way, Daniel,” the angel says (in verse 9 and again in verse 13). And I immediately start singing Fleetwood Mac. You can go your own way (Go your own wa-aaa-ay). And because I’m always up for a distraction, Frank Sinatra and a whole host of random musical characters continue the game in my head.\nI’ll do it my way. Are you gonna go my way? Love will find a way. She’s got a way about her. Oooo, baby I love your way.\nI attribute my lyrical obsession to my endless hours spent singing along to cassette tapes in the car with my brother and friends growing up. We lived in a small Alabama town where “riding around” was the coolest thing a teenager could do, and the pastime was exactly as glamorous as it sounds. But make no mistake—we cruised that single stretch of highway like our life depended on it. I think sometimes we actually thought it did.\nI was a good girl (loved my mama, loved Jesus, and America too. Tom Petty, anyone?). I did well in school and followed more rules than I broke, especially in the light of day. But underneath, I was trying to find my way just like we all were. It was acceptance and significance we were after. Our goal was our glory, be it in the form of a beer and a cigarette or youth group council and extracurricular accolades.\nMany days I find myself back there, desperately trying to build my own kingdom.\nStaring at the aftermath of these 12 chapters of Daniel—all the egos and kingdoms that have crumbled in both dreams and real life—I see it as clearly as when I look back on my high school self. So much effort for things that matter so little, so many idols built up just to watch them fall. Perspective might come easily enough with 20 years or 12 chapters, but not so much when you’re in the thick of the struggle and the waiting.\nIt’s no surprise that Daniel (by this time an old man who’s spent years in exile) stands here at the close of the book feeling pretty awful. He is utterly confused by all he has witnessed and heard, and he has one question: How and when is this finally going to end? Daniel—the man we have praised for his faithfulness, and rightly so—is just ready for this insanity to be over already.\nThe angel does not answer Daniel’s question but points him to the answer, in two parts: “for the words are secret and sealed until the time of the end” (Daniel 12:9). The word “sealed” here (also in Daniel 8:26) means to close up for safekeeping, to preserve as-is. The truths Daniel heard and witnessed are everlasting, unchanging truths.\nThe earth and all its works will burn up, but the Word of God will last forever (see 2 Peter 3:10 & Isaiah 40:8).\nThe angel also says this: “None of the wicked will understand, but the wise will understand” (Daniel 12:10). Wisdom is not knowing the answer, it is knowing the God who IS the answer. Daniel’s question of the “how long?” is a valid one (one echoed throughout Scripture—see Psalm 13). It’s a hard thing to be held captive in a place that’s not your home. We fret and wring our hands, with so many questions about what tomorrow holds, what next year will bring and 30 years after that. Daniel wondered, too. But our God is infinitely bigger than our confusion.\nOur view is limited to hindsight, but our God sees from beginning to end because He is the beginning and the end (Revelation 1:8). The only true kingdom is His Kingdom. The only true way is His Way.\nFriend, the way for the wisdom and the waiting lies in God’s Word. His Word is where He meets us, day after day, in our place of earthly exile, and fills our hearts and minds with His truth. It is where we find Jesus, who is the Way, the Truth, the Life (John 14:6). True wisdom starts here, prayerfully reading the pages of His Word.\nSo get up and go on your way today, sister. Be free of building your own kingdom. Take heart knowing that your way is not your own. The God of Daniel leads you.\n \n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Daniel_instagram19.jpg"
    }
]