[
    {
        "book_title": "Esther",
        "devo_passages": "Esther 1:1-22, Psalm 32:7, Daniel 6:8, Daniel 6:13-18",
        "devo_title": "Vashti Angers the King",
        "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Esther 1:1-22, Psalm 32:7, Daniel 6:8, Daniel 6:13-18\nThere’s an old saying that goes, “When God closes a door, He opens a window.” Perhaps you’ve heard it? But God’s work in the lives of His people is far more magnificent than that. \nEven better than closing doors and opening windows, what we find in the book of Esther is the active, invisible, and preemptive hand of God at work in the most unexpected places. \nToday’s reading sets the stage by casting an ominous shadow over a seemingly happy time of feasting and abundance. The king throws a party meant to last for 180 days, but when he summons his queen so that he might show off her beauty to his guests, she refuses to come to him. This decision has repercussions that will reverberate throughout the kingdom, kicking the rest of the story into motion. \nReaders respond in different ways to this conflict between the king and queen. How are we to view her defiance? How should we measure his reaction? But whether we interpret Vashti’s actions as brave or bad, the larger truth of this book remains unchanged. This story is about God and His providential care for His chosen people in exile. In the book of Esther and throughout all of Scripture, God is the main character of every story. \nThough His name is not directly mentioned, God’s presence is evident in this Old Testament book. And His sovereignty and goodness are not dependent upon our reactions and interpretations. When faced with an unexpected turn of events or unwelcome challenge, most of us turn to scheming and problem solving, trying to figure things out and then “fix” them as we see fit. But the book of Esther shows us that God does not go around simply reacting to whatever we throw at Him. He doesn’t work that way. No, He acts first. His rescue plans are already in place—even before danger comes our way.  \nGod’s involvement in our lives is so much better than closed doors and open windows. In the story of Esther, and in our story of salvation, God designs our deliverance even before man begins to devise our destruction.\nThe book of Esther is short, rich, and ultimately points to Christ overcoming death by giving His own life—a ransom for us all. As you read, look for the active, invisible, preemptive hand of God. Consider the ways God has designed your own deliverance, and imagine the invisible ways He is caring for you even now. \nGod is good. And He is at work.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day1.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 2, Proverbs 31:10-31",
        "devo_title": "The King Searches for a Queen",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Esther 2, Proverbs 31:10-31\nWell, I have to admit; the circumstances of Esther’s appointment as queen are a bit… gritty. \nI wish I could say that everything in the book of Esther is beautiful because it’s in the Bible. But the truth is, the Old Testament is filled with the stories of ordinary people who make extraordinarily bad choices. Yes, “All Scripture is inspired by God and is profitable for teaching” (2 Timothy 3:16), but clearly, we aren’t meant to emulate the idol-loving Jezebel, the jealousy of Joseph’s brothers, or the murderous Cain. \nIt’s not Esther I take issue with; it’s her circumstances. I can’t help but read her story and feel a little disturbed by the idea of a young woman kept in a harem. It’s creepy to imagine a king trying out different women until he picks his favorite. And it sure seems like Esther was beloved largely because of her looks (Esther 2:15). I suppose that makes her sound eerily similar to a contestant on some reality television show. It makes for an entertaining show, but it’s surely not showcasing the most life-giving way to date in real life.\nSo then, what can we learn from Esther’s appointment as queen?\nFirst of all, it is good to remember that God works through imperfect circumstances. I don’t know about you, but that’s a huge relief to me. Contrary to the gospel of social media, we don’t need to have perfect lives for God to move in our lives. Esther was a persecuted orphan girl living in a brothel, but the Lord used her to save His people in a big way. \nThe heart of the Father is to bring beauty from ashes (Isaiah 61:3). This is demonstrated in His redeeming work again and again, through the imperfect circumstances of Scripture’s heroes and heroines. Esther is a godly woman who’s called to act in a precarious situation. What you might notice is that Esther took the wise counsel of those she trusted, keeping her ethnicity a secret until the right time as Mordecai advised, and adorning herself as the king’s eunuch instructed. \nSure, Esther could have been prideful, determining she ultimately knew best. She could have blurted out her secret and chosen her own fashion statements. But had she gone that route, it might have changed the king’s reaction and the entire story. \nSo was Esther passive or humble? Weak or wise?\nWhile the circumstances surrounding Esther’s story may raise a few eyebrows in today’s culture, the woman herself seems to be an admirable and fierce role model. Esther knew that “charm is deceptive and beauty is fleeting,” but the wisdom found in learning to fear the Lord does not fade (Proverbs 31:30). Out of wisdom and humility, she sought the help she needed. And through that counsel, God gave her the courage to walk into a life-threatening situation on behalf of His people.\nEsther trusted in her God and in His perfect will. Through her story, we are reminded that our pasts are never too crooked, our circumstances never too disappointing, to take part in the world-changing work of our heavenly Father.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day2.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 3:1-15, Psalm 68:20, Proverbs 16:33",
        "devo_title": "Haman Plans to Kill the Jews",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Esther 3:1-15, Psalm 68:20, Proverbs 16:33\nAt times, my life can feel like one of those “Choose Your Own Adventure” books I used to read back in the fourth grade. I find myself at a fork in the road, worrying that if I make the wrong choice the plot will be ruined, the protagonist (i.e. me) won’t be rescued, and my story won’t ever be worth reading. \nBut the Bible is a different kind of book. God’s Word is uniquely able to lift my eyes off of the decisions that paralyze me, and instead refocus them on the “author and perfecter” of my story, and of your story, too—of the bigger story that has already been written (Hebrews 12:2). \nHere in the book of Esther, the storyline of God’s people takes a desperate turn. Fueled by ego, power, and a desire for revenge, Haman is “filled with fury” (Esther 3:5) and plots the genocide of the Jews. He’d already decided to destroy the Jews, but he waited to show his hand until the “signs”—the casting of lots (v.7)—seemed to confirm that this was more than vindication, that it was a divine assignment. \nCasting lots looked much like rolling a pair of dice, and was often used as a way of seeking divine guidance. Joshua cast lots to divide up the promised land among the tribes of Israel (Joshua 18:6). The apostles cast lots to find Judas’s replacement (Acts 1:26). Here, King Ahasuerus’s officials cast lots in his court, and Haman tasks himself with interpreting them. \nOn the day Haman chose to move forward, an edict of death was signed and delivered throughout the land, seemingly sealing the doom of God’s people. But their story isn’t determined by a single decision or a lone madman. Our lives are not a Choose Your Own Adventure book where we sink or swim, survive or die, based solely on our ability to make the right choice. \nGod’s people would be spared, not because they did everything right and Haman did everything wrong. The edict of death would be repealed, not because Haman didn’t have the power to enforce it—he did—but because there is a stronger hand writing the story. \nThere is no rolling the dice with the sovereignty of God. “The lot is cast into the lap, but its every decision is from the LORD” (Proverbs 16:33). His plans cannot be thwarted. His story cannot be edited. His people cannot be ripped from His loving hand. \nThe story God writes in Esther ultimately points to Jesus. Again, wicked rulers, high on power and poisoned by jealousy, sought to destroy God’s Chosen. Again, the government officials issued decrees that seemed to seal a deal with darkness. Only this time, the edict was not repealed. Christ was killed for our benefit. And once again, the lots were cast: \nAnd they crucified him and divided his garments among them, casting lots for them, to decide what each should take (Mark 15:24). \nGod is sovereign, capable of having His way in our lives and in our history books. While Roman soldiers cast lots to divide up Jesus’ bloody robe, He was already at work making all things new. No man can stop Him. No plot can take Him out. In His sovereignty, He rescued the Jews from Haman’s hatred, just as He rescued us from our sin. Truly, “Our God is a God of salvation” (Psalm 68:20).\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day3.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 4:1-17, Isaiah 15:1-3, Romans 5:6-11",
        "devo_title": "Mordecai Appeals to Esther",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Esther 4:1-17, Isaiah 15:1-3, Romans 5:6-11\nRachel is a scourge to the devil in Vienna.\nEvery time I saw her she was flushed with excitement over a recent chance to share the gospel. Any encounter on the subway, any phone call, and every relationship irresistibly impelled her to tell people the good news. Although she was a gifted linguist with a degree from Cambridge, she carried Bible tracts in her pockets and she wasn’t afraid to use them.\nNo amount of poor or sad or weird was enough to keep Rachel from befriending strangers and reaching out to them with hope and love. She was inspiring and a little overwhelming.\nOne afternoon, Rachel invited me to a street music event she was staging on Kärntner Straße. She is a classical violinist and had gathered other string musicians to play a concert and share the gospel on that ancient, black stone street.\nFeeling both a little shy and peckish, I got a gelato and went antique shopping instead.\nI missed an opportunity. God didn’t need me to help share His gospel; His gospel will go forth whether I stand up and speak His name or not. In fact, if I can’t muster a good word about the Lord, Scripture says even the stones will cry out in my place (Luke 19:40).\nGod invites us to join His work, not for His sake, but for ours. God invited Esther to join Him in saving the Jewish nation. If Esther had refused to go to the king, God still would have saved His people, but she would have missed an opportunity. As Esther’s cousin Mordecai said: \n“If you keep silent at this time, relief and deliverance will come to the Jewish people from another place, but you and your father’s family will be destroyed. Who knows, perhaps you have come to your royal position for such a time as this.”\n– Esther 4:14\nOur refusal to take part in God’s work doesn’t thwart God. It limits our privilege to take part in what He is doing. God can even use unrepentant sinners to achieve His good purposes. Consider Pharaoh, Caiaphas the high priest, and Pontius Pilate (Exodus 9:12; John 18:14; John 19:5-16). “But God proves his own love for us in that while we were still sinners, Christ died for us” (Romans 5:8).\nGod’s providence is comprehensive, wise, and holy. His timing and calling are no mistake, and just as He did with Esther, He has placed us here and now, for such a time as this. \nWe, like Esther, can have courage, comfort, and peace. From a human perspective, our lives and circumstances can seem totally out of control and scary. But we can rest in God’s providence, knowing that He is working. \nLook for God’s invitation to join Him in His work. Have courage, comfort, and peace—you can join Him now! You can always go get a gelato later.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day4.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 5:1-14, Proverbs 16:18, Mark 6:14-29",
        "devo_title": "Esther Approaches the King",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Esther 5:1-14, Proverbs 16:18, Mark 6:14-29\nIt was a dinner party with an enviable guest list. Sitting at the head of the table were hosts Michael Eisner, former CEO of Disney, and his wife, Jane. In charge of passing the bread baskets was their friend George Lucas, creator of Star Wars, as well as Dick Rutan and Jeana Yeager, the guests of honor.\nIt was sometime in the ‘80s and there was reason to celebrate. Dick and Jeana had just become the first people to fly around the world without stopping.\nAfter the dessert had disappeared from their plates and they’d heard story after story about Dick and Jeana’s worldwide adventure, Jane Eisner raised the question many of us would have asked. “Well, now that you’ve accomplished the pinnacle of your aspirations, what could you possibly do next?”\nWithout hesitation, Dick responded, “I’m going to Disneyland!” Without hesitation, Jane responded, “That’s a good slogan.” And so it was.\nFrom the 1987 Super Bowl on, the answer to, “You won! What are you going to do now?” became “Disneyland.” And yet, when we watch sports reporters ask this question, it always seems a little silly, doesn’t it? Because after the Gatorade coolers have been thrown, and the trophies have all been shined, the athletes already have exactly what they were after in the first place: victory. What else could a Super Bowl champion possibly need?\nIn the books of Esther and Mark, we find two very different women who happen to have their king’s ear—Esther and Herodias’s daughter. Both women are asked a remarkably similar question: “What is it you want? Whatever you want, even if it’s half the kingdom, will be done” (Esther 5:3; Mark 6:23, my paraphrase).\nThe similarities between their stories stop there. Overwhelmed with possibility, Herodias’s daughter consults her mother, asking what desires she ought to demand, and they soon decide on their perfect request: John the Baptist’s head. On a platter. Perhaps she believed that for them, the most beneficial and powerful thing that could happen would be the destruction of God’s people. Her choice reeks of pride.\nPride comes before destruction, and an arrogant spirit before a fall.\n– Proverbs 16:18\nEsther, on the other hand, asks the king and Haman to attend a banquet where she herself will be the one preparing the platters. This probably seemed like a strange request, even to Esther. But instead of dreaming about the riches that could be hers, she keeps her heart close to the Lord’s. Esther believes the most beneficial and powerful thing that could happen to her is the rescue of her people—of God’s people. Her request is steeped in humility.\nEsther lives from a rooted belief in the kingdom that’s already been won for her. She makes choices based on riches she’s already received. Because she trusts in the King on High, she takes joy in making herself low. What else could a beloved daughter of the King possibly need?\nMaybe we need to be asking each other new questions as we gather around our own dinner tables. After all, we’ve already been given the kingdom. Now, how will we act? What will we do next?\nMay those questions lead us to respond with humility. May they lead us back, again and again, to the heart of the Father.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day5.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Psalm 32:7",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nYou are my hiding place;\nyou protect me from trouble.\nYou surround me with joyful shouts of deliverance.\n—Psalm 32:7\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day6.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 4:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through the book of Esther, we will memorize the book’s key verse in two parts. We’ll begin with the first part of the verse—a reminder that God’s sovereignty does not depend on us.\n“If you keep silent at this time, relief and deliverance will come to the Jewish people from another place, but you and your father’s family will be destroyed.”\n—Esther 4:14a\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/4-Esther-1.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 6:1-14, Proverbs 26:27, Isaiah 52:1-2",
        "devo_title": "The King Honors Mordecai",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Esther 6:1-14, Proverbs 26:27, Isaiah 52:1-2\nAren’t we all born with a strong sense of justice? From a young age, we tattle on the wrongdoers and we vehemently defend what we call “ours.” We fight for what we believe to be fair. As we grow up, we hopefully mature in our understanding of right and wrong, just and unjust, godly and ungodly. \nThis sense of justice is the reason Mordecai’s honoring and Haman’s humbling is so satisfying as we read on in the book of Esther. We want the good guys to win and the bad guys to lose. We tend to like it when people get what is coming to them. As Proverbs 26:27 puts it, “The one who digs a pit, will fall into it.”\nIs it a coincidence then, that King Ahasuerus cannot sleep, and so he asks for the daily events to be read to him? No, this event demonstrates God’s sovereignty. In fact, the book of Esther is filled with “coincidences” and fortunate turns of events, making it evident that God is in control and actively working on behalf of His people. During a time of exile and suffering, God rescued His children through an unlikely orphan girl, enacting justice on their behalf. \nUnfortunately, the world is still a place of injustice today. We see the bad guys winning. We see evil, hate, death, and disease infecting the world. Life is far from fair for most—something we’ve probably all been told at some point. \nWe still cry out when someone wrongs us. We grieve when a devastating attack occurs somewhere in the world. We cannot accept the imperfection and pain of this life. C.S. Lewis said, “If we find ourselves with a desire that nothing in this world can satisfy, the most probable explanation is that we were made for another world.”\nWhen our hearts cry out for justice, for good to prevail over evil, our hearts are really crying out for heaven. We long for Christ to come back and make things right once and for all. We long for the new heaven and the new earth (Isaiah 65:17). \nIn the stories of Esther, Joseph, Moses, and others, God intervened to save His people because He loved them and He cared about their plight. The greatest demonstration of God’s love was certainly when the Father sent His own perfect Son to die in our place so that justice could be satisfied. We were ransomed because of how much God loves us and loves justice.\nWhile we wait for the second coming of the Lord, all is not lost. We have been called to join in the work of kingdom building with Christ even now (1 Corinthians 3:9). Although our final home is not here, we’ve been instructed to pray for God’s will to be done “on earth as it is in heaven” (Matthew 6:10).\nEsther’s story was one of encouragement to the Jewish people in the midst of exile. It was a story to remind them that God is over all and God is good. In a less than perfect world, let Esther be a story of encouragement to all who believe.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day8.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 7:1-10, Psalm 91:2-3, Revelation 20:11-15",
        "devo_title": "The King Executes Haman",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Esther 7:1-10, Psalm 91:2-3, Revelation 20:11-15\nLately, I have been in a season of waiting. There is a lot of transition and change happening in the coming months, but at the moment, I feel stuck—like I’ve been running full speed, but I’ve had to come to a sudden stop. There’s a huge ravine in front of me, and I’ve reached as far as the current path will take me. I have to wait for a bridge to be built before I can cross to the other side. \nBut I don’t want to wait for the bridge. Waiting for the bridge to be built takes too long; it takes away my power. Still, I know with absolute certainty that I cannot build the bridge by myself; I have to wait for the Creator to build it and show me the way. Yet even with the humbling knowledge that I cannot do it on my own, I am impatient. I want the control. \nAt this point in her story, Esther had been doing a lot of waiting. She had to wait and see if she would be chosen queen. She had to wait for the king and Haman to come to her banquet, and then she had to wait for her second banquet before asking if the king would save her people. Esther had to wait on God’s timing instead of relying on her own.\nIn a book where the name of God is never directly mentioned, God’s providence and all-encompassing power appear time after time. Esther goes before King Ahasuerus, nervous and unsure, but God’s presence went before her, as it does with us (Isaiah 45:2). God continues to be our refuge and our fortress in times of uncertainty and distress (Psalm 91:2). \nThough God’s presence was not explicitly stated in this scene with Esther, King Ahasuerus, and Haman, it is evident that He was there. He was there when Esther invited them to the banquet, there when she asked King Ahasuerus to save her people, and He was there in the midst of Esther’s fright and uncertainty. \nPerhaps when Esther first heard of Haman’s evil plot, she might have felt as if she were standing at the edge of a ravine. Unsure of where to go next, she simply had to wait for God to build the bridge and show her the way.\n And He did. He built the bridge, He led Esther across it, and He worked through Esther to save His people. God took Haman’s disastrous plan and turned it on its head, destroying Haman and restoring full life to the Jews so that they may proclaim His glory throughout the nations.\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. She is most often found with a large iced coffee in her hand and a smile on her face. She is a lover of good books, ugly dogs, and cozy sweaters. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day9.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 8:1-17, Romans 8:10-11, Colossians 3:1-4",
        "devo_title": "Esther Intervenes for the Jews",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Esther 8:1-17, Romans 8:10-11, Colossians 3:1-4\nSometimes I am absolutely paralyzed by indecision. Does this happen to you? My to-do list gets too long, and instead of just chipping away at it one item at a time, my stomach starts to hurt, my neck gets tight, and I just go back to bed. The rational thing to do is to simply move forward, pay the bills, write the essay I’m avoiding, and buck up. But I find that sometimes I just can’t muscle through. I find that my nose is raw from so much keeping to the grindstone. I can’t move forward for good or for ill. I am paralyzed.\nWe can get frozen in place when there’s too much to do, or even when there’s nothing to be done. In either case, panic and flight are the natural human responses to unfavorable circumstances. Both solve nothing, and both betray a lack of faith that God is in control. We find ourselves in that terrifying state of freezing indecision, yet He really only desires one thing: that we turn to Him in trust.\nTrust doesn’t mean we have to remain inactive. Often, trust means we must act. In those situations, God calls us to simply do the next right thing, and for the rest, cast our cares on Him (1 Peter 5:7). Do you have a ten-year plan? Good on you. Do you have no plans at all? That’s okay, too; start with the next right thing.\nEsther didn’t have a ten-year plan. Her future plans risked her neck, so she had every reason to be paralyzed by fear and indecision. But instead she cries out in agony, “How could I bear to see the disaster that would come on my people?” (Esther 8:6). Even though her enemy Haman had been dealt with, his evil plotting left behind a huge disaster and danger. Lives were at stake. How could her people be saved from destruction? In Esther’s case, King Ahasuerus turned matters over to Esther and Mordecai. \nThroughout Esther’s story, we have seen that so much has rested on favor. The favor the king showed Vashti, the favor he showed Esther, the favor the king showed Haman, the favor he showed Mordecai, then the favor he showed the Jews. This favor, of course, is often reversed. The king’s favoring of Vashti ended. Esther favored Haman by inviting him to the feast, but it was to his destruction. Mordecai was ignored, then favored. And finally, the Jews, once despised, were now favored of the king.\nAll of this favor is out of our control. Amidst flatteries and reversals, however, God’s favor for His people endures. The story of Esther is ultimately the story of God’s favor toward His people. It’s the story of Psalm 30:11-12: “You turned my lament into dancing; you removed my sackcloth and clothed me with gladness, so that I can sing to you and not be silent.”\nGod’s favor is the greatest surety there can be. We are called to trust Him and walk in obedience. We don’t need to give up and confine ourselves to bed, paralyzed by fear and indecision. We can move forward in confidence of God’s promises. If we trust ourselves to His care, we need not fear or be anxious. Though the whole world heave against us, or when everything is shrouded in darkness, He is King.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day10.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 9:1-22, Nehemiah 8:10, Luke 1:46-55",
        "devo_title": "Esther’s People Are Saved",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Esther 9:1-22, Nehemiah 8:10, Luke 1:46-55\nWhen it comes to a blockbuster movie experience, I like to feel a tinge of tension. I don’t mind my emotions being pushed to the brink of disaster before the hero swoops in and saves the day—that is, while I’m sitting in a comfy seat with a jumbo tub of popcorn (extra butter, please). But in real life? Oh no. I’d rather play it safe. \nI don’t want to even come close to disaster, disappointment, or despair. I’d prefer to see God’s hand rescue me as soon as the thought that something could go wrong enters my mind. Wouldn’t you?\nGod knows this about us, and He knows what we need. His plan is always right on time. Never early. Never late. We see this play out among God’s people in the book of Esther. Haman’s evil edict of death was issued on the thirteenth day of the first month, sending God’s people into a panic (Esther 3:15). But deliverance did not come until the thirteenth day of the twelfth month. The only thing worse than panic is prolonged panic. Am I right? \nFor twelve long months God’s people must have pleaded with Him to rescue them. They must have worn paths in the kitchen floor pacing with worry. They must have resisted a million urges to run and hide the little ones they knew Haman had ordered to be killed. They must have fretted that God would not come through, worried they’d misunderstood His plan for them, or felt abandoned by the God who promised to protect them. \nDeliverance did not come twelve months early, or twelve weeks early, or twelve days early. \nDeliverance came “on the day when the Jews’ enemies had hoped to overpower them, just the opposite happened. The Jews overpowered those who hated them” (Esther 9:1). \nThat very day. \nThe second they arrived at the juncture they’d been dreading, the switch flipped, the tables turned, and their Great Deliverer delivered them from destruction. God’s people stood, ready to fight, eyeball to eyeball with their worst nightmare. God has promised He will care for us, but we cannot put grace to the side, storing it up for a moment we don’t want to face. \nWhen our enemies come for us, God will stand beside us. When our hearts are broken, God will be near (Psalm 34:18). When we walk through the valley of the shadow of death, we will see His hand (Psalm 23:4). But we may find ourselves closer to suffering than we’d ever want to be, on our knees praying until they ache. Like Israel did as they fled their Egyptian oppressors (nearly 1,000 years before Esther pleaded for her people to be spared), we may feel the sting of a raging sea before us and hear the pounding of enemy chariots behind us before we are able to see God make a way. \nSo what do we do as we wait for our rescue? We stand firm in God’s promises, trusting that He will deliver us at exactly the right moment. We wait for His rescue. We wait on Him. Our God is able to shift our sorrow to gladness and our mourning into celebration (Esther 9:22). He will do it right on time, every time.\n\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day11.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 9:23-32, Esther 10:1-3, Leviticus 16:29-31, Ephesians 1:3-14",
        "devo_title": "God’s People Remember and Celebrate",
        "devo_summary": "\nBY Rebecca Faires\n\nThings don’t always go according to plan.\nTake the summertime of 1812, for example. Paris was warm and beautiful, and Napoleon’s army was 600,000 men strong. He was on top of the world, but Russia’s Czar Alexander was really starting to get on his nerves. He ignored French trade embargos, and worse, refused to let Napoleon marry one of his sisters. Frustrated but confident, Napoleon made his most ambitious plan yet: take Moscow and show Alexander once and for all who was the greater ruler.\nNapoleon crossed from Poland into Russia, his vast army advancing deeper and deeper into the countryside as the Russian forces burned their crops and fled before him. But as he advanced, Napoleon’s supplies and men began to dwindle. And although he did finally limp into Moscow in October, the wind and snow had started to swirl and bite—winter was coming. With only a sixth of his men remaining, Napoleon had to retreat, defeated not by Russia’s military, but by her freezing, obliterating winter.\nIf you’ve ever engaged in a land war in Asia, or even parented small children, you know things hardly ever go as planned. So why do we continue to believe we can control our circumstances? History and personal experience prove God alone is in control. The Red Sea parted, Jericho’s walls collapsed, and fire fell on Mt. Carmel—we are not the ones running the show.\nHaman planned to crush the Jews (Esther 9:24). He wanted to destroy them. We’ve seen examples of this kind of horrific racism all throughout history. In every era, men have shown this evil instinct to destroy other men for being different. They lay their evil plans, perhaps prevailing for a time, but in the end, their plans fall flat. They may cast the dice, but God alone controls the outcome.\nIn our own failed Napoleonic aspirations we are quick to become frustrated, lamenting, “Nothing ever goes like I plan!” But every failed human plan is actually cause for thanksgiving, because all things happen according to the good pleasure of God’s will (Romans 8:28). Likewise, when the enemies of God approach, armed with malice and intent upon blood, we can still give thanks. God Himself is our defense, and we should not fail to celebrate His good providence in all things.\nAt the end of the book of Esther, the Jewish people celebrate God’s deliverance. They not only celebrate in the present, but they vow to celebrate in the future—to remember who they are and what God has done:\n“These days are remembered and celebrated by every generation, family, province, and city, so that these days of Purim will not lose their significance in Jewish life and their memory will not fade from their descendants.”\n– Esther 9:28\nMay we also remember. May we remember, with Solomon, that “The heart of man plans his way, but the Lord establishes his steps” (Proverbs 16:9). May our hearts respond in thanksgiving because He alone is God, and there is no one like Him (Isaiah 46:9). May we celebrate our freedom in Christ by remembering what we’ve been saved from, and Who has saved us from it.\nMake your plans, but rejoice and remember: it is the Lord who had a good plan for us before the foundation of the world (Ephesians 1:4). Glory be to Him.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-Day-11-100x100-c-center.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Ephesians 1:9-10",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHe made known to us the mystery of his will, according to his good pleasure that he purposed in Christ as a plan for the right time—to bring everything together in Christ, both things in heaven and things on earth in him.\n—Ephesians 1:9-10\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/SRT-Esther-instagram-Day13.jpg"
    },
    {
        "book_title": "Esther",
        "devo_passages": "Esther 4:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through the book of Esther, we are memorizing the book’s key verse in two parts. This week, we’ll memorize the end of the verse, which reminds us that God has a purpose for our lives.\n“Who knows, perhaps you have come to your royal position for such a time as this.”\n—Esther 4:14b\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/4-Esther-2.jpg"
    }
]