[
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 1:1-31, Genesis 2:1-24, 2 Corinthians 4:6, Hebrews 11:3",
        "devo_title": "The Creation",
        "devo_summary": "\nBY Amanda Bible Williams\n\nThere was a time when I was afraid to write. The act of etching my thoughts in ink onto a blank page felt like one of the riskiest things I could do—to declare who I am, reveal what’s inside of me, and then slide it across the table for the rest of the world to see. Even now as I type these words on my laptop in the comfort of home, I am prone to second guess every sentence, every word choice.\nSure, I like new beginnings in theory, but in practice they paralyze me. It might be a new calendar, an empty room, a first day, or a clean white sheet of paper staring back at me. Like a rookie film actor stumbling onto set, I’m certain I’ll flub the first take. \nBut Genesis is another story. It is the story—our story. The beginning of all beginnings, the book of Genesis is the true history of who we are and where we came from. The first book of the Bible, it is our first glimpse of God’s character in Scripture, of His creation and compassion and His covenant with mankind. And though, yes, we humans dove headlong into sin from the first, our faithful, holy, and steadfast Creator remains true. God is the author and star of this story, and He is the one who invites us in to make it our story as well. \nThe book of Genesis presents hard truths about human nature and the fallen world we live in, but it is ultimately a book of hope. God created us—each one of us—to bear His image, and He has not changed His mind (Genesis 1:27). Fear and fallenness plague us here on earth, but God will one day bring us home to the perfect peace of His presence. Until then, we are called to “be fruitful, multiply, fill the earth, and subdue it,” to extend God’s plan for Eden throughout the whole earth (v.28). \nOne day, we will know and experience our Creator’s presence face to face—in perfect peace, whole, and unashamed—just as Adam and Eve once did long ago (Genesis 1:25; Revelation 22:4). That is the life we were created for, the intimate relationship we were always meant to enjoy with Him. One day, even death itself will die, and we will get the fresh start we’ve always longed for—the perfect new beginning, free from fear. \nGenesis lays the foundation for everything else we read in Scripture. Our prayer is that this reading plan serves to draw you further into God’s Word, that it would bring you to a deeper knowledge of the God who made you and a deeper longing for His presence. He alone knows the end from the beginning, and we can rest in Him. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-1-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 3:1-24, Romans 5:12-21, Romans 16:20",
        "devo_title": "The Temptation and the Fall",
        "devo_summary": "\nBY Guest Writer\n\nWe have a painting in our home, one depicting a distraught Eve being comforted by a pregnant Mary, who is wiping away Eve’s tears. Her eyes focused on Mary’s belly, she reaches out to touch it, even as her own heel is trampling the serpent’s head (Romans 16:20). It’s an achingly beautiful, succinct depiction of what we lost in Eden, and of God’s never-ceasing pursuit to return us to right relationship with Him. \nGod’s pursuit of relationship with us is there from the start, in the beginning of His Word. From Genesis 1 and 2, we discover how God formed the earth and everything in it, including man and woman, who He made in His image (Genesis 1:27). He gives Adam and Eve the radical opportunity to rule over the world with Him, cultivating its growth. And out of His relational love for them, He gives them a choice about how they will live and work in this world: will they choose to follow God’s way and His wisdom and instruction for life, or will they choose a different kind of wisdom, one that relies on self-sufficiency and autonomy, apart from Him?\nGod has already provided Adam and Eve with everything they need to carry out this task, instructing them on what is good for them and what is not (“the tree of the knowledge of good and evil” [vv.16–17]). Prior to the serpent’s persuasive lie (3:4–5), enticing them to their own brand of knowledge, humanity dwelled in perfect harmony with God and one another. But after choosing to eat from the forbidden tree, “the eyes of both of them were opened, and they knew they were naked” (3:7). From this point forward, discontent and shame would be a part of the human condition, disobedience would drive a wedge between creation and Creator. \nWhen God asked Adam and Eve where they were that day in Eden (3:9), He already knew, of course. It makes me think the question was certainly more for their sake than His—it had to be. He asks where we are, too, all the while knowing all the dark places we run to, the many ways we attempt to hide our hearts from Him. But He pursues us all the same, fully aware that while He will ultimately defeat the serpent, that same enemy still actively seeks to destroy us (John 10:10), to lure us away from the God who adores us.\nI looked at that painting again today. We’ve had it for maybe a decade, but to this day, if I look at it too long, it never fails to wake me to the indifference of my own sin, to the lie of self-sufficiency—it wrecks me. \nHonestly, that’s where I’m at today. What about you?\nIf God were to ask, “Where are you?”, what would you tell Him? Do you believe it’s safe to come out of hiding? Do you trust that our Creator knows what’s best for His own creation? The God of Genesis 1 and 2, is the same God here in chapter 3; He does not change (Hebrews 13:8). He is still in the business of covering our shame with His own righteousness—even when we disobey Him (Genesis 3:21; Romans 5:8,19). Wherever you are, He waits for you.\n\nKara Gause is a content editor for She Reads Truth, happily residing with her family in Nashville, Tennessee. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-2-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 4:1-26, Genesis 5:1-32, Hebrews 12:22-24",
        "devo_title": "Cain and Abel",
        "devo_summary": "\nBY Sharon Hodde Miller\n\nMy children are currently in a difficult season of discipline. On a daily basis, usually multiple times a day, I dispense consequences for bad behavior, which are then met with responses of total shock and horror. \n“I didn’t do anything!”  “I didn’t know!”  “I didn’t hear you!”  “But his face ran into my fist!” \nLike generations of children before them—including myself!—my kids are gifted at playing the martyr. Rather than repent and ask forgiveness, they make excuses. And sometimes, they dig in their heels even deeper. \nHere in this story of the very first murder, we see where this blame-shifting began. And it all started very innocently. Two competitive brothers—one a farmer, one a shepherd—bring offerings to God. Cain brings the fruits of his soil, and Abel brings fat portions from the firstborn of his flock (Genesis 4:3–4). At first glance, it would appear that each brother brought what he had, but God does not see it this way. God looks with favor on Abel’s offering, but he withholds favor from Cain.\nWhy?\nIn their commentary on this passage, Tremper Longman and Scot McKnight explain the difference in their gifts: “Cain offered the ordinary and Abel the best, and of course the quality of their offering reflects the condition of their hearts. Abel is enthusiastic about worship, while Cain is basically disinterested.”\nCain is caught doing the bare minimum, but rather than humble himself, admit his spiritual apathy, and ask how he can do better, Cain digs in. He becomes angry. He throws a pity party. He nurses his bitterness until it culminates in murder, and even after all that he continues to play the victim: “My punishment is too great to bear” (v.13).\nIn these early chapters of Genesis, we are learning about the ways of God, but we are also learning about the ways of sin, and here we observe a major hallmark. Human sin is so utterly broken that it will even deny its brokenness. It will run, hide, make excuses, and lash out before taking responsibility and repenting, and this is an important thing to know about ourselves. When accountability comes our way, even if it comes harshly or imperfectly, our response determines the course of our lives. How we respond to sin sets our feet on one of two paths: back to God, or further away from Him. \nBut here is what else this story reminds us, and I hope this sets you free: sometimes we are the ones being confronted, but sometimes we are the ones doing the confronting. Sometimes, we bring truth to light and then, just like God does in this story, have to watch as a loved one hardens their heart all the more. This, we must remember, is not about us or our shortcomings or how we could have said it better. It’s about sin, and what it does to the human heart. \nThankfully, we have something that Cain didn’t have: the Holy Spirit. Through the gift of God’s Son, Jesus Christ, we have a helper and an advocate who is ready to work when repentance feels too hard. That is how good God is—even as He asks us to be faithful, He helps us to do it.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-3-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 6:1-22, Genesis 7:1-24, Genesis 8:1-22, 1 Peter 3:18-22",
        "devo_title": "The Flood",
        "devo_summary": "\nBY Sharon Hodde Miller\n\nA couple years ago, God called my husband and me to something scary. Ike quit his secure church job with a regular salary and generous benefits to strike out and start a new church. We had no idea how it would turn out, whether we were adequately equipped, or whether it would succeed or fail. But we trusted God, so we obeyed and went. \nDuring that season, we relied on a number of stories in the Bible to buttress our faith. Whenever we needed a reminder about God’s gracious willingness to confirm a hard call, we read about Gideon. Whenever we needed to stand on God’s ability instead of our own, we read about Moses. And whenever we wrestled with the loneliness and fear of stepping into a seemingly illogical call, we read about Noah.\nNoah’s story is remarkable for two reasons, one which is obvious and one which is not. The obvious reason is Noah’s faithfulness in an unfaithful generation. Genesis 6:1–5 describes an era in human history that was so dark, so depraved, that it prompted God to declare “I regret that I made them” (v.7). The human race was unraveling, and yet there was Noah, “a righteous man, blameless among his contemporaries” (v.9), who managed to resist the moral current of his day. \nThis fact about Noah, on its own, makes him an exceptional person. But here is the less obvious, but equally remarkable truth about him: Noah was the first person recorded in Scripture to be asked to take a big leap of faith. To put it another way, Noah didn’t have the heroic stories of God to turn to that we do. No histories of God using the unlikely, or confirming a hard call, or rescuing a desperate people, or most importantly, sending a Savior. \nSo when God called Noah to something strange and nonsensical—building a boat, in the middle of the land, with no flood in sight—Noah had little to no record of God’s faithfulness in history. All he had was his own knowledge of God.\nBut how did he acquire it? \nGenesis 6:9 tells us that Noah “walked with God,” which is an intentionally active verb. He didn’t simply know God; he did life with God. He drew near to God, he followed God, he honored God, and he served God, and this was how he learned about God. He didn’t have a long historical record of the deeds of God, but he wrote one with his own life. \nMillenia later, as a people of God who possess generations of stories of God’s faithfulness to ordinary people, the witness of Noah reminds us of something important. As much as these stories are a gift and a help when faith is hard, one of the most important ways we know God’s character and get to know Him more intimately, is not simply by reading about Him. It’s through walking with Him. It’s through obedience. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-4-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 9:1-29, Genesis 10:1-32, Isaiah 54:9-10, Hebrews 11:7",
        "devo_title": "God’s Covenant with Noah",
        "devo_summary": "\nBY Sharon Hodde Miller\n\nRecently, I met with someone who was agonizing over a big life decision. She wanted to make the right choice, and she was terrified of making the wrong one. But her fear was not simply about discerning God’s will. It was about disappointing God. Or worse, failing Him. If she made the wrong decision with the wrong motivation, she worried that God would punish her for it.\nThis is, not surprisingly, a common fear among Christians. Many followers of Jesus live with the unsettling worry that God will judge us for our sin, despite receiving His gift of grace and salvation. Either consciously or subconsciously, we operate out of a place of fear rather than love, and it’s often because of stories like Noah and the flood. \nThis fear of judgment would be understandable if the flood—or any judgment from God—were the end of the story, but thankfully, it is not. Instead, the flood is only a chapter in a bigger, redemptive plan.\nWhat we encounter in the chapters following the flood is a second story of creation. It’s as if God wipes the slate clean and begins again. In the same way God directed Adam and Eve to be fruitful and multiply, He commands Noah to do the same (Genesis 9:1). Noah is, in some sense, a new Adam. \nHowever, what is different from that first creation is the presence of sin. Humanity’s relationship with God has fundamentally changed, which makes this story fundamentally different. He explains what it means to be His people and what He expects of them, but He also promises never to rain down this kind of judgment again (v.11). \nGod calls these commands and His promise a “covenant,” which is significant. What God is offering is not a cold, legal “contract,” but a relational covenant that is instituted and upheld by God, and here is why all of this matters: In these opening chapters of Genesis, we are learning about who God is. God is just and He will not be mocked, and we see this in His judgments. But, God is also a rescuer and a redeemer who gives everything He has to deliver us. \nIn every story that follows, God affirms these two things: this covenant, and His commitment to preserve His people. And ultimately, He fulfills it in Christ. Jesus receives our judgment and achieves our redemption, and then makes this restoration available to all who enter this covenant through Him.\nThat is why we can read these stories of God’s wrath without fear. Sin has consequences and God is indeed just—but the judgment has been dispensed. Because of Christ, God looks upon us in all our weakness and mistakes, and promises, “Never again.”\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Isaiah 54:10",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“‘Though the mountains move and the hills shake, my love will not be removed from you and my covenant of peace will not be shaken,’ says your compassionate LORD.” Isaiah 54:10\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-6-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 1:31",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Genesis, a declaration of God’s satisfaction with the work He accomplished while creating the world. \nGod saw all that He had made, and it was very good indeed.  —Genesis 1:31a\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Amanda-Raines-2019-12-19-22-52-05-SRT_Genesis-Lockscreen-7-576x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 11:1-32, Genesis 12:1-9, Psalm 2:1-12, Luke 1:51",
        "devo_title": "The Tower of Babel",
        "devo_summary": "\nBY Bailey Gillespie\n\nMy dad is a talented woodworker, and one year he built my brother and me an elaborate treehouse in our backyard. It was the talk of the town. There was a fire escape pole, a sandbox, a gymnastics bar, and a slide. He built it so high it just fit within coding limits established by the California building department. While it may seem like his motivation was a defiance of building permits, it was really an extravagant gesture of love. He wanted our treehouse to be as big and awesome as a treehouse could be.\nIn Genesis 11, the motivation for building a really tall tower wasn’t quite as pure. After settling in Shinar, the people were afraid of being scattered throughout the earth (Genesis 11:2). Although God’s command to be fruitful and multiply implies expansion into surrounding lands, the people liked it right where they were. They didn’t want to leave and, instead, decided to construct a tower to “make a name” for themselves (v.4). They likely built a ziggurat—a temple that was supposed to bridge the gap between heaven and earth, a place where they believed they could communicate with the gods. This was a way for them to claim the territory as their own and, hopefully, avoid being scattered. \nIn contrast with this story, when Abram received God’s call of pilgrimage to a new land, he responded by building a stone altar (Genesis 12:1–7). Unlike the tower, this wasn’t a symbol of human achievement or possessiveness. It was an offering to the Lord. Although we find countless biblical characters building things—arks, walls, altars, towers—the inner motivation behind these outward acts is different in each case. Some are born out of self-protection. Others out of worship. \nIt’s so easy to become possessive, isn’t it? We find something we want, plant a flag in the ground, and we don’t let go. Understandably, we all long for something—a patch of land, a community, a reputation. But our desires can become all-consuming and corrupt when left unchecked. Suddenly, instead of surrendering those desires to God out of obedience, we fight tooth and nail to keep them. \nWhatever we’re building, may we work more from a desire to offer it all as worship to God than to protect our own self-interests.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 12:10-20, Genesis 13:1-18, Genesis 14:1-24, Hebrews 7:11-22",
        "devo_title": "Abram and Lot",
        "devo_summary": "\nBY Bailey Gillespie\n\nToday’s reading is packed with action: famine strikes, Pharaoh gets deceived, Abram is kicked out of Egypt. It’s the making of a great summer blockbuster. After Lot and Abram’s respective herdsmen begin quarrelling about their small quarters, Abram sets a boundary. In an attempt to maintain harmony, he gives Lot the hard truth and asks him to separate from the group and make his home elsewhere. “Isn’t the whole land before you?” Abram asks, perhaps with a sweeping gesture of his arm (Genesis 13:9). The surrounding plain of the Jordan River was lush and ready for the taking (v.10). \nAfter Lot gets himself in all sorts of trouble, Abram comes through and rescues him. I imagine he was a little agitated by his nephew’s actions, but it wasn’t in his nature to abandon him to his own folly. With the sweat and dirt of conquest still fresh on his clothes, he’s given bread and wine as the priest Melchizedek proclaims: “Abram is blessed by God Most High, Creator of heaven and earth” (Genesis 14:19).\nWas Abram blessed by God because he was a victorious warrior? A protective uncle? Although, in this case, it may look like blessing is synonymous with circumstantial favor, we have to dig a little deeper. Abram isn’t necessarily blessed because He was delivered from his physical enemies. We know from other passages in Scripture that this predictable, cause-and-effect sort of way isn’t how God works. So, why does Melchizedek give him this blessing?\nThe second part of the message the priest brings is “blessed be God Most High who has handed over your enemies to you” (v.20). It appears that Abram isn’t the only one who is blessed—God is, too! Ultimately, God gets the glory for delivering Abram over to his enemies, and it’s His own power and blessing that covers Abram. \nJust as Abram was blessed by the God Most High, so are we. Our blessing isn’t dependent on releasing nephews from captivity (although I’d like to think we’d rise to the occasion), but just as Melchizedek came bearing bread and wine, Christ extends His own body and blood to us. When we accept His gift, we enter into abundant life. We are blessed not because of our own merit but simply because He blesses us. Today, let’s carry this story with us as a reminder that God is at work in our lives. Whether in physical circumstances or matters of the heart, He has called us blessed because we are first, and foremost, His.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 15:1-21, Genesis 16:1-16, Romans 4:1-5, Romans 4:9-25, Galatians 3:15-18, Galatians 3:27-29, Galatians 4:1-7",
        "devo_title": "The Abrahamic Covenant",
        "devo_summary": "\nBY Bailey Gillespie\n\nIn his book, Beyond Words, Frederick Buechner says this: “Here is the world. Beautiful and terrible things will happen. Don’t be afraid.” Buechner is echoing Christ’s words in the Gospel of John, where we’re told to take heart because Christ has overcome the world (John 16:33). There are many times when personal loss makes it feel as if God has removed His provision, and sometimes it takes everything in me not to project the actions of others onto my faithful Father, who has proven His provision in the past. \nAlthough today’s passage records God’s covenant with Abram, I can’t help but notice the part Sarai plays in this story. First, she experiences the disappointment of infertility, fearing it to be God’s prevention of her potential family line. She takes action by asking her husband to sleep with their slave, Hagar, to produce an heir. “Perhaps through her, I can build a family,” she reasons (Genesis 16:2). So, not only must she endure her husband’s intimate relations with their slave, but she also grows to resent Hagar after the very thing she hoped for comes to pass—Hagar’s pregnancy. \nHer own infertility must have felt emphasized by Hagar’s growing body. I imagine Sarai looking at Hagar and thinking this new life should have her features, her hairline, her DNA. So, what did Sarai really want? Did she want Abram to push back against her plan? Go at it with God? As emotionally complicated as her situation was, in the end, it was only God’s plan that could ease the depth of Sarai’s distress.\nThere’s an eerie line in this passage after God reveals that Abram’s offspring will be as countless as the stars. It describes how, after the sun set, “a smoking fire pot and a flaming torch appeared and passed between the divided animals” (Genesis 15:17). After Abram sacrificed the animals that God requested, this strange apparition appeared. However, God’s presence was often associated with fiery images in the Old Testament, and according to the Faithlife Study Bible, that night “the passage of fire ratified the covenant.”\nThere’s a reason God often tells His followers not to be afraid. Famine and battles, new land ownership and elderly maternity, flaming objects that move on their own—these are not things you see every day. But these are the sort of plot twists God delights in using to develop trust in His people and further His kingdom. Still, He understood how alarming all this must have been for Abram and consoled him by saying, “Do not be afraid… I am your shield” (v.1). \nDo not be afraid, friends. God is our shield. Before taking matters into our own hands, let’s believe that God is for us, not against us. Let’s give Him the benefit of the doubt and wait for His redemptive movement in our lives (Romans 4:20).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-10-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 17:1-27, Genesis 18:1-21, Galatians 4:21-31, Galatians 5:1-6",
        "devo_title": "Covenant Circumcision",
        "devo_summary": "\nBY Bailey Gillespie\n\nFour years ago, the university where I was working went through financial difficulties and laid off several recent full-time hires. I was one of them. It was devastating since our team was like a close family. After reestablishing financial stability, they extended an offer to come back one year later; and because I was juggling part-time gigs at the time, I accepted. Here’s the crazy thing: it was a far better role than before and wound up being the closest thing I’d ever had to a dream job. The experience led to one of those moments when you think: I sure wouldn’t want to go through that again, but I’m so happy things worked out the way they did. I couldn’t wait to share the good news with my family and, like Abram, say in amazement: “Is anything impossible for the LORD?” (Genesis 18:14). \nIn Genesis 18, both Abraham and Sarah laugh after the Lord says they’ll have a son in one year’s time. What a crazy claim! Being in their autumn years, how would they have the strength and endurance to raise a child? Abraham responds by laughing to himself and asking if a hundred-year-old man and ninety-year-old woman can have a baby (Genesis 17:17). It’s a legitimate question. But God isn’t even close to being done working the miraculous into Abraham’s story. \nGod came through for them. He gave them a son, demonstrating it had always been His intention to further their family line. And the story didn’t end there. God not only chose to make Abraham a father, but also the father of many nations and the root of Christ’s lineage (vv.4–5). It wasn’t about how tired or advanced in years the couple was now; it was about the kingdom. \nThe reason why it’s so important to remember how God worked for our good in the past is because it anchors our trust for the future. My story didn’t have to end with returning to that university, just like Abraham and Sarah’s story didn’t have to end with a male heir. God could shape us and build His kingdom in a million different ways. In the end, we’re left in awe and wonder, laughing and marveling, just like Abraham and Sarah. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-11-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 18:22-33, Genesis 19:1-38, Ezekiel 16:49-50, Romans 1:18-25",
        "devo_title": "Judgment on Sodom and Gomorrah",
        "devo_summary": "\nBY Bailey Gillespie\n\nAs I read about the destruction of Sodom and Gomorrah, I couldn’t help but think of Tolkien’s The Lord of the Rings: Return of the King. Toward the conclusion of the film adaptation, we see the Pelennor Fields lying in smoky ruins after battle. It’s a scene of utter and complete destruction. I remember watching this scene for the first time, wondering as the camera panned out if there’d be a familiar character still alive among the wreckage. I wanted to see a remnant of the good guys, to know that mercy had been shown to at least one person. Or hobbit. Or elf.\nMany of us hear words like “grace” and “mercy” and immediately jump to Jesus and the New Testament. But since we know that Christ is “the exact expression” of God’s nature (Hebrews 1:3), it won’t do to consider God in the Old Testament any less gracious or merciful.\nGod’s mercy is not hard to find in the Old Testament. It’s woven throughout the book of Genesis like a flowering vine, connecting the stories in Christ’s lineage. Even when people continue to make bad decisions that bring about their own demise or widespread catastrophe, God’s desire is for people to be saved (2 Peter 3:9). We see the ultimate display of God’s mercy in His Son, Jesus Christ; through the power of His resurrection, there is healing for the world (Isaiah 53:5). \nDuring his exchange with Abraham, God listens to Abraham’s plea and gives the people a chance. “The LORD said, ‘If I find fifty righteous people in the city of Sodom, I will spare the whole place for their sake’” (Genesis 18:26). They continue to talk, and that number of fifty is reduced to only ten (v.32). But sadly not even ten can be found. God still saves Lot—Abraham’s nephew and the familiar face Abraham knows and loves. God’s mercy is always there and greater than we expect, even when most people reject it.\nWithout Christ, it’s our own hearts that resemble that plain of smoking ruins. Even after receiving the Holy Spirit, we still wrestle with sin. We routinely choose to submit to our own will instead of the Spirit. Our sins may not seem as flagrant as those of Sodom and Gomorrah, but we are all sinners in need of grace. \n\nHallelujah! Christ has broken the curse of sin and death. Even now, Christ—the exact expression of the Old Testament God with whom Abraham bargained and pleaded for the lives of his community—invites us to accept the gift of eternal life. He is for us, and His mercy is greater than we think. Remembering this, may we echo Abraham’s plea for the redemption of our own hearts, our city, and our world. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-12-1-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Galatians 3:27-29",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor those of you who were baptized into Christ have been clothed with Christ. There is no Jew or Greek, slave or free, male and female; since you are all one in Christ Jesus. And if you belong to Christ, then you are Abraham’s seed, heirs according to the promise. Galatians 3:27–29\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-13-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 15:6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse about Abram’s trust in the Lord—a reminder that our salvation comes by faith in God and His Son, Jesus Christ. \nAbram believed the LORD, and he credited it to him as righteousness.  —Genesis 15:6  \nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Amanda-Raines-SRT_Genesis-Lockscreen-14-576x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 20:1-18, Genesis 21:1-34, Proverbs 21:1, 1 John 1:9",
        "devo_title": "The Birth of Isaac",
        "devo_summary": "\nBY Claire Gibson\n\nI’ve never been pregnant. I’ve come to terms with the fact that, like Sarah (or Rachel or Hannah) in the Bible, I have been given the burden of infertility, a weight that I’ve kicked and railed against and sobbed about and finally, dutifully picked up—mostly because I had no other option. I don’t know if I will ever have a child born from my own body, but I know that if I did, I would join right along with Sarah in laughing. \nGod’s timing is perfect, and sometimes, pretty funny too. To think, Sarah had waited her whole life to have children, and only once her family was in disarray, did God choose to follow through on His great promise. After everything that happened, why now? Because when she was at her weakest, once again, He showed His great strength.\nThe Bible is full of humans, not heroes. We see in Genesis chapter 20 a story of fear, when Abraham tries to hide and protect his wife Sarah by claiming that she was his sister, only to nearly cause a massive tidal wave of destruction for Abimelech. What follows in close succession is Sarah finally giving birth to the child God promised: Isaac.\nBut even amidst the laughter and celebration, a shadow hovers over this family. After all, they didn’t wait patiently for God to follow through on His promise. Earlier in their marriage, Sarah encouraged her husband to have an affair with Hagar in order to bear a child. Now, she can’t fully enjoy God’s faithfulness, because the proof of her unfaithfulness is right there, mocking her, at the party. \nAre we any different? When God is good to you, what do you focus on? Are you wholeheartedly clinging to His goodness, or do you still see, out of the corner of your eye, glimpses and reminders of your own sin, lack, and shame? After all, how good can He really be? We see the answer in the second half of chapter 21.\nEven when Sarah sends Hagar and Ishmael away in a fit of rage, God continues to be good to them. He is loving and saving and kind—because that is who He is. It doesn’t matter if you see yourself as a promised child or a child whose background is questionable. None of this is conditional on who we are or what we’ve done, but rather on who He is and what He accomplished on the cross. \nGod’s promises always come true. He has promised to forgive our sins and guide our hearts, leading wherever He pleases (Proverbs 21:1). He promises to give us everything we need for life and godliness (1 Peter 1:3). He promises to come for us, and not to leave us as orphans (John 14:!8). The Lord did for Sarah all that He had promised. The Lord will keep His promises to us as well. That is who He is. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-15-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 22:1-24, Genesis 23:1-20, Isaiah 54:1, Hebrews 11:8-12",
        "devo_title": "Isaac Offered Up",
        "devo_summary": "\nBY Claire Gibson\n\nI really didn’t want to be assigned this passage. I’ve been a Christian most of my life, and still, when I read this passage about Isaac and Abraham walking up the mountain, I simply want to throw my Bible across the room. Why in the world would God ask Abraham to do this?\nThere are a host of things that God asks His people to do—things that, without faith and understanding of context surrounding these passages, seem really wild. Earlier in Genesis, God asked Abraham to circumcise every man in his household, even his servants. Today, Christians are asked to live in obedience to a lot of biblical commands which make no sense to the world and its culture today. We’re asked not to have sex outside of marriage. We’re asked to think of others as better than ourselves. We’re asked to go out of our way to give to and love others—even our enemies. These commands might seem obvious if you’ve been in church for a long time. But outside of the lens of faith, they really make no sense at all. Only God can give us the strength and faith needed to obey Him. \nAnd so, I’m left to believe that God must have given Abraham the strength and faith to obey even this—this seemingly insane command. Why would God have Abraham sacrifice this child, who he and Sarah had waited and longed for throughout the course of their lives? Why this child of the promise? If you remember Genesis chapter 21, you’ll recall that Abraham had just sent his other child, Ishmael, away. So now, if he were to go through with the sacrifice of Isaac, he would have no children at all. \nBut Abraham trusted God. He trusted that God was good. Abraham had learned that obedience to God brings greater blessing than pain. So, if God was asking him to surrender to something painful—something as horrific as losing his only son—then there must be an even more abundant blessing on the other side.\nI’m not sure I would have had the faith to walk up that mountain. But because Abraham obeyed, we now get to witness, through Scripture, the first example of substitutionary sacrifice, as God provides a ram in the thicket. Do you know who else walked up a mountain that led directly to an inconceivable sacrifice? Jesus.\nOnly when Jesus walked to Calvary, when the Roman guard slammed hammer into steel, through flesh, there was no ram in the thicket (Genesis 22:13). Jesus, the King of kings and Lord of lords, became God’s autobiography on earth. And God’s nature is not punitive—it is sacrificial. Jesus willingly obeyed the Father to the point of death—even to death on a cross (Philippians 2:8). And because of His supernatural, unexplainable, indescribable obedience, we now have peace with God. Thanks be to God for obedience and the peace that comes with it—things that we may not be able to understand, but can only pray to the strength and faith to emulate. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-16-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 24:1-67, Genesis 25:1-18, Psalm 37:23-24, Lamentations 3:22-23",
        "devo_title": "A Wife for Isaac",
        "devo_summary": "\nBY Claire Gibson\n\nIn 2009, I moved to Nashville to take a job at a middle school that had no central heat or air. That summer was hot, and I spent day after day in my new classroom, cleaning out closets stuffed with books, mice feces, and dust. By the end of my first week in a new city, I was exhausted, friendless and scared that I’d made a huge mistake in taking this job. \nThat weekend, a friend reached out and invited me to a concert with a group of friends. “This guy Patrick is planning it,” my friend told me. “Here’s his number.” Maybe I was desperate for new friends. Maybe all that time in an airless classroom made me bold. But I called, and a man with a deep, soothing voice answered the phone. Patrick and I talked for a long time. When we met later that night, I saw in his eyes something familiar and kind. Much to everyone’s surprise, we were engaged five months later. People thought we were crazy, and for the record, let me say this: we were.\nIsaac and Rebekah have an even crazier origin story. Camels, water troughs, long distances across foreign lands, prayers to God—all accumulated to create an arranged marriage between two people whose lives God would use to change the course of history. Their story is full of the kind of inexplicable coincidences that help us see God’s hand at work. I mean, what are the chances that Abraham’s servant would arrive at this well, at this hour? He asks her for water, and waits to see if this young woman will offer to quench the thirst of his camels as well. He’s searching for kindness, for goodness, for industrious character. And he finds it in Rebekah, the very first woman he meets.\nWhat are the chances?\nAs a Christian, I believe that God is constantly at work, guiding His people in the way they should go. Scripture tells us that “a person’s steps are established by the LORD,” and that “all [our] days were written in [His] book” (Psalm 37:23; 139:16). “We are God’s workmanship, created in Christ Jesus to do good works which he prepared in advance for us to do” (Ephesians 2:10). These are comforting truths when things seem to be going our way, but not so much when our circumstances seem to go awry, veering off into an unexpected direction. But even then, God is our protector, who never sleeps or slumbers (Psalm 121:4). He is always engaged with our lives, whether we realize it or not. \nAnd so it was with Isaac and Rebekah. Their story reminds me that God builds unlikely families, restores broken relationships, and heals us from what seems irreparable apart from Him. He promised to build a family through Abraham and his descendants, a family line that would eventually lead to the Messiah, our Savior Jesus, who was born into this world to redeem His own Bride, the Church. \nAfter pursuing and finding a bride for Isaac, his servant “knelt low [and] worshiped the LORD, and blessed the LORD,” the God of Abraham (Genesis 24:48). Jesus Christ pursued His own Bride, even to the point of death on a cross. May our response be to turn to Him in worship, thanking Him for His faithful love and mercies that never end (Lamentations 3:22–23).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-17-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 25:19-34, Genesis 26:1-35, Hebrews 12:14-17, James 3:13-18",
        "devo_title": "The Birth of Jacob and Esau",
        "devo_summary": "\nBY Claire Gibson\n\nWhen I was seven years old, my family went to Disney World. At the time, we lived in Virginia, which meant that in order to get to Space Mountain, we had to drive from the D.C. area all the way to Orlando. To survive an eleven-hour drive with three daughters under the age of fourteen, my parents came up with a plan. They told us that when we got to Disney World, we would all get $50 as spending money, but that any misbehavior during the drive would lead to a deduction from that amount. And so the drive began.\nA few hours later, their plan had backfired. Rather than sitting quietly, trying to maintain our $50 allowances, my sisters and I had devised a game of our own, in which we attempted to provoke one another into losing more and more of their allowance. Anytime one of us misbehaved, my mother would take out her notepad where she was keeping track of deductions. While one sister sulked, the other two would pull down an imaginary lotto-lever and shout “cha-ching!” \nWe weren’t all that nice to one another. But our misbehavior pales in comparison to the sibling rivalry recounted in the story of Jacob and Esau, twin brothers who came out of the womb as enemies. And their parents were no help. From the beginning, Isaac and Rebekah chose favorites, and that favoritism only stoked the enmity between these brothers.\nAt stake in this passage is Esau’s birthright, the inheritance he stood to receive as the firstborn of his family. Knowing the value of that inheritance, Jacob plotted against his older brother, as if land and money were a finite resource. Meanwhile, Esau didn’t place adequate value on his birthright. He was “immoral and irreverent,” selling “his birthright in exchange for one meal” (Hebrews 12:16). Know this: favoritism and strife is not God’s plan. In fact, the Mosaic Law will later forbid a father from favoring a younger son merely because he comes from a preferred wife (Deuteronomy 21:15–17). But for now, we see that Jacob uses the means at his disposal to manipulate his way into wealth. \nGod is not interested in breaking up families over dollars and cents. Perhaps the greatest problem with Jacob and Esau’s behavior is that they both forgot God’s character. They forgot that the same God who blessed Isaac also blessed Ishmael. God never runs out of goodness. He does not “dock” us for misbehavior, nor will He look favorably upon those who provoke others into deceit. God’s goodness exists equally for His dearly loved children. We know this, because Jesus calls us His friends (John 15:!5). \nJesus, the most favored Son of all, gave us the right to become His brothers and sisters, His co-heirs to the kingdom (Romans 8:17). He is willing to share the blessing. He knows there is more than enough blessing to go around.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-18-1-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 27:1-46, Genesis 28:1-22, Psalm 121:5-8",
        "devo_title": "The Stolen Blessing",
        "devo_summary": "\nBY Claire Gibson\n\nThis morning, I opened up Facebook to discover that a celebrity picked my friend’s book for her highly influential book club. Rather than experience a surge of excitement for my friend, I felt the sinking pull of sadness. I didn’t even pause for a moment to feel happy for my friend; instead, I rushed to despondency, dejection, defeat. One question screamed loudly, over and over again in my mind: Why not me?\nPeople have plenty of conversations these days about the dangers of comparison, but I rarely hear the “j” word: jealousy. Jealousy is dirty. It’s dark and venomous and seeps into my consciousness like poison. In those moments, I’m not just wishing I had it better; I’m wishing that the other person had it worse. Yikes. I try to swallow the sadness—I leave a comment, I say congratulations—and I mean it… eventually. But my initial reaction isn’t charitable or kind. \nMy heart’s natural posture isn’t to hope for the blessing of others; it’s to hoard every good thing for myself. I have to keep that ugly truth in mind as I read today’s passage. I’m not all that different from Jacob. And if I had the chance to skew my future for the better, I might just put on some goatskins too. \nThe rivalry between these brothers, stoked by the favoritism in their parents, creates a toxic ripple effect that flows out for many generations. In yesterday’s reading, Jacob entrapped Esau, and Esau stupidly traded his birthright for a bowl of soup. In today’s passage, Jacob schemes with his mother Rebekah to steal even more from Esau: his father’s blessing. Words are powerful, but these aren’t just words. When Isaac speaks a blessing over Jacob, he’s passing along a divinely ordained covenant with Yahweh. He’s telling the family secret. He’s bringing Jacob into the Abrahamic covenant, and essentially saying, “Through your family, God will redeem the world.”\nI have to wonder why Rebekah was so adamant that Jacob become the favored, blessed son. Maybe Esau was not that bright? We know he traded a huge inheritance for a bowl of soup. We’re told his wives were a thorn in Rebekah’s side. Maybe she saw that Esau’s poor choices could negatively impact the future. But no matter what her reason for favoring Jacob, her methods to secure his position were totally wrong. She offers no directness, no honesty. She initiates no difficult conversations. Her only tactics are manipulation and deceit.\nThe Bible is full of humans, not heroes. And yet, God still fulfills His promises to His people. Despite the fact that Jacob is a master manipulator, God continued to work out His plan through these sinful people, moving history ever closer toward a Savior who could save us from our jealousy, our deceptions, our fears. \nJesus lived a perfect life. He didn’t have to scheme to receive anything, because He created everything. And yet, for the joy set before Him—including an eternity spent with you and me—He endured the cross, scorning its shame, and sat down at the right hand of the throne of God (Hebrews 12:2; 1:3). And now, we have a brother in heaven. And He is the best brother, because He wants to share the gifts of His family with us (Romans 8:16–17). He hoards nothing.\nEven when I am faithless, He is faithful. Even when I am jealous, He is there, ready to forgive and put salve on those self-inflicted wounds. Even when I scheme to build my own earthly kingdom, Jesus gently turns my eyes back to the city with eternal foundations—the one built by God, and shared with me (Revelation 21:7). \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-19-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Psalm 37:23-24",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nA person’s steps are established by the LORD, and he takes pleasure in his way. Though he falls, he will not be overwhelmed, because the LORD supports him with his hand. Psalm 37:23–24\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-20-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 26:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse spoken by God to Isaac, reassuring Isaac of God’s presence with him. \n“I am the God of your father Abraham. Do not be afraid, for I am with you.” —Genesis 26:24 \nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Amanda-Raines-2019-12-19-22-52-22-SRT_Genesis-Lockscreen-21-576x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 29:1-35, Genesis 30:1-43, Deuteronomy 21:15-17, Psalm 63:1-4",
        "devo_title": "Jacob Deceived",
        "devo_summary": "\nBY Melanie Rainer\n\nMy family recently subscribed to a new television streaming service, one that walks me down memory lane with beloved after-school TV shows and movies that I watched as a kid. Revisiting those stories, and sharing them anew with my daughters, has been so much fun.\nNarratives shape us. Good stories can awaken our desire for eternity, reminding us of the good in the world, while lifting the veil on the darkest parts of the human experience. \nI think the story of Jacob and his two wives, sisters Leah and Rachel, checks all of those boxes. It is a story brewed in brokenness and stirred with deceit, envy, and deep sadness. As a kid, I thought it was so very sweet, a little like a fairy tale: How romantic that Jacob loved Rachel enough to work for seven years to marry her! \nBut revisiting the story as an adult unlocks deeper truths about what I’m reading. Laban used his power to deceive Jacob into fourteen years of labor. Leah was cast aside and considered ugly, while Rachel gloated over her favor with Jacob—that is, until Leah bore sons, while Rachel could not. What a desperately sad story about two broken marriages, rival sisters, and a deceptive uncle who repeatedly manipulated his kin for profits. \nJacob was deceived. Leah was rejected and unloved. Rachel was emptied out by envy. Laban saw profits instead of people. \nWhen Leah bears Jacob’s sons, she names them Reuben, Simeon, Levi, and Judah. With each son’s birth, she hopes that Jacob will love her. But by the time Judah is born, she seems to relent and refocus her affections on her God, saying, “This time I will praise the LORD” (Genesis 29:35). \nBetween Leah and Rachel and their servant women Bilhah and Zilpah, Jacob had twelve sons. These twelve sons would go on to be the patriarchs of the twelve tribes of Israel, and from the tribe of Judah, Jesus would be born. This son of the unloved wife would lead to the birth of the Messiah, who would bear the weight of every broken relationship. \nThe sad twists of this story lead us to look forward to the cross, because it is the only lens that allows us to see the grief and sadness that come from broken relationships more clearly. And yet, the good news of Jesus doesn’t change what we feel when we are mistreated, deceived, or utterly distracted with envy. \nEach of those scenarios tears at our relationships with other people, inevitably causing us to see people as less than the image-bearers God created us to be. We wound and are wounded. People become objects, wrong sources of our happiness (like Rachel was to Jacob), transactional sources of labor and economic gain (like Jacob was to Laban), or they make us the victim of our own disordered desires (like Rachel did to Leah). \nBut Jesus takes all of that–every objectifying, victimizing, heartbreaking, manipulative, broken interaction–and instead, offers us perfect healing and a gospel-paved way to reconciliation. As we read on, Jacob will experience total reconciliation with his brother Esau. While not every relationship experiences that kind of healing in this life, as we seek to treat other people the way Jesus treats us, we can lean on the shared gift of the gospel to be the common ground of grace. It is all we have to offer. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-22-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 31:1-55, Genesis 32:1-32, Genesis 33:1-20, Hosea 12:3-4",
        "devo_title": "Jacob Prepares to Meet Esau",
        "devo_summary": "\nBY Melanie Rainer\n\nI love this story. I think it’s because somehow I missed it growing up, and when I read it as an adult, it moved me to tears. I remember hearing the part of Jacob’s story from the end of Genesis 32, where he wrestles with God, but I’d never really heard his story from chapter 33—and this story has a happy ending. \nWe don’t actually get to say that very often about many stories in the Bible, and certainly not the stories in found in Genesis. In fact, every story about Jacob leading up to this one hasn’t necessarily been fun to read. Following Jacob’s narrative, we see that he chooses to collude with his mother in order to steal the birthright from his older brother Esau. He goes on to be deceived into marrying a woman he doesn’t love. And he is exploited by his father-in-law, Laban, forced into years of servitude. \nIn Genesis 31, Jacob begins to journey back to his home where he will meet his estranged brother, Esau. In stealing Esau’s birthright, Jacob wronged his brother terribly. And now, he brings his wives, children, and livestock on a journey to meet him again. He packs up a massive gift offering, trying to win Esau’s affections (or tolerance) with whatever he can give. \nHere’s the stunningly beautiful, perfect portrait of God’s free grace to us: Esau runs to Jacob, embraces him, and says “I have enough, my brother… Keep what you need” (Genesis 33:19). Esau’s reaction moves me to tears and makes me want to shout out in celebration—all at the same time—because this story is a picture of what God offers me. Their reconciliation is just a foretaste of our own reconciliation with our God: a redeemed relationship that we cannot buy, we cannot earn, and we cannot lose. I have wronged God. Apart from Christ, I was estranged from Him. Everything that Jacob did to Esau, I have done ten times over to everyone I know. \nI can imagine myself before Him. I’m trembling as I hold out my “good deeds” as an offering to Him, a way to make our relationship right, and He responds by telling me He not only has enough—He is enough. \nGod provided redemption through Jesus for His children, and His work on the cross is enough to cover every sin. Jesus secured the redemption of those who believe in Him. And the Holy Spirit seals us for the day of redemption, when we will live with God forever. Thanks be to God!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-23-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 34:1-31, Genesis 35:1-29, Genesis 36:1-43, Psalm 116:1-2, Isaiah 43:2",
        "devo_title": "Return to Bethel",
        "devo_summary": "\nBY Melanie Rainer\n\nAfter being married just three years, my husband and I moved away from the city I grew up in, all our friends, our families, and our church community. We left to attend graduate school in a state five hours away, which isn’t really that far, but in the post-move shock of everything being so painfully new, I struggled mightily.\nTwo years later, we moved again, closer to home in proximity and yet every day we felt further and further away from relationship. While we now had a baby, I still had no friends, which left me a particularly unhealthy combination of angry, sad, and lonely. In the end, we limped home in a moving truck with a baby who had just learned to crawl. And as I stood there in our new apartment, finally holding the keys in my hand, I wept. God had called us back to the place we had ached to be for so long. \nIn Genesis 35, God called Jacob home to Bethel, where He had first appeared to him. In Genesis 28, Jacob saw a stairway to God in a dream. And God made him this epic promise: “I will give you and your offspring the land on which you are lying… All the peoples on earth will be blessed through your offspring” (Genesis 28:13–14). In response, Jacob named the place Bethel, declaring, “Surely the LORD is in this place, and I did not know it … What an awesome place this is! This is none other than the house of God. This is the gate of heaven” (vv.16–17). \nSo when God called Jacob back to Bethel after many years away, Jacob reacted immediately. First, he told his family to purge their homes of any idols to false gods, promising to build an altar to worship the God who had been there in his “day of distress” and “everywhere” he had since gone (Genesis 35:3). When Jacob returned to Bethel, God gave him the new name of “Israel” and promised that both nations and kings would descend from him (vv.10–11). Jacob would set up an Ebenezer, a stone marker to remember and celebrate the Lord’s faithfulness in all circumstances.\nIn his hymn “Come Thou Fount of Every Blessing,” a twenty-two-year-old Robert Robinson declared:\nHere I raise my Ebenezer;  Hither by Thy help I’m come;  And I hope, by Thy good pleasure,  Safely to arrive at home.  Jesus sought me when a stranger,  Wandering from the fold of God;  He, to rescue me from danger, Interposed His precious blood.\nBecause of Jesus, we can claim the same promise of an eternal home, the door opened for us by His person and work on the cross. And we can pray, thanking, celebrating, and remembering the promises He has made to us in His Word, and that ultimately, our forever home is with Him. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-24-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 37:1-36, Job 5:2, Psalm 77:2",
        "devo_title": "Joseph Is Sold into Slavery",
        "devo_summary": "\nBY Melanie Rainer\n\nThe ugliest moments of my life have been marked by jealousy. It is perhaps my most defining sin, and it masquerades as pride, fear, insecurity, and relationship-crushing meanness. Envy dehumanizes everyone around me; it removes their own agency as creative, talented, smart image-bearers of God. I no longer see them as their own persons, but rather as measuring sticks for my own worth. Too often, I think, I’m better than so-and-so at that, but nowhere near as good as that other person. If jealousy is my economy, cynicism and narcissism are the currency I trade. If that sounds harsh or out of proportion, it’s not. I think that jealousy and envy are the root of most conflicts between people, and unadmitted jealousy festers and slowly destroys relationships. \nEnvy is threaded through the Bible, a throughline of sin from Cain and Abel, Rachel and Leah, Saul and David, the pharisees who watched Jesus draw crowds to Himself, and more. In history, art, and literature, examples are rampant. In Shakespeare’s Othello, Iago cautions Othello about such envy: “Oh, beware, my lord, of jealousy! It is the green-eyed monster which doth mock the meat it feeds on.”\nJoseph is the victim of his brothers’ jealousy, which robs him of his family, his home, his dignity, and almost his life. His brothers strip him of his robe and would have killed him, but sold him to a band of traders instead. It was perhaps the equivalent of death in their eyes: they expected to never see him again, and delivered the news of his death to their father Jacob. \nAs modern readers, we know how the story goes: Joseph trusts the Lord, and the Lord protects him. He rises to power in Egypt and eventually saves his family from famine and forgives his brothers. But the moment we read about today in Genesis 37 doesn’t have any of that goodness— only pain. And by not reading ahead, we can force ourselves to sit in the devastation wreaked by Joseph’s brothers. Jacob mourns the loss of his son and cannot be comforted. Joseph is sold again, this time to an Egyptian official. No longer in control, Joseph has lost all agency at the hands of his jealous brothers. \nThis is that same “green-eyed monster,” and throughout Scripture, we are warned against its fallout. Proverbs 14:30 cautions that “a tranquil heart is life to the body, but jealousy is rottenness to the bones.” Ecclesiastes 4:4 tells us that “all labor and all skillful work is due to one person’s jealousy of another. This too is futile and a pursuit of the wind.” And James 3:16 advises that “where there is envy and selfish ambition, there is disorder and every evil practice.” \nScripture certainly doesn’t hold back about the consequences of jealousy, and neither should we. As I read about Joseph’s story, I’m aware that I should “let it read me”: Where is my jealousy hurting people that I love? Where is it corroding my heart and sowing disorder? Where is it disordering my priorities away from Christ and toward my own selfish gain? These are important questions to ask because jealousy isn’t something to be taken lightly. My prayer is that I never will.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-25-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 38:1-30, Deuteronomy 25:5-10, 1 Timothy 5:8",
        "devo_title": "Judah and Tamar",
        "devo_summary": "\nBY Melanie Rainer\n\nGenesis 38 breaks into the Joseph narrative with a bold, complicated, very broken story. Joseph is sold into slavery, and the very next verse we read is about his brother Judah. Judah was one of Leah’s sons, and Leah the wife that Jacob didn’t love. Judah was also the patriarch of the lineage of King David and Jesus. So this story, and Judah’s legacy, isn’t as much an interjection as an interlude that gives us a glimpse of God’s grace and the amazing ways His promises were fulfilled despite all sorts of human interference. \nSome cultural background helps this story, because it’s a rather tangled web of relationships. Levirate marriage was a practice in the ancient Near East that was later codified in Deuteronomy 25 as part of the Mosaic law. Basically, it meant that if a man died before he had a child, his brother had to marry his wife, and their first child would carry on the first (dead) brother’s name and place in the lineage. \nJudah had three sons: Er, Onan, and Shelah. Er married a woman named Tamar, and Er was so evil that he died. Onan married Tamar, but didn’t want to preserve his brother’s place in the lineage, and so he did not impregnate Tamar, and was killed for that sin. Judah had seen both of his sons die after marrying Tamar, so he hid Shelah away and kept him from Tamar. \nTamar, the widow who had the right to bear Judah’s eldest son’s child and continue the family line, responded. She dressed as a prostitute, tempted Judah, and conceived a child with him without him knowing who she was (Genesis 38:13–19). Later, when Judah found out she was pregnant, he threatened to kill her for adultery (against Shelah, whom she was technically betrothed to). When she revealed that Judah was, in fact, the father, he then admitted that he had wronged her. Tamar had twin sons, Perez and Zerah, and Perez continued the family line and his descendants included King David and Jesus. \nThat is a lot of background to unpack a story that is, at its root, a story of God’s faithfulness to a family. God had made a promise to Abraham. He made a promise to Isaac and to Jacob. And at so many turns, the promise appears threatened by someone’s sin. Judah almost destroyed what he should never have had in the first place: the blessing of the line of Christ. \nBut the author of this very complicated story is the Author of the ultimate story: the story where God wins, where His promises all come true, and we are given the free gift of grace purchased on the cross by Jesus, the Son of God who came to earth as a baby in the line of Judah. God can and does redeem the hardest, most impossible, most complicated stories. What a gift it is to be His.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-26-1-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Isaiah 43:2",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nI will be with you when you pass through the waters, and when you pass through the rivers, they will not overwhelm you. You will not be scorched when you walk through the fire, and the flame will not burn you. Isaiah 43:2\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-27-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 31:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize Genesis 31:13, Jacob’s reference to when God appeared to him in a dream. \nI am the God of Bethel, where you poured oil on the stone marker and made a solemn vow to me. —Genesis 31:13  \nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Amanda-Raines-2019-12-19-22-52-27-SRT_Genesis-Lockscreen-28-576x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 39:1-23, Genesis 40:1-23, Psalm 1:1-6, Psalm 25:14",
        "devo_title": "Joseph in Potiphar’s House",
        "devo_summary": "\nBY Erin Davis\n\nAt first glance, Joseph’s story reads like a set of extraordinary circumstances lived by an ordinary man. If that’s the case, it would be enough to hold our collective attention for a moment, but not one second more. So why is it we are still talking about him?\nJoseph was the favorite son of Jacob (Genesis 37:3). You may have heard of his coat of many colors, or perhaps the time his brothers sold him into slavery (vv.3, 27–28). Joseph stood firm against the temptations of Potiphar’s wife, even though doing so landed him in prison. (Genesis 39). He’s the one who relocated the baby nation of Israel to Egypt and protected them from eventual famine (Genesis 47). \nThese are the facts we see on the surface, but look again. There is an undercurrent to Joseph’s story that points to a deeper truth. We see it written all over Genesis 39. We read that the Lord “was with Joseph,” and when his master realized this, he also saw that “the LORD made everything he did successful” (vv.2–3). The Lord remained “with Joseph and extended kindness to him,” blessing “the Egyptian’s house” and making everything he did successful (vv. 5,21–23). It’s clear that while on a human level Joseph’s life was marked by betrayal, fear, and desperate circumstances, on the supernatural level, his story is about so much more—because of God’s favor. \nWhen Joseph’s brothers plotted his death— God preserved his life.\nWhen the schemes of man made Joseph a slave and a refugee—God gave him favor in a foreign land. \nWhen he was falsely accused and thrown in jail—God infused Joseph’s prison time with purpose. \nWhen there was no way for Joseph to free himself from his shackles—God set Him free. \nWhen Joseph was cut off from his family—God made a way for radical reconciliation. \nWhen Joseph lived in a land of famine—God filled his storehouses. \nJoseph was a nobody. Just an overlooked kid with a string of bad luck. Nothing to see here—but God. God was using the circumstances of Joseph’s life to tell a bigger, more important story: the story about His glory. \nGod’s story of grace is the undercurrent of our lives too. He proves His own love for us in that while we were still sinners, Christ died for us” (Romans 5:8). He remains faithful to us, even when we are not (1 Corinthians 10:13). He is “rich in mercy, [and] because of his great love that he had for us, made us alive with Christ even though we were dead in trespasses. [We] are saved by grace!” (Ephesians 2:4–5). \nThe reality of God’s grace turns every moment of rejection, every false accusation or overlooked achievement, every fear and every famine, into an opportunity to showcase His glory. He is the point—not us. Thousands of years later, we are still compelled to remember the story of a shepherd boy turned slave, who was transformed from a prisoner into a man of great power—not by Joseph’s strength of character or accomplishment, but by God’s design and power. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-29-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 41:1-57, Genesis 42:1-38, 2 Corinthians 3:5, 1 Timothy 1:16",
        "devo_title": "Joseph Interprets Pharaoh’s Dreams",
        "devo_summary": "\nBY Erin Davis\n\nOf all the drama and intrigue contained in Genesis 41 and 42, these four words capture my attention the most: “after two whole years” (Genesis 41:1, ESV). Joseph sat in a foreign prison, innocent of the crimes he was accused of committing—for two whole years. That’s a long time to wait for your rescue, a long time to wonder if a savior is coming, a long time to pray for God to come through. Except, on God’s redemptive timeline, it isn’t. When God decided to restore Joseph, it happened in the blink of an eye: “Then Pharaoh sent and called Joseph, and they quickly brought him out of the pit” (v.14). \nThough I know the stories in God’s Word aren’t about me, I can’t help but identify with Joseph. I’d go all in on the bet that you can identify with him too. Here we sit, longing for our rescue. We’ve got heartaches and breaks we want mended. We’ve got needs we cannot meet for ourselves. We’ve got broken bodies, broken homes, and broken cultures. There are times our fallen world feels like a prison. In Christ, we have been made new (2 Corinthians 5:17), but it doesn’t always feel like it. We are still waiting for complete deliverance from our brokenness, and we have been waiting our whole lives. And yet… “in a moment, in the twinkling of an eye, at the last trumpet… the dead will be raised incorruptible, and we will be changed” (1 Corinthians 15:52).\nWhatever it is that you’re waiting for God to do, whether you’ve been waiting two years or two decades and even when the wait feels like it will last forever, there is hope worth holding on to. Someday, when Christ returns for His bride, we will exchange prisons for the fullness of His presence, pits for His perfect peace. \nThe wait often feels like it’s lasting too long—except, on God’s timeline, it isn’t. Watch for Jesus with hope that is rooted in expectation, knowing that the wait, no matter how long, will not have the last word.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-30-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 43:1-34, Genesis 44:1-34, Genesis 45:1-28, John 12:25, Philippians 2:5-11",
        "devo_title": "The Return to Egypt",
        "devo_summary": "\nBY Erin Davis\n\nI’ve always been fascinated by geodes. They’re unremarkable on the outside; to the untrained eye, they just look like rocks (often ugly ones). But crack a geode open and you’ll find your breath has been taken away. Each one is filled with a tiny city of crystals that shine and sparkle in a spectacular variety of colors and formations.\nThere are many geodes in Joseph’s story, moments that are unremarkable at first, even ugly. But as the Bible cracks each one open and all is revealed, our breath is taken away by the beauty God brings about in the midst of the ugly and unremarkable.\nOne geode is the silver Joseph snuck back into the sacks of his brothers. Genesis 42 records: “Joseph then gave orders to fill their containers with grain, return each man’s silver to his sack, and give them provisions for their journey. This order was carried out” (v.25). For Joseph, this was a moment of generosity. He opted to give blessings to the brothers who had taken so much from him. But to the brothers, who could not scrub the blood of their brother from their hearts and hands, the money was a curse, highlighting their sin and guilt. \nThere are both blessings and perceived curses in our lives. We think we can distinguish the difference between the two. Blessings look and feel good. Situations that seem to be cursed, in our limited, human perspective, do not. But what if blessings and burdens are in cahoots? What if God can use the seemingly unremarkable and ugly parts of our lives to reveal His goodness and provision?\nWhen the famine forced his brothers to return to Egypt a second time to purchase grain for their hungry families, it was the silver in their sacks that brought them back to Joseph. Without money to return, surely they would have avoided the foreign ruler who imprisoned them, kept their brother Simeon, and ordered them to bring him their beloved baby brother. But once the geode was cracked open, deep beauty was revealed. \n“Then the steward said, ‘May you be well. Don’t be afraid.  Your God and the God of your father must have put treasure in your bags.  I received your silver.’ Then he brought Simeon out to them” (Genesis 43:23). \nThey returned the silver, and brought their brother Benjamin to Joseph, and Simeon was returned to them. But look again. Standing in their brother’s presence, reconciliation was possible. The family was reunited and brought together to live in the thriving nation of Egypt.\nLook again. Crack open another geode. The events of Joseph’s story set the stage for Israel’s later enslavement by a new Pharaoh. That moment of history is ugly, but look at how God continues to work. Israel’s deliverance through Moses, the Passover, and the parting of the Red Sea. Keep looking. Keep cracking. From the nation of Israel came our Savior whose birth seemed unremarkable and death was horrific, but whose sacrifice granted us salvation—the greatest treasure of all. \nThere is no way to know the riches God can bring in the ugly, rocky places of our lives. We can trust the treasure is there and that in His timing, beautiful, sparkling gems will be revealed.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-31-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 46:1-34, Genesis 47:1-31, Genesis 48:1-22, Psalm 31:19",
        "devo_title": "Jacob Comes to Egypt",
        "devo_summary": "\nBY Erin Davis\n\nSometimes the language of Scripture is so tender, I’m tempted to look away. We find such a moment in Genesis 48. When Jacob sent his favorite son on a simple errand to check the family pasture, that son, Joseph, was barely out of boyhood. Scripture tells us he was just seventeen years old (Genesis 37:2). But Joseph never came home. Jacob believed the story his other sons told him, that his favorite boy was dead. He must have mentally buried all of his hopes for Joseph’s future. \nIn the unbelievable providence of God, Jacob was reunited with his boy. But Joseph wasn’t a teenager anymore. The son Israel lost now had sons of his own, and Israel’s hopes for his boy were suddenly resurrected. You can almost hear the wonder and surprise in his voice when he looked at his grandsons for the first time and asked, “Who are these?” (Genesis 48:8).\nIsrael wasted no time on icebreakers. Seeing your children taken and returned has a way of cutting through the trivial. “Bring them to me and I will bless them,” he said (v.9). Scripture describes Jacob as a tired old man, with eyes that didn’t work like they used to (v.11), but he had seen enough in his life to know to hold his blessings close. Knowing this, these words in particular from this interaction put a lump in my throat: \n“Then Joseph took them from his father’s knees and bowed with his face to the ground… then [Jacob] blessed Joseph and said…  ‘the angel who has redeemed me from all harm— may he bless these boys’” (vv.12,15–16). \nThe image of Ephraim and Manassah sitting on their grandfather’s knee pulls every string in my heart. There’s such tenderness in this moment. Such precious, paternal prayer. The words of blessing Jacob spoke over his grandsons weren’t grandiose. Though Jacob wrestled with God to secure his own blessing (Genesis 32:22–32), for the next generation, he sweetly whispered “bless these boys.” It was a prayer God certainly answered—a prayer God is answering still. \nYou don’t have to strongarm God to get Him to listen. Brute force is not the secret to praying with power. Lift your babies onto your knee. Grab a friend. Pull her close. Simply ask God to bless the ones you love. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-32-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 49:1-33, Genesis 50:1-26, Isaiah 55:8-9, Romans 8:28-30",
        "devo_title": "Joseph’s Kindness",
        "devo_summary": "\nBY Erin Davis\n\nAt the end of the day, and the end of our lives, we all want to be carried home. \nIsrael experienced the dysfunction and joy of family (Genesis 28 and 29), life and death (Genesis 29–30, 35:18), abundance and famine (Genesis 30 and 42). He wrestled with God and walked with Him. \nThere is typography to all of our lives, highs and lows, peaks and valleys, times when God’s blessings flow like roaring rivers, and times when they seem like a barely trickling brook. Each individual moment, experience, or circumstance is just a snapshot; only God has the 10,000 foot view. And at every elevation, He is wooing us back toward home. \nThough Israel met the love of his life and experienced smashing success in Haran, he never stopped thinking about Canaan. Though his children and grandchildren put down deep roots in Egypt, he never shook the pull of home. After calling them to himself to offer one final blessing over each of them, he gave instructions for his own burial—not in Egypt, where Joseph was interred, but with his forefathers, in the cave found in a field, in the land of Canaan (Genesis 49:29–30). He told them: “This is the field Abraham purchased from Ephron the Hethite as burial property. Abraham and his wife Sarah are buried there, Isaac and his wife Rebekah are buried there, and I buried Leah there’” (Genesis 49:29–31). Israel wanted to rest with his people.\nWhether we are in a moment of success or failure, whether we find ourselves deeply rooted or adrift, whether in the highest of highs or the lowest of lows—our hearts ache for our true and future home. There is a longing, placed deep inside of each one of us, not for the land of our fathers, but the land of the Father. We know, deep down in our guts, that eternity with Him is where we belong. \nIsrael’s ache exists in each one of us. Like him, we want to know that we won’t have to stay forever in this foreign, broken land. In every peak and every valley, we can cling to this hope: in Christ, our homesickness will be satisfied. Someday soon—it won’t be long now—we, too, will be carried home. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-33-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Psalm 31:19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHow great is your goodness that you have stored up for those who fear you and accomplished in the sight of everyone for those who take refuge in you. Psalm 31:19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/SRT_Genesis-Instagram-34-1024x1024.jpg"
    },
    {
        "book_title": "Genesis",
        "devo_passages": "Genesis 50:20",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nIn this week’s verse, Jacob extends kindness and forgiveness to his brothers, demonstrating his trust in God’s ultimate goodness and sovereignty. \nYou planned evil against me; God planned it for good to bring about the present result— the survival of many people. —Genesis 50:20 \nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/Amanda-Raines-2019-12-19-22-52-33-SRT_Genesis-Lockscreen-35-576x1024.jpg"
    }
]