[
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 1:1-11, Titus 3:4-7",
        "devo_title": "God’s Command to Hosea",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Hosea 1:1-11, Titus 3:4-7\nI spent many years being a wanderer. In many ways, I still am.\nMy heart is easily distracted by false loves, things I imagine will bring me life when all they really do is pry my eyes from the truer life I’ve already been given.\nWhen David and I got married, a family friend—a man his father’s age who’d known David since he was a boy—pulled him aside a day before the ceremony. The words he spoke were not merely advice; they were a mandate, an imperative. Be faithful to your wife, he said. You aren’t immune to infidelity; don’t give yourself the opportunity.\nNot a year goes by where we do not remember his advice, admitting our brokenness to one another and praying God’s grace on the promise we made all those years ago.  \nAt heart, I am Gomer. I am a woman who sabotages love in spite of what I know to be true. I did it when I was younger, “looking for love in all the wrong places,” as the old country song puts it. And I do it now, looking for love in the praise of others, in social media likes, and even in the refrigerator late at night. I hear the call of my false loves every day. And every day, I hear the faithful call of my One True Love, the God who made me for love in the first place.\nHere is what the Lord said to the prophet Hosea when Israel was going her adulterous way:\nGo and marry a promiscuous wife\nand have children of promiscuity,\nfor the land is committing blatant acts of promiscuity\nby abandoning the Lord.\n– Hosea 1:2\nThe word “promiscuous” here is a heavy word. Other versions translate it as “wife of whoredom,” “wife of harlotry,” or even “prostitute.” The woman God was calling Hosea to pursue was not just double-minded; she was actively and consistently deceitful, disloyal, and devious. She was all of us.\nIsrael was caught in a cycle of sin, and God was ready to get her attention. Hosea was to show Israel her sin, literally, by taking an unfaithful wife and being faithful to her.\nGod’s judgment on His unfaithful people was more than clear. They were not fit to be His people. They were not fit to be His, period. And yet…\nYet the number of the Israelites\nwill be like the sand of the sea…\nAnd in the place where they were told:\nYou are not My people,\nthey will be called: Sons of the living God.\n– Hosea 1:9-10\nThe Lord, the perfect and faithful One, would have mercy, grace, and compassion on Israel, the always-unfaithful ones. God said of Israel, “I will deliver them by the Lord their God. I will not deliver them by bow, sword, or war, or by horses and cavalry” (Hosea 1:7). This would be no worldly rescue. This would be the promised salvation of God’s people by the Almighty God Himself, a promise established from the first sin of the first man and woman in the first book of the Bible (Genesis 3:15).\nThe consequences of sin were real and painful, but the rescue would come—not by the merit of those being rescued, but because of the merciful grace of God.\nAnd that, friends, is the theme of this book we begin reading today. The book of Hosea is a treatise on the unworthiness of sinners and the graciousness of God. We are wanderers, all of us. We run after false loves while the Father runs after us. But, praise the Lord, His faithfulness is greater than our sin.\nHe saved us—\nnot by works of righteousness that we had done,\nbut according to His mercy,\nthrough the washing of regeneration\nand renewal by the Holy Spirit.\n– Titus 3:5\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram1s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 2:1-13, Ezekiel 21:1-7",
        "devo_title": "Not My People",
        "devo_summary": "\nBY Guest Writer\n\nText: Hosea 2:1-13, Ezekiel 21:1-7\nWhen I was in college, I volunteered as a Young Life leader. That meant I spent my afternoons driving to a local high school, only to awkwardly walk through the cafeteria, trying to befriend high school girls, and eventually, tell them about Jesus. \nEvery summer, we took hoards of high schoolers to a camp in Colorado, where we promised they’d have the “best week of their lives.” Midnight obstacle courses, pool parties, and delicious family-style meals were all punctuated by “club,” a gathering where we’d scream songs at the top of our lungs, and then later quiet down and listen to a speaker talk about God and this man called Jesus. About three days in, the speaker stopped talking about God and started talking about sin, something he told hundreds of teenagers they were powerless to fix.\nThat day was never fun. And neither is today’s passage from Hosea.  \nHad I read these verses a few years ago, I would have written a true but shallow reflection. Something about how angry God gets at our sin, and how grateful we should be for Jesus. Back then, I knew I was an adulterer theoretically. But practically speaking, I’d done a pretty good job of following the rules. \nNow, here I am, reading these verses with new eyes, on the other side of a marathon of misplaced affections. Angry at God and threatening to sabotage my relationships and even my marriage, I chased down false loves I knew were off limits to me: a job that took me away from home, clothes and experiences that were out of my budget, a belief that freedom existed outside the walls of my life rather than within them. I ran hard. God wasn’t giving me what I wanted, so I pursued other gods instead.\nNow, here I am, reading from God’s Word, “This is what the Lord says: I am against you” (Ezekiel 21:3). Are there any more terrifying words? But when I am pursuing sin, I need the Lord to oppose me. I need the Lord to intervene.\nOn a Saturday in April, sitting in a grassy field in the middle of Tennessee, I held a cell phone to my ear and cried my eyes out to a dear friend who had watched me choose that futile path. “I’ve been running for so long,” I cried to her. And her response came slowly, softly. “That’s the thing about God. When you’re running, He’s in hot pursuit. And He will take you down.” \nLet me say this from firsthand experience: getting taken down by God doesn’t always feel good. The New Testament tells us that God’s kindness leads us to repentance (Romans 2:4). But that kindness, in the moment, may not always feel so kind. It can be mortifying. Embarrassing. Oftentimes, it is public, because our Lord is the King of bringing things from darkness into the light (Luke 1:79). \nHe could turn us back to Him with a soft and tender hand, and often, He does. But sometimes, His kindness comes with thornbushes, with walls in our way (Hosea 2:6). With shipwrecks and blindness and the belly of a whale. He turns us back with Calvary—the bloodiest kindness of all. \nThat’s what made those days in Colorado so powerful: watching teenagers learn the joy of a grace that is greater than our sin. God has once and for all redeemed our lives with the cross. We are His. And because He is holy and loving, and because we are His children, He will not tolerate our false gods or sit idly by while we run from Him. \nPraise God, He takes us down.\n\n\nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram2s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 2:14-23, 2 Samuel 12:1-10",
        "devo_title": "You Are My People",
        "devo_summary": "\nBY Raechel Myers\n\nText: Hosea 2:14-23, 2 Samuel 12:1-10\nMan, I love being on the right side of an argument. \nBeing “righteously right” is more satisfying to me than a dark chocolate-covered pretzel (and those are pretty darn good). Sure, I’ll forgive you—just as long as you know I’m the one administering the mercy, and you’re the one admitting your shortcoming. It’s restoration on my terms and with my limits. You’re welcome.\nNot super attractive. Not to my kids, not to my husband, not to the people I work with, and not to the One seated on the Mercy Seat. \nBut mercy isn’t about our righteousness. We don’t grant mercy because we are more and someone else is less. We grant mercy because we have been granted mercy. Period. We watch God, in His Word and in our own lives, act in mercy toward us every day. He requires us to repent but He doesn’t make us grovel. He invites us, just like He invited Israel, to return from how very wrong we are. And He makes us right because He is righteous. Because we have been shown real mercy, we can begin to learn to show the same.\nDo you see the way God demonstrates mercy to His people in today’s reading? Israel is wronger than wrong—deeply unfaithful and offensive—and God makes plans to allure His unfaithful bride with tenderness. And my favorite: He promises to make the Valley of Achor (also known as the “Valley of Trouble,” a place synonymous with sin and death) into “a gateway of hope” (Hosea 2:15). Not even a gate—a gateway!\nGod makes it easy for us to come home too. He laid out the welcome mat for unfaithful Israel in spite of their wandering and unwillingness to return His faithfulness. God’s unrelenting love was just that—it never stopped inviting. And it never stops inviting and pursuing us. Not only does God’s faithful love save us, it also teaches us. It shows us how to show mercy—how to be unrelenting in our tenderness, offering gateways of hope because the same has been done for us. \nAs we read the book of Hosea, we learn no one is beyond the reach of God’s forgiveness. No one is too wrong to receive mercy. God may bring judgment and consequence for our sins, but His ultimate aim is restoration, as demonstrated even in the way He renamed Hosea’s children. \nHe calls us His people too. He calls you His person. His Word teaches us—from Eden’s fig leaves, to Hosea’s family, to the very line of David—that God is in the eternal business of turning condemnation into restoration. This restoration is for us to receive, and for us to offer to others. Being righteously right won’t get us anywhere, but joining the Father in His business of restoration is work worth doing well. Receive His invitation today, friend. Receive His mercy. \n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram3as.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 3:1-5, Romans 5:6-8, Exodus 20:1-3",
        "devo_title": "Waiting for Restoration",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Hosea 3:1-5, Romans 5:6-8, Exodus 20:1-3\nIt started the way these things always do. I ate a cookie and wanted another one. \nBut here’s the catch: Although it tasted like gooey, chocolatey goodness, it was technically considered a protein bar, something you’d proudly toss in your workout bag. But delicious and permissible? These things do not just happen. I felt like I’d unlocked THE secret to eternal snacking bliss. \nGomer’s story starts the same way. She was hungry for love, and she had it in her husband, Hosea. But she wanted more. Her desire was delicious and permissible—until it wasn’t. And Hosea was left with something far from what he’d hoped for, not unlike the cardboard box that had arrived at my door a few weeks later. \nThat box was unexpectedly heavy, underscoring the compromises I’d made on flavor and price in exchange for a pantry filled with a lifetime supply of healthy “cookies.” As I opened the box, red and green labels signaled that my online order of “seasonal” and “limited edition” delights actually meant Christmas (it was May) and crusty (with mold, you guys). So here I am, stuck with a pantry full of rotten, non-returnable snacks. Incidentally, can I interest anyone in a “Snickerdoodle”? \nAlthough I’m unsure about their stance on snickerdoodles, we know the Israelites loved raisin cakes. They piled them high and gorged themselves full in observance of the law and idol-worship. We see an illustration of their rebellion through Gomer; their pursuits of dried fruits and her chase after pitted romance would not lead to the one True Vine. \nAs a result, Hosea and Gomer’s marriage exited the honeymoon phase quickly—but they aren’t the only ones. Before we point fingers or assign blame, we ought to remember this truth: God is in a terrible marriage, too—with us—one He should have divorced from long ago.\nHe loved us first.\nWe loved sin more.\nHe made us without shame.\nWe dirtied the white dress.\nHe gave us a covenant.\nWe didn’t show up to the altar.\nYou cannot know how many healthy cookie bars are stuffed in each of my kitchen cabinets, a daily reminder of my unexpected, unwanted purchase. I can’t help but wonder: Was Hosea filled with the same regret? Is God? \nHosea is fully aware of Gomer’s adultery, yet God tells him to pursue her still.\n“Go again; show love to a woman who is loved by another man and is an adulteress, just as the Lord loves the Israelites though they turn to other gods and love raisin cakes” (Hosea 3:1).\nHosea doesn’t have enough money to buy her back, so he pays for her with 15 shekels and 5 bushels—the price of a slave (Exodus 21:32). \nGod is all-knowing of our unfaithfulness, yet He pursues us still. He gives everything He has to buy us back, paying for us with His Son and a cross—the price for the ungodly (Romans 5:6).\nWe are His runaway brides, but He will not divorce us. May we return to Him with awe. Amen. \n“Then God spoke all these words: I am the Lord your God, who brought you out of the land of Egypt, out of the place of slavery. Do not have other gods besides Me.”\n– Exodus 20:1-3\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram4s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 4:1-19, Proverbs 19:2, 2 Corinthians 4:3-6",
        "devo_title": "God’s Case Against Israel",
        "devo_summary": "\nBY Guest Writer\n\nText: Hosea 4:1-19, Proverbs 19:2, 2 Corinthians 4:3-6\nI was raised in the church, which means I speak “Christian” rather fluently.\nTerms like “quiet time” and “sinner’s prayer,” or cautionary calls to “guard your heart” and “pray for a hedge of protection”—I know all the buzz words. When I went to seminary, I learned even bigger words like “sanctification” and “justification.” Between my background and my education, you could say I know a lot about the Bible. \nHowever, I need to confess something about all that “knowledge.” Sometimes, I coast on it. Sometimes, I rely on my familiarity with Scripture, instead of actually opening up God’s Word. Sometimes, I assume what Jesus’ response would be, instead of looking it up for myself. Sometimes, I quote verses that fit the situation, instead of exploring Scripture for a fresh perspective. And sometimes, I substitute vague, scattered prayers for intentional time in God’s Word.\nI can go weeks without actually reading the Bible, and no one will ever know. I can mask my neglected faith as a flourishing one, simply because I know the right answers. \nBut I can’t do it for long because I am a human being, and human beings forget. We forget God’s faithfulness and we forget His truths, which means we must return to His Word daily. Like water, like food, we must consume Scripture day after day, because our broken minds will struggle to recall it. No matter how familiar we are with God’s Word, we will forget it.\nThis is exactly what happened to the Israelites in Hosea. Israel was a people whose history was intertwined with God. His Word and His truth were written into their very identity. And yet, God had this against them:\n“My people are destroyed for lack of knowledge” (Hosea 4:6).\nAccording to Old Testament scholar David Allan Hubbard, this “knowledge” refers specifically to the knowledge of God, a knowledge the Israelite priests had failed to pass on. The people of Israel had, collectively, forgotten who they were. They had forgotten whose they were. And throughout chapter 4, we see the terrible consequences of their forgetting. \nWhen you know a lot about God, it’s tempting to take that knowledge for granted. It’s easy to treat your soul like a hard drive, as if you can download the data and click “save.” But our hearts and our minds are more like leaky buckets. Given enough time away from the source, all the water eventually drains out. \nProverbs 19:2 tells us, “Desire without knowledge is not good, and whoever makes haste with his feet misses his way.” This verse discourages us from rushing to judgment, or letting our emotions carry us away, but it also has something larger in view. This verse is about the entirety of the Christian life. No matter your upbringing, no matter your desire to serve God, your soul requires daily doses of the knowledge of God. Without it, your heart will slowly wander astray. \nIn that sense, the story of the Israelites is a cautionary tale. The Israelites weren’t any different from you and me. They simply forgot. The truth of God, which gives freedom and life, was not a part of their daily diet, so their souls began to stray, and their lifestyles followed.\nI am always amazed at how easily we forget. No matter what God does, we forget. Without the “daily bread” of His Word, we can’t remember how to live. That is why, I suspect, there is a deeper invitation behind the simple words, “Hear the word of the Lord.” It’s not just a call to listen, but a call to life.\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, and mom of two boys. She is a regular contributor to Christianity Today and recently completed her Ph.D, which focused on cultivating the gifts of women in the church.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram5s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Titus 3:6-7",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nHe poured out this Spirit on us abundantly\nthrough Jesus Christ our Savior,\nso that having been justified by His grace,\nwe may become heirs with the hope of eternal life.\n—Titus 3:6-7\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram6s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 6:3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.  This week, we’re memorizing a verse that reminds us of God’s faithfulness:\nLet us strive to know the Lord.\nHis appearance is as sure as the dawn.\nHe will come to us like the rain,\nlike the spring showers that water the land.\n— Hosea 6:3\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/4-Hosea1.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 5:1-15, Isaiah 29:15-16, Revelation 3:19",
        "devo_title": "God’s Judgment",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Hosea 5:1-15, Isaiah 29:15-16, Revelation 3:19\nWe’d picked out the brown velvet curtains at Ikea not long after we got married, and hemmed them with the iron-on adhesive strip that came in the package. They hung in our first home and then in our second, even though they were about a foot too short with the higher ceilings and taller windows. I always meant to get around to changing them, or at least mending the falling-out hem; but come 2009, I decided I didn’t mind.\nShe was 2 years old that year, with wild, thin hair that stuck straight up and a smile so bright it could knock you out. Those too-short curtains were the perfect hiding place for her new favorite game: hide and seek.\nI have a few precious minutes of video of the usual scene: our little girl hiding conspicuously behind the brown dining room curtains, her pink sneakers poking out at the bottom and her giggle audible from the other side of the room. Her papa would sneak up slowly and the giggles would get louder, and she would squeal with delight as he threw back the curtain. Hiding was fun, but the true joy was being found.\nHosea chapter 5 is a painful read. Israel was playing hide and seek with her God, but this was no game. The people’s very lives were at stake, yet they kept turning to dead idols that reaped only destruction and desolation.\nGod warned them through the prophet. His tone, gentle and wooing in the first chapters, had become booming, insistent, firm. The call from the Lord was clear: Come back to Me. If you run, disaster awaits. I’m not saying it might destroy you; I’m saying it will.\nYet Israel was “determined to follow what is worthless” (v. 11). In verse 4, the prophet proclaimed:\n“Their actions do not allow them\nto return to their God,\nfor a spirit of promiscuity is among them,\nand they do not know the Lord.”\nThe sin did not disqualify them from returning and repenting; it kept them from returning and repenting. God’s warning to Israel was His mercy to them; so was His discipline. God turned away so that they might turn back to Him (v. 15).\nThe priests and the people of Israel hid in their idolatry and their sacrifices, hoping their rituals might hide their hearts. But there is no hiding from God. He sees all; and, even more, He knows all (v. 3). But as we often do, Israel hid anyway, their tell-tale sneakers sticking out from under the curtains of their sin. We hide, believing we know better, believing we and our “little-g” gods can outsmart the one true God.\nWe hide, but He seeks us out. He seeks us out so that we will seek Him.\nIsrael’s attempts at deceiving God resulted in her injury, just as He said it would. She turned to her little-g gods for healing (v. 13), and God kept pursuing. Like a lion, He prowled in guard of her heart, doing whatever it took to frustrate her desires for lesser loves, to thwart her attempts to run and hide (v. 14).\nAre you hiding today? I am. I feel the Holy Spirit calling my heart to return from places where I’ve gone to hide from my sin, to hide from my own brokenness. Hear our God speak words of hard, merciful truth to us, His children:\nI know you, He says. You are not hidden from me.\nYou turn to false loves, but they cannot cure you. They cannot heal your wounds.\nSeek me. Return and repent (vv. 3, 14-15, my paraphrase).\nDear friend, there is joy in having the darkest parts of our hearts uncovered by our merciful Father. Surrender to the knowledge that you are known. You’ve been found out, you’ve been found, and you are loved.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram8s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 6:1-7:2, Matthew 12:1-8, Isaiah 26:16-19",
        "devo_title": "Faithful Love, Not Sacrifice",
        "devo_summary": "\nBY Guest Writer\n\nText: Hosea 6:1-7:2, Matthew 12:1-8, Isaiah 26:16-19\nAs a church culture kid, brought up on the lap of youth group events, Christian concerts, Bible camp, and the Awana Olympics, I somehow got the impression that overseas mission work was the highest calling a Christian could have. I truly and passionately loved God, so if that’s where the faith-action was, then that’s where I wanted to be. \nTo a wide-eyed high-schooler, anxious for adventure and an uncommon life, the abnormality of mission work appealed to me. I was ready to sacrifice BIG for God. But if I’m honest, that was mostly because I thought a missionary life sounded kind of flashy—daring, and even religiously “successful.”\nI took a handful of short-term trips (which, in all reality, probably benefitted me more than the people I went to serve), but I never became a career missionary, not in the way I had pictured, anyway. I was willing, but God had a different plan for my life. Today, my “mission field” looks strangely more like my childhood home than the jungles of the Amazon. \nMaybe you’ve wrestled through that tension, too. Can we be faithful to God in the ordinary, or do we have to do “big things” for God for our faith to be legitimate? \nIn Ephesians 4:1, Paul urges believers to “live worthy of the calling [we] have received.” But what does that actually look like? Hosea 6:6 helps us: \n“For I desire faithful love and not sacrifice,\nthe knowledge of God rather than burnt offerings.”\nThis verse shows us what God considers the highest devotion to Him, what He wants most: faithful love over sacrifice, a relationship with Him over our offerings.\nHave you ever had a nagging suspicion that giant sacrifices come more easily than quiet faithfulness? I have. It was easier to dream of living in a foreign land, leading whole villages to Christ, than it is to actually live a quiet, largely unknown, completely unflashy, but faithful life. To be loyal to God even when His plan for me doesn’t make for a great Christmas card.\nGod still expected the Israelites to bring the prescribed offerings and sacrifices to the altar. But those things weren’t what He wanted most of all. \nSo why would God prefer loyalty and faithfulness over big sacrifices? The answer is the echo of the love story woven throughout the Bible’s pages: God wants our hearts. He is jealous for our affection. He wants loyalty and faithfulness because that’s what you bring to the table when you are hopelessly in love with someone. He wants us to be head-over-heels for Him, and when we are, sacrifices will come easily. \nWhether our faithfulness takes us to the ends of the earth or leaves us right where we are, remember what He’s really after: us.\n\nJessie Minassian is an author, blogger, and speaker, who prefers to be known for her ability to laugh at herself, a weird obsession with nature-ish stuff, and a penchant for making up words. Learn more about Jessie and her ministry at LifeLoveandGod.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram9sa.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 7:3-16, Galatians 6:6-10, Romans 9:22-24",
        "devo_title": "God Has Not Changed",
        "devo_summary": "\nBY Raechel Myers\n\nText: Hosea 7:3-16, Galatians 6:6-10, Romans 9:22-24\n“Ephraim has allowed himself to get mixed up with the nations. Ephraim is unturned bread baked on a griddle. Foreigners consume his strength, but he does not notice. Even his hair is streaked with gray, but he does not notice. Israel’s arrogance testifies against them, yet they do not return to the Lᴏʀᴅ their God, and for all this, they do not seek him” (Hosea 7:8-10).\nHave you noticed something here?\nEphraim (the largest of the ten northern tribes, whose name is sometimes used to refer to Israel as a whole) has become an out-of-control, hot mess. Meanwhile, the people of Israel are so crazed with self-indulgence they can hardly tell what day it is. But I can’t help standing back a bit and noticing, in all of Israel’s wayward mindlessness as they run to Egypt and Assyria and every which way, God hasn’t changed.\nOh, He’s definitely watching. He sees them spiraling out of control, tossing their reputation out the window. He hears the other nations all whispering to each other about “God’s Chosen People” killing off their leaders, one by one, and getting fresh starts from their God, only to get all muddy again (Hosea 7:16).\nIsrael is two-faced and double-tongued.\nBut if we turn our attention from the squeaky wheel for a moment—if we tune out all the noise—we’ll notice this: God has not changed.\nHe has but one face and one tongue. One unrelenting love for His bride.\nWe want this passage to be about the rogue bride, or the prodigal son, and how Israel can’t seem to get it right. But it isn’t. It’s about God.\nGod’s character never changes. His one face is righteousness. His one Word is holiness. His one undying call to His people is love.\nAs the ever-faithful Groom, God remains. Even as His anger burns over the unfaithfulness of His bride, He forgives her. He provides for her. He gives her a fresh start. And in His severe mercy, He even withholds good things from her so that she might return to Him. While Israel hedges its bets on other gods, the Groom has all His focus on His one, true love.\nMaybe you don’t need me to spell it out for you today, but in case you do, hear this: you are His one, true love. Wherever you are, whatever you’ve done, whatever anyone else thinks of you, and however long it’s been since the last time you called Him your Groom—He hasn’t changed, and neither has His love for you. \n“But God proves his own love for us in that while we were still sinners, Christ died for us!”\n-Romans 5:8\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram10s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 8:1-14, Mark 2:15-17, 1 John 3:1",
        "devo_title": "Israel’s False Hopes",
        "devo_summary": "\nBY Guest Writer\n\nText: Hosea 8:1-14, Mark 2:15-17, 1 John 3:1\n“They sow the wind and shall reap the whirlwind.”\n-Hosea 8:7\nIt’s kind of an absurd picture to imagine. Pushing hard against a plow through air. Carefully planting seeds of air. Sweat beading down as you pull weeds from the air. No matter how determined and sincere the Israelites might have been in their efforts, they were applied to an absolutely immovable force: the wind, a force of nature. \nAll those miracles right in front of their faces, day after day, and still they were crouching out back, hammering little bits of metal together to fashion some other god to worship. It’s as if they were eager to put themselves in harm’s way, intentionally hunting down ways to insult and abandon the One who had loved and cared for and rescued them time after time. Israel was “a wild donkey wandering alone” (Hosea 8:9). They were a ridiculous people, trying to sow the wind.\nIn reality, we’re not so different from the Israelites. \nFear and pain and loss surround us. They threaten to rip out our hearts and swallow us whole. Daily we’re tempted to rely on our most sincere plans, determined to live out of our own strength. We strive hard to pile up some measure of security in an unstable world. Whether it’s on the job or in our relationships, we labor at the plow, striving to produce something—anything—that will prove our significance.\nWe avoid. We manipulate. We shop. We control. We produce. We sow the wind. We hope, but we hope in the wrong things. \nBut “this is what the Sovereign LORD, the Holy One of Israel, says: ‘In repentance and rest is your salvation, in quietness and trust is your strength, but you would have none of it’” (Isaiah 30:15). The Israelites were sinners, just like me and you. But, praise the Lord, Jesus came for wind-sowers like us (Mark 2:17).\nYes, life is painfully hard and the giants in the land are real. We are not enough for any of it, but He is. He offers us rest from our endless plowing. He offers us Himself. \nOur wrestling and questioning may never end. Sin will continually call us back to our self-sufficient wandering. But when we turn to God and repent, we exchange our demands of Him for trust in Him. When we recall His faithfulness, we’ll see we can put down our idol-making hammers and put all our faith in Him. And faith in Him is never in vain. \n\nLaura Pierce is a homeschooling, public-schooling, and private-schooling mom to six kids, ages 5 to 17. She and her husband, Rick, met in Bible school and have been married for 21 years. They love doing life in Kansas City, where Rick is a marriage counselor and Laura is a full-time mom.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram11s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 9:1-17, 1 Corinthians 6:9-11, Psalm 51:1-12",
        "devo_title": "Wanderers Among the Nations",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Hosea 9:1-17, 1 Corinthians 6:9-11, Psalm 51:1-12\nMy favorite room in our house is the dining room. True, it may be because we eat food there (and I do love food), but it’s more than that. It’s because of the way it makes me feel. I can’t put words to it exactly, but I knew it the first time I set foot in that room: it was home.\nThe intangible quality of feeling “at home” is as hard to replicate as it is to describe, but it is nonetheless deeply real—so real that we spend our lives trying to find it, create it, hang on to it. That’s why I can’t bear to change the color of our green paint-over-panel dining room walls. I want it to always feel the way it did the day I stood in the doorway and cried because I knew I was home.\nHosea chapter 9 is about home, but not the warm, fuzzy feeling I get when I walk into my green dining room at the end of a long day. Israel had forfeited all opportunities for true joy in their lives, in their families, and in their homes. Their blatant and persistent sin meant they were no longer welcome in God’s presence, not until they returned with repentant hearts.\nBut Israel was not interested in repentance. Instead, they settled into their sin, becoming at home in their shame. Listen to the sadness in the Lord’s description of their turning away from Him and unto their false loves:\nI discovered Israel\nlike grapes in the wilderness.\nI saw your fathers\nlike the first fruit of the fig tree in its first season.\nBut they went to Baal-peor,\nconsecrated themselves to Shame,\nand became detestable,\nlike the thing they loved.\n– Hosea 9:10\nGod’s people were called to be holy—set apart for Him alone. But they instead set themselves apart for Shame, the very opposite of their holy, just, and loving Father. What choice did He have but to kick them out of His house?\nI will drive them from My house\nbecause of their evil, wicked actions.\nI will no longer love them…\n– Hosea 9:15\nAnd that’s where the story would end without the gospel—with me, you, and Israel, sitting on the curb next to a heap of our idols, none of them able to save us or give us a forever home. There we would stay, bound to our shame and humiliation.\nShame is not the same as repentance, nor is humiliation the same as humility. It is not enough to be aware of our sin, wallowing in our brokenness. We must (and we may!) repent and return to our holy, gracious God.\nPraise the Lord, He loves even the wanderers. He seeks us out and beckons us home by the perfect sacrifice of His Son, Jesus. The Holy One invites us to exchange our worship of impotent idols for worship of Him, the only living God. He washes us of our guilt, breaks our chains of sin and shame, and binds us to Himself. Thanks be to God, we “who were far away have been brought near by the blood of the Messiah” (Ephesians 2:13).\nIn Christ, we are at home. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram12s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Psalm 51:1",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBe gracious to me, God,\naccording to Your faithful love;\naccording to Your abundant compassion,\nblot out my rebellion.\n-Psalm 51:1\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-instagram13s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 6:6 ",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. This week, we’re memorizing the key verse for Hosea:\nFor I desire steadfast love and not sacrifice,\nthe knowledge of God rather than burnt offerings.\n— Hosea 6:6 ESV\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/4-Hosea2.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 10:1-15, Matthew 11:28, Psalm 25:12-22",
        "devo_title": "His Discipline Is Loving",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Hosea 10:1-15, Matthew 11:28, Psalm 25:12-22\nThere are some passages of Scripture that are really hard to read because they don’t tell us pleasant things. This passage in Hosea is one of them; it talks to us about sin and about its undeniable consequences.\nI like it best when I can imagine Jesus patting me on the shoulder, saying, “Well done, good and faithful servant” (Matthew 25:23). But instead of patting me on the back, Hosea 10 kicks me in the pants.\nWhy would God say all this to us? Why can’t we skip over the nasty parts and hear about something nice instead?\nThe truth is, we cannot fully understand the gospel without this very real and difficult realization of sin. The gospel isn’t a “skip over the difficult stuff” message. It’s the answer to an ugly, deeply rooted problem in our hearts. On their own, our hearts aren’t naturally inclined to seek the Lord and do what’s right.\nWe may like to claim a kind of made-up righteousness of our own, but those are “mere words” and “false oaths” (Hosea 10:4). In truth, apart from God’s bountiful grace, we are like Israel. Our actions reveal what we really believe, that “we do not fear the Lᴏʀᴅ” (v. 3). That’s frightening, because Hosea tells us where all this leads: shame, judgment, and war. \nBut even in this passage about the darkness of sin, God shines a light for us. When God calls us to “sow righteousness” (v. 12), He’s not simply commanding us—He’s also beckoning to us. God is throwing a rope down into the well to pull us up out of the darkness and muck of our sin. \nFrom the deep pit of our own destruction and despair, we hear a steady, loving voice calling even now: \n“Sow righteousness for yourselves and reap faithful love; break up your unplowed ground. It is time to seek the Lᴏʀᴅ until he comes and sends righteousness on you like the rain. . .  Come to me, all of you who are weary and burdened, and I will give you rest” (Hosea 10:12; Matthew 11:28).\nHosea is a book about God’s wooing of an undeserving people. While the reality of our sin may make us want to run from God, the reminder that He desires good for us, not destruction, draws us close. Difficult passages like this remind us that God longs for our wandering hearts to return to Him and receive His cleansing grace. \nLet’s not wallow in our shame, but instead run with abandon back to our loving Father. As we do, He will continue to pursue us as He always has, to rescue us from even the deepest darkness of our hearts.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram15s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 11:1-12, John 6:32-40, Matthew 23:37",
        "devo_title": "The Lord’s Love for Israel",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Hosea 11:1-12, John 6:32-40, Matthew 23:37\nThe books had gathered dust in the corner of the room for too long, and I was finally putting them in their rightful place on the hallway shelf. I brushed off each one, shaking out the pages as dust particles danced in the sunlight. That’s how I found it—a torn strip of paper sticking out of the top of an old paperback. The words were written in crayon, in my handwriting: Mama, we’re always in the family, right? \nAs soon as I saw it I remembered. It was about two years ago, and all three of our children had become adorably addicted to affirmation. When they got into trouble, or sometimes just because, they would ask the question again. I’d written it down so I’d remember.\n“Mama, we’re always in the family, right?” Yes, of course, we’d say. You will always, always be part of this family. \nThey haven’t asked the question lately, now that I think of it. I hope this means they’re learning what it means to be a beloved child. \nWe’ve come a long way in the book of Hosea. We’ve seen Israel struggle to believe that God is who He says He is. We’ve seen them struggle to repent and obey. And while the whole book makes us ache with recognition of our own sin, these verses at the start of chapter 11 have to be among the most heartbreaking. \nWhen Israel was a child, I loved him,\nand out of Egypt I called My son.\nThe more they called them,\nthe more they departed from Me.\nThey kept sacrificing to the Baals\nand burning offerings to idols.\nIt was I who taught Ephraim to walk,\ntaking them in My arms,\nbut they never knew that I healed them.\n– Hosea 11:1-3\nGod had been with Israel from the beginning—loving them, providing for them, healing them, leading them “with ropes of love” (v. 4). He was faithfully their Father, but they had forgotten what it meant to be His beloved children. \nIt’s not hard to imagine ourselves in Israel’s shoes. Those shoes are where we live. We forget. We are unfaithful. We ignore the hand who heals us. But our sin is not the headline here. The headline is God’s faithfulness. \n“How can I give you up?” He asked His children, while they continued to wander in their idolatry (Hosea 11:8). Jesus echoed God the Father’s heart in the Gospel of John: “Everyone the Father gives Me will come to Me, and the one who comes to Me I will never cast out… This is the will of Him who sent Me: that I should lose none of those He has given Me” (John 6:37, 39). \nGod’s people scatter in their sin, yet Christ will lose none—not a single one. I am not the exception to that rule. Neither are you. \nIt’s true that we are Israel-caliber sinners. We get lost, wandering through the wilderness of our idolatry. But even when we’re lost, He never loses us. The Lion of Judah will roar as necessary, and His children will return to Him, trembling (Hosea 11:10). Trembling, but at home. \nChild of the Father, receive this affirmation today from God’s Word. The One who was with you in the beginning, who has raised you up as His beloved child, will not forsake you now. The sacrifice of His Son has covered your sin, secured your standing, and sealed your hope (Col. 1:14, Rom. 5:17, 1 Pet. 1:3-4). \nWith Jesus as your Redeemer, you are always in the family.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram16s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 12:1-14, Psalm 135:13, Isaiah 63:11-14",
        "devo_title": "Return to Your God",
        "devo_summary": "\nBY Guest Writer\n\nText: Hosea 12:1-14, Psalm 135:13, Isaiah 63:11-14\nI am a recent and reticent convert to hiking. Moving from the flat Midwest to a state of unending mountains, there is a certain peer pressure to become a more outdoorsy girl—the type who likes to hike. The problem is that hiking sounds wonderful to me in theory, but the reality of slowly trudging up and up and up is not always as fun.\nSo a couple hours into a spontaneous hike with my husband, I was ready to be done. Tired, hungry, and lost, it felt like we were getting nowhere and only increasing our chances of being eaten by a bear. Growing “hangrier” by the minute, I convinced my husband—at this point, probably more afraid of being eaten by me rather than a bear—to head back. \nAbout 50 feet back down the worn path, a woman came walking in the direction we had just abandoned.\nThis woman had hiked these woods before and she knew the mountaintop was just out of sight, beyond the ridge. She assured us the view from there was absolutely breathtaking and worth every inch of hiking heartache. How could we give up now knowing we were so close? \nFeeling a bit foolish, we did a 180-degree about-face, and with renewed hope in our step, we ascended to a clearing. Sitting in silence, staring out at mountains for miles, I realized what we would’ve missed if that woman had not encouraged us to keep going.\nIn our walk with God, it can be just as easy to get distracted, tired, and lost along the way. \nDo you ever feel like you’ve drifted too far from God to ever come back? Maybe you’re lost in the forest and don’t know just how close the mountaintop really is.\nThe book of Hosea reminds us that even when we are unfaithful, God is faithful. Even when we’ve given up, God pursues us. Our God called Hosea to take up a prostitute as his wife and be relentlessly compassionate to her. This demonstrated God’s character and just how much He loved wayward Israel—how He loves us, too, rebellious sinners though we are.\nGod declares loud and clear that there is nothing you can do to lose the Father’s love (Romans 8:31-39). \nIt can be difficult for us to really grasp the unfailing love of God because it seems so counterintuitive to the way we operate out of our humanity. When we’re hurt, our instinct is often to hurt someone in return or withdraw our love altogether. When people disappoint us time and again, we start to give up on them. To think we can hurt and disappoint God endlessly, yet He still draws near to us, is unfathomable! \nOur Lord isn’t some begrudging judge, waiting for us to shape up on our own. He comes to rescue us, helping us turn back to Him (Hosea 12:6). He is the loving Father, running unashamedly toward His prodigal child (Luke 15:20). He is the Good Shepherd who goes off in search of just one lost sheep (Luke 15:4).\nSometimes the climb is tedious and disheartening and downright painful. In those moments it’s tempting to give up and turn away. But what we might not be able to see through the trees is the most magnificent view up ahead: our gracious Father, extending His arms and calling us home.  \n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. Jesus dramatically changed her life in high school, giving her a heart for those who don’t yet know the love of Christ. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram17s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 13:1-16, Acts 4:11-12, 1 Corinthians 15:54-56",
        "devo_title": "I Knew You in the Wilderness",
        "devo_summary": "\nBY Raechel Myers\n\nText: Hosea 13:1-16, Acts 4:11-12, 1 Corinthians 15:54-56\nI mean. They should know better.\nThese people we’re reading about—the ones who “continue to sin” and kiss golden calves (Hosea 13:2)—are God’s people. The Chosen Ones. The ones He brought out of slavery in Egypt and provided for in crazy, miraculous ways. The ones He has been calling to Himself for whole chapters and books of the Bible, year after year, generation after generation. \nStill, thirteen chapters into the book of Hosea, no clanging cymbal or shockingly graphic simile is enough to shake Israel out of their sin and cause them to turn and repent. \nGod gave Israel food and water in the wilderness, but just as soon as they were satisfied, they forgot why they needed Him in the first place (Hosea 13:6). God is angry with Israel. Shoot, by this point, I’m angry with Israel.\nBut Ephraim isn’t the only chaff swirling around on the threshing floor (v. 3).\nThat’s me, too, Lord. Isn’t it?\nAnd so, our frustration with the Chosen People for being so maddeningly unfaithful to their Helper, turns inward. Their “He’ll be here when we need Him” attitude—putting God in a box on a shelf in case of emergency—sounds disquietingly familiar. \nEven waist deep into the book of Hosea, we may find we’re still not giving God the place He deserves in our lives—not up high on some shelf in a box, but on our door frames and at our tables and on our tongues (Deuteronomy 6:6-9). We belong in relationship with Him.\nWe may also realize that, like Ephraim, we sometimes talk about God’s grace like it’s a get-out-of-jail-free card (Romans 6:15). We can think of His anger as some kind of scare tactic, where we keep our heads down and toe the line. That might have worked for another generation, but it doesn’t really intimidate us anymore.\nBut God still knows us, even as we wander in the wilderness of our sin. He wants our hearts back. So He reminds us, “you know no God but Me, and no Savior exists besides Me” (Hosea 13:4). Amen?\nWe are broken, but He is faithful. We are rebellious, but He pursues. We stray. We become prideful and forget who He is. But our change doesn’t change Him. He still wants us back. And He comes for us. Oh, that we would always be amazed by His all-sufficient grace. \nWe are more unfaithful than we ever dared believe, but the God of Israel—and of our hearts—is far more faithful than we ever dared hope. Let’s go before our holy God today to thank Him for not giving up on us, even in our darkest moments.\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram18sn.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 14:1-9, Isaiah 61:1-4, Psalm 52:1-9",
        "devo_title": "Promise of Restoration",
        "devo_summary": "\nBY Guest Writer\n\nText: Hosea 14:1-9, Isaiah 61:1-4, Psalm 52:1-9\nI try to buy love.\nI have never felt loved freely, so I attempt to earn it somehow instead. I’m a slave to affection, to being loved, to gaining approval. I am an apostate, abandoning my faith and refusing to believe the gospel’s fullness for my life and heart. I buy my way into the affections of others by being winsome, being faithful, being silent, being whatever they need in that moment. \nI make a mockery of it—of the extravagant act of mercy the Son of God made on my behalf—every time I go on sinning so that grace may abound (Romans 6:1). I play hard to get, while at the same time longing to be caught in His infinite love and grace. I know the Truth in my head and struggle to wrestle it into my heart. \nLike Gomer, what I fail to see is I am already caught. I’m already the bride of the King of the universe, and I bear His name (Isaiah 54:5). I twist myself to repent of my apostasy, yet God says He alone will heal it (Hosea 14:4). He doesn’t just undo my sin; He heals it because I cannot.\nHe loves us freely, without cost, without money:\n“Come, everyone who thirsts,\ncome to the waters;\nand he who has no money,\ncome, buy and eat!\nCome, buy wine and milk\nwithout money and without price.\nWhy do you spend your money for that which is not bread,\nand your labor for that which does not satisfy?\nListen diligently to me, and eat what is good,\nand delight yourselves in rich food.”\n–  Isaiah 55:1-2\nGod’s love is wholly distinct and different from ours. God is love, while Hosea can only give love. Love is who God is (1 John 4:8). He cannot help but love fully, without cost to those He loves, save one: His Son.\nThere is nothing that can be done to earn God’s love; this is the primary message of the book of Hosea. In the face of adultery, abandonment, idolatry, deceitfulness—His love remains, without cost, without money. He remains and He loves us freely. \nAs you finish reading the book of Hosea, the illustration of God’s extravagant love and our constant rebellion, lift up your eyes from your sin. See your God, your Maker, your Groom in the fullness of who He is and what He has done. Stop twisting yourself to win His affection, and stop trying to heal your own rebellious heart. He has already chosen you—yes, you—to be His bride. \nBe His bride. Be healed. Be loved, Beloved. \n“I trust in God’s faithful love forever and ever. I will praise You forever for what You have done. In the presence of Your faithful people, I will put my hope in Your name, for it is good.”\n-Psalm 52:8-9\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, tweets @lorewilbert, and posts photos @loreferguson. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram19s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Revelation 3:19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n“As many as I love, I rebuke and discipline. So be committed and repent.”\n—Revelation 3:19\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Hosea16-Instagram20s.jpg"
    },
    {
        "book_title": "Hosea",
        "devo_passages": "Hosea 14:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. This week, we’re memorizing a verse about the ways of the Lord:\nLet whoever is wise understand these things,\nand whoever is insightful recognize them.\nFor the ways of the Lord are right,\nand the righteous walk in them,\nbut the rebellious stumble in them.\n— Hosea 14:9\n Write this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/4-Hosea3.jpg"
    }
]