[
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 1:1-18, Deuteronomy 31:1-6, Psalm 1:1-3",
        "devo_title": "Joshua Succeeds Moses",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Joshua 1:1-18, Deuteronomy 31:1-6, Psalm 1:1-3\nLike any reasonable person, I put no stock in fortune cookies. Still, I usually crack one open once I’m overfull from a generous plate of sesame chicken and rice. Despite my satisfied appetite, I nibble on a bite of the sweet shell while reading the words printed on the tiny slip of paper inside.\nI’m not sure why I have trouble resisting that treat at the bottom of my takeout bag. Maybe it’s my love of sugar, but I think it’s something more. In a world that seems to grow more uncertain by the day, we want a sure thing. We want to know what’s coming, what’s not, what’s next. We know a fortune cookie isn’t going to change our circumstances, but it’s fun to pretend, just for a moment, that it might.\nWhen the book of Joshua opens, the Israelites have come to the end of one long, unpredictable journey. Unpredictable as far as the humans involved are concerned, that is. The Lord—God Almighty, the Holy One—has been with His people each step of the way. He has never left them, never forsaken them, never taken back His covenant even when they gave Him a million sinful reasons to do so. And here, as Israel stands on the edge of the last leg of their journey to the Promised Land, He promises that His faithfulness will continue.\nListen to these phrases of certainty offered by both God and His newly appointed servant, Joshua, over the span of just 18 verses (emphasis mine):\n“I am giving [this land to the Israelites]” (v. 2).\n“I have given you [every place your foot touches]” (v. 3).\n“Your territory will be [where I’ve appointed it]” (v. 4).\n“I will be with you” (v. 5).\n“I will not leave you or forsake you” (v. 5).\n“You will distribute the land I swore to their fathers” (v. 6).\n“You will have success” [as you heed all of My instruction] (v. 7).\n“You will prosper and succeed” [when you observe My Word] (v. 8).\n“God is with you wherever you go” (v. 9).\n“You will be crossing the Jordan” (v. 11).\n“God is giving” [this land to you] (v. 11).\n“God will give you rest” (v. 13).\n“God will give you this land” (v. 13).\nAs profoundly complex as the situation seemed, it was also profoundly simple: God was keeping His promise, just like He always had and just like He always will.\nIsrael got the message, and they responded in kind: \n“Everything you have commanded us we will do, and everywhere you send us we will go. We will obey you, just as we obeyed Moses in everything” (v. 16-17, emphasis mine).\nIf you’ve read ahead, you know how this story ends. The God of Israel was completely faithful to His people. They did cross the Jordan, and they did take possession of the land He’d promised their ancestor Abraham 450 years earlier. You may also know that Israel did not hold to the “everything” and “everywhere” they’d promised. Yes, they followed Joshua. They heeded his instructions to prepare, to remember, to go (v. 11-13), but their faithfulness was only partial. Like a sieve, obedience slipped through the holes in their good intentions.\nTheir faith was not perfect, but God’s Word and faithfulness did not falter. \nThis Bible we open together today makes some bold promises. These are not fortune-cookie promises to be read one moment and tossed into the takeout bag the next. These are holy promises. These are true promises (Psalm 19:7). \nWhen we believe on Jesus Christ, we will be saved (Romans 10:9).\nThrough the gift of His Holy Spirit, Christ will never leave us (Matthew 28:20).\nBy His death and resurrection, Jesus has taken on our sin and granted us His righteousness (2 Corinthians 5:21).\nWhen God says “I will” and “I have,” He will and He has. \nPraise the Lord, His faithfulness fills in the cracks of our obedience! Praise the Lord, we can walk with courage and confidence into the certainty of a tomorrow where God will never leave us or forsake us. Praise the Lord that as co-heirs with Christ (Romans 8:17), every foot forward is another step on the journey of coming home to a place we’ve never been. \n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 2:1-24, Joshua 3:1-17, Numbers 13:25-33, Hebrews 11:31",
        "devo_title": "Joshua Sends Spies to Jericho",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Joshua 2:1-24, Joshua 3:1-17, Numbers 13:25-33, Hebrews 11:31\nWe’re in that phase of family where at least one, if not all three, of our children end up in our bed by the time the sun comes up. At some point in the night one of the little people in our home will inevitably wake. Rather than rolling over and going back to sleep, he or she will stand up, drag his or her sleepy self down the stairs, round the corner into our room, and climb into our bed, right between my husband and me.\nOther than the growing amount of room they take up in our comfy bed, there’s something else I’ve noticed about this nightly ritual. Our comfort-seeking kiddos always crawl in our bed and lie down facing their papa, every single time. Whether the culprit is a bad dream in their heads or a raging storm outside the window, their response is the same: they face their father.\nI love the juxtaposition of the stories we find in chapters 2 and 3 of Joshua. Two very different stories of God’s children choosing to face and follow their holy heavenly Father in the face of impossible circumstances. And in both situations, He proves Himself worthy of their unabashed trust and holy fear.\nRahab, a woman known primarily by her sin, met the one true God in a precarious time in the history of her homeland. She’d heard the stories of God’s stunning faithfulness to His people, and she knew they were coming to possess the land. Her neighbors were frightened by the evidence of His greatness; in Rahab’s own words, they were panicked (Joshua 2:9). But a different kind of fear was taking root in Rahab. She was coming to fear the Lord.\nBelieving the God of Israel was “God in heaven above and on earth below” (Joshua 2:11), Rahab risked everything to offer refuge to the two spies sent by Joshua into Jericho. In a culture of faithlessness, she dared to face full-on the holiness of God and follow Him in a bold act of faith. Later, her family would be spared because of it (Joshua 6:17).\nIsrael had seen God’s rescue not from afar but up close. When Joshua said to them, “The Lord will do wonders among you tomorrow,” they knew he meant it (Joshua 3:5). So Israel faced the ark of the covenant, which symbolized the very presence of the Lord (Joshua 3:10-11), and moved forward to take possession of the “land flowing with milk and honey” (Numbers 13:27). Even following the ark among the masses required faith. Surely the people remembered the time the scouts reported back to Moses, Aaron, and all of Israel that the promised land was inhabited by a people impossible to defeat. “They are stronger than we are!” the scouts cried out (Numbers 13:31). But they were not stronger than Israel’s God.\nIsn’t this what it’s like to follow the Almighty Lord? Sometimes, like Rahab, you walk the road alone, stepping out on nothing but faith and a holy fear of the God who rescues His people. Sometimes you move with the masses, direction clear as day, but a nagging doubt nonetheless. What if we aren’t strong enough? What if we’re defeated? Then the God of the impossible dries up a riverbed for your feet to walk across, just as He did when your wilderness journey began (Joshua 3:17; Exodus 14:22). \nFrom impossible to impossible, the road of faith is under the command of our sovereign God, beginning to end. A people with an impossible future and a harlot with an impossible past—both fixed their eyes on the only true God and neither were beyond the reach of His rescue.\nNo situation is beyond the sovereignty and strength of our God. He is the God of Abraham, of Moses, of Joshua, of Rahab. He is the same—yesterday, today, and forever (Hebrews 13:8). Fear Him in His awesome glory. Face Him in His limitless compassion. Follow Him wherever He leads, no matter the scene to your right or left. Fix your eyes on His presence and His promises.\n\n \n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 4:1-24, Joshua 5:1-15, Exodus 25:10-22",
        "devo_title": "The Ark Crosses the Jordan River",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Joshua 4:1-24, Joshua 5:1-15, Exodus 25:10-22\nI think I have a super-nose. It has twice identified dangerous fires in the nick of time, once diagnosed an ear infection in a baby, and can always sense any change in my husband’s morning ablutions. The poor man can’t wash his face with a different soap without my nose sensing the difference. I’ve learned never to ignore a smell because scents yield up so much valuable information.\nOur sense of smell also delivers when it comes to evoking memories. I learned to depend on smell when I was still young, so when I found myself in a moment that I wanted to impress on my memory forever, I used a scent to anchor it. Over time, I amassed a rolodex of lotions and perfumes that I used as markers for memory; I needed only to breathe in the scent to remind me of those treasured days. The smell of lime conjures up the peak of the Kahlenberg looking over the Danube River, and the smell of strawberry reminds me of our first apartment.\nPurposeful, intentional memory building is not my own clever invention; God used markers in the Old and New Testaments to memorialize significant moments in the lives of His covenant people. Just like the Israelites, we are “forgetful hearers” and we need help remembering God’s past faithfulness and His future promises (James 1:25).\nIsrael had both God’s promises and His faithfulness to remember, and their escape from Egypt was bookended by two unbelievable river crossings: the Red Sea and the Jordan River. God taught them to remember by establishing an equally unbelievable monument. He commanded twelve men to heave giant river stones out of the muddy riverbed on their shoulders and carry them to shore. They muscled these stones into an heavy pile. As the slimy green algae dried on the rocks, they stood back, wiping their hands, to look at what they had done, and saw an impossible, otherworldly monument. These were rocks from the very bottom of the Jordan River. They never should have been seen, and yet, because God miraculously stopped the river, they were stacked on the shore as a reminder of God’s impossible miracle for generations.\nThis unlikely mound of river rocks was a testament and a signal that this was the end of an era. No more would they be wilderness wanderers; they had finally come home. “And the day after they ate from the produce of the land, the manna ceased. Since there was no more manna for the Israelites, they ate from the crops of the land of Canaan that year” (Joshua 5:12). God underscored the end of their travels by putting a stop to the manna. They could set up homes, and grow their own food on their own land.\nAs they settled in to this wonderful home they had never known before, it would have been easy to forget how they got there. Their legendary victories were only achieved when they walked in obedience, and their devastating failures were a direct result of failing to obey God. The people of Israel were inclined to forget the source of their help, and we lean right with them in that same direction.\nEven as we set up memorials, using the power of sight and smell and our other senses to remember our lives, Joshua drives us to remember those old and sure memorials of God’s faithfulness. Israel’s epic victories were not undergirded by their own doing, but by God’s faithfulness to His promises. \n“In the future, when your children ask their fathers, ‘What is the meaning of these stones?’ you should tell your children, ‘Israel crossed the Jordan on dry ground.’ For the Lord your God dried up the waters of the Jordan before you until you had crossed over, just as the Lord your God did to the Red Sea, which He dried up before us until we had crossed over. This is so that all the people of the earth may know that the Lord’s hand is mighty, and so that you may always fear the Lord your God.”\n– Joshua 4:21-24\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 6:1-27, 1 Kings 16:34, Colossians 2:11-12, Exodus 3:1-6",
        "devo_title": "The Conquest of Jericho",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Joshua 6:1-27, 1 Kings 16:34, Colossians 2:11-12, Exodus 3:1-6\nMost people move into a retirement community later in life, but I’ve been a part of one since birth. My dad has always been in the business of caring for the elderly, and as a result, I’ve gained some serious benefits—mainly, a personal cheering squad. They are always up for a competitive card game or impromptu ice cream cone, and never forget to tell me how tall I’ve gotten. And boy, do these people know how to throw parties. I’ll never forget the Bon Voyage party we had for the chapel. \nYou see, the community was going through a huge, exciting expansion—new office buildings and homes going up left and right. There was just one problem standing, quite literally, in the way of those new plans: the community’s beloved chapel, the centerpiece of the campus. Instead of letting the bulldozer run its course, the community decided to uproot the chapel from its original location and transfer it to the other side of the property. There, it could continue to be enjoyed for years to come. \nThe day of the move, my parents let me miss a few hours of the second grade to witness it. We stood under the porte-cochere, eating cream cheese bagels while the community band warmed their bagpipes and trumpets. Surrounded by dirt piles and construction hats, it was hard to miss the shocking upheaval of the chapel’s uprooted foundation. Still, there was much to celebrate. The chapel itself, the very place where this community had regularly recounted God’s faithfulness, remained safe and sound. \nIn our reading today, we’re entering a different construction site together, one filled with its own upheavals and unknowns. The broad-shouldered city of Jericho is fearfully closed to the Israelites—no one goes out, no one comes in. Under the Lord’s direction, a curse is imposed on the city and its idol-loving inhabitants when Joshua and the priests begin to march around it. Carrying the ark of the covenant, they keep in step with God’s commands and watch as the walls around Jericho fall at their feet. \n“The people advanced into the city, each man straight ahead, and they captured the city. They completely destroyed everything in the city with the sword—every man and woman, both young and old, and every ox, sheep, and donkey.”\n-Joshua 6:20-21\nGod gave them the city. \nNow, I don’t know about you, but I’m not sure how I’m supposed to feel about this. Yes, justice was served. Yes, the good guys prevailed. And yes, God’s perfect plan unfurled as He’d promised. But that doesn’t change the fact that they were standing in a destruction zone, does it?\nSitting with the truth of crumbled walls and a city destroyed, I cannot help but wonder what this says about God. We readily cozy up to God’s promises of love, restoration, and peace, but what do we do when His promises include curses, death, and brokenness? \nWe trust Him still. From where we sit, it’s hard to understand the mind and ways of God (Isaiah 55:8-9). But the just consequences of sin do not lessen the sovereign goodness of our God.\nAt the intersection of God’s wrath and mercy, we find two constants: His kept promises and His unfailing love. To trust the fullness of His character, we need Him to be steady and sure. In chapter 6 we encounter God’s faithfulness, not only in the midst of a crumbling Jericho, but also in the protection of Rahab, who became part of the lineage of Christ (Matthew 1:5). \nBecause of who He is, we can always stare into the dark unknown of destruction to find an unchanging God. In the midst of every upheaval and replanting, He is faithful.\nPraise the Lord for every promise kept. \n \n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 7:1-26, Joshua 8:1-35, Deuteronomy 9:26-29",
        "devo_title": "Israel Cannot Stand Alone",
        "devo_summary": "\nBY Guest Writer\n\nText: Joshua 7:1-26, Joshua 8:1-35, Deuteronomy 9:26-29\nWho of us has not lamented like Joshua, beating our breasts and rending our garments, surveying the landscape of darkness, rebellion, and fear in front of us? Many of us have fretted that God’s name will not be made great, but all too often we say, “What can we do to make Your name great?” Joshua, praise God, got the pronoun right: “What will You do for your own great name?” (Joshua 7:9, emphasis mine).\nIt’s strange, the knots we tie ourselves up in, the puzzles we struggle to fit ourselves into, the efforts we put forth to be the bringers of greatness to God. We want to be the world changers and the history makers, the people of God for God, with nothing standing in our way. But Joshua, in the face of Israel’s abundant sin, knew if God’s name was to be great, He Himself would be the one to do it—not man. \nWe think the world will be changed by our short-term missionary journeys, fiery sermons, and quippy books. We think we can bring glory to God’s name with our efforts of authenticity, by racking up social media “likes” and “followers,” by planting new churches, both big and small. We think we’ll glorify Him by performing awesome acts in His name and creating large gatherings for prayer and praise—by centering most things on the gospel, and relying on great graphics to take care of the rest. \nBut in Joshua chapter 7, here is how God chose to make His name great: \nJoshua lines up the twelve tribes.\nWithin those tribes, the clans.\nWithin those clans, the households.\nWithin those households, the men.\nThen one man: Achen.\nTo him, Joshua says, “My son, give glory to the Lord, the God of Israel, and make a confession to Him. I urge you, tell me what you have done. Don’t hide anything from me” (v. 19).\nAnd here, among an entire nation, Achen is found out and then tells the truth: “I have stolen and I have hidden what I have stolen, and here is where it is” (vv. 20-21, my paraphrase).\nBut God already knew Achen and his actions. He knows ours, too. \nWhat if the way God chooses to make His name great is the difficult, relentless, painful, and excruciatingly long process of unearthing sin in our lives? What if the way God makes His name great is not through public acts of piety, but private acts of repentance? What if His greatest act of glory is in exposing the darkest of lies our hearts have clung to, only to replace them with the light of His mercy and Truth? \nAs Charles Spurgeon said, “It is far easier to fight with sin in public, than to pray against it in private.”\nToday, as you read this passage, do not ask how you can do great things for God. Instead, ask Him to unearth the secret sins in your heart, the places that need exposure to His light and healing in His presence. He knows them already and loves you still.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, tweets @lorewilbert, and posts photos @loreferguson. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Hebrews 8:10",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut this is the covenant that I will make with the house of Israel\nafter those days, says the Lord: I will put My laws into their minds\nand write them on their hearts.\nI will be their God, and they will be My people.\n—Hebrews 8:10\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 1:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.  This week, we’re memorizing a command and a promise from the Lord to Joshua:\n“This book of instruction must not depart from your mouth; you are to recite it day and night so that you may carefully observe everything written in it. For then you will prosper and succeed in whatever you do.”\n—Joshua 1:8\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 9:1-27, Joshua 10:1-15, Ephesians 1:18-23",
        "devo_title": "The Day the Sun Stood Still",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Joshua 9:1-27, Joshua 10:1-15, Ephesians 1:18-23\nNothing makes me hustle like a deadline. Seriously, mention one in conversation and I’ll be unable to hear you over the clock that starts ticking in my head. \nIn college, I worked for the school newspaper. The building was underground, beneath the university’s basketball court, filled with the sounds of screeching sneakers and jammed printers. Sleep was replaced by a steady stream of caffeine and adrenaline, while stories forcefully flowed out of our fingers to be placed in the hands of our readers a few short hours later. \nWe basked in the knowledge that news couldn’t become news without us. Everything was under our watch, from the latest rumors to the biggest announcements. The fluorescent hallway beams created a false sense of time, as we hibernated under the security of to-do lists and grammar rules. In the morning, we’d climb the stairs of reality, the latest issue in hand, to welcome the day. Before opening the door, we’d make bets on whether the sky would be dark or light, because we honestly couldn’t tell the difference from our journalism bunker. \nIn chapter 10, Joshua faces a firm deadline with a pretty serious agenda: save his people from the attack of five powerful kings. It’s a bleak situation until the Lord says, “Do not be afraid of them, for I have handed them over to you. Not one of them will be able to stand against you” (v. 8).\nIf God were to assign a project and a deadline to me, I imagine I’d descend the the stairs to the newspaper office and begin strategizing my next move, emerging with a plan in the morning. But that’s not what Joshua does. \nJoshua asks God to make the sun stand still, giving him time to fulfill the mission at once. And God does it. The sun stops in the middle of the sky, delaying its setting almost a full day and giving Joshua the time needed to accomplish His task. \nAs I think about what a sight this must’ve been, I can’t help but realize that, if it were me, I’d still be underground, oblivious to the stilled sun. Even worse than missing that newsworthy spectacle, I’d miss out on observing the intimate care of my Creator. \nWhile I no longer work for the newspaper and now spend most of my time above ground, I haven’t completely graduated from my own knee-deep ambition. I collect my cares and hide away from the very God who fought for Israel! But I don’t want to spend my days strategizing. I want to get busy living like God has called me to live. \nMay we ask the Lord for a faith like Joshua’s, boldly believing that God is in our corner. Let us stand and walk and live in the sunlight, knowing He is for us.\n\n \n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 10:16-43, Joshua 11:1-23, Psalm 110:1-7, Ephesians 1:3-14",
        "devo_title": "The Lord Gives the Land to Joshua",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Joshua 10:16-43, Joshua 11:1-23, Psalm 110:1-7, Ephesians 1:3-14\nI only watch action movies for the romance. You know, the love subplot, where the guy-and-girl tale is interspersed between all the scenes of war and gore. Battles don’t interest me, nor do bomb explosions, car chases, guns, or swords. No matter the era or context of the film, something in my brain shuts off when the action picks up, and then that something turns back on to watch love rise from the rubble.\nWhen reading Joshua, I find myself doing much the same thing. I’m tempted to glaze over the battle scenes, the names of the countries conquered, and all those kings’ names I can’t pronounce. Until I get to the “good stuff,” I tune out, then tune back in once I get to… well, Psalms.\nBut something interesting happened as I was reading over this week’s passage. At first, I only saw scenes of conquest, of Israel taking each and every enemy in its path—Makkedah, Libnah, Lachish—a slew of battle scenes depicting how God’s people took over the north and south territory of Canaan. However, as I read the passage again, I began to see that, in the midst of all the action, another plot emerges.\nThese verses are more than a retelling of conquest and victory. We see this when we pay attention to the repetitive language in the text—language that emphasizes God’s devotion to Israel:\n“And the Lord also delivered [Libnah] and its king into the hands of Israel” (Joshua 10:30).\n“And the Lord delivered Lachish into the hands of Israel” (Joshua 10:32).\n“Do not be afraid…I will deliver all of them” (Joshua 11:6).\n“And the Lord delivered them into the hand of Israel” (Joshua 11:8).\nSimilarly, repetitive language is used to describe Joshua’s devotion to God’s command:\n“So Joshua conquered all the land… as the Lord God of Israel had commanded him” (Joshua 10:40).\n“So Joshua did to them as the Lord had told him” (Joshua 11:9).\n“He utterly destroyed them, as Moses the servant of the Lord had commanded” (Joshua 11:12).\n“As the Lord had commanded Moses his servant, so Moses commanded Joshua, and so Joshua did. He left nothing undone of all that the Lord had commanded Moses” (Joshua 11:15).\nAs the dust settles on the battlefield, look for it: the making and fulfillment of a promise. Devotion, obedience, and a commitment to one another, at all costs. In the midst of the struggle and the fear is this command: “Do not be afraid” (Joshua 10:25).\nIt sounds like a love story, doesn’t it? The love of God for His people—a love that spans much further than the physical territory Joshua conquered. It’s a love that would eventually come down in human form to save not only Israel from their enemies, but also you and me from a fate we surely deserved: “We have redemption in Him through His blood, the forgiveness of our trespasses, according to the riches of His grace that He lavished on us with all wisdom and understanding” (Ephesians 1:7-8).\nI no longer want to turn my head from the battle scenes of Joshua. I see my own redemptive story in there now, woven in and out with the assurance of deliverance and of promises fulfilled. Victory is found in Christ alone. This is the greatest love story we will ever know.\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 12:1-24, Deuteronomy 29:7-8, Nehemiah 9:22, Psalm 136:16-21",
        "devo_title": "The Land East and West of the Jordan",
        "devo_summary": "\nBY Guest Writer\n\nText: Joshua 12:1-24, Deuteronomy 29:7-8, Nehemiah 9:22, Psalm 136:16-21\nI’m not sure what prompted the woman in seat 4B to share such intimate details of her life. Her husband, a pastor, had been kidnapped and killed just eighteen months earlier. Dabbing her eyes with a tissue, she quietly described to me the sorrow her family had endured.\nMy mind struggled to comprehend her pain. Honestly, I wanted to race back to the airplane lavatory and bolt the door against the suffering that was so palpable in the seat next to mine. Instead, I managed to get this sentence past the lump in my throat:\n“Are God’s promises true?”\nThis was a woman who knew Christ and yet had truly suffered. I wanted to know—I needed to know—if God even climbed into valleys as dark and deep as this to keep His promises to His people. The woman’s response?\n“Every single one of them.” \nThis sweet stranger had come face to face with darkness and found that Jesus truly is the Light of the World (John 8:12). \nShe had walked through the Valley of the Shadow of Death and discovered Jesus is the resurrection and the life (Psalm 23:4; John 11:25). \nShe had buried her treasure but found that the treasure of God’s presence had remained (Matthew 13:44). \nGod’s faithfulness in her life helped me remember His faithfulness in my own. When circumstances cause my anxious heart to question if God’s promises are really true, I need look no further than my own life to remind myself of His faithfulness. \nThis is what we find God’s people doing in Joshua 12. They had seen the walls of Jericho come a-tumbling down (Joshua 6), then watched as the Lord stopped the sun in its track for an entire day and rained hailstones down on their enemies (Joshua 10). God had kept His promises to defeat Israel’s enemies and clear the path for them to enter into the promised land. But there were still many battles left to fight, “still very large areas of land to be taken over” (Joshua 13:1). \nI so often see myself in the stories of God’s people as they wandered. Like me, they were a wimpy-hearted bunch, prone to discouragement, defeat, and despair. Despite God’s unbroken track record, their confidence was easily shaken. \nSo here, in Joshua 12, we find a roll call of the kept promises of God: a list of the kings God’s people had conquered, the lands they’d captured. Each one is proof of God’s love and provision:\nThe king of Jericho, one.\nThe king of Ai, one.\nThe king of Jerusalem, one.\nThe king of Hebron, one…\nFor 31 kings, the list goes on. Over and over, God came through. There’s not a single example of Him dropping the ball. It was God’s track record, not their own, that emboldened God’s people to keep fighting, to keep walking toward the land they’d been promised. \nIt’s hard for fickle folks like us to fully grasp, but God is the promise keeper. Failing to come through is not in His nature. His faithfulness gives us the courage to keep moving forward, pressing on toward the prize (Philippians 3:13-14). And as we march toward the promised land, we can rest assured that He will keep His promises still. \nEvery. Single. One. \n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 13:1-33, Joshua 14:1-15, 2 Peter 3:13, Romans 4:13-17",
        "devo_title": "Israel’s Promised Inheritance",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Joshua 13:1-33, Joshua 14:1-15, 2 Peter 3:13, Romans 4:13-17\nI grew up on old church hymns. I have vivid memories of me as a child and then a teenager, turning a purple hardcover hymnal to the page number specified in the bulletin. Sunday mornings and Sunday nights, donning a dress or jeans, I’d stand up straight in the pew and sing loud the songs that would become the sounds of my faith—my confession in a melody of sharps and flats (sung mostly on key).\nWhen I read the conquest and land allotment passages in Joshua, I find myself humming “Victory in Jesus” and remembering the pages of that hymnal. It’s a boisterous hymn—at least, our rendition was. The combination of the pounding piano chords and reverberating notes from the pipe organ made me lift my head a little higher and belt out Eugene Bartlett’s chorus a little louder. \nO victory in Jesus,\nMy Savior, forever.\nHe sought me and bought me\nWith His redeeming blood;\nHe loved me ere I knew Him\nAnd all my love is due Him,\nHe plunged me to victory,\nBeneath the cleansing flood.\nIt felt, well, victorious. The irony is that the actions expressed in these lyrics sound less like conquest and more like surrender. Being “sought” and “bought” and “plunged” into a flood is not congruent with my idea of winning. But in the gospel of Jesus, that’s exactly what it is. To be conquered by the grace of God is to be victorious.\nThe list of land divisions in Joshua 13 is more than just a test of our Old Testament pronunciation skills (a test I would fail with flying colors); it is a testimony to the precise, complete, and gracious fulfillment of God’s promise to Israel. Like every other promise God makes to His children, the boundaries described for each tribe were both fixed and fulfilled by God.  \nBut there’s even more to see here than the staggering detail with which the book describes the physical, promised land God gave Israel. Notice the phrasing used throughout chapters 13 and 14 for each portion of land. This land is their inheritance. It is a gift from the Lord, not based on merit but on identity. \nThe Israelites gained the land through conquest, but only with the one true God at the helm. Joshua’s people took the land, but only with the Lord of lords supplying the strength. This promised land was fulfilled because God secured it long ago as an inheritance for His children. The same is true of our eternal inheritance—our salvation.\nClifford in Shakespeare’s Henry VI declares, “God on our side, doubt not of victory!” And he was right. But this victory does not always look like we think it should. To be victorious in the Lord is to surrender what little might we have to the almighty One. To “win for Jesus” means losing ourselves in the flood of His forgiveness and grace.  \nWe are His children, His people, and He has granted us His very identity, sealed for us in Christ (Galatians 3:29). The new heavens and new earth are not yet ours to inhabit, but according to 2 Peter 3:13, the promise is ours now. The victory has been secured and the allotment has been assigned. \nYou and I don’t yet dwell in the new heavens with Christ. This fallen world we’re living in will never have the permanent “rest from war” we’ll enjoy in the new earth (Joshua 14:15). But Jesus dwells here with us—through the already-fulfilled promise of His Holy Spirit (John 14:26). “He is the down payment of our inheritance, for the redemption of the possession, to the praise of His glory” (Ephesians 1:14).\nThanks be to the Almighty God. \n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 15:1-63, Joshua 16:1-10, 1 Peter 1:3-5, John 10:7-18",
        "devo_title": "Judah’s Promised Inheritance",
        "devo_summary": "\nBY Guest Writer\n\nText: Joshua 15:1-63, Joshua 16:1-10, 1 Peter 1:3-5, John 10:7-18\nGrowing up, Judah’s prospects looked pretty dim. Dysfunction? His family had it in spades. With all that family drama, it’s no wonder Judah ran away. Nor is it surprising that his problems continued to follow him. \nAfter marrying and having three sons of his own, the generational sin and chaos just perpetuated. Scripture tells us the first two were wicked and died young. The remaining son refused to care for his brother’s widow, Tamar; and while Judah was also responsible for her welfare, he refused to act on her behalf (Genesis 38:6-11). Eventually, Tamar used deceit to force his hand. Would Judah honor his responsibilities or run from them once again?\nWhen we look at Judah’s background, the answer seems obvious: Judah is not one of the “good guys.” He comes from one sinful mess and jumps right into another. Isn’t his course already set?\nThank God, the answer to that question is a resounding NO. Redemption is a constant refrain in the Bible: Your past does not define you (see Rahab). Your sin does not define you (see King David). Your family does not define you (see Ruth). Because of God’s love and mercy, Jesus Christ defines you. He calls you by name, and you are His (Isaiah 43:1). He alone created us, loves us perfectly, and saves us from our sin.\nJudah was not doomed by his past any more than you or me. God had great plans for him—plans to open his eyes to his own sinfulness (Genesis 38:26), plans to give him a new heart that could love well (Ezekiel 36:26), and even plans to reconcile his family and turn it into a great nation (Genesis 12:2). \nTamar’s trap became the turning point in Judah’s life. After he chose to take care of her, Judah returned to his father’s household, but this time as a sacrificial leader. By the time Judah received a final word from his father, it was a prophetic blessing: the future for his descendants would be long and bright (Genesis 49:10). This is the blessing we see unfolding in Joshua 15. Judah had become a tribe numbering in the thousands, and that tribe had arrived at the promised land to receive its inheritance.\nIn Ephesians, Paul wrote that God “is able to do far more abundantly than all that we ask or think, according to the power at work within us” (Ephesians 3:20). Do we really believe that? Or do we think it’s too late for us? Deep down, have we believed the lie that there are places God’s redemptive grasp can’t reach? \nWhen you feel stuck in dysfunction, or hounded by your past, remember Who defined Judah and his future. The tribe of Judah brought forth Jesus Christ, the “Lion of Judah” and the anchor of our true identity (John 1:12-13). He has an eternal inheritance for us beyond what we can imagine.\n\nCarolyn Denny dabbled in the Navy, politics, business, and publishing before she discovered her true calling: household management. Today she is raising three boys and a baby girl with her husband Josh in Nashville, Tennessee. In those precious moments tucked between bedtimes and carpools, Carolyn loves to teach the Bible and write about how God shows up in her messy world.\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "2 Peter 3:13",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nBut based on His promise, we wait for the new heavens and a new earth, where righteousness will dwell.\n—2 Peter 3:13\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 1:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.  This week, we’re memorizing the key verse for the book of Joshua:\n“Haven’t I commanded you: be strong and courageous?\nDo not be afraid or discouraged, for the Lᴏʀᴅ your God is with you wherever you go.”\n—Joshua 1:9\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n \n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 17:1-18, Joshua 18:1-28, Hebrews 9:1-14",
        "devo_title": "Tribal Divisions",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Joshua 17:1-18, Joshua 18:1-28, Hebrews 9:1-14\nAs much as I love traveling, there is nothing like coming home. Sleeping in my own bed, waking up to my own coffeemaker, hearing the familiar hum of traffic outside my window—home is truly a restful reprieve.\nIn Joshua chapter 18, we see a new home established for the nation of Israel at Shiloh: “Now the whole congregation of the children of Israel assembled together at Shiloh, and set up the tabernacle of meeting there. And the land was subdued before them” (Joshua 18:1).\nThe tabernacle was the physical manifestation of God’s presence among His people. He dwelled in the innermost part of it, the holy of holies. In the midst of dividing territory and separating themselves physically from one another, it’s significant that the Israelites—all of the Israelites—now gathered in this one place to be in the presence of the Lord. God was the center, the core, of this people. And Shiloh would be His resting place for the next 300 years, until the Israelites were defeated by the Philistines.\nWhen I looked up “Shiloh” in Hebrew, I came across a couple of definitions. One was “a place of rest” and the other, “peace.”\nI don’t know that we can fully understand how the Israelites must have felt to finally settle and put down roots after years and years of traveling as nomads. An entire generation had been born and raised on foot, a generation that didn’t know what it meant to have a home—to have something to return to, a place to rest.\nThis is something we all understand: to have wandered far and long, to be weary and tired and thirsty, to desire peace—real peace. We all desire a place to call home.\nWhat this scene at Shiloh points us to is the place we, as Christians, now find our rest. “But when Christ came as high priest of the good things that are now already here, he went through the greater and more perfect tabernacle that is not made with human hands. Not with the blood of goats and calves, but with His own blood He entered the Most Holy Place once for all, having obtained eternal redemption” (Hebrews 9:11-12).\nThe atonement for our sin that was once achieved through sacrifice and ritual in the tabernacle, is now complete through Christ’s blood. He entered the Most Holy Place once, and for all. For me and for you. \nJesus is our Shiloh.\nAre you weary? “Come to Me, all of you who are weary and burdened, and I will give you rest” (Matthew 11:28).\nAre you thirsty? “Whoever drinks from the water that I will give him will never get thirsty again” (John 4:14).\nAre you hungry? “I am the bread of life… No one who comes to Me will ever be hungry” (John 6:35).\nAre you restless? “Cast all your anxiety on Him because He cares for you” (1 Peter 5:7).\nIn Christ, we have rest and reprieve. In Christ, we have a home. \nLet us gather at Shiloh today and rest in that truth.\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 19:1-51, Genesis 49:1-28, Acts 13:16-25",
        "devo_title": "Joshua’s Inheritance",
        "devo_summary": "\nBY Guest Writer\n\nText: Joshua 19:1-51, Genesis 49:1-28, Acts 13:16-25\nI was 10 or 11 years old when I first read Little Women. In the years before I opened that book, I thought reading and writing were “school” activities. I wrote stories because my teacher required it, not because I actually liked it. But Louisa May Alcott changed all that. She awakened something inside me, and I wanted in. So I pulled a blank notebook out of my desk, and I scribbled a story inside it.\nSince then, my heart has drawn ever deeper into writing. Writing about God’s Word, and teaching it to others, makes my soul sing. I’m certain it’s the thing I was created to do.\nHowever, it hasn’t always come easily. Around the time I dove headfirst into writing, God called me back to school. It felt like an obstacle to my dream, but not an insurmountable one, so I pressed on. Then, I got pregnant and had a baby. Then I got pregnant again and had another baby. All while I was still in school.\nBetween school and marriage and parenting, my attention was pulled in a lot of directions, and it wasn’t long before writing got put on the backburner. All the while, I watched as my writing friends achieved their own goals. One by one, they grew their ministries and published books, while I was lucky to steal an hour to write. My friends had reached the promised land, while I remained just outside it.\nWaiting is always hard, but it is made especially difficult by comparison. When your friends or colleagues attain the thing you want, it’s tough to hold on to contentment. The ache is somehow heightened by the sight of another’s success.\nWhen I read the story of Joshua, I wonder if he knew this ache. A skilled, lifelong warrior, Joshua wasn’t appointed to lead Israel until he was 90 years old. Then, he spent another decade guiding the Israelites into the promised land. After he accomplished all that, he dispensed the land to the twelve tribes of Israel. Only at the very end of the journey, and the very end of his life, after everyone else had received their inheritance, did Joshua receive his (Joshua 19:49-50). \nJoshua waited a lot, and I wonder how the story might have been different had he been guided by impatience. I wonder how his leadership might have been compromised had his spirit been discontent. Thankfully, Joshua succumbed to neither. He was a man who waited well. Rather than pine for the life he wanted, Joshua made himself available to the will of God. His waiting was both active and fruitful. \nI suspect Joshua did all this because he trusted God’s promises. He knew God would make good on His Word because He always does. From the start, God told Joshua what would be required to endure this particular journey: “Be strong and courageous, because you will lead these people to inherit the land I swore to their ancestors to give them” (Joshua 1:6).\nGod always comes through. This was a truth that guarded the integrity of Joshua’s leadership. God promised to be with Joshua, to bring him success wherever he went (Joshua 1:7,9), and that’s just what He did. By trusting in God’s perfect timing, Joshua accomplished a lot through his waiting.\nThe story of Joshua reminds us that we don’t have to despair in the waiting. God’s promises are trustworthy, His plans are precise, and His timing is perfect—which means waiting isn’t a setback. It’s an opportunity. \nDon’t waste your waiting. Your story is much bigger than the ending.\n\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, and mom of two boys. She is a regular contributor to Christianity Today and recently completed her Ph.D, which focused on cultivating the gifts of women in the church.\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 20:1-9, Joshua 21:1-45, Exodus 21:12-14, Hebrews 2:14-15",
        "devo_title": "The Lord Fulfills His Promises",
        "devo_summary": "\nBY Missy Fuller\n\nText: Joshua 20:1-9, Joshua 21:1-45, Exodus 21:12-14, Hebrews 2:14-15\nThe nation of Israel had been through a lot. \nThey conquered the land of Canaan, driving out existing nations and taking over the land. They crossed the raging Jordan River. Before that, they wandered in the desert for 40 years, waiting for God to signal when it was time to move. And before that, they were a nation of slaves, living in Egypt under hardship and oppression.\nYet God had His hand in all of it, like He does in our lives. In Genesis 15, God made a covenant promise to Abraham, spelling out exactly what would happen to his descendants.\nGod promised that Abraham would have numerous offspring. He kept that promise. The Israelites multiplied more and more the longer the Egyptians oppressed them (Exodus 1:12). \nGod promised Abraham that his descendants would be enslaved for 400 years. And they were. The Egyptians worked the Israelites ruthlessly and made their lives bitter (Exodus 1:13-14). \nGod also promised to judge the nation the Israelites served. Indeed, the Angel of the Lord killed all the firstborn of Egypt and passed judgment against the gods of Egypt (Exodus 12:12).\nGod promised that His people would leave the nation they served with overwhelming possessions. And they did. The Egyptians gave the Israelites silver, gold jewelry, and clothing as they left Egypt (Exodus 12:35-36).\nFinally, God promised to bring Abraham’s descendants back to the promised land. In Joshua, we see God drive out the inhabitants of Canaan and give the land to Israel (Joshua 21:43-44).\nWe serve the same God today. He makes promises to us as His children, just as He made promises to the house of Israel.\nHe will meet all our needs (Philippians 4:19).\nHe will provide for us (Matthew 6:33).\nHe will never leave us or forsake us (Deuteronomy 31:8).\nHe has a purpose for us (Romans 8:28).\nRemembering God’s faithfulness in our past helps us cling to His promises in our present. When I struggle to believe that He will provide for my needs, I remember how He provided that check in the mail at exactly the right moment. When I’m overwhelmed with loneliness, I think of the friendships He’s given me and how He Himself walked through dark moments with me. When I fear condemnation for my sin and mistakes, I recall the ways He’s already redeemed my past.\nGod’s promises are our foundation. He fulfills His every word. We can cling to His promises as we wander in the desert and fight the enemy. We can count on Him to be fully faithful (Joshua 21:45).\n“None of the good promises the Lᴏʀᴅ had made to the house of Israel failed. Everything was fulfilled.”\n– Joshua 21:45\n\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 22:1-34, 2 Corinthians 1:21-22, Psalm 7:8-11",
        "devo_title": "Altars of Remembrance",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Joshua 22:1-34, 2 Corinthians 1:21-22, Psalm 7:8-11\n“I’ve never been asked to play Dixie® Cups before!” said my grandmother… and, well, most people. \nIt was my favorite childhood game: stealing the box of mouthwash cups from the bathroom, then dumping its contents onto the table and standing the paper cups to attention. \nIt was like playing a game of “Memory”—the object was to find the cup that matched the one in my hand. Except my game was better, because instead of only one possible match, there were probably twenty. Once a match was made, I’d add the pair to my prized, yet toppling, tower of cups. \nClearly my game did not require superior memory skills, but that little tower was a comforting sight nonetheless. I loved to remember that the odds were stacked in my favor. I needed to remember that. \nThe eastern tribes of Israel needed to remember, too. They’d wandered in the wilderness—twice!—but their journey was also bookended with two miraculous water crossings. As they crossed the Jordan River, they came across giant stones—ones they never would have seen without God making a way for them in the river. Marking each as a promise kept from the Lord, they began to stack them, creating an altar of remembrance. Each river stone said, God brought you out of the wilderness and carried you through this river. Remember this. \nThey were just rocks, and yet, they were so much more. Unlike an altar built for idol-worshipping, this was a token shouting out the one true God’s faithfulness, created in His presence and stacked high for all to see. \n“It is to be a witness between us and you, and between the generations after us, so that we may carry out the worship of the Lord in His presence with our burnt offerings, sacrifices, and fellowship offerings.”\n-Joshua 22:27\nA witness. The rocks their feet had walked across in obedience also bore witness to the grace of the Father, who makes small things significant and significant things small. \nMy Dixie cup towers were small yet significant, too—filled with joy, yet paper and disposable. It would’ve been easy for anyone to assume that my toppling tower was begging to be thrown away, when that wasn’t part of the game at all. Small and significant things are also easily misunderstood. \nWhen the western tribes of Israel encountered the eastern tribes’ altars of remembrance, they mistook them for a sign of aggression. They even began preparing for civil war! Oops. They couldn’t have known what the rocks meant. They couldn’t have seen their mistake. The Israelites, like you and I, were trying the best they could! But they were confused. \nDon’t worry—the tribes came together to discuss the matter, and fears fizzled as they recalled the Truth they held in common. “Yahweh is the God of gods! Yahweh is the God of gods!” (Joshua 22:22). They remembered what we are learning: The humans in the story may be confused, but the God of the story is sovereign and good. \nWhere there is human confusion, Christ is our resolve. Where we build towers, He seals hearts. While we build temporary remembrances of God, He has already created a permanent remembrance within us. “He has also sealed us and given us the Spirit as a down payment in our hearts” (2 Corinthians 1:21-22).\nWhether we walk in wilderness, or find a miraculous crossing, or build towers in His name, may we continue to put our trust and hope in God alone.\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 23:1-16, Joshua 24:1-33, Matthew 11:28-30, Hebrews 4:1-13",
        "devo_title": "Joshua’s Farewell Address",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Joshua 23:1-16, Joshua 24:1-33, Matthew 11:28-30, Hebrews 4:1-13\nEven the greatest leaders die. As Joshua prepared for the end of his life, he addressed Israel—those people of God who had followed him through impossible circumstances to an improbable reward.\n“I am now going the way of all the earth, and you know with all your heart and all your soul that none of the good promises the Lord your God made to you has failed. Everything was fulfilled for you; not one promise has failed.”\n– Joshua 23:14\nIt was time for Joshua to go. In keeping with his steady voice as their leader, Joshua’s farewell address was a plea for Israel to do three things: Remember what God has done. Obey Him courageously and completely. Worship Him alone.\nI like to picture the scene as Joshua stood there in front of the tribes, relaying one last message from the Lord. I like to imagine the passion in his voice as he recounted their treacherous journey—how God rescued His people from generations of idol worship and multiplied their descendants, how He rescued them from slavery in Egypt and sustained them in the wilderness, and how He ushered them into the promised land, handing them every victory along the way. This line is my favorite:\n“I gave you a land you did not labor for, and cities you did not build, though you live in them; you are eating from vineyards and olive groves you did not plant.”\n– Joshua 24:13\nThe Lord did it all. And Joshua, with all the earnestness his 110 years could muster, was asking Israel to remember, to obey, and to worship the God of the Rescue.\nThis was not a call for arbitrary emotion or passive intention. This request was active and specific. Joshua gave the people instructions specific to their time and circumstance, but his admonition echoes even to us: “You are witnesses against yourselves that you yourselves have chosen to worship Yahweh” (Joshua 24:22). In other words, Don’t just say this. Mean it. Do it.\n“We are witnesses,” they said back to him.\n“Then get rid of the foreign gods that are among you and offer your hearts to the Lord, the God of Israel” (v. 23).\nI like Joshua’s style: “Okay then. Get on with it.”\nJoshua was a good leader. But even he did not perfectly fulfill the promises he solicited from the people. Even Joshua was a sinner in need of a savior. He was used by the Lord to secure a tangible inheritance for his people. But, like Joshua himself, that inheritance was only temporary. The rest from war would not last. \nNot even Joshua could bring God’s people salvation.\nJoshua couldn’t, but Jesus did.\nJesus obeyed perfectly and followed the Father faithfully. And when we did not and could not? Jesus satisfied God’s wrath for our sin and granted us the eternal benefit of His perfect obedience (Romans 3:25-26). Jesus has gone ahead of us into the very death that was ours and conquered it on our behalf (2 Timothy 1:10). Christ secured for us an inheritance that is eternal, a rest that will last (Hebrews 4:9).\nHere in the last chapters of Joshua, as we look back over the epic story of what God did for His people, we lean in and listen to the wise old man’s words: Remember what God has done. Obey Him courageously and completely. Worship Him alone.\nBe faithful to the God of the Rescue. And when your faithfulness fails, lean wholly on the grace of Christ. \n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Matthew 11:28-30",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \n“Come to Me, all of you who are weary and burdened, and I will give you rest.  All of you, take up My yoke and learn from Me, because I am gentle and humble in heart, and you will find rest for yourselves. For My yoke is easy and My burden is light.”\n—Matthew 11:28-30\n\n\n",
        "img_url": ""
    },
    {
        "book_title": "Joshua",
        "devo_passages": "Joshua 24:15",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.  This week, we’re memorizing a beautiful verse of commitment:\nBut as for me and my house, we will serve the LORD.\n—Joshua 24:15\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n",
        "img_url": ""
    }
]