[
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Zephaniah 3:17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Zephaniah.\nThe Lᴏʀᴅ  your God is among you, a warrior who saves. He will rejoice over you with gladness. He will be quiet in his love. He will delight in you with singing.\nZephaniah 3:17\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT_4-MP-2.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Haggai 2:9",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nToday we will read the key verse for the book of Haggai. \n“The final glory of this house will be greater than the first,” says the Lᴏʀᴅ of Armies. “I will provide peace in this place” – this is the declaration of the Lᴏʀᴅ of Armies.\n– Haggai 2:9\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram13.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Haggai 2:1-23, Romans 8:9-10, Hebrews 12:26",
        "devo_title": "Encouragement and Promise",
        "devo_summary": "\n                    \n                    It’s been noted by many a preacher that one of the most repeated commands in Scripture is to not be afraid. Oftentimes, the recipients of this instruction were frightened by seemingly insurmountable trials, challenges, or enemies. Those things can cause us to fear too. It’s a natural human reaction, especially when we forget God is always with us.  \nThat was the case in Haggai 2; the people were discouraged and afraid. Rebuilding the temple was no small feat, and they felt overwhelmed with the task and the problems they were facing. They were stuck and were stalling. Even though they were likely excited about worshiping God in the temple once again, the arduous process and demanding labor was enough to dampen their spirits. Plus, they thought the rebuilt temple could never measure up to the glory of the former temple (v.3).\nGod’s loving proclamation in the midst of their discouragement was, “My Spirit is present among you; don’t be afraid” (v.5). Instead of promising them that their challenges would suddenly disappear, God comforted His people by reminding them of His presence. The people needed to pivot from their unhealthy fear of the task before them to a healthy fear and respect for God, the Most High. They needed to remember His Spirit was with them to direct and strengthen them for the work they were called to do.\nMisplaced fear is crippling. It keeps us focused on our lack of resources, the size of our problems, and the strength of opposition we face. By contrast, God-honoring fear is rooted in reverential awe, worship, and a trusting relationship with our all-powerful God and Father. This kind of fear is freeing, healing, and energizing. Scripture tells us that “the fear of the LORD is the beginning of wisdom” (Proverbs 9:10). We won’t be able to sustain wise, courageous action apart from the fear of the Lord.\nIt’s easy to look at the Israelites’ cycles of fear—from misplaced to proper, and back around again—and wonder how they could have missed the mark. This might be because we have the luxury of observing their stories from a distance. If we step back and examine our own lives with some degree of objectivity, we might see the same pattern of belief and unbelief, of faith and fear. We’re not so different from them.\nI suspect fighting fear is something we will have to do our whole lives; it will never completely go away in this life. Knowing that, and knowing our proclivity to fear the wrong things, my prayer is that we’d focus on growing in a healthy, life-giving fear of the Lord. Fear rooted in the goodness and power of God propels us forward, despite the obstacles we face. It’s a fear that’s powerful enough to overcome all our other fears. So, let’s pursue the only fear that leads to peace—the fear of the Lord.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram12.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Haggai 1:1-15, Ezra 4:24-5:5, Ephesians 2:19-22",
        "devo_title": "Command to Rebuild the Temple",
        "devo_summary": "\n                    \n                    I have two small daughters who love one another deeply but who also love to pick on one another. My wife and I play referee every single day, telling them to be nice to one another, to be kind, to be gentle, and on and on it goes.\nAfter a recent fight, I sat them down to have a conversation about family. I asked, “Do you know what it means for us to be a family?” To which my five-year-old replied, “It means we all have to share the same snacks.” I chuckled and said, “Well, yes, but more importantly, it means that we belong to one another. No matter what happens, this house is the place we all come back to. We’re always here for each other, no matter what. So even though you might have disagreements with your sister, remember that you are family and you should always forgive one another.”\nJudging by their argument a few hours later, I’m pretty sure my message didn’t stick. But our passage today reminds me of that conversation. When we read Haggai 1, we might wonder why God is so bent on having His temple built. If God is everywhere, why does He need a temple? Why would anyone need to go to a temple to meet with Him? It can seem like an unnecessary concern on God’s part.\nBut God’s temple was the place where His presence dwelt with His people in a special way. He says, “I am with you—this is the LORD’s declaration” (v.13). God wants His people to know He is with them, and no circumstance they face will separate them from Him. Even so, the temple showed God’s people that He wanted to be with them. He was so committed to them that He encouraged them to press on and rebuild it. The temple was for them—to shape their identity as God’s people. Much like how a roof over my kids’ heads doesn’t make them my kids, our house, nevertheless, represents a place of belonging, of love, of protection. It helps my kids remember they belong to the family.\nPaul told the Ephesians, “You are no longer foreigners and strangers, but fellow citizens with the saints, and members of God’s household, built on the foundation of the apostles and prophets, with Christ Jesus himself as the cornerstone” (Ephesians 2:19–20). Our passage today points to this greater truth. God has always wanted to dwell with His people—He has always “templed” with them—from the garden of Eden to the sending of the Holy Spirit.\nThe temple’s reconstruction all the way back in Haggai was another promise kept by God. The sending of the Son and the sending of the Spirit are more signs God hasn’t abandoned His people. And so we look forward to that day described in Revelation 21, when God will come down from heaven and we will spend eternity with Him, never again separated by our sin. He will be our God, and we will be His people forever.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram11.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Zephaniah 3:1-20, Isaiah 30:18, Hebrews 7:22-28",
        "devo_title": "Woe to Oppressive Jerusalem",
        "devo_summary": "\n                    \n                    It’s almost weekly that we hear of some new corruption scandal—a man or woman in a position of power preying on the weak and vulnerable. It’s maddening. It’s nauseating. These stories of oppression and injustice tempt us to lose our faith in God’s providential governance of our world. Where is justice? Where is God?\nToday’s injustices are not unlike the situation in ancient Israel, where leaders acted like wolves under the cover of darkness, devouring the innocent and leaving nothing but waste for morning (Zephaniah 3:3). Yet Scripture reminds us that God remains just. He “applies his justice morning by morning; he does not fail at dawn” (v.5). We set our hope in His ability to set things right, knowing He is the only one who can. \nLearning to trust God while being treated unfairly demonstrates faith. It is acting by waiting. It is patiently believing God will act at the right time and in the right way. It is clinging to the words of the prophet Isaiah: “The LORD is waiting to show you mercy, and is rising up to show you compassion, for the LORD is a just God. All who wait patiently for him are happy“ (30:18). \nThe need to trust God in the midst of injustice and suffering is no different today than it was in ancient Israel. Even our best leaders are flawed, and our worst leaders can be tyrants. The presence of unfit and unrighteous leaders generates longing for the one true leader who will bring about perfect justice. Jesus is that perfect leader. He not only seeks justice but is able to bring it to His people. With His first coming, He established His rule—the kingdom has come. It is already here. Yet the full experience of His kingdom, of His perfect rule, lies in the hope of His future return, when everything will be set right forever. \nAs we wait in the night, let us be reminded that the Son has come, and is coming again. And when He returns, it will be the dawn of a new age when justice and righteousness will prevail forever. A new age in which our present earthly rulers will seem but frail shadows when compared to the perfect rule of the Son, who will shine brighter than we can imagine.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram10.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Zephaniah 2:1-15, Psalm 27:7-10, Romans 11:1-6",
        "devo_title": "A Call to Repentance",
        "devo_summary": "\n                    \n                    What would you do if you went to the mailbox today and found a letter from a foreign world leader of a small, unimposing nation—a letter telling you your time was short and his fury would soon come, bringing an end to your family, home, community, and entire way of life? How would you handle the threat of being wiped off the face of the earth in a display of his power and terrible anger?\nIf it were me, I’d probably toss the letter into the trash and completely disregard it. I couldn’t fathom any scenario where my way of life could be threatened so seriously by an insignificant foreign nation while living in a so-called superpower. No way, no how, could that happen in my lifetime. At least that’s what I’d be tempted to think.\nI imagine something similar was going through the minds of those who received Zephaniah’s prophetic message in chapter 2. Perhaps the Philistines just laughed. The Moabites and Ammonites might have looked at their lands and temples and shrugged their shoulders. The powerful kingdom of Assyria and its capital, Nineveh, most likely didn’t even consider the threats from the God of Israel to be problematic. They are of the “jubilant city that lives in security, that thinks to herself: I exist, and there is no one else” (v.15).\nReceiving this kind of message from a seemingly inferior power would not generate any kind of response other than to just go about life normally. And that’s the problem. Unless people really know who God is and how they have rebelled against His glory, they will be unconcerned about His impending judgment over all the earth. Even those of us who are in Christ can remain somewhat oblivious to God’s righteousness and His just punishment of sin.   \nSandwiched between the message of the coming day of the Lord and the judgment of the nations are three beautiful verses pointing us in a new direction toward humility. To those who are “undesirable” (2:2), a message of grace gives hope and provides a way of escape from God’s impending wrath. It’s a call to humble repentance, to seek mercy and forgiveness from the hand of our Maker.\nThe prophet’s “perhaps” (v.3) isn’t meant to be read as if he’s saying, “Maybe you’ll find mercy if you’re lucky.” It was meant to give the people of Judah hope, and it’s meant to point us to the cross, where Jesus absorbed the full fury of God’s anger on our behalf. He concealed us from death by His own death, so that we might know the mercy and love of God.\nHow will you receive God’s warning to repent and believe, and to continue to do so? Will you receive it with pride, thinking you’re secure in and of yourself? Or will you receive it with humility, depending only on God’s grace to cover your sin and need?\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram9.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Zephaniah 1:1-18, Romans 9:19-24, 2 Peter 3:8-10",
        "devo_title": "The Great Day of the Lord",
        "devo_summary": "\n                    \n                    When I get home from work in the afternoon, I can tell by my children’s reaction to my entrance how they behaved that day. Some days, I walk through the door and am surrounded by kids who are thankful to see me. Other days, the sound of the doorknob turning sends children flying up to their rooms, hoping I won’t come up and ask the dreaded question, “How was your day?” My return home either means a fun rest of the afternoon or a difficult conversation about their behavior.\nThe Bible paints the “day of the Lord” with brushstrokes that depend on the audience. Zephaniah, writing in the days before the Babylonian captivity, portrayed the day of the Lord as a day of wrath and fury. He said, “The great day of the LORD is near, near and rapidly approaching” (1:14). Then he laid out what people can expect on that “great day”:\n“That day is a terrible day of wrath, a day of trouble and distress, a day of destruction and desolation, a day of darkness and gloom, a day of clouds and total darkness, a day of trumpet blast and battle cry against the fortified cities, and against the high corner towers” (vv.15–16).\nZephaniah spoke the “word of the LORD” (v.1), declaring that the day of the Lord would usher in terrible wrath and distress. The great city’s walls and defenses would be no match for God, who would lay waste to those cities. A trumpet blast would declare His appearance for battle against those who had rebelled against Him.\nPeter strikes a different tone when he speaks of the Lord’s return. He pictures it as a day his readers ought to look forward to. He reminds them that the Lord’s delay is not because He forgot His promise, but because He is giving more people more time to repent and believe. They are called to wait patiently for His return, understanding it will happen “like a thief” (2 Peter 3:10). On that day, the “elements will burn and be dissolved,” but “we wait for a new heavens and a new earth” (v.10,13).\nThe day of the Lord will be a day that is both great and terrible. The dam holding back the wrath of God will break, and all who have escaped justice will no longer be able to hide. Yet, for those who are in Christ, the flood of God’s wrath has already been poured out on Him. We no longer have to look at the Lord’s return with fear, trembling at His coming, as those who have no hope. The day of the Lord holds great promise for us. We look forward to a new heaven and a new earth, where we will reign with Christ in glorified bodies. Because of the new life we have in Christ, we say, “Come, Lord Jesus!” (Revelation 22:20). \nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram8.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Nahum 1:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Nahum.\nThe Lᴏʀᴅ is good, a stronghold in a day of distress; he cares for those who take refuge in him.\n—Nahum 1:7\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT_4-MP-1.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Habakkuk 3:18-19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nThis week, we will reflect on the key verse for the book of Habakkuk. \nYet I will celebrate in the Lᴏʀᴅ; I will rejoice in the God of my salvation! The Lᴏʀᴅ my Lord is my strength; he makes my feet like those of a deer and enables me to walk on mountain heights!\n—Habakkuk 3:18-19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram6.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Habakkuk 3:1-19, Psalm 17:1-15, John 1:14-18, Galatians 3:11",
        "devo_title": "Confidence in God",
        "devo_summary": "\n                    \n                    In what seems like another lifetime now, our children were small, as in preschool and kindergarten age small. During those years, a craze was afoot—scrapbooking—and my wife was all in. In some sense it was an analog version of Instagram. You took pictures constantly, trying to capture those special moments. Then you’d get the film developed and arrange the pictures in a scrapbook, complete with handwritten text, tagging who was in the photo and what was going on. Sound familiar? There was special paper, special pens, special stickers, special adhesive tape. It was crazy. But it was also special. Here’s why.\nIf we had ever experienced a house fire while our kids were small, do you know what they would have grabbed on their way to our designated safe place outside? You guessed it—those scrapbooks. They were, and still are, one of their most treasured possessions. There are probably a handful of reasons why that is, but I believe the primary one to be this: those scrapbooks tell them who they are and where they come from—and, most importantly, who loves them more than anything. Those photos and text awe them, they reveal the amazing experiences they had in the past, and that gives our kids confidence to keep moving into their unknown futures.\nHabakkuk could pray, “LORD, I stand in awe of your deeds” (3:2), because he had heard the report of all the amazing things God had done in the past. And the recounting of those miracles and wonders gave him confidence to continue on, regardless of what the future held. It’s in those moments that Habakkuk’s confidence in God was bolstered by the words and pictures, if you will, of God’s faithfulness in the past.\nThat’s a key reason why consistently reading and studying God’s Word is so important to our lives. In a very real sense, the Bible is a scrapbook that reveals to us the ways of God. Yes, you’re right: the Bible often feels like another lifetime now (probably because it was), but here’s the deal: the same God Habakkuk prayed to is the same God we pray to today. In fact, He’s the very same God who “became flesh and dwelt among us” (John 1:14). Those scriptural snapshots tell us who we are and where we come from—and, most importantly, about the God who loves us with a never-ending love. They provide for us a confidence, also known as faith, to carry on into today and tomorrow.\nWritten by John D. Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram5.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Habakkuk 2:1-20, Proverbs 29:18, Hebrews 10:32-39",
        "devo_title": "The Five Woe Oracles",
        "devo_summary": "\n                    \n                    Where in your life are you demanding that God give an account of Himself?\nHabakkuk is indignant. Enemies are coming. Bad things seem immanent for God’s people, and like Job, Habakkuk is wondering about the justice of God. From where he is sitting, things are headed in a disastrous direction, and God does not seem to be as moved to act as Habakkuk thinks He ought to be. The wicked seem to be getting off scot-free. And the people of Judah, Habakkuk’s countrymen, are slipping into corruption. All is about to be lost. So in the first chapter of Habakkuk, the prophet asks God to give an account of Himself.\nIn today’s reading of chapter 2, Habakkuk takes a seat and waits for the Lord to answer. Before we look at God’s response, though, consider the ways in which you are sitting right next to Habakkuk, tapping your fingers on the table, waiting for God to clear His throat and apologize for failing to do the good thing that seems plainly right to you. In what areas are you trusting in your own perspective so much that when God doesn’t do what you expect, you assume the problem lies with Him?\nThe Lord responds to Habakkuk by saying that He sees everything, knows everything, and will judge everything rightly, with perfect justice, holiness, and strength. As surely as the Lord lives, “the earth will be filled with the knowledge of the LORD’s glory, as the waters cover the sea” (v.14). Take some time to read this chapter slowly. Maybe even read it aloud to catch every phrase. The absolute power and assurance of God’s justice rings out with a steady, fearsome clarity. God will not be overcome. No one will thwart Him.\nI sometimes evaluate God’s performance in my life based not on what He does, but when He does it. I don’t know about you, but I’m usually in a hurry. When God doesn’t act quickly, do you wonder what’s wrong with Him?\nI take comfort in passages like this because they remind me that God is working on a larger scale than the one I see. Habakkuk’s prayer for justice was in response to the injustices he could see. His nation was falling apart, and he wanted God to patch it back together. But God’s plan to deal with the problem of injustice had an unimaginably greater reach than what Habakkuk or the people of Judah could see. God’s vision for justice and healing went beyond what they could imagine—all the way to a cross on Calvary and an empty tomb.\nWe think this world is a fragile place, that one mistake or missed opportunity could bring everything crashing down to the ground. But today we are reminded that “the LORD is in his holy temple; let the whole earth be silent in his presence” (v.20). Rest easy. God sees more than you or I can see, and He is good. All the time. He needs to give no other account of Himself than the death and resurrection of His Son. That’s enough.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram4.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Habakkuk 1:1-17, Psalm 13:1-6, Acts 13:40-41",
        "devo_title": "Habakkuk’s Prayers",
        "devo_summary": "\n                    \n                    Injustice is everywhere around us. Sometimes I’m overwhelmed by what I find when I scroll through my news feed: another public shooting; new abuse victims coming forward; the latest statistics on abortion or human trafficking; some public figure has used racial slurs, devaluing whole segments of the population. It feels like people invent new ways to ignore basic human dignity each day. \nThe prophet Habakkuk called it “violence”—deliberate and brutal hurt imposed on one person by another. Seeing it left him grieved, shocked, and tired. Habakkuk cried out, “How long, LORD, must I call for help?” (1:2). \nThe prophet’s words should remind us of the raw, pain-filled cries we find in the Bible’s psalms of lament (see Psalm 13:1–2; 22:1–2). The Bible doesn’t downplay this world’s brokenness. It doesn’t paint over the pain with pious words. Instead, it gives us true words that describes how we feel, allowing us to borrow these words and form them into our own desperate prayers.  \nI look at Habakkuk’s dark cry in particular as an invitation to go to God with my grief. I want to plead with Him about what I perceive to be His apathy in the face of our world of injustice. With the psalmist, I want to cry out to God: “Why do you hide and forget our affliction and oppression?” (Psalm 44:24). \nHabakkuk implores us to plead with God from our own wretched corners—but not solely from our own corners. Because these words are in the Bible, they communicate more than our own personal griefs; they also communicate the griefs of the covenant community. In fact, there may be no better way to “weep with those who weep” (Romans 12:15) than to offer prayers of lament with and for others. \nTaking our cries of indignation and doubt to God is an act of personal and corporate faith. When we go to God with our complaints, we’re acknowledging the truth that He alone can solve our problems. Sometimes we find that God answers these prayers in ways that are clear and surprising. On other occasions, our requests appear to remain unanswered. But even then there’s a great treasure in praying during times of suffering. \nOnly in the midst of our laments can we become acquainted with the God who suffered. You see, Christ joins us in our pain, and He prays with us. In our affliction, we come to know Him as the One who cried out on the cross, “My God, my God, why have you abandoned me?” (Matthew 27:46). Though we may feel abandoned, with no understanding of why we’re suffering, we can still trust God in the midst of our pain. Our suffering is not random or cruel; it’s purposeful and redemptive.   \nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram3.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Nahum 2:1-13, Nahum 3:1-19, 2 Chronicles 32:9-23",
        "devo_title": "Attack Against Nineveh",
        "devo_summary": "\n                    \n                    Taunting God is a bad idea. No, taunting an MMA fighter is a bad idea; taunting God is blasphemous and deadly. In our modern age, we have so distanced ourselves from the reality of God and turned Him into a spiritual figment that the idea of bothering to taunt Him seems absurd. Our mockery of God comes as we passively ignore His lordship of the universe. In the Old Testament, taunting God looked entirely different.\nSecond Chronicles 32:9-22 describes the invasion of Judah by the Assyrians, who were led by Sennacherib. They surrounded Jerusalem, the holy city of Israel and the home of God’s temple. They began to taunt, but they did not merely taunt the people or King Hezekiah—they hurled insults at God. “No god of any nation or kingdom has been able to rescue his people from my power or the power of my father. How much less will your God rescue you from my power!” (2 Chronicles 32:15). And they escalated their mockery from there.\nSennacherib thought he could rattle the faith of Judah by undermining their confidence in God. He thought he could bring God’s people to their knees. Well, he was right. Hezekiah, king of Judah, did indeed fall to his knees. He prayed for deliverance, and God acted. That day, an angel of the Lord killed every Assyrian warrior and sent the shamed Sennacherib home to his own demise. Jerusalem was rescued.\nThe prophecies of Nahum, given a few years after Sennacherib’s attack on Jerusalem, speak directly to the pride of the Assyrians, specifically Nineveh. And if the people of Nineveh had any doubt about whether the God who defeated Sennacherib’s army would again act to bring this defiant city to justice, the Lord makes it perfectly clear: “I am against you. This is the declaration of the Lord of Armies” (Nahum 2:13). Nahum 2 tells of the armies of God rising up fierce and strong with blood-red shields and chariots of fire to devastate Nineveh. Chapter 3 tells of the shaming of the city for its pride, prostitution, and sorcery—all acts of defiance against God. It ends by saying the city’s people would be scattered into exile, a just retribution in line with how they had treated nations they’d once conquered.\nThese are hard verses and harsh prophecies. Our instinct might be to ignore them or explain them away, but we cannot. In these verses we see the reality of a God who will not be mocked or rejected or reviled. He is not petty or spiteful; He is perfect and glorious, making such acts infinitely condemnable. We also see a God who rescues His people, who achieves justice and doesn’t let evil stand. In God’s infinite power, holiness, justice, and kindness we find comfort. \nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram2.jpg"
    },
    {
        "book_title": " Nahum, Habakkuk, Zephaniah, and Haggai",
        "devo_passages": "Nahum 1:1-15, 2 Kings 19:8–19",
        "devo_title": "God’s Vengeance",
        "devo_summary": "\n                    \n                    Many of our spiritual struggles stem from holding wrong views of God. When we don’t see God as He is, as He has revealed Himself in Scripture, spiritual dysfunction is sure to follow. I know when I lose sight of God’s goodness and doubt His faithfulness to me, my desire to obey God plummets along with my peace and joy. \nThe spiritual dysfunction of God’s people, the Israelites, is frequently on display in the books of the Minor Prophets. The Israelites would trust and obey the Lord for a time, but then would fall headlong into rebellion and idolatry. They seemed to forget who God is and who they were as God’s people. Their struggle to remain faithful to the covenant God had made with them through Moses resulted in God sending prophets to warn them of the consequences of their disobedience. \nBut not every message from the prophets is a warning to Israel. Sometimes the prophets announce God’s blessing upon them and judgment upon their enemies. That’s what we see happening in the book of Nahum. The prophet Nahum announces God’s impending judgment upon Assyria. About 150 years prior, God relented from destroying Assyria and its capital Nineveh, much to the chagrin of the prophet Jonah. But now God’s patience has run out with this arrogant, cruel nation. Assyria’s comeuppance has finally arrived. God’s people, despite their many failings, would soon be avenged. \nThough the book of Nahum highlights God’s grace toward Israel, chapter 1 reveals much about the Lord’s character that, had the Israelites consistently believed it, they might not have drifted from Him so often. Consider the first part of verse 3: “The LORD is slow to anger but great in power; the LORD will never leave the guilty unpunished.” From this verse we see that God is patient and merciful, and He is holy and just. He is a gracious God, and He is not to be trifled with.\nSeeing God as He is remains a challenge for us, too, but Jesus has made the Father known in a way the old covenant never could. God’s character is perfectly revealed in His Son, who is the “exact expression of his nature” (Hebrews 1:3). When we see Jesus in the pages of Scripture, we see the Father as well (John 14:9). Jesus corrects our faulty views of God. He is the “true light that gives light to everyone” (John 1:9). \nAs Christians we are invited to read the Minor Prophets, indeed all of Scripture, in light of the revelation of the gospel of Jesus Christ. All Scripture points to Him (John 5:39). While the prophets spoke to the issues of the day, and we should work hard to understand the original context of their words, many of their prophecies have a later, larger fulfillment as well. They point to the new covenant age and the kingdom of God inaugurated by Jesus and later to be consummated upon His return at the end of the age. These small books at the end of the Old Testament are sometimes overlooked, but they form a key chapter in God’s great story of redemption.\nWritten by Matt Erickson\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/10/HRT-MP-instagram1.jpg"
    }
]