[
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 1:7-9, Proverbs 2:1-12, Proverbs 3:35, Proverbs 9:13-18, Proverbs 17:12, Proverbs 18:2",
        "devo_title": "The Ways of Wisdom and Folly",
        "devo_summary": "\nBY She Reads Truth\n\nThe fear of the Lord is the beginning of knowledge; fools despise wisdom and discipline. \n-Proverbs 1:7\nProverbs: The Way of Wisdom is a study which focuses on the application of biblical wisdom to our hearts and lives.\nThe Book of Proverbs itself is a collection of sayings, not a narrative, and much of it is not designed to be read in verse-by-verse order. Instead, Proverbs lends itself well to a topical approach, which is how we have arranged this study.\nWe’ve gathered a selection of wisdom sayings from throughout the Book of Proverbs into daily thematic readings. Each day’s reading is followed by a short series of questions to help you grasp the meaning of the text and then apply that day’s wisdom to your own life. This study is meant to be contemplative—light on the quantity of verses but heavy on the thoughts, questions, and prayers that flow from them.\nAs you come to each day’s proverbs, read them several times. Linger over them. Read them out loud if that helps you absorb them. Take time to turn them over in your mind. Then use the questions provided to help you connect the day’s Scripture with your own life.\nBe brave, and watch how God uses the humbling pursuit of wisdom to lift you up and draw you closer to Him.\nGrace & Peace,\n The She Reads Truth Team\n//\nSection One— God: Wisdom concerning the nature and values of God\nIn this first week of our study of Proverbs, we turn our attention upward to who God is and the wisdom He offers His people. We’ll explore topics such as the ways of wisdom and folly, the fear of God, what God commands, what God hates, and blessings and curses.\n//\nDay One— The Ways of Wisdom and Folly\nThe key foundational truth in Proverbs is this: to pursue wisdom is to pursue God, and to deny God is to walk in the way of a fool.\nWisdom is not just the accumulation of knowledge. It is a way we walk through life, seeking not only to know, but to interact with the truths of God. Folly, in the biblical sense of the word, is to hold the love and pursuit of truth in contempt by choosing to make our own path. A life of wisdom or folly comes from more than just the quality of the individual decisions we make. It comes from how we approach the journey of life as a whole.\nConsider these proverbs that describe the way of wisdom, and also the way of folly.\n\nThe Way of Wisdom\nProverbs 1:7-9\n7 The fear of the Lord\nis the beginning of knowledge;\nfools despise wisdom and discipline.\n8 Listen, my son, to your father’s instruction,\nand don’t reject your mother’s teaching,\n9 for they will be a garland of grace on your head\nand a gold chain around your neck.\nProverbs 2:1-12\n1 My son, if you accept my words\nand store up my commands within you,\n2 listening closely to wisdom\nand directing your heart to understanding;\n3 furthermore, if you call out to insight\nand lift your voice to understanding,\n4 if you seek it like silver\nand search for it like hidden treasure,\n5 then you will understand the fear of the Lord\nand discover the knowledge of God.\n6 For the Lord gives wisdom;\nfrom His mouth come knowledge and understanding.\n7 He stores up success for the upright;\nHe is a shield for those who live with integrity\n8 so that He may guard the paths of justice\nand protect the way of His loyal followers.\n9 Then you will understand righteousness, justice,\nand integrity—every good path.\n10 For wisdom will enter your mind,\nand knowledge will delight your heart.\n11 Discretion will watch over you,\nand understanding will guard you,\n12 rescuing you from the way of evil—\nfrom the one who says perverse things.\n\nAsk—\nQ. These words come near the beginning of the Book of Proverbs as a way to help us read everything that follows. What do these verses suggest is the goal of growing in wisdom?\nQ. According to these verses, what does wisdom give us?\nQ. What do you hope a month of studying God’s wisdom will produce in you?\n\nThe Way of Folly\nProverbs 3:35\nThe wise will inherit honor,\nbut He holds up fools to dishonor.\nProverbs 9:13-18\n13 The woman Folly is rowdy;\nshe is gullible and knows nothing.\n14 She sits by the doorway of her house,\non a seat at the highest point of the city,\n15 calling to those who pass by,\nwho go straight ahead on their paths:\n16 “Whoever is inexperienced, enter here!”\nTo the one who lacks sense, she says,\n17 “Stolen water is sweet,\nand bread eaten secretly is tasty!”\n18 But he doesn’t know that the departed spirits are there,\nthat her guests are in the depths of Sheol.\nProverbs 17:12\nBetter for a man to meet a bear robbed of her cubs\nthan a fool in his foolishness.\nProverbs 18:2\nA fool does not delight in understanding,\nbut only wants to show off his opinions.\n\nAsk—\nQ. Proverbs 9:13-18 describes folly as being secretive about our sin. Why is being secretive about sin foolish, and what is the value of letting trusted friends know the secrets in our lives?\nQ. Look at Proverbs 18:2. What is the difference between understanding and expressing your own heart?\nQ. What does it look like to “delight in understanding”? On what sorts of occasions do you do this in your life?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Proverbs-Instagram1s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 3:7-8, Proverbs 8:13, Proverbs 19:23, Proverbs 23:17, Proverbs 31:30",
        "devo_title": "The Fear of God",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection One, cont’d— God: Wisdom concerning the nature and values of God\nIn this first week of our study of Proverbs, we are turning our attention upward to who God is and the wisdom He offers His people. We’re exploring topics such as the ways of wisdom and folly, the fear of God, what God commands, what God hates, and blessings and curses.\n//\nDay Two: The Fear of God\nIn Genesis 31:42, Jacob referred to God as “The Fear.” What exactly does it mean to fear God? Does it mean cowering under a rock for fear that if He sees us, He will strike us down? \nWhen the Bible talks about “fearing God,” it means we should revere God as holy. Fearing God by revering Him as holy is not a posture of hiding; it is a posture of drawing near. \nConsider these proverbs that focus on fearing the Lord.\n \nProverbs 3:7-8\n7 Don’t consider yourself to be wise;\nfear the Lord and turn away from evil.\n8 This will be healing for your body\nand strengthening for your bones.\nProverbs 8:13\nTo fear the Lord is to hate evil.\nI hate arrogant pride, evil conduct,\nand perverse speech.\nProverbs 19:23\nThe fear of the Lord leads to life;\none will sleep at night without danger.\nProverbs 23:17\nDon’t let your heart envy sinners;\ninstead, always fear the Lord.\nProverbs 31:30\nCharm is deceptive and beauty is fleeting,\nbut a woman who fears the Lord will be praised.\nAsk\nQ. What do you think it means to fear God in a way that actually cultivates intimacy between you and Him? \nQ. What does “Don’t consider yourself to be wise” (Proverbs 3:7) have to do with fearing God? \nQ. Where in your life does pride have its strongest hold? What is the difference between confidence and pride? \nQ. When you’ve found yourself “envying sinners” (Proverbs 23:17), what specifically do you envy? What does that envy reveal about what you revere? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram2s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 6:16-19, Proverbs 10:29, Proverbs 11:1, Proverbs 17:15, Proverbs 21:27, Proverbs 28:9",
        "devo_title": "What God Hates",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection One, cont’d— God: Wisdom concerning the nature and values of God\nIn this first week of our study of Proverbs, we are turning our attention upward to who God is and the wisdom He offers His people. We’re exploring topics such as the ways of wisdom and folly, the fear of God, what God commands, what God hates, and blessings and curses.\n//\n \nDay Three: What God Hates\nOne of the most glorious overarching themes of the Bible is the astonishing love of God toward a rebellious and sinful people. This aspect of God’s nature is so wonderful because it plays out in every setting and circumstance—even in a broken world full of terrible things. To truly know God, and therefore truly walk in wisdom, we must know not only what God loves, but also what He abhors. \nConsider these proverbs about the things God hates.\nProverbs 6:16-19\n16 The Lord hates six things;\nin fact, seven are detestable to Him:\n17 arrogant eyes, a lying tongue,\nhands that shed innocent blood,\n18 a heart that plots wicked schemes,\nfeet eager to run to evil,\n19 a lying witness who gives false testimony,\nand one who stirs up trouble among brothers.\nProverbs 10:29\nThe way of the Lord is a stronghold for the honorable,\nbut destruction awaits the malicious.\nProverbs 11:1\nDishonest scales are detestable to the Lord,\nbut an accurate weight is His delight.\nProverbs 17:15\nAcquitting the guilty and condemning the just—\nboth are detestable to the Lord.\nProverbs 21:27\nThe sacrifice of a wicked person is detestable—\nhow much more so\nwhen he brings it with ulterior motives!\nProverbs 28:9\nAnyone who turns his ear away from hearing the law—\neven his prayer is detestable.\nAsk\nQ. Why do you think there are so many proverbs that talk about what God hates? Why is this important for us to know? \nQ. God hates abominations, but loves sinful people. When you are sinned against or are a witness to sin, is hatred something that rises up in you? If not, why do you think there’s no hatred? If so, what is your hatred directed at? How do these proverbs instruct us in how and what to hate? \nQ. Look at Proverbs 11:1. In what sense are we, as people, scales? Name at least one specific time you were a dishonest scale. How can we be “accurate weights”? \nQ. Look at Proverbs 28:9. What does the first half (turning our ears away from hearing the Law) have to do with the second (offering detestable prayers)?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram3s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 4:1-4, Proverbs 6:20-23, Proverbs 29:18, Proverbs 30:5",
        "devo_title": "The Commands of God",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection One, cont’d— God: Wisdom concerning the nature and values of God\nIn this first week of our study of Proverbs, we are turning our attention upward to who God is and the wisdom He offers His people. We’re exploring topics such as the ways of wisdom and folly, the fear of God, what God commands, what God hates, and blessings and curses.\n//\nDay Four: The Commands of God\nImagine what this world would be like if God had chosen to be silent and distant from His creation. Imagine if He had not given us His Word to guide us. Imagine how lost and morally bankrupt we would be—how hopeless we would be when it comes to understanding our identity and worth. \nThough it is part of our sinful nature to rebel against God, His commands are more than mere rules. They are one of the primary ways He has drawn close and revealed His character. The commands of God help us to know who He is and what He values for the children He loves. \nConsider how these proverbs guide us in approaching God’s commands with wisdom.\nProverbs 4:1-4\n1 Listen, my sons, to a father’s discipline,\nand pay attention so that you may gain understanding,\n2 for I am giving you good instruction.\nDon’t abandon my teaching.\n3 When I was a son with my father,\ntender and precious to my mother,\n4 he taught me and said:\n“Your heart must hold on to my words.\nKeep my commands and live.”\nProverbs 6:20-23\n20 My son, keep your father’s command,\nand don’t reject your mother’s teaching.\n21 Always bind them to your heart;\ntie them around your neck.\n22 When you walk here and there, they will guide you;\nwhen you lie down, they will watch over you;\nwhen you wake up, they will talk to you.\n23 For a command is a lamp, teaching is a light,\nand corrective discipline is the way to life.\nProverbs 29:18\nWithout revelation people run wild,\nbut one who listens to instruction will be happy.\nProverbs 30:5\nEvery word of God is pure;\nHe is a shield to those who take refuge in Him.\nAsk\nQ. We have all inherited a sinful nature and, therefore, we cannot keep God’s commands perfectly. So, according to these proverbs, what purpose do His commands serve in the day-to-day life of a Christian? \nQ. Where do you find yourself “running wild” (Proverbs 29:18)? What drives this in us—this desire to live without law?\nQ. Is it possible to live without law? If we reject the Law of God and say “I live by no law,” is there still a law governing us? If so, what is it? \nQ. When was the last time you received “corrective discipline”? Are you one who willingly receives reproof? If so, under what circumstances and from whom? If not, why not? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram4s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 3:33, Proverbs 20:7, Proverbs 28:20, Proverbs 28:27, Proverbs 27:14  ",
        "devo_title": "Blessings and Curses",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection One, cont’d— God: Wisdom concerning the nature and values of God\nIn this first week of our study of Proverbs, we are turning our attention upward to who God is and the wisdom He offers His people. We’re exploring topics such as the ways of wisdom and folly, the fear of God, what God commands, what God hates, and blessings and curses.\n//\nDay Five: Blessings and Curses\nFrom the time we are born, we learn that the decisions of life come with consequences. If a baby cries, she might get fed or changed. But if a toddler throws a tantrum, he might get a time-out. Consequences are not payments as much as they are the natural results of our actions. \nIn this life, we experience blessings and curses—consequences of choices we make or the choices others make that affect us. The preserving grace of God assures us that He is not temperamental or spiteful, but He does discipline His children. His discipline is for our flourishing because how we live and what we do matter in the here and now. \nThese proverbs value our present well-being without abandoning the biblical truth that love covers a multitude of sins.\nProverbs 3:33\nThe Lord’s curse is on the household of the wicked,\nbut He blesses the home of the righteous;\nProverbs 20:7\nThe one who lives with integrity is righteous;\nhis children who come after him will be happy.\nProverbs 28:20\nA faithful man will have many blessings,\nbut one in a hurry to get rich\nwill not go unpunished.\nProverbs 28:27\nThe one who gives to the poor\nwill not be in need,\nbut one who turns his eyes away\nwill receive many curses.\nAnd for fun:\nProverbs 27:14\nIf one blesses his neighbor\nwith a loud voice early in the morning,\nit will be counted as a curse to him.\nAsk\nQ. To what extent do you think you recognize God’s blessings in your life? What are some ways you believe God has blessed you? \nQ. To what extent do you think you are aware of God’s opposition in your life? Are there any areas of your life you feel God has thwarted or opposed? \nQ. What do you think God is responding to when He blesses? What do you think God is opposing when He curses? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram5s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "James 1:2-5",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nText:  James 1:2-5 \nThe journey to spiritual maturity involves trial and struggle. This passage from James reminds us to persevere, and to ask God for wisdom as we navigate difficult seasons. He is faithful to give it. \nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself.\nConsider it a great joy, my brothers, whenever you experience various trials,\nknowing that the testing of your faith produces endurance.\nBut endurance must do its complete work, so that you may be mature and complete, lacking nothing.\nNow if any of you lacks wisdom, he should ask God, who gives to all generously and without criticizing, and it will be given to him.\n-James 1:2-5\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram6sn.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 1:7 ",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry the Word of God with us wherever we go—to have God-breathed truth, instruction, and reproof in our hearts and minds as we live unto Him each day.\nThis week, let’s memorize a verse that expresses the big theme of the Book of Proverbs:\nThe fear of the Lord\nis the beginning of knowledge;\nfools despise wisdom and discipline.\n-Proverbs 1:7\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us? \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/4-Proverbs1.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 3:31-32, Proverbs 23:17, Proverbs 24:1-2, Proverbs 24:19-20 , Proverbs 14:26 , Proverbs 18:10-11, Proverbs 20:29, Proverbs 25:28",
        "devo_title": "Seduction and Strength",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Two—The Inner Life:Wisdom concerning the body, heart, and mind\nThe proverbs we study this week will turn our attention inward. We’ll examine ourselves in light of the wisdom God’s Word provides on the topics of seduction and strength, health and happiness, adversity and anger, counsel and instruction, and humility and pride.\n//\nDay Eight: Seduction and Strength\nIt’s an image we’ve all seen, either on a movie screen or in our imaginations: a person faced with a decision stands conflicted, an angel whispering into one ear and a devil whispering into the other. \nAs fallen people in a fallen world, we should assume we are susceptible to seduction at any given moment. We should also assume that, for every situation we face, the wisdom of God is available to us if we ask. Both of these safe assumptions call for us to pay attention to the words of wisdom found in Scripture. \nThese proverbs call us to examine how seduction and strength work in our lives.\nSeduction\n\nProverbs 3:31-32\nDon’t envy a violent man\nor choose any of his ways;\nfor the devious are detestable to the Lord,\nbut He is a friend to the upright.\nProverbs 23:17\nDon’t let your heart envy sinners;\ninstead, always fear the Lord.\nProverbs 24:1-2\nDon’t envy evil men\nor desire to be with them,\nfor their hearts plan violence,\nand their words stir up trouble.\nProverbs 24:19-20\nDon’t be agitated by evildoers,\nand don’t envy the wicked.\nFor the evil have no future;\nthe lamp of the wicked will be put out.\nAsk\nQ. What is the most powerfully seductive voice speaking into your life right now? What is it promising that makes your heart want to follow? \nQ. With that answer in front of you, what is the deeper, God-given longing of your heart that lies beneath the desire you just named? \nQ. Who or what do you envy the most? How does envy distort the promises of God in our lives? \nStrength\nProverbs 14:26\nIn the fear of the Lord one has strong confidence\nand his children have a refuge.\nProverbs 18:10-11\nThe name of Yahweh is a strong tower;\nthe righteous run to it and are protected.\n11 A rich man’s wealth is his fortified city;\nin his imagination it is like a high wall.\nProverbs 20:29\nThe glory of young men is their strength,\nand the splendor of old men is gray hair.\nProverbs 25:28\nA man who does not control his temper\nis like a city whose wall is broken down.\nAsk\nQ. What are the strong towers you run to for refuge? Are any of them addictions? \nQ. What do you think Proverbs 25:28 means? Can you think of a time when you found this proverb to be true in your own life? \nQ. How would you put Proverbs 20:29 into your own words? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram8s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 4:20-22, Proverbs 14:30, Proverbs 18:14, Proverbs 25:25, Proverbs 3:13, Proverbs 14:10, 13, Proverbs 24:17 , Proverbs 29:18",
        "devo_title": "Health and Happiness",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Two—The Inner Life:Wisdom concerning the body, heart, and mind\nThe proverbs we study this week we are turning our attention inward. We’re examining ourselves in light of the wisdom God’s Word provides on the topics of seduction and strength, health and happiness, adversity and anger, counsel and instruction, and humility and pride.\nDay Nine: Health and Happiness \nThe first question of the Westminster Shorter Catechism asks, “What is the chief end of man?” and answers, “To glorify God and enjoy Him forever.” This answer assumes two profound truths: we are made to be happy, and we are eternal beings. The Bible has a lot to say about both of these. Our hearts and our health matter to God. \nThough we are eternal beings, God created us with bodies. He also tells us that we will have glorified bodies for all eternity, where there will be no more sadness or pain—only joy. Right now, however, we live in a fallen world where our joy is sometimes quelled and our bodies sometimes break. \nThese proverbs help us live now in light of the eternal comfort that awaits.\nHealth\nProverbs 4:20-22\n20 My son, pay attention to my words;\nlisten closely to my sayings.\n21 Don’t lose sight of them;\nkeep them within your heart.\n22 For they are life to those who find them,\nand health to one’s whole body.\nProverbs 14:30\nA tranquil heart is life to the body,\nbut jealousy is rottenness to the bones.\nProverbs 18:14\nA man’s spirit can endure sickness,\nbut who can survive a broken spirit?\nProverbs 25:25\nGood news from a distant land\nis like cold water to a parched throat.\nAsk\nQ. These proverbs hold physical well-being up as a good thing and as a benefit of spiritual health. How are the two connected? What are the spiritual reasons we should care about our physical health? \nQ. How would you explain the connection between wise counsel and “health to one’s whole body” (Proverbs 4:22)? Conversely, how can something like envy contribute to poor health? \nQ. Where do you turn when your spiritual health needs a lift?\nHappiness\nProverbs 3:13-14\n13 Happy is a man who finds wisdom\nand who acquires understanding,\n14 for she is more profitable than silver,\nand her revenue is better than gold.\nProverbs 14:10, 13\n10 The heart knows its own bitterness,\nand no outsider shares in its joy.\n13 Even in laughter a heart may be sad,\nand joy may end in grief.\nProverbs 24:17\nDon’t gloat when your enemy falls,\nand don’t let your heart rejoice when he stumbles…\nProverbs 29:18\nWithout revelation people run wild,\nbut one who listens to instruction will be happy.\nAsk\nQ. We all want to be happy in this life, but Colossians 3:2 tells us to set our minds on things above, not on earthly things. How do you see yourself placing value and identity in your own personal happiness, and how do you measure it?\nQ. Put into your own words a definition of godly happiness. What light does Proverbs 14:10&13 shed on true happiness? \nQ. Look at Proverbs 29:18. What is the relationship between happiness and obedience to God? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram9s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 1:33, Proverbs 3:25-26, Proverbs 17:17, Proverbs 27:10, Proverbs 3:30, Proverbs 10:12, Proverbs 15:1, Proverbs 17:14, Proverbs 25:8",
        "devo_title": "Adversity and Anger",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Two—The Inner Life:Wisdom concerning the body, heart, and mind\nThe proverbs we study this week we are turning our attention inward. We’re examining ourselves in light of the wisdom God’s Word provides on the topics of seduction and strength, health and happiness, adversity and anger, counsel and instruction, and humility and pride.\nDay Ten: Adversity and Anger\nHarboring anger can destroy a person, but facing our anger often requires a great deal of humility and courage. It is easier to blame other people for the problems in our lives than to do the soul-searching work of admitting our own responsibility. The Bible cares about how we handle relationships in times of adversity and through seasons of anger. \nThese proverbs are like a hand on your shoulder, telling you to take a breath before you barge, guns blazing, into conflict.\nAdversity\nProverbs 3:25-26\n25 Don’t fear sudden danger\nor the ruin of the wicked when it comes,\n26 for the Lord will be your confidence\nand will keep your foot from a snare.\nProverbs 17:17\nA friend loves at all times,and a brother is born for a difficult time.\nProverbs 27:10\nDon’t abandon your friend or your father’s friend,\nand don’t go to your brother’s house\nin your time of calamity;\nbetter a neighbor nearby than a brother far away.\nAsk\nQ. Look at Proverbs 3:25-26. What dangers do you fear the most? What does it mean that the Lord is our “confidence”? \nQ. What is your general reaction to adversity? Do you tend to blame God for it? Do you reach out to Him for comfort? \nQ. What do you think Proverbs 27:10 is saying? \nAnger\nProverbs 3:30\nDon’t accuse anyone without cause,\nwhen he has done you no harm.\nProverbs 10:12\nHatred stirs up conflicts,\nbut love covers all offenses.\nProverbs 15:1\nA gentle answer turns away anger,\nbut a harsh word stirs up wrath.\nProverbs 17:14\nTo start a conflict is to release a flood;\nstop the dispute before it breaks out.\nProverbs 25:8\nDon’t take a matter to court hastily.\nOtherwise, what will you do afterward\nif your opponent humiliates you?\nAsk\nQ. What makes you angry? Why? In what ways do you see pride and anger working together in your life?\nQ. Based on the wisdom of these verses, do you think it is possible for you to harbor anger without it affecting anyone else? Why or why not?\nQ. Do you harbor anger? Does unresolved anger ever just go away? What hope does Scripture give us for our angry hearts (see Proverbs 10:12)? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram10s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 3:6, Proverbs 17:10, Proverbs 19:20, Proverbs 12:15-16, Proverbs 13:20",
        "devo_title": "Counsel and Instruction",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Two—The Inner Life:Wisdom concerning the body, heart, and mind\nThe proverbs we study this week we are turning our attention inward. We’re examining ourselves in light of the wisdom God’s Word provides on the topics of seduction and strength, health and happiness, adversity and anger, counsel and instruction, and humility and pride.\nDay Eleven: Counsel and Instruction\nSeek counsel. Desire to be taught. Nurture a curiosity to explore things you don’t understand.\nOn a purely intellectual level, these ideas make perfect sense—to the extent that they shouldn’t even need to be said. But because we are proud, our hearts tense up at the suggestion that we have much to learn. \nThe way of wisdom is about more than simply obtaining new information. It is about living as part of a community where we gladly regard one another as valuable. \nThese proverbs charge us to lay down our pride and seek counsel and instruction.\nCounsel and Instruction\nProverbs 3:6\nThink about Him in all your ways,\nand He will guide you on the right paths.\nProverbs 12:15-16\nA fool’s way is right in his own eyes,\nbut whoever listens to counsel is wise.\nA fool’s displeasure is known at once,\nbut whoever ignores an insult is sensible.\nProverbs 13:20\nThe one who walks with the wise will become wise,\nbut a companion of fools will suffer harm.\nProverbs 17:10\nA rebuke cuts into a perceptive person\nmore than a hundred lashes into a fool.\nProverbs 19:20\nListen to counsel and receive instruction\nso that you may be wise later in life.\nAsk\nQ. Are you someone who desires wise counsel, or are you someone who wants to find your own way? \nQ. How do you react when people try to tell you what you should do? How do you react to a command from God that you’re not particularly fond of? \nQ. What does it look like to walk with wise people? How is this something you are doing, or could do, in your life? \nQ. Think about those people who have counseled and instructed you. Are you becoming someone who has counsel and instruction to give? Is there anyone in your life right now who needs your wisdom, experience, and counsel? What would it look like for you to pursue that person this week?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram11s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 11:2, Proverbs 15:33, Proverbs 22:4, Proverbs 27:1-2, Proverbs 29:23",
        "devo_title": "Humility and Pride",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Two—The Inner Life:Wisdom concerning the body, heart, and mind\nThe proverbs we study this week we are turning our attention inward. We’re examining ourselves in light of the wisdom God’s Word provides on the topics of seduction and strength, health and happiness, adversity and anger, counsel and instruction, and humility and pride.\nDay Twelve: Humility and Pride\nIn Mere Christianity, C.S. Lewis wrote, “the essential vice, the utmost evil, is Pride. Unchastity, anger, greed, drunkenness, and all that, are mere flea bites in comparison: it was through Pride that the devil became the devil: Pride leads to every other vice: it is the complete anti-God state of mind.” \nThe wise person assumes the battle between humility and pride is always raging in our hearts. These proverbs help us understand that fight.\nProverbs 11:2\nWhen pride comes, disgrace follows,\nbut with humility comes wisdom.\nProverbs 15:33\nThe fear of the Lord is what wisdom teaches,\nand humility comes before honor.\nProverbs 22:4\nThe result of humility is fear of the Lord,\nalong with wealth, honor, and life.\nProverbs 27:1-2\nDon’t boast about tomorrow,\nfor you don’t know what a day might bring.\n2 Let another praise you, and not your own mouth—\na stranger, and not your own lips.\nProverbs 29:23\nA person’s pride will humble him,\nbut a humble spirit will gain honor.\nAsk \nQ. Where does pride have its strongest hold on you? \nQ. What is the difference between self-deprecation and humility? Why do you think we employ false humility in the ways we relate to others? What do we want it to do for us? \nQ. In these proverbs, humility is associated with wisdom, honor, and riches. Pride, however, is associated with shame. Do you functionally live as someone who accepts these connections or as one who rejects the idea that they are related? \nQ. We should be people who seek to praise God for the work He is doing in us. The gospel tells us that the Holy Spirit works in the lives of believers to make us more like Jesus (Philippians 2:13). This means He is working to cultivate humility in us. Name a place in your life where you can thank God for bringing you true humility? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram12s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Colossians 2:1-3 ",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nOne of the greatest honors God gives to His people is the privilege of walking through seasons of growth together. In this passage from Colossians, we get a glimpse into the Apostle Paul’s love and concern for his friends as they seek wisdom.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this text for a specific person in your life and for yourself.\n1 For I want you to know how great a struggle I have for you,\nfor those in Laodicea, and for all who have not seen me in person.\n2 I want their hearts to be encouraged and joined together in love,\nso that they may have all the riches of assured understanding\nand have the knowledge of God’s mystery—Christ.\n3 All the treasures of wisdom and knowledge are hidden in Him.\n-Colossians 2:1-3\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram13s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 4:23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry the Word of God with us wherever we go—to have God-breathed truth, instruction, and reproof in our hearts and minds as we live unto Him each day.\nThis week let’s memorize a verse about self-examination before the Lord:\nGuard your heart above all else,\nfor it is the source of life.\n-Proverbs 4:23\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day. As you read this verse this week, let’s give thanks for God’s intimate love for His people.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/4-Proverbs2.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 31:10-31",
        "devo_title": "A Virtuous Woman",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Three. Relationships: Wisdom concerning our interpersonal lives\nThis week’s proverbs will turn our attention outward to the relationships we have with others. Let’s look at the the wisdom God’s Word gives us concerning parents and children, adultery, correction, and the power of the tongue.\nDay Fifteen: A Virtuous Woman\nProverbs 31 is the most comprehensive description of a godly woman in Scripture. It is also a poem—an acrostic—each line beginning with the next letter in the Hebrew alphabet. The poetic structure adds to the mystery, orderliness, and poetry of the woman being described.\nThough not all of the qualities here belong solely to women (Proverbs 31:16, for example), this chapter gives us an ideal personification of virtue—a person “who fears the Lord” (Proverbs 31:30). What are those virtues? Read the passage to see.\nProverbs 31:10-31\n10 Who can find a capable wife?\nShe is far more precious than jewels.\n11 The heart of her husband trusts in her,\nand he will not lack anything good.\n12 She rewards him with good, not evil,\nall the days of her life.\n13 She selects wool and flax\nand works with willing hands.\n14 She is like the merchant ships,\nbringing her food from far away.\n15 She rises while it is still night\nand provides food for her household\nand portions for her female servants.\n16 She evaluates a field and buys it;\nshe plants a vineyard with her earnings.\n17 She draws on her strength\nand reveals that her arms are strong.\n18 She sees that her profits are good,\nand her lamp never goes out at night.\n19 She extends her hands to the spinning staff,\nand her hands hold the spindle.\n20 Her hands reach out to the poor,\nand she extends her hands to the needy.\n21 She is not afraid for her household when it snows,\nfor all in her household are doubly clothed.\n22 She makes her own bed coverings;\nher clothing is fine linen and purple.\n23 Her husband is known at the city gates,\nwhere he sits among the elders of the land.\n24 She makes and sells linen garments;\nshe delivers belts to the merchants.\n25 Strength and honor are her clothing,\nand she can laugh at the time to come.\n26 She opens her mouth with wisdom\nand loving instruction is on her tongue.\n27 She watches over the activities of her household\nand is never idle.\n28 Her sons rise up and call her blessed.\nHer husband also praises her:\n29 “Many women are capable,\nbut you surpass them all!”\n30 Charm is deceptive and beauty is fleeting,\nbut a woman who fears the Lord will be praised.\n31 Give her the reward of her labor,\nand let her works praise her at the city gates.\nAsk\nQ. This picture of a virtuous woman comes to us from an ancient context. What are some present-day comparisons you could make between the woman in this passage and a godly woman today? \nQ. How is the woman depicted in this passage different from the women our culture tends to prize?\nQ. What does this picture of a virtuous woman reveal about what it means to be a virtuous person, whether man or woman? \nQ. If you have a woman like this in your life, how can you tell her before the sun goes down today?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram15s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 10:1, Proverbs 13:1, Proverbs 14:26, Proverbs 19:18, Proverbs 22:6, Proverbs 22:15, Proverbs 30:17",
        "devo_title": "Parents and Children",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Three. Relationships: Wisdom concerning our interpersonal lives\nThis week’s proverbs are turning our attention outward to the relationships we have with others. We’re looking at the the wisdom God’s Word gives us concerning parents and children, adultery, correction, and the power of the tongue.\nDay Sixteen: Parents and Children \nThe last words in the Old Testament, in Malachi chapter 4, tell us that the Messiah will “turn the hearts of fathers to their children and the hearts of children to their fathers,” healing what is broken between them (v. 6). Few relationships carry greater room for pain or influence than the parent-child relationship. \nThe Book of Proverbs does not assume this relationship is easy, or that its health is automatic. But it does acknowledge that this relationship, potentially more than any other, has the capacity to shape a young person’s life in beautiful and lasting ways. \nThe wisdom given here looks very much like what Jesus described as the greatest love there is—one person laying down their life for another (John 15:13). These proverbs shed some light on what that sort of self-sacrifice looks like.\nProverbs 10:1\nA wise son brings joy to his father,\nbut a foolish son, heartache to his mother.\nProverbs 13:1\nA wise son responds to his father’s discipline,\nbut a mocker doesn’t listen to rebuke.\nProverbs 14:26\nIn the fear of the Lord one has strong confidence\nand his children have a refuge.\nProverbs 19:18\nDiscipline your son while there is hope;\ndon’t be intent on killing him.\nProverbs 22:6\nTeach a youth about the way he should go;\neven when he is old he will not depart from it.\nProverbs 22:15\nFoolishness is tangled up in the heart of a youth;\nthe rod of discipline will drive it away from him.\nProverbs 30:17\nAs for the eye that ridicules a father\nand despises obedience to a mother,\nmay ravens of the valley pluck it out\nand young vultures eat it.\nAsk\nQ. Looking back, how did you see the wisdom in these verses modeled for you (or not modeled for you) when you were younger? What can you learn from that now? \nQ. Look at Proverbs 10:1. Why do the actions of a child have so much impact on the hearts of his or her parents? \nQ. Why does the Bible tell parents to train their children early? \nQ. In what ways does the parent-child relationship uniquely cultivate understanding of the gospel in our lives? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram16s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 5:1-17",
        "devo_title": "Adultery",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Three. Relationships: Wisdom concerning our interpersonal lives\nThis week’s proverbs are turning our attention outward to the relationships we have with others. We’re looking at the the wisdom God’s Word gives us concerning parents and children, adultery, correction, and the power of the tongue.\nDay Seventeen: Adultery\nNotice the way this topic, adultery, comes up in Scripture. It is included in the Ten Commandments as a clear statement of Law: “Don’t do this.” But the Book of Proverbs adds a layer of complexity to that law by discussing the sometimes hard-to-detect process often involved in committing this particular sin. \nFew people wake up in the morning saying, “Today I am going to commit adultery.” Much of the time, the act of adultery is the product of walking a long and dangerous road of seduction. Sometimes the seductress described in this text is a particular person (man or woman) who tries to lure another person into infidelity. But sometimes the seductress in this passage can be the unchecked longings and unaddressed pains in our own hearts, calling to us from within to succumb to temptation with the promise that it will bring us happiness. \nKeep both of these meanings in mind when reading these proverbs about adultery.\nProverbs 5:1-17\n5 My son, pay attention to my wisdom;\nlisten closely to my understanding\n2 so that you may maintain discretion\nand your lips safeguard knowledge.\n3 Though the lips of the forbidden woman drip honey\nand her words are smoother than oil,\n4 in the end she’s as bitter as wormwood\nand as sharp as a double-edged sword.\n5 Her feet go down to death;\nher steps head straight for Sheol.\n6 She doesn’t consider the path of life;\nshe doesn’t know that her ways are unstable.\n7 So now, my sons, listen to me,\nand don’t turn away from the words of my mouth.\n8 Keep your way far from her.\nDon’t go near the door of her house.\n9 Otherwise, you will give up your vitality to others\nand your years to someone cruel;\n10 strangers will drain your resources,\nand your earnings will end up in a foreigner’s house.\n11 At the end of your life, you will lament\nwhen your physical body has been consumed,\n12 and you will say, “How I hated discipline,\nand how my heart despised correction.\n13 I didn’t obey my teachers\nor listen closely to my mentors.\n14 I am on the verge of complete ruin\nbefore the entire community.”\n15 Drink water from your own cistern,\nwater flowing from your own well.\n16 Should your springs flow in the streets,\nstreams of water in the public squares?\n17 They should be for you alone\nand not for you to share with strangers.\n Ask\nQ. Why do you suppose this passage is so personalized and told like a vivid story, as opposed to being a list of reasons why adultery is wrong? \nQ. Describe the temptress wooing your heart in this season of your life. \nQ. It is interesting that a negative thing (an immoral woman) is compared to a sharp two-edged sword, when the Word of God is also compared to a sharp two-edged sword (Hebrews 4:12). What do they have in common? \nQ. What does “Keep your way far from her” mean in Proverbs 5:8? Practically, what are some ways you can do this as it relates to the particular temptation you are facing? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram17s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 3:12, Proverbs 6:23, Proverbs 9:8 , Proverbs 11:14, Proverbs 12:1, Proverbs 19:20-21, Proverbs 27:5-6",
        "devo_title": "Correction",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Three. Relationships: Wisdom concerning our interpersonal lives\nThis week’s proverbs are turning our attention outward to the relationships we have with others. We’re looking at the the wisdom God’s Word gives us concerning parents and children, adultery, correction, and the power of the tongue.\nDay Eighteen: Correction\nAs followers of Jesus, we are called to humility—to be open to correction from God’s Word, and from people in our lives who love us. \nReceiving correction, as with seeking counsel, requires the humility to openly admit that we do not know all there is to know. It also requires the grace to receive what may, at the time, feel like a wound, believing that wounds from a true friend can be trusted. \nConsider how these proverbs dealing with correction work to correct you even as you read them.\nProverbs 3:12\n[F]or the Lord disciplines the one He loves,\njust as a father, the son he delights in.\nProverbs 6:23\nFor a command is a lamp, teaching is a light,\nand corrective discipline is the way to life.\nProverbs 9:8\nDon’t rebuke a mocker, or he will hate you;\nrebuke a wise man, and he will love you.\nProverbs 11:14\nWithout guidance, people fall,\nbut with many counselors there is deliverance.\nProverbs 12:1\nWhoever loves discipline loves knowledge,\nbut one who hates correction is stupid.\nProverbs 19:20-21\nListen to counsel and receive instruction\nso that you may be wise later in life.\n21 Many plans are in a man’s heart,\nbut the Lord’s decree will prevail.\nProverbs 27:5-6\nBetter an open reprimand\nthan concealed love.\n6 The wounds of a friend are trustworthy,\nbut the kisses of an enemy are excessive.\nAsk\nQ. From whom do you welcome correction? Why? Who seeks wise counsel from you? Why? \nQ. Consider Proverbs 9:8. Describe what a mocker is and does. What motivates them to do so? Are you a mocker? \nQ. How would you explain the meaning of Proverbs 27:6 to a friend? What are some wounds good friends have given you in the spirit of this proverb? What do you think the phrase “kisses of an enemy” means?\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram18s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 29:20, Proverbs 10:11, Proverbs 15:1-2, Proverbs 26:4-5, Proverbs 31:8-9  ",
        "devo_title": "The Tongue",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Three. Relationships: Wisdom concerning our interpersonal lives\nThis week’s proverbs are turning our attention outward to the relationships we have with others. We’re looking at the the wisdom God’s Word gives us concerning parents and children, adultery, correction, and the power of the tongue.\nDay Nineteen: The Tongue\nOur words matter. James wrote, “Every sea creature, reptile, bird, or animal is tamed and has been tamed by man, but no man can tame the tongue. It is a restless evil, full of deadly poison. We praise our Lord and Father with it, and we curse men who are made in God’s likeness with it. Praising and cursing come out of the same mouth. My brothers, these things should not be this way” (James 3:7-10). \nFew of us probably spend much time considering how we use our words throughout the course of a day. Use this day to pay careful attention to your words, and see what wisdom these proverbs have for you.\nProverbs 29:20\nDo you see a man who speaks too soon?\nThere is more hope for a fool than for him.\nProverbs 10:11\nThe mouth of the righteous is a fountain of life,\nbut the mouth of the wicked conceals violence.\nProverbs 15:1-2\nA gentle answer turns away anger,\nbut a harsh word stirs up wrath.\n2 The tongue of the wise makes knowledge attractive,\nbut the mouth of fools blurts out foolishness.\nProverbs 26:4-5\nDon’t answer a fool according to his foolishness\nor you’ll be like him yourself.\n5 Answer a fool according to his foolishness\nor he’ll become wise in his own eyes.\nProverbs 31:8-9\nSpeak up for those who have no voice,\nfor the justice of all who are dispossessed.\n9 Speak up, judge righteously,\nand defend the cause of the oppressed and needy.\nAsk\nQ. Why do our words matter so much? What is it about the way God made us that gives power to words? \nQ. Our words can give life and take life. They can bring light or add darkness. How have you given light and life with your words? How have you spoken death and darkness?\nQ. Why do you think Proverbs 26:4 and 26:5 are back to back? Is this a contradiction in the Bible, or is there an important principle of wisdom to be found in their being placed beside each other? If so, what is it? \nQ. Are there any areas of your life where you know you need to practice the wisdom of Proverbs 31:8-9? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram19s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": " Ephesians 1:16-19 ",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nGod cares about our daily decisions. This passage from Ephesians teaches us how to pray for counsel and discernment for ourselves and for others.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this text for a specific person in your life and for yourself.\n16 I never stop giving thanks for you as I remember you in my prayers.\n17 I pray that the God of our Lord Jesus Christ, the glorious Father, would give you a spirit of wisdom and revelation in the knowledge of Him.\n18 I pray that the perception of your mind may be enlightened so you may know what is the hope of His calling, what are the glorious riches of His inheritance among the saints,\n19 and what is the immeasurable greatness of His power to us who believe, according to the working of His vast strength.\n-Ephesians 1:16-19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram20s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 27:17 ",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry the Word of God with us wherever we go—to have God-breathed truth, instruction, and reproof in our hearts and minds as we live unto Him each day.\nAfter a week focused on relationships, let’s memorize a verse that invites us into the vulnerability of  being known by others for the sake of our spiritual health:\nIron sharpens iron,\nand one man sharpens another.\n-Proverbs 27:17\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day. Let’s give thanks for the gift of loving reproof in our lives. \nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/4-Proverbs3.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 4:23, Proverbs 12:27, Proverbs 13:11, Proverbs 22:29, Proverbs 27:23-27, Proverbs 6:6-11, Proverbs 26:14-16, Proverbs 15:19",
        "devo_title": "Diligence and Laziness",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Four. Work and Wealth: Wisdom concerning our material world\nThis week’s proverbs will turn our attention to biblical wisdom concerning how we interact with the material world. We’ll explore the topics of diligence and laziness, justice, generosity and gluttony, wealth and poverty, and good versus evil.\nDay Twenty-Two: Diligence and Laziness\nWhen Jesus taught us to pray, He told us to say, “Give us today our daily bread” (Matthew 6:11). Not our monthly or yearly bread, but our daily bread. The instruction to pray for daily sustenance implies that we are meant to always be engaged in the work and provision of life. We are not meant to be workaholics, but neither are we meant to coast. We are called to engage with the life we’ve been given. \nGodly diligence is the pursuit of contributing beauty, goodness, and truth in whatever ways we can. Consider how these proverbs help us understand that call.\nDiligence\nProverbs 4:23\nGuard your heart above all else,\nfor it is the source of life.\nProverbs 12:27\nA lazy man doesn’t roast his game,\nbut to a diligent man, his wealth is precious.\nProverbs 13:11\nWealth obtained by fraud will dwindle,\nbut whoever earns it through labor will multiply it.\nProverbs 22:29\nDo you see a man skilled in his work?\nHe will stand in the presence of kings.\nHe will not stand in the presence of unknown men.\n Proverbs 27:23-27\n23 Know well the condition of your flock,\nand pay attention to your herds,\n24 for wealth is not forever;\nnot even a crown lasts for all time.\n25 When hay is removed and new growth appears\nand the grain from the hills is gathered in,\n26 lambs will provide your clothing,\nand goats, the price of a field;\n27 there will be enough goat’s milk for your food—\nfood for your household\nand nourishment for your female servants.\nAsk\nQ. In what areas of your life are you the most diligent? What does Scripture call us to be diligent about?\nQ. Proverbs 4:23 calls us to “guard our hearts.” What does it mean to make caring for your heart a priority? \nQ. What are the ways you currently take care of your heart? If you don’t have an answer, what would it look like for you to begin? \nLaziness\nProverbs 6:6-11\n6 Go to the ant, you slacker!\nObserve its ways and become wise.\n7 Without leader, administrator, or ruler,\n8 it prepares its provisions in summer;\nit gathers its food during harvest.\n9 How long will you stay in bed, you slacker?\nWhen will you get up from your sleep?\n10 A little sleep, a little slumber,\na little folding of the arms to rest,\n11 and your poverty will come like a robber,\nyour need, like a bandit.\nProverbs 26:14-16\n14 A door turns on its hinges,\nand a slacker, on his bed.\n15 The slacker buries his hand in the bowl;\nhe is too weary to bring it to his mouth.\n16 In his own eyes, a slacker is wiser\nthan seven men who can answer sensibly.\nProverbs 15:19\nA slacker’s way is like a thorny hedge,\nbut the path of the upright is a highway.\nAsk\nQ. We live in a culture of busy people. Is it possible to be extremely busy and extremely lazy at the same time? Explain. \nQ. What does laziness look like in your life? Why is laziness a gospel issue? Why, specifically, is it sinful? \nQ. Under the banner of a gracious God, how would you state in the positive the negative command, “Don’t be lazy”? \n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram22sn.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 1:33, Proverbs 13:6, Proverbs 3:9-10, Proverbs 4:13, Proverbs 11:1, Proverbs 13:23, Proverbs 18:13, Proverbs 18:17, Proverbs 22:28",
        "devo_title": "Security and Justice",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Four. Work and Wealth: Wisdom concerning our material world\nThis week’s proverbs will turn our attention to biblical wisdom concerning how we interact with the material world. We’ll explore the topics of diligence and laziness, justice, generosity and gluttony, wealth and poverty, and good versus evil.\nDay Twenty-Three: Security and Justice \nYou have only ever had one provider. One of the most frequent commands in the Bible is, “Do not fear.” This command is less about feeling the sensation of fear and more about what our fear tells us about our view of God. We’re called to live without fear because God, who made us, knows our needs and takes care of us.\nOf course, as we’ve already seen in this study, sometimes God’s provision comes in the form of loss, by way of inheriting the natural consequences of our actions. But God calls us to honor Him by trusting in His goodness, rather than our possessions, to give us security.\nThese proverbs help us understand security and justice from a biblical perspective. \nSecurity\nProverbs 1:33\nBut whoever listens to me will live securely\nand be free from the fear of danger.\nProverbs 13:6\nRighteousness guards people of integrity,\nbut wickedness undermines the sinner.\nProverbs 3:9-10 ESV\nHonor the Lord with your wealth\nand with the firstfruits of all your produce;\nthen your barns will be filled with plenty,\nand your vats will be bursting with wine.\nProverbs 4:13\nHold on to instruction; don’t let go.\nGuard it, for it is your life.\nAsk\nQ. Look at Proverbs 1:33. What benefit is there in listening to God? What is your security? \nQ. Why does Scripture talk about giving in terms of “firstfruits” (Proverbs 3:9)? What is the wisdom of giving from the top of our resources as opposed to the bottom? In what ways does giving “firstfruits” combat the power of greed in our hearts? \nQ. Look at Proverbs 4:13. What does it look like to “hold on to instruction”? \nJustice\nProverbs 11:1\nDishonest scales are detestable to the Lord,\nbut an accurate weight is His delight.\nProverbs 13:23\nThe uncultivated field of the poor yields abundant food,\nbut without justice, it is swept away.\nProverbs 18:13\nThe one who gives an answer before he listens—\nthis is foolishness and disgrace for him.\nProverbs. 18:17\nThe first to state his case seems right\nuntil another comes and cross-examines him.\nProverbs 22:28\nDon’t move an ancient boundary marker\nthat your fathers set up.\nAsk\nQ. Name a time when you have fallen prey to the sort of folly described in Proverbs 18:13. How does answering without listening contribute to injustice? Why do you think people are so quick to speak confidently about things we don’t fully understand? \nQ. What does Proverbs 22:28 have to do with preserving justice? What do you think is the wisdom behind this specific instruction not to move an ancient landmark? \nQ. These proverbs tie the plight of the poor to whoever reads these words of God’s wisdom. What does the plight of the poor have to do with you? Why should you care? Why is it wise and godly to care? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram23s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 21:17, Proverbs 23:19-21 , Proverbs 25:16, Proverbs 28:7, Proverbs 3:27-28, Proverbs 19:17, Proverbs 30:15-16",
        "devo_title": "Generosity and Gluttony",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Four. Work and Wealth: Wisdom concerning our material world\nThis week’s proverbs will turn our attention to biblical wisdom concerning how we interact with the material world. We’ll explore the topics of diligence and laziness, justice, generosity and gluttony, wealth and poverty, and good versus evil.\nDay Twenty-Four: Generosity and Gluttony\nGluttony and generosity are opposites. One involves taking as much in as we possibly can for our own enjoyment; the other focuses on giving of ourselves to others to help meet their needs. One makes us sick; one makes others well. \nThe true problem with gluttony has less to do with how many calories we take in or how big our waists become. It has to do with our ability to practice the fruit of the Spirit, self-control—an essential component of generosity. Generosity is always an exercise in self-control because it requires us to give when our instinct is to keep. \nConsider how these proverbs link gluttony and generosity together, and let their wisdom hold up a mirror for you.\nGenerosity\nProverbs 3:27-28\n27 When it is in your power,\ndon’t withhold good from the one it belongs to.\n28 Don’t say to your neighbor, “Go away! Come back later.\nI’ll give it tomorrow”—when it is there with you.\nProverbs 19:17\nKindness to the poor is a loan to the Lord,\nand He will give a reward to the lender.\nProverbs 30:15-16\nThe leech has two daughters: “Give, Give!”\nThree things are never satisfied;\nfour never say, “Enough!”:\n16 Sheol; a childless womb;\nearth, which is never satisfied with water;\nand fire, which never says, “Enough!”\nAsk\nQ. Why does God care about how we handle our possessions? \nQ. Look at Proverbs 30:15-16. Have you ever been bitten by a leech? What about this creature’s process makes it a fitting symbol of greed? \nQ. Think of a time you withheld giving to someone, knowing you should have been generous. Why did you withhold your generosity? \nGluttony\nProverbs 21:17\nThe one who loves pleasure will become a poor man;\nwhoever loves wine and oil will not get rich.\nProverbs 23:19-21\n19 Listen, my son, and be wise;\nkeep your mind on the right course.\n20 Don’t associate with those who drink too much wine\nor with those who gorge themselves on meat.\n21 For the drunkard and the glutton will become poor,\nand grogginess will clothe them in rags.\nProverbs 25:16\nIf you find honey, eat only what you need;\notherwise, you’ll get sick from it and vomit.\nProverbs 28:7\nA discerning son keeps the law,\nbut a companion of gluttons humiliates his father.\nAsk\nQ. Where are you a glutton—what appetites have a hold on your heart? Why do you think God cares about gluttony? How does gluttony contradict godliness? \nQ. What sort of “poverty” do you think is being described in Proverbs 23:19-21? \nQ. Proverbs 28:7 tells us there is a relational cost to our own personal gluttony. What does gluttony cost us relationally, and why do you think gluttony works this way? \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram24s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 6:1-5, Proverbs 11:15, Proverbs 22:26-27, Proverbs 6:10-11, Proverbs 13:7, Proverbs 118:23, Proverbs 20:21, Proverbs 22:1-2, Proverbs 22:4",
        "devo_title": "Debt, Wealth, and Poverty",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Four. Work and Wealth: Wisdom concerning our material world\nThis week’s proverbs will turn our attention to biblical wisdom concerning how we interact with the material world. We’ll explore the topics of diligence and laziness, justice, generosity and gluttony, wealth and poverty, and good versus evil.\nDay Twenty-Five: Debt, Wealth, and Poverty \nMoney is more than a means to buy the things we need. It is power, and it always has been. This is why the love of money is the root of all kinds of evil (1 Timothy 6:10): it is the love of being able to wield power for our own benefit. \nThere is nothing inherently sinful about being wealthy. The Lord gave King Solomon great wealth. And He continues to do this, using the generosity of His people to fund important works of mercy and justice around the world. But God’s people are called to be very careful when it comes to the pursuit and use of wealth, and very generous when it comes to caring for the poor. \nConsider the principles of debt, wealth, and poverty raised in these proverbs.\nDebt\nProverbs 6:1-5\n6 My son, if you have put up security for your neighbor\nor entered into an agreement with a stranger,\n2 you have been trapped by the words of your lips—\nensnared by the words of your mouth.\n3 Do this, then, my son, and free yourself,\nfor you have put yourself in your neighbor’s power:\nGo, humble yourself, and plead with your neighbor.\n4 Don’t give sleep to your eyes\nor slumber to your eyelids.\n5 Escape like a gazelle from a hunter,\nlike a bird from a fowler’s trap.\nProverbs 11:15\nIf someone puts up security for a stranger,\nhe will suffer for it,\nbut the one who hates such agreements is protected.\nProverbs 22:26-27\nDon’t be one of those who enter agreements,\nwho put up security for loans.\n27 If you have no money to pay,\neven your bed will be taken from under you.\nAsk\nQ. Have you ever financially over-extended yourself? If so, what did that experience teach you? \nQ. Isn’t it interesting that the Bible speaks about co-signing for someone else’s loan, or “putting up security for a stranger”? How would you summarize the wise counsel given in these proverbs concerning co-signing? \nQ. What is the wise counsel from these verses concerning debt? What does teaching about debt have to do with living in the freedom of the gospel?\nWealth and Poverty\nProverbs 6:10-11\n10 A little sleep, a little slumber,\na little folding of the arms to rest,\n11 and your poverty will come like a robber,\nyour need, like a bandit.\nProverbs 13:7\nOne man pretends to be rich but has nothing;\nanother pretends to be poor but has great wealth.\nProverbs 18:23\nThe poor man pleads,\nbut the rich one answers roughly.\nProverbs 20:21\nAn inheritance gained prematurely\nwill not be blessed ultimately.\nProverbs 22:1-2, 4\n1 A good name is to be chosen over great wealth;\nfavor is better than silver and gold.\n2 The rich and the poor have this in common:\nthe Lord made them both.\n4 The result of humility is fear of the Lord,\nalong with wealth, honor, and life.\nAsk\nQ. Read Proverbs 13:7. If you were given a million dollars, would you be more likely to blow it on excess or bury it in the ground? What does your answer reveal about your view of wealth? Your view of God? \nQ. Look at Proverbs 20:21. What do you think is behind our fascination with gaining instant wealth? \nQ. Being as honest with yourself as you can be, do you think you are a person who easily sees the poverty in and around you? Why is poverty so difficult to see? \n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram25s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": " Proverbs 1:10-19, Proverbs 11:3-5, Proverbs 14:14 , Proverbs 25:21-22, Proverbs 3:3-4 , Proverbs 30:5, Proverbs 20:6, Proverbs 20:17, Proverbs 13:5, Proverbs 11:13, Proverbs 25:13, Proverbs 25:19, Proverbs 27:6",
        "devo_title": "Good and Evil, Faithfulness and Truthfulness",
        "devo_summary": "\nBY She Reads Truth\n\nIf you’re just joining us, welcome! You’ll find a short introduction to the Proverbs reading plan on Day 1.\nSection Four. Work and Wealth: Wisdom concerning our material world\nThis week’s proverbs will turn our attention to biblical wisdom concerning how we interact with the material world. We’ll explore the topics of diligence and laziness, justice, generosity and gluttony, wealth and poverty, and good versus evil.\nDay Twenty-Six: Good and Evil, Faithfulness and Truthfulness \nJesus says, “I tell you, love your enemies and pray for those who persecute you, so that you may be sons of your Father in heaven. For He causes His sun to rise on the evil and the good, and sends rain on the righteous and the unrighteous” (Matthew 5:44-45). Amos 5:15 says, “Hate evil and love good.” These two passages do not contradict each other. They clarify each other. \nOne of the profound characteristics of a maturing Christ follower is a desire to live in the tension of hating evil while loving our enemies. In a way, this is the heart of the gospel—Christ came carrying an unwavering disdain for the sin at work in us while maintaining an unwavering love for us. \nConsider how these proverbs show us how to live in that tension.\nGood and Evil\nProverbs 1:10-19\nMy son, if sinners entice you,\ndon’t be persuaded.\n11 If they say—“Come with us!\nLet’s set an ambush and kill someone.\nLet’s attack some innocent person just for fun!\n12 Let’s swallow them alive, like Sheol,\nstill healthy as they go down to the Pit.\n13 We’ll find all kinds of valuable property\nand fill our houses with plunder.\n14 Throw in your lot with us,\nand we’ll all share our money”—\n15 my son, don’t travel that road with them\nor set foot on their path,\n16 because their feet run toward trouble\nand they hurry to commit murder.\n17 It is foolish to spread a net\nwhere any bird can see it,\n18 but they set an ambush to kill themselves;\nthey attack their own lives.\n19 Such are the paths of all who make profit dishonestly;\nit takes the lives of those who receive it.\nProverbs 11:3-5\nThe integrity of the upright guides them,\nbut the perversity of the treacherous destroys them.\n4 Wealth is not profitable on a day of wrath,\nbut righteousness rescues from death.\n5 The righteousness of the blameless clears his path,\nbut the wicked person will fall because of his wickedness.\nProverbs 14:14\nThe disloyal one will get what his conduct deserves,\nand a good man, what his deeds deserve.\nProverbs 25:21-22\nIf your enemy is hungry, give him food to eat,\nand if he is thirsty, give him water to drink;\n22 for you will heap burning coals on his head,\nand the Lord will reward you.\nAsk\nQ. How often would you say you are caught in an internal struggle between good and evil? \nQ. See Proverbs 1:10-19. What does traveling the road of sinners look like for you? \nQ. What is Proverbs 25:21-22 saying? What do you think “you will heap burning coals on his head” means? \nFaithfulness and Truthfulness\nProverbs 3:3-4\nNever let loyalty and faithfulness leave you.\nTie them around your neck;\nwrite them on the tablet of your heart.\n4 Then you will find favor and high regard\nin the sight of God and man.\nProverbs 30:5\nEvery word of God is pure;\nHe is a shield to those who take refuge in Him.\nProverbs 20:6\nMany a man proclaims his own loyalty,\nbut who can find a trustworthy man?\nProverbs 20:17\nFood gained by fraud is sweet to a man,\nbut afterward his mouth is full of gravel.\nProverbs 13:5\nThe righteous hate lying,\nbut the wicked act disgustingly and disgracefully.\nProverbs 11:13\nA gossip goes around revealing a secret,\nbut a trustworthy person keeps a confidence.\nProverbs 25:13\nTo those who send him, a trustworthy messenger\nis like the coolness of snow on a harvest day;\nhe refreshes the life of his masters.\nProverbs 25:19\nTrusting an unreliable person in a difficult time\nis like a rotten tooth or a faltering foot.\nProverbs 27:6\nThe wounds of a friend are trustworthy,\nbut the kisses of an enemy are excessive.\nAsk\nQ. See Proverbs 3:3. How do you tie truth around your neck and write it on the tablet of your heart? \nQ. Who are some faithful people in your life? If an unfaithful person is compared to a bad tooth or a busted foot (Proverbs 25:19), to what would you compare a faithful person? Get creative. \nQ. Look at Proverbs 13:5. Do you hate lying? What must be true in a person’s heart in order for them to hate lying? \nQ. How has Christ epitomized the faithfulness depicted in these proverbs? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram26s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Isaiah 40:28 ",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUltimately, we have one hope when it comes to the pursuit of wisdom: God is all-wise, faithful, and unchanging.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Thank God for His unfailing love and wisdom.\nDo you not know?\nHave you not heard?\nYahweh is the everlasting God,\nthe Creator of the whole earth.\nHe never grows faint or weary;\nthere is no limit to His understanding.\n-Isaiah 40:28\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/SRT-Proverbs-Instagram27s.jpg"
    },
    {
        "book_title": "Proverbs: The Way of Wisdom",
        "devo_passages": "Proverbs 3:5-6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry the Word of God with us wherever we go—to have God-breathed truth, instruction, and reproof in our hearts and minds as we live unto Him each day.\nLet’s memorize a couple of verses that call us to trust God’s sovereign care over every aspect of our lives:\nTrust in the Lord with all your heart,\nand do not rely on your own understanding;\nthink about Him in all your ways,\nand He will guide you on the right paths.\n-Proverbs 3:5-6\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/4-Proverbs4n.jpg"
    }
]