[
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 1:1-5, Deuteronomy 25:5-10, 1 Timothy 5:4-8",
        "devo_title": "Family Ties",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Ruth 1:1-5, Deuteronomy 25:5-10, 1 Timothy 5:4-8\nRaise your hand if today’s title makes you picture a young Michael J. Fox with feathered hair and a sweater vest. No? If you didn’t grow up under the tutelage of ‘80s sitcoms, all you need to know is this: Alex P. Keaton and family always had a little drama brewing. But, thirty minutes and some live studio-audience laughter later, things seemed to work themselves out. \nAlas, you and I aren’t living in an ‘80s sitcom. Real life is happening and we’re in the thick of it. Relationship issues don’t always resolve with a sincere side hug, and problems aren’t limited to finding a date for the school dance. \nLife is hard. It is beautiful, yes; but gosh, is it hard. Dear friends suffering from deep depression, family members whose loss stings as sharply as when their loved one first left, children who are hungry and enslaved around the world, and wars that rage on for reasons long forgotten. Not to mention the stack of dishes in the sink, the pile of unpaid bills on the counter, and the decision you just can’t bear to make. \nLife is hard.\nThe book of Ruth is a book about real life. It is the story of a family and of one woman in particular. She was loyal and loving, hardworking and humble—an ordinary woman who led an ordinary life. Ruth’s ordinary story is much like yours and mine; it bears the fingerprints of an extraordinary God. \nJust five verses in, the scene is set for the story, and straightaway you can tell it’s not a happily-ever-after kind of tale. Naomi has lost her husband, a loss with serious implications for a woman in her culture. Then, just ten years later, she loses both of her sons, too. Now, she is a childless widow, with no means for caring for herself or her two surviving daughters-in-law. \nThis is a real-life story of real-life suffering. And let’s be honest—doesn’t that bring you a little relief? It is not a story of kings or princes, great leaders or stunning turns of events. This is just the story of a family facing loss, grief, and uncertainty, and the God who cares intimately about it all, every single detail. \nLet’s venture into this story set in the very town where Christ would be born. Let’s enter into the life of this unconventional family, ordinary folk God would use to bring about the coming of His kingdom in Christ Jesus. And let’s see what God has to teach us about His faithfulness right here, in our hard and beautiful life. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Ruth-Instagram1s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 1:6-18, Hosea 2:18-23",
        "devo_title": "She Stayed",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Ruth 1:6-18, Hosea 2:18-23\nI did a terrible thing to my mother-in-law.  \nI took her son away. She and my father-in-law were very gracious, and they let him go. I understand that we raise children up to let them go. Indeed, I think few things are more joyful than to see children well-married. But now that I’m a mother of sons, I’ve got my dander up just thinking about some young floozy batting her eyes at my boys.\nI’m very fortunate to have a creative, intelligent, and godly mother-in-law. (She might read this, and she’s quite a woman, y’all!) Nevertheless, it’s not a relationship that comes easily. This delicate relationship between mother-in-law and daughter-in-law doesn’t feel like home right away. \nRuth’s husband died; her beautiful boy was gone, and with him the tenuous thread that tied her to Naomi was poised to unravel too. Imagine Ruth, Orpah, and Naomi sitting around the metaphorical kitchen table, staring at their hands. Together, but alone, the bonds that held them together seemingly gone. Each wilting under her own personal loss. What happens next? How do we pick up the pieces from this?\nRuth chooses Naomi. That’s her next step. It’s so unexpected. She could have stayed in her hometown, with her own people. But no, she said, “Let your people be my people!” (Ruth 1:16). Imagine giving up your home and relocating across the country to live with your mother-in-law. It’s a bold move.\nRuth binds herself to her mother-in-law, vowing to do six things with Naomi: travel, dwell, claim her people, worship her God, die where she dies, and be buried where she is buried. Ruth is not messing around. She could have just said, “Okay, let’s go. I’ll check it out and see if it’s for me.” Nope, Ruth was ALL IN.  \nThis decision to stay with Naomi is so all-encompassing because it is a decision to follow the God of Israel. God uses this mother-in-law relationship unexpectedly, just as he plants Ruth quite unexpectedly in the genealogy of Christ. He used Naomi to woo Ruth to the one true God. She is in love, not with Naomi’s beauty, riches, or good humor, but her wisdom, virtue, and grace. Naomi preserves these in spite of the huge loss of her husband and sons.\nGod was doing a mighty work in Naomi.\nRuth didn’t want her brush with the God of Israel to end.\nSo Ruth clung to Naomi—the one person who linked her to the God of Israel.\nWhat kind of God is this who could draw us, against all odds, into what seems like the least comforting of circumstances? He is the God who offers comfort in sorrow, bread in a time of famine, blessing in a season of barrenness, and joy that overcomes all sorrow. He is the God of good news. This is what Ruth saw in Naomi and in Naomi’s God. This is why she joyfully concludes, “Let your God be my God!”\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram2s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 1:19-22, Ruth 2:1-3, Job 27:2-6, Philippians 3:8-11",
        "devo_title": "A New Name",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Ruth 1:19-22, Ruth 2:1-3, Job 27:2-6, Philippians 3:8-11\nHave you ever asked for prayer because you could not pray on your own? Have you ever uttered “pray for me” and meant “pray instead of me, because I just can’t do it”? \nIf prayer is a picture of believers lifting one another before the Lord, there are times I have been full-on carried. I don’t mean they’ve just walked alongside me or encouraged me to go on. No, they have picked me up from the pit and held me high before the Lord, my spiritual self limp and lifeless, desperately in need of the life-breath of my Savior. It sounds melodramatic until you’re in the thick of it, too spent to sigh another “please” or “amen.”\nThis kind of spiritual and physical exhaustion is what I see when I picture Naomi walking into town that day, so affected by her suffering that she is hardly recognizable. The townswomen whispered to one another, shocked at the condition of the friend they used to know. Naomi quickly set them straight. “It’s over for me,” she said. “Don’t call me Pleasant. Call me Bitter” (Ruth 1:20, my paraphrase).\nNaomi’s circumstances were indeed awful. She’d buried her husband, lost two sons, and said goodbye to a daughter-in-law. She had no hope of a grandchild, no path of provision. “I went away full,” she told them, “and the Lord has brought me back empty” (Ruth 1:21). Yet, there was no fist-shaking at heaven. No renouncing her faith. Naomi believed God was sovereign, even in her tragedy. \nBut even this believing woman had trouble seeing past her circumstances. The hand was dealt, the credits were rolling. Naomi believed with her head that her God was sovereign, but she was too soul-weary to believe with her heart. And so she called it. Game over. Name changed. \nNaomi could not imagine being filled back up. She couldn’t picture her daughter-in-law remarried to an upstanding man who would welcome them both into his family. She couldn’t dream of holding a grandson in her arms. She couldn’t imagine how bitterness could become beauty, but her sovereign God could.\nNaomi named herself Bitter, but God names her—and us!—Blessed.\nHe names us Forgiven (1 John 1:9).\nHe names us Beloved (Romans 5:8).\nHe names us Redeemed (Ephesians 1:7).\nThese names hold true even when circumstances don’t, because ours is a God who is mighty over affliction and blessing, bitterness and beauty, past and future. \nThe same woman who walked into her hometown deflated of joy and hope, nevertheless trusted herself and her daughter-in-law to the Lord’s keeping. “Go ahead, my daughter,” Naomi said to Ruth, sending her out into the fields to gather up God’s provision. And provide, He would. Their circumstances were anything but good, but their God was always good. \nCircumstances change, but they do not change our God. And they do not change the saving power of Jesus Christ. We need not waste time shaking our fists at heaven when we can run full-force into His arms, trusting He can redeem even us, even this, even now.\nWe are not named by our circumstances. We are named by our good God. \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram3s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 2:4-17, Deuteronomy 28:8-9, Psalm 36:7-9",
        "devo_title": "God’s Hand at Work",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Ruth 2:4-17, Deuteronomy 28:8-9, Psalm 36:7-9\nI’m grinning as I sit in the coffee shop typing this. Thankfully, there’s no one at the table facing mine. \nI can’t help it. This story is why I can’t get enough of the gospel of Jesus Christ. Because do you know who is declared royalty in the eyes of God? A poor, Moabite widow gleaning barley. I can’t even stand it, I love this story so much.\nLet me back up and explain. Here we have our dear Ruth, busting her tail in the barley fields in an honest effort to keep herself and her mother-in-law alive. She “happened” into the field of Boaz. And he “happened” to take notice of her. And (spoiler alert) all these little happenings will end up with Ruth and Boaz at the marriage altar one day, a beautiful ending to an abrupt and terrible life twist. \nThe thing is, none of this was happenstance. The hand of a gracious God led Naomi back to Bethlehem and led Ruth to go with her. The hand of a gracious God led Ruth to Boaz’s fields that first day and turned Boaz’s heart toward the hard-working widow from a foreign land. What appeared as coincidence was God’s hand continually at work. \nIn the same upside-down way of the gospel, Ruth’s simple and consistent acts of faithfulness have Kingdom-size ramifications. \nRuth was not some long-time, super-religious believer who earned herself a spot in God’s capital-S Story (and even in the lineage of Christ!). She was just a young woman doing hard things because she believed it was what she was called to do. We don’t hear this in her words, but we see it in her actions. Her faithfulness is not bright and shiny; her work is not award-winning or perfectly planned. She was simply following God’s lead, taking the next right step.\nLike Ruth, we cannot see the whole of our story, let alone His Story. We aren’t meant to. But we can follow God’s lead, knowing that our yeses to Him make a Kingdom-size difference, even when no one sees.\nAre you sitting in a quiet apartment this morning, wondering if your next steps matter? Are you driving to an office where you’ll work tirelessly without thanks or appreciation, just like yesterday? Are you settling in for another day at home, serving little hearts in a million unnoticed ways? \nHear these words from Boaz to Ruth as my prayer over you today:\n“May the Lord reward you for what you have done, and may you receive a full reward from the Lord God of Israel, under whose wings you have come for refuge.”\n– Ruth 2:12\nAnd as you do the work set before you, know this: Your small and steady acts of faithfulness are being used in big and beautiful ways in the kingdom of God.  \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram4s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 2:18-23, Deuteronomy 7:7-9, Psalm 41:1-3",
        "devo_title": "Unexpected Kindness",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Ruth 2:18-23, Deuteronomy 7:7-9, Psalm 41:1-3\nTo a kindergartener, riding the bus is no small thing. In fact, riding the bus seems to be the bookend horror of my education—terrifying when I was 6 and mortifying when I was 16. (Thanks again, Mom and Dad.) \nWhen I was in kindergarten, the buses weren’t identified by numbers, but by animals. I rode the squirrel bus—not to be confused with the chipmunk bus my best friend rode to her house on the other side of town—and was required to wear a luggage tag flaunting an illustrated picture of the animal on my backpack. \nEvery day at 3 pm, the school bell would ring and we’d file outside to our animal-specific location, and every day I remember the same tears, wailing, and resistance. One fellow kindergartener, a curly-haired boy with a blue backpack, was not happy with his assigned position in the bus-zone zoo. “I WANT TO RIDE THE MANATEE BUSSSS!,” he’d wail until his face matched the color of his backpack. \nNow, I don’t know if the appeal of this particular bus was the swimming sea cow itself (understandable), a cute passenger with pigtails, or a problem with the squirrel bus he’d been assigned to (also understandable). But one thing was clear: the boy was decidedly discontent. \nI may have kept my cool about the squirrel bus, but I, too, become decidedly discontent more often than I’d care to admit. This is especially true when it comes to the love story of Ruth and Boaz. I mean, promise me a Boaz and my single-girl self will run, not walk, to the closest field and gather grain just like Ruth did. That probably wouldn’t work for me, but does that mean God is a better provider to Ruth than He is to me?\nWe must decide a few things here: God is either the ultimate Provider, or not at all. He is either in the business of redemption, or He is off the clock altogether. His hand is either strong, or it is weak. He either chose us, or He rejected us. There is no sliding scale according to our worthiness. In fact, His love for us and devotion to us rests on His faithfulness, not ours (Deuteronomy 7:7-9).\nNo matter where our feet rest, we are always standing in the field of God’s provision. \nI’m reminded of the ways the teachers on bus duty tried to reason with Manatee Boy.  \nThey’d say, “That bus isn’t going to take you home, but here’s the one that is!” \nThe same is true for us. God’s provision is a vehicle to His perfect will. Maybe unexpected kindness comes to you in the form of a Boaz, or maybe it looks a little different—a new job, a needed friend, a resolved conflict. Either way, our strong Provider is always present, giving His children what they need.\nEither way, we’re all headed home.\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram5s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Psalm 36:7",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nGod, Your faithful love is so valuable\nthat people take refuge in the shadow of Your wings.\n—Psalm 36:7\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram6s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 1:16",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nThis week, commit to memory Ruth’s declaration of fidelity to her family and to God.\n Wherever you go, I will go,\nand wherever you live, I will live;\nyour people will be my people,\nand your God will be my God.\n-Ruth 1:16\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/4-Ruth16.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 3:1-13, Ephesians 5:22-32, 2 Corinthians 11:2",
        "devo_title": "In Search of a Redeemer",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Ruth 3:1-13, Ephesians 5:22-32, 2 Corinthians 11:2\nEverybody has awkward first dates. Right?  \nNaomi set Ruth up on an incredibly intimate and awkward first date. First of all, she tells Ruth to go to the threshing floor. In the ancient world, the threshing floor was sometimes like the middle school bleachers. In fact, the threshing floor was often a place where folks went to make whoopie (Hosea 9:1).\nBut whoopie was far from Naomi’s scheme for Ruth that night. There is no indecency in her set up. Rather, it’s a chaste plan to find Ruth’s kinsman-redeemer (Ruth 2:20). Naomi wants to find a husband for Ruth; she wants Ruth to be at rest. And with the right partner, marriage is rest!\nBoaz was a good guy. He was a farmer with weathered face and hands, and on this day he was winnowing. Winnowing means “party time” because it’s the final step in separating the barley from the chaff. The harvest was finally ready, and he and his workers were having a well-earned celebration.\nBoaz was a good boss. He worked with the harvesters, then ate and drank and celebrated with them. The boss doesn’t have to get his hands dirty, but great bosses aren’t too proud to serve when they are needed. Then he went to bed at a good hour, so that he was already asleep by midnight. He was all set to be ready for work again the next morning. Oh, Boaz—so responsible!\nBoaz was a plain man. He lay out in the barley that night, not because he didn’t have a bed, but to guard his harvest and to be close to work tomorrow. He was a man’s man. \nOkay, so are we totally in love with Boaz now?\nNaomi sends Ruth to him. And when you put a man and a woman together alone in the dark, it’s a risk, right? But Naomi knew Boaz was sober-minded and Ruth was chaste. Naomi trusted that Boaz would tell Ruth what to do. \nOur dear Ruth creeps onto his farm, uncovers his feet and lies down on the hard ground, waiting for Boaz to wake up and acknowledge her. This date is completely terrifying! She could’ve easily doubted the whole thing, wondering, “What if Naomi was wrong? What if Boaz looks at me and recoils in horror? What if he rejects me?”\nI imagine her lying there at his feet, watching the stars in their courses, listening to the wind in the barley, and awaiting either her doom or her redemption.\nShe calls to him, “I am Ruth, your maiden; take me under your protecting wing” (Ruth 3:9 MSG). And that night Boaz sends her away no less chaste but much happier than when she came. He gives her the promise of marriage and protection.\nWe, too, are sometimes on the cold, hard ground of life, putting our reputation at risk, waiting for our redemption. When we lay ourselves at the feet of our Redeemer, He does not recoil in horror. He does not reject us. He looks at us, small and shivering, and gathers us close to Him. He loves us.\nCall out to your Redeemer, who waits to take you under His wing. Lay at His feet and bask in your redemption.\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram8s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 3:14-18, Proverbs 31:10-11, Matthew 22:23-33",
        "devo_title": "Waiting as Obedience",
        "devo_summary": "\nBY She Reads Truth\n\nText: Ruth 3:14-18, Proverbs 31:10-11, Matthew 22:23-33\nHave there been times in your life when you’ve felt a strong call by the Lord to pursue something? I have. I often start strong, feeling bold and excited, my heart ready and willing to obey. I can’t help but think, This is it! This is the moment life changes because I said yes! \nThen, inevitably, a bend or a bump in the smooth, straight road I envisioned leaves me doubting. But wait. I said yes. I was obedient. So why is this still so hard?\nRuth has said all the right yeses in her story. She has been faithful to her mother-in-law Naomi in many ways, but especially so where Boaz is concerned. Ruth has truly put herself out there in trust, and it seems everything has been leading up to this moment. \nWhat a surprise it must have been to be told simply to wait—and not for a certain amount of time, but indefinitely. (Indefinite waiting is the worst kind of waiting, if you ask me.) Ruth was instructed to wait until Boaz found the nearer kin, or redeemer, and ask if that man would marry Ruth, per the custom of their culture (Ruth 3:12-13). And who knew how long that would take or what would happen?\nWe aren’t told if this frustrated Ruth, but it frustrates me for her. This is the point where I’d likely throw in the towel, caught up in a thought spiral that goes something like this: Well, it’s all over now. I’ll be married to some man I’ve never met, these past few months will have been a total waste, and all I’ll have to show for it is a sore back and some barley. Perfect.\nBut Naomi—the same woman who once named herself “Bitter”—offered enough faith for the both of them. She encouraged Ruth, saying, “Wait, my daughter, until you learn how the matter turns out” (Ruth 3:18).\nWait, and then wait again. Isn’t this the way of life? Nowhere are we promised an easy time just because we obey or come to what we believe is a capital-A Answer. But our Father waits too—both with us and for us. His Word says that He longs to be gracious toward us and show us compassion and mercy (Isaiah 30:18). “His steadfast love endures forever,” through all things, all the time, just like the psalm says (Psalm 118).\nThis doesn’t mean that things will turn out exactly the way we think they should. But it does mean that God’s hand is always at work in our story, even when we can’t see it. Even when we’re waiting. God’s plan would have still gone ahead of Ruth, even if Boaz came back to say he couldn’t marry her. She would still have been God’s daughter, and His covenant promise to her would still have been true. \nIn your waiting place, cling to the hope that God will not leave our stories unfinished or unredeemed. They may not look how we expected but, as with Ruth and Naomi, our story is His story. We can wait with hope, and we can trust and obey with confidence. Thanks be to God.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram9s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 4:1-12, Psalm 74:1-3, Leviticus 25:23-28",
        "devo_title": "Renowned In Bethlehem",
        "devo_summary": "\nBY Raechel Myers\n\nText: Ruth 4:1-12, Psalm 74:1-3, Leviticus 25:23-28\nOur Ruth is waiting in obedience to Naomi. (I say “our Ruth” because we all feel a little bit protective over her at this point, don’t we? Maybe we even see a little of ourselves in her.) And Boaz is pursuing a future with Ruth through the proper channels. He respects the law, and he’s demonstrating over and over again that he is an honorable guy. \nBoaz wants this to be legal—for the agreement to be made in plain sight, in the presence of elders. This is a particularly public scene, and it’s a cornerstone in the foundation of the most public scenes in Christian history.\nThis narrative almost makes me want to giggle with excitement and nod knowingly. When Boaz fairly and legally earns the right to take Ruth as his wife, the ten elders invoke this awesome, ancient blessing for fruitfulness on their union: “May the Lord make [Ruth] like Rachel and Leah, who together built up the house of Israel. May you be powerful in Ephrathah and famous in Bethlehem” (Ruth 4:11).\nYou guys, it’s almost like they knew!\nGod reveals a peek at His awesome tapestry when we look at the bigger picture of Boaz and Ruth’s love story. We pull back the curtain and see that Ruth’s decision to follow Naomi was so much more than an address change; it is a tiny piece of God’s grand plan. \nThat blessing of fruitfulness would soon bring forth a son, Obed, who would be the father of Jesse. And Jesse’s son was David. (Yep, the guy who slayed Goliath, was anointed king, and wrote many of the Psalms.) David also happens to be the direct ancestor of a baby whose parents returned to their hometown, Bethlehem, to deliver Him in a manger.\nJesus. Renowned in Bethlehem, indeed!\nRuth and Boaz have an awesome family history of redemption. Even better, through this family tree, the Redeemer—our Redeemer—would come to buy back the world.\nChrist has redeemed us like Boaz redeemed Ruth. Their love story is our love story. In the most public way possible, Jesus redeemed us once and for all, a people for His own possession.  \nMay we go forward today knowing we are loved so genuinely and so incredibly by the One who redeemed us to be His.\nWe are loved, indeed. And we are His.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram10s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 4:13-17, Psalm 127, Proverbs 24:27",
        "devo_title": "A Life Restored",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Ruth 4:13-17, Psalm 127, Proverbs 24:27\nIsn’t it amazing? In just four chapters, we have seen two women move from overwhelming despair to incredible hope. Remember how Naomi interacted with her friends in the first chapter? “‘Don’t call me Naomi. Call me Mara,’ she answered, ‘for the Almighty has made me very bitter. I went away full, but the Lord has brought me back empty’” (Ruth 1:20-21).\nNow, in chapter four, her friends are surrounding her, praising God for the birth of Ruth and Boaz’s son, Obed, another potential kinsman-redeemer in her family tree. What was empty in Naomi’s life is now full, and her friends declare, “Blessed be the Lord, who has not left you this day without a redeemer” (Ruth 4:14). \nIn the midst of trial, I am always tempted to think the opposite of what Naomi’s friends declared—that the Lord has left me, and there will be no redemption to my story. We’ve all been there. You might be there right now. \nDuring these times, when I don’t know what the future holds, I often try and plan it out myself. Grasping for a sense of control, I make lists, imagine scenarios, send emails, do whatever I need to do to feel like I’m making progress, to feel like I’m fixing my problems, to feel like I am getting somewhere. This is what I would have done had I found myself in a Ruth-and-Naomi situation: widowed, childless, desperate, and staring at a shaky, unclear future. \nThe problem with my go-to method of scrambling and planning is not the plan itself, but rather, the overseer of that plan. Me. \nPsalm 127 says that when we are building our own house, our labor is in vain. When we are watching over own city, our watching is in vain. The Lord is the only one who knows the plan and has the power to put it into action. Try as we may, we simply get in the way.\nNaomi could not have foreseen the beauty that would come from her story of ashes (Isaiah 61:1-3). What God was building was beyond her predictions and planning. Though she lost her sons and her husband, as her friends reminded her, having Ruth as her daughter-in-law turned out to better than having seven sons (Ruth 4:15). \nJust as redemption was in God’s plan for Naomi, so is it in God’s plan for us.\nDown the bloodline from Boaz and Ruth and Obed is our Redeemer, Jesus. In Christ, there is no such thing as a story beyond redemption. There is only resurrection, restoration, and rejoicing, even in the most unlikely of circumstances and with the most unlikely of subjects. \nIf you’re wondering today if the Lord has left you, and the idea redemption at this point feels impossible, hold fast to the promise we see in Ruth and Naomi’s journey. Nothing is too much, too big, or too scary for our Savior. God has not walked away from you. He’s done the opposite. He has drawn near to you through His Son, Jesus. \nToday, let’s take a step back today from whatever it is we are trying to control our way out of. Instead of planning and building, let’s sit in the promise of our Redeemer, believing that God is sovereign and His redemption is already ours.\n \n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram11s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 4:18-22, Matthew 1:2-16, Romans 15:12, Luke 3:32-38",
        "devo_title": "Beneath the Tapestry",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Ruth 4:18-22, Matthew 1:2-16, Romans 15:12, Luke 3:32-38\nHave you ever seen the Bayeux Tapestry? I haven’t seen it in person. It lives in Normandy, France—ooh la la! The tapestry narrates William the Conqueror’s victory at the Battle of Hastings. It’s very famous, very big, and sometimes very beautiful. The top side of it makes sense and tells a story. The underside is a hot mess and looks like the weaver didn’t have a plan.\nGod’s will throughout history is like a tapestry. We are underneath looking up, and all the random threads tied in knots and snarls don’t make sense to us. We can’t see the tapestry of history like God sees it. From His perspective it tells the story of His love and plan for mankind from the beginning of time.\nOur earthly perspective is limited. So, when God weaves together the family line of Christ, He uses people we would never expect. We assume the line of ancestry for the Son of God would be filled with “respectable” male leaders. But God used women, foreigners, illegitimate children, and a prostitute. (Sidebar: we live in a great world where women can be leaders, but Ruth lived in a world where leaders only looked like serious-faced, respectable men.)\nRuth was not only a foreigner; she was from an enemy country, Moab. The Israelites despised the Moabites. So when Ruth walked into town, that’s likely what they saw—a woman with the invisible label of “Moabite” hovering over her head. She herself wasn’t guilty, but she was an easy target for prejudice. And God chose to weave her into His Kingly line. See how the tapestry looks crazy from underneath?\nGod makes Ruth an ancestor of David and the Messiah. It is the greatest of  honors. This is the story God was penning all along, from the beginning of the book. \nLook at some of the names in Christ’s genealogy:\nPerez\nHezron\nRam\nAmminadab\nNashon\nSalmon\nBoaz\nObed\nJesse\nDavid\nDo you know all the people on that list? I don’t. \nThe story of Ruth shows us that there are no insignificant people in God’s plan, even if we only know them as a name on a list. He takes the despised and the rejected, the lowly and the insignificant, even His enemies, and He binds them to Christ. \nWhat looks messy and meaningless to us is, from God’s perspective, an intentional and precise way He is working to establish His kingdom. He takes what appear to be loose, broken, and unrelated threads and reveals how He was weaving something eternally beautiful all along.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram12s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Matthew 6:26",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n“Look at the birds of the sky:\nThey don’t sow or reap or gather into barns,\nyet your heavenly Father feeds them.\nAren’t you worth more than they?”\n-Matthew 6:26\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Ruth-Instagram13s.jpg"
    },
    {
        "book_title": "Ruth",
        "devo_passages": "Ruth 4:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nThis week, commit to memory this verse of restoration and hope from the last chapter of Ruth.\nThen the women said to Naomi, ‘Praise the Lord, who has not left you without a family redeemer today. May his name become well known in Israel.’\n– Ruth 4:14\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/4-Ruth16-2.jpg"
    }
]