[
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 22:36",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This week’s verse rejoices in God’s sure protection and help.\nYou have given me the shield of your salvation;\nyour help exalts me.\n-2 Samuel 22:36 \nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/4-12Samuel-5.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "Romans 5:8",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut God proves his own love for us in that while we were still sinners, Christ died for us.\n– Romans 5:8\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day34.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 23:1-39, 2 Samuel 24:1-25, Micah 1:2-3, John 2:19-22",
        "devo_title": "David’s Last Words",
        "devo_summary": "\n                    \n                    I wonder if David’s words about an “everlasting covenant” over his house ever rang hollow to the Israelites after he died. It’s not as if things got better after David. His children and grandchildren were mired in rebellion resulting in a divided kingdom and exile. Eventually, there was no king in Israel because of their rebellion against God.\nYou can almost imagine a Jew under the rule of Rome hearing these words of David and being torn apart on the inside, the emotions rising at the mention of David and the promise of an everlasting covenant with God. This is what the Jews longed for: a king like David to vanquish their foes and rule in righteousness. This king would set things right, and God’s people would no longer be under the thumb of pagans. \nBut this was not the reality. For hundreds of years there had been rumors of a coming king, but he had not come. The hope of this everlasting covenant must have felt unfulfillable, exhausting the souls of all who set their hearts on it. It must’ve been hard to believe a so-called Messiah would ever come. What with Roman guards everywhere and the capitulation of the religious leaders, how could anyone sustain the hope necessary to read “everlasting covenant” with any kind of resolve?\nAfter all, a covenant is understood to be an oath involving two parties. Promises are made and they are binding. So you can see how it seems as if one of two things has happened: God is either holding out His favor till Israel gets their act together, or He has given up on Israel, making His promise empty.\nThis may sound familiar. Oftentimes things start going badly for us, and we believe either one of those things. Either God is sitting up in heaven tapping His foot, waiting for us to straighten up, or He’s altogether given up on us.\nHow do we know neither is true?\nBecause of Jesus. Just as Jesus was the fulfillment of God’s promise of an everlasting covenant over the house of David, He is the guarantee of God’s promises to be God to us. Even when life is hard. Even when it’s hard because of our own sin. We have a sure hope in this everlasting covenant because Jesus has fulfilled our covenant obligations—the ones we could never keep—and paid the penalty we deserved for our covenant-breaking. \nBecause of what Jesus, the Son of David, has done for us, we can enjoy the promise of everlasting fellowship with God.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day33.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 20:1-26, 2 Samuel 21:1-22, 2 Samuel 22:1-51, Psalm 89:29-33, Revelation 20:11-15",
        "devo_title": "David’s Song of Thanksgiving",
        "devo_summary": "\n                    \n                    The Christian life is bound up in the use of personal pronouns. Martin Luther made that important point when he wrote, “Read with great emphasis the words ‘for me;’ accustom yourself to apply these to yourself with certain faith.” Luther was reflecting on the words of the Apostle Paul in Galatians 2:20; however, the same could be said of so many of the inspired songs written by David. “The sweet psalmist of Israel” (2 Samuel 23:1) claimed the promises and provisions of God by regarding the God of Israel as his God and Redeemer. \n\nHaving returned from battles in which he was victorious over the enemies of the Lord, David penned a great song of deliverance and thanksgiving to Him. At the opening of this song, David expressed his trust in the Lord by linking a series of personal pronouns to a series of truths about God:\nThe Lord is my rock, my fortress, and my deliverer,\nmy God, my rock where I seek refuge.\nMy shield, the horn of my salvation, my stronghold, my refuge,\nand my Savior, you save me from violence.\nI called to the Lord, who is worthy of praise,\nand I was saved from my enemies (2 Samuel 22:2-4).\nDavid was not suggesting he had personally done anything to gain the victory. Instead he was stating the great work of God on behalf of His people when they are in great distress. \nAs believers, we often find ourselves in great distress. In verses 5-7 of his Song of Thanksgiving, David reveals the deep distress he had felt in his own soul. There are times when we as believers feel as though we’re on the brink of death and destruction. It is then that we cry out to God for deliverance, confident that the One in whom we trust will hear and answer, according to His perfect will and timing. \nDavid also sings of God’s mighty power, the natural world serving as a platform for understanding the power of the Creator in the spiritual realm. Borrowing imagery from God’s creation, David likened God’s power to the earth reeling and rocking (v.8), His thundering from heaven (v.14). In the same way, David sang of God’s deliverance in terms of imagery from the natural world: “He reached down from on high and took hold of me; he pulled me out of deep water” (v.17). This is the language of death and resurrection. \nDavid was a great king, but Jesus Christ is our truer, better King of kings. \nBecause of Jesus’ victory over death and Satan, we too, have been “pulled out of deep water.” Because of Jesus, we can claim God as the Great Deliverer of our souls. In this way, David’s song becomes our song. May it be yours today.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day32.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 18:1-33, 2 Samuel 19:1-43, Romans 5:7-8, 1 Timothy 1:12-17",
        "devo_title": "David’s Kingdom Restored",
        "devo_summary": "\n                    \n                    King David was far from perfect, and he would’ve been the first to admit it. Just read a few of the psalms and you’ll get an intimate look at David’s nearly constant cycle of shortcoming and contrition. Perhaps this is what makes his psalms so compelling; we see David in the depths of his broken humanity crying out for the embrace of a completely loving and restoring God. \nWhen we appropriately acknowledge the complexities of David’s character, we are able to say that while not all of his choices as king were flawless, he was still “a man after God’s own heart” (1 Samuel 13:14). In light of that, I want to draw our attention to two moments in today’s narrative that really demonstrate David’s closeness to God, and his sensitivity to the Father’s heart.\nThe first, and perhaps the most powerful, is his response to the death of Absalom. We know from earlier in Samuel’s account that Absalom was not a loyal son. His intentions to wage a rebellion and incite an insurrection were clear and known by the people as well as David. Yet David, upon hearing news of Absalom’s death, wept the tears of a distraught and deeply grieved father. He did not see an insurgent; he saw his son. David did not remember a traitor to the throne. Rather, he showed the heart of our Father, who always desires the prodigal’s return, no matter how far he has strayed or wandered. \nThe second moment comes when David, as he is restored to power, has mercy upon his enemies. For many of us, this may be harder to comprehend than the love for one’s own son. It can be difficult to truly forgive a friend who has slighted you, but I imagine it would be nearly impossible to offer true forgiveness to someone who betrayed you and then tried to kill you. But that is exactly what we see David do throughout 2 Samuel. Truly, only a heart restored to God could extend that sort of forgiveness and reconciliation. \nIt seems to me that David had learned to emulate the heart of the Father the hard way. As an adulterer, he had to beat his breast before the throne of grace. As a murderer, he had to cry out for mercy and forgiveness. And as a wayward king, he had to lay down his pride over and over again. \nSo it is for us. \nMore often than not, we come out the other side of a shipwreck better understanding the heart of God for others, because He’s so freely extended Himself to us. This does not mean we get to go on sinning intentionally so that “grace may abound” (Romans 6:1), but what it does mean is that God can redeem anything and everything from our past. He redeems us for our own sake, but also for the sake of those around us. \nDavid knew how to forgive because he himself had been so lavishly forgiven. He knew how to love unconditionally because he had been loved so perfectly and truly by his God. \nMy hope, my prayer for each of us today, is that we would hand over to God the things that we’ve most mucked up, the worst we’ve done, and the worst that’s been done to us. It’s in those places where we’ll find the greatest hope, and also the great opportunity to live as wounded healers and heralds of the goodness of God.\nWritten by Andrew Stoddard\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day31.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 15:1-37, 2 Samuel 16:1-23, 2 Samuel 17:1-29, Psalm 96:10, Isaiah 11:1-5",
        "devo_title": "Absalom’s Revolt",
        "devo_summary": "\n                    \n                    The comedian Louis C.K. said, “If anyone says that you hurt them, you don’t get to say that you didn’t.”\nHow strong is your drive to defend yourself when people speak ill of you? For many of us, we’ll go to battle defending any criticisms we believe are undeserved—and often even those we know are deserved. But when someone says we hurt them and we respond by trying to silence them, what exactly are we defending?\nA theme that runs throughout David’s psalms is that God Himself vindicates His children (Psalms 26:1, 35:24, 43:1, 54:1). From the time David stepped into the limelight, he had people shouting him down—accusing him, condemning him, doubting him, and even trying to harm him. When this happened, he often responded in prayer, asking the Lord to vindicate him.\nWhy did he ask for this? We might think David asked the Lord to defend him because David regarded himself as innocent. But today’s passage shows David understood he owned a measure of guilt for the pain of others. \nIn the strange little story of Shimei, we see something I believe every person seeking wisdom should consider: What if the stinging rebuke of someone who has been wounded by our conduct is something the Lord means for us to hear and endure? What if there is some measure of opposition we need to receive and be humbled by? Even chastened by?\nDavid is on the run from his own son, Absalom, who wants to kill him and take the throne. When one of Saul’s descendants, Shimei, sees David and his men traveling along the road, he follows them on a ridge, rebuking David for all the bloodshed that has come upon the house of Saul. David is vulnerable and Shimei hopes the king will reap the whirlwind of his warring ways.\nDavid’s men offer to squash Shimei like a bug, but David’s response is uncommonly humble. He says, in effect, “What if this man’s pain is exactly what the Lord wants me to hear? Let him curse me. If the Lord told him to do this, I won’t silence him. Maybe the Lord will see this and heal us both.”\nThe story ends with David and his men stopping to rest, exhausted by their journey, by Absalom’s threats, and by Shimei’s constant rebuke. David knows he has contributed plenty to the pain in his family and nation. There are too many messes to clean up. There is too much blood on his hands to claim innocence. All he can do is rest in the hope that the Lord will show him mercy. And maybe part of that mercy comes by hearing the complaint of a man whose family he has hurt.\nI’m not advocating enabling abuse. Neither does today’s text. What it does do is raise the question: Is it possible to feel completely in the right, and not be aware of—or open to—the possibility that, somewhere along the way, our actions might have caused someone real pain?\nThe humble response is to say, “Lord, give me ears to hear the pain I have caused, even as I ask you to show mercy to the pain I’m in.” If ever there was a sinner’s prayer, this is it.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day30.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 12:26-31, 2 Samuel 13:1-39, 2 Samuel 14:1-33, Leviticus 18:9, Deuteronomy 22:28-29",
        "devo_title": "Absalom’s Restoration",
        "devo_summary": "\n                    \n                    I used to regularly watch a show called Criminal Minds. It’s a TV drama about a group of special officers trained primarily to psychoanalyze the motives of a murderer they’ve never met, using only clues and evidence from the murders. The show fascinated me mostly because in my mind, murder is one of the most senseless crimes one can commit. I cannot fathom or understand doing such a thing.\nThe oddest part of my fascination with the show—and why I stopped watching it—is that it became entertaining to think about the motives and actions involved in murder. Murder became something to keep me entertained and even frightened on some level, but never something that led me to consider the weight of sin and the stench of death.\nIn our passage today, we see the raw results of murder and death. This account isn’t primarily about the entertainment factor of understanding why a murder took place; rather, it’s an account of the ripple effect of death. Death doesn’t just shut the deceased out from the world; it shuts out the world from the deceased. No one in close contact with the departed walks away unscathed.\nThe effects of sin and death touch us all. Murder is heinous, but we’re all guilty of countless sins that bring physical and spiritual death into the world. And our sin doesn’t merely affect us—it affects everything we touch and everyone we come in contact with, at varying levels.\nAnd yet, the grace and reconciliation we see in this passage are a beautiful picture of the way God pardons and reconciles sinners who’ve been complicit in the sin and death that plagues creation. We deserve an eternal death sentence, and yet our King Jesus pardons us, giving us numerous chances at reconciling with Him and with others.\nDon’t let the weight of your sin crush you. Instead, seek pardon from your King. Seek His grace and mercy, and you will find it; His love and justice know no bounds. We need no other proof than the cross and resurrection, when the Father sent His own Son to be an atoning sacrifice for us all.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day29.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 7:11",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This week we will memorize the key verse from 2 Samuel, where God establishes a covenant with David and promises provision for His people. \nThe Lᴏʀᴅ declares to you: The Lᴏʀᴅ himself will make a house for you.\n-2 Samuel 7:11 \nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/4-12Samuel-4.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "Psalm 51:10",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod, create a clean heart for me\nand renew a steadfast spirit within me.\n– Psalm 51:10\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day27.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 11:1-27, 2 Samuel 12:1-25, Psalm 51:1-19, Isaiah 42:1-4",
        "devo_title": "David and Bathsheba",
        "devo_summary": "\n                    \n                    Everyone makes terrible decisions. We sin. We put ourselves in positions of temptation— temptation toward sexual sin, dishonesty, abuse of power or position, hypocrisy. And then we’re tempted to cover it all up. We do exactly what we know we ought not to do, just like David did. We’re no better or worse because of our different sins, anymore than one mud puddle is cleaner than another. \nWith that said, we must look at what happens after sin. We have two paths available, two choices: ruin or restoration. David chose ruin. He chose to hide and deny his sin, and then to pompously judge the unjust man from Nathan’s parable. It was a profound display of God’s mercy when Nathan declared, “You are that man!” It was the slap across the face David needed to snap him from his sin-induced stupor. It turned him from ruin to restoration.\nIn that moment, David saw that he had sinned against the Lord. Yes, he had sinned against Uriah, against Bathsheba, against Israel, against his family. But he stood guilty before God. If he’d take an entire lifetime to try to make things right—to pay penance, to work at being a better man—but had never fallen on his knees before God, crying out for mercy, David never would’ve been made right. He would have rotted from the inside out.\nThat was his turn from ruin to restoration, but restoration did not mean hugs and affirmation. It meant facing the dire consequences of his actions, without indignation or grumbling. David pleaded with God to save his child, but it was not a plea for an easier punishment or a lack of consequences. It was a plea for life, a plea on behalf of someone else. \nWhen his prayers were not granted, we see David’s true heart; he got up, cleaned up, and moved forward. He poured out his soul before God, saying, “Against you alone have I sinned,” and “Create a clean heart in me” (Psalm 51). These are the groanings of a broken man—a man who knows God’s mercy and knows God will not “extinguish the smoldering wick,” but instead will breathe that flame back into life again (Isaiah 42:3).\nRuin or restoration: those are the options after sin. The only way to find restoration is to recognize against Whom we’ve sinned and cast ourselves on His mercy. When we do, we are purged, purified, and, by Christ’s blood, made whiter than snow. Here we rediscover the joy of salvation from which sin blinded us.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day26.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 8:1-18, 2 Samuel 9:1-13, 2 Samuel 10:1-19, Acts 4:24-28",
        "devo_title": "David’s Kindness",
        "devo_summary": "\n                    \n                    When my wife and I welcomed into the world our fourth child, the hospital gave me a numbered plastic bracelet identifying me as her father. It was a symbol of joy. A second bracelet was snapped on my wrist a week later when we had to have her admitted back into the hospital because she turned orange—like a little Cheeto. Her tiny liver was still learning to keep up with its workload. \nFor something as common and treatable as jaundice, I must tell you that I felt very lonely before God during that time. That second bracelet was a symbol of the blues—“Nobody knows the trouble I’ve seen… ” I have expectations for how I believe the Lord should deal with me. So do you, I’m sure. I expect Him to shelter me and those I love from hardship. I bet you do too. What do we do when those expectations are not met? \nToday’s text says that, whether or not our expectations are met, we should do the same thing: depend on God’s kindness. \nImagine how Mephibosheth must have felt—the grandson of the deposed king, crippled when his nurse tried to flee with him, now living in hiding from the new, rival king he presumed wanted him dead. Imagine how he felt about the hand he’d been dealt. Imagine how terrified he must have been when David, powerful and victorious, sent for him. Imagine his prayers as the soldiers carried him back to face the king.\nNobody knows the trouble.\nWhat Mephibosheth received from David was mercy and grace. But it was a special kind of mercy and grace. He was given a permanent seat at the king’s table like one of the king’s sons. But because he was unable to walk, never once did he come to that table without help. He spent his life being carried in the arms of another. \nThis is where my heart wanted to rebel when we had to return to the hospital with our little girl. Often we want God’s care, but on our terms. We cry out, “If you really want to restore me, let me walk on my own.” But the King says, “If you really want to be restored and have a seat at my table, let me carry you.” God does not want to give us autonomy from Him. He doesn’t heal us in such a way that we don’t need Him anymore. The desire for autonomy from God is what got us into trouble in the first place (Genesis 3:1-7).\nRestoration does not come through God making us strong enough to live without Him. His mercy causes us to lean hard on His grace with all we have and are. But it also liberates us to know that we are not dead dogs to Him, as Mephibosheth said, but we are His sons and daughters. And because we are, His healing will include even deeper levels of dependency on Him, not autonomy. \nWe cannot bring ourselves before His throne. We must be carried. But beloved, we are. By Him. Always.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day25.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 5:1-25, 2 Samuel 6:1-23, 2 Samuel 7:1-29, 1 Corinthians 12:12-20, Hebrews 10:19-22",
        "devo_title": "The Lord’s Covenant with David",
        "devo_summary": "\n                    \n                    Have you ever read the terms and conditions for the things you sign up for online? Whenever you buy a new phone, download a new app, register on that new website—a little checkbox appears, asking you to indicate that you have read and agree with the terms and conditions of the service. I’ve never read them. No one does. The terms and conditions are just too long. They’re filled with jargon and legal-speak—a hoop to jump through. So we jump and never think about it again. But when God gives us His contract—His covenant, His promises, His terms and conditions—we read it and hold it in our hearts.\nGod makes a covenant with David, a promise that David’s kingdom and his family will not fade into the library of Israel. David’s line will reign forever. \nPresidents of the United States serve one or two four-year terms and then fade into the background. History books are filled with stories of kings and their families who lost the throne because they were overtaken, betrayed, or their family line died out. Kingdoms are powerful, but legacies are fragile.\nGod promised that a son of David would build the temple, and that he would be on the throne forever. Solomon? Yes and no. While Solomon built God’s temple, Solomon’s temple is now a pile of dust somewhere in Jerusalem. Solomon himself died. His reign came to an end. God knew we needed the One who is greater than Solomon, the true and final answer, the ultimate deliverable from God’s promise. Jesus Christ, God’s Son, born of David’s line and in his town, will reign forever. With Christ, God’s faithful love is with us forever.\nWhen Jesus died on the cross for our sins, His reign didn’t end; He rose again from the dead, ascended to the right hand of God the Father, and He now holds the universe together with His powerful word (Hebrews 1:3). God’s faithful love is set on us, secured because Jesus set us free and forever secured our salvation by His shed blood (Revelation 1:5). \nGod’s covenant to David, as well as the the new covenant He’s made with you and me, is signed, sealed, and answered by the shed blood of Christ alone. Not us. All Him. \nThese are the terms and conditions to live by: Christ alone, grace alone, faith alone. Amen.\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day24.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 3:1-39, 2 Samuel 4:1-12, Psalm 30:11-12, Jeremiah 16:5-9",
        "devo_title": "Civil War in Israel",
        "devo_summary": "\n                    \n                    Patience is a difficult virtue to cultivate, is it not? When it is difficult to wait on God, we often try to resolve our circumstances by working with our own hands. But we must remember that God works in His own time, and He is good to those who wait.\nIn 2 Samuel 3:18, God declares that He will save His people through His servant David, one of the most colorful and complex characters of the Bible. Even with all of his failures, we still know that David was a man after God’s own heart. This truth is most evident in his trusting patience with God’s plan. David knew nothing could thwart the good purposes of God.\nSo David did not take the kingship from Saul by force, nor did he seek to promote himself to the throne. When given opportunities to rid the kingdom of King Saul, David resisted the temptation (1 Samuel 24 and 26). Even when others tried to advance David’s kingship, David responded righteously and justly (2 Samuel 3:6, 27-31; 4:7,12). He waited.\nThis type of patience is firmly rooted in trusting God’s timing. Eventually, David was anointed king over Judah and Israel (2 Samuel 2,5). His reign would bring peace and blessings to God’s people. But while David was a good king, he was far from perfect.\nLike the ancient people of Israel, we often long to experience the peace and blessings experienced under the reign of a good king. Jesus is that and more: the truer and greater David. Jesus is the perfect King who rules with justice and is able to bring lasting welfare for the people. As Christians, we know the full reality of Jesus’ rule will be experienced in His second coming, when all our hopes will be met in Him. Until then, like David, we must learn to wait.\nSaint Augustine once said  “patience is the companion of wisdom,” and Paul teaches patience is fruit of the Spirit (Galatians 5:22). Still, while it is wise to wait, doing so often seems harder than trying to do the work ourselves. But even when we cannot see God’s hand, we must trust in His promises. In our own strength, we cannot fully bring about the peace and blessing we desire, but with patience, we learn to listen to the Spirit, and then respond to our circumstances according to God’s will. \nOur King is coming, and He will save us. Until then, let us humble ourselves under the mighty hand of God until the proper time. The Lord is good to those who wait.\nWritten by Matt Capps\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day23.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "2 Samuel 1:1-27, 2 Samuel 2:1-32, Psalm 60:1-12, Romans 12:14",
        "devo_title": "David’s Lament",
        "devo_summary": "\n                    \n                    The story of Saul’s death and David’s actions afterward have always been hard for me to understand. As king, Saul had not only rebelled against the God he was supposed to be serving, but in his fits of jealousy, he also sought to kill David. And yet, David, upon finding out Saul had been killed by an Amalekite, turns around and kills the Amalekite—the one who’d put an end to his enemy. Then David sings a lament over Saul and Jonathan with the repeated refrain, “How the mighty have fallen,” which I can only hear now in the high and lonesome voice of country singer Margo Price.\nCertainly the Amalekite was surprised by David’s action. He probably expected to be rewarded. But what about everyone else? He couldn’t have been the only one there who wanted Saul dead. Saul was a terrible king who’d been hunting David and his men, set on killing them. \nI have to confess, I am more like the Amalekite and not very much like David. Wanting Saul dead is my gut reaction even now, reading this story for the hundredth time. I look at David and have trouble seeing his actions towards the Amalekite as anything other than capricious. \nIn his novel Till We Have Faces: A Myth Retold, C.S. Lewis retells the story of Cupid and Psyche. It’s a masterful work of storytelling. The first part of the book features the mercurial manner in which the King of Glome deals with those who are against him—even his own daughters. At any moment, his fury could flare, causing blood to be spilled and fortunes to be lost. \nReading that story alongside the saga of Saul and David, I find it easy to compare their actions and become frustrated with David. Why was David so grieved by the death of Saul, who wanted him dead? Why did he lament Saul’s death and go on to avenge him?\nI think we get a clue when David repeatedly calls Saul the “LORD’s anointed” (2 Samuel 1:14). Yahweh Himself put Saul in the position to reign as king, and not even Saul’s most heinous acts could override God’s will. David’s conviction of this truth and his surrender to God’s sovereignty were stronger than his own pride and the desire to escape unscathed.\nSome things are just bigger than our own skin.\nIn Romans 12, Paul’s instruction is, “Bless those who persecute you” (v.14), and that is exactly what David did: he blessed those who had tried to kill him. It’s a trait we also see in the Son of David, Jesus. \nThere on the cross, Jesus was mocked, persecuted, and hung to die—all under the watch of our wise and sovereign God. And what did Jesus do? He blessed. Jesus had compassion on those who persecuted Him, which is a form of blessing (Luke 23:34). And to this very day, He has not stopped doing the same for us, those who have sinned against Him yet call on His name (Romans 10:13). \nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/08/HRT-12-Samuel-instagram-Day22.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 12:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This verse from David’s song of deliverance extols both God’s goodness and His strength.\nAbove all, fear the LORD and worship him faithfully with all your heart;\n consider the great things he has done for you.\n—1 Samuel 12:24\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/4-12Samuel-3.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "Psalm 54:4",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod is my helper;\nthe Lord is the sustainer of my life.\n– Psalm 54:4\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day20.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 30:1-31, 1 Samuel 31:1-13, Psalm 56:3-4, Luke 4:18-19",
        "devo_title": "The Death of Saul",
        "devo_summary": "\n                    \n                    I was a slow, undersized high school football player. Hidden away on the offensive line, I served as little more than a blocking sled with a pulse. The summer between my freshman and sophomore year, the linebacker I regularly had to block was pushing 350 pounds on the bench press. I was still trying to figure out a grip that would keep the bar from falling on me when I tried half that.\nI only played two years of high school football because I decided getting a job was more important than being a tackling dummy. Those two years brought me face-to-face with my own weakness. \nRecognizing our weakness is demoralizing, especially when it seems like everyone else is strong. King David, the giant-slaying man that he was, had to reckon with his own weakness, too. \nUpon arriving at Ziklag, David and his men are confronted with the tragic kidnapping of their families. 1 Samuel 30:4 says that David and his men wept “until they had no strength left to weep.” Amidst the deepest despair any of the men had ever known, they turned on their leader and considered stoning him. Left with nowhere else to turn, the text says, “David found strength in the LORD his God” (v.6).\nDavid’s hope in the strength of God must be contrasted with Saul’s hope in his own strength. David trusts God for deliverance while Saul trusts only himself. In the strength of God, David finds his deliverance. In his own strength, Saul finds his demise.\nWhen we are confronted with the darkness of our sin-scarred world, even our own friends and family may turn on us. When we feel backed into a corner because of our own failure or inescapable circumstances, we can allow our inadequacy to become our identity and we risk implosion.\nThis is the reality: we are not strong enough to overcome the brokenness of this world, but our God is. We may be the Body of Christ, but we are weak apart from the Head, who is Christ Jesus Himself.\nAs we trudge through seasons of life that feel like modern manifestations of the “valley of the shadow of death” David mentions in Psalm 23, we must rely on the guidance of the Good Shepherd. It is the strength of God in which we trust, not our own.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day19.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 28:1-25, 1 Samuel 29:1-11, Deuteronomy 18:10-12, Proverbs 1:28",
        "devo_title": "Saul and the Medium at Endor",
        "devo_summary": "\n                    \n                    Personal experience often confirms this biblical truth: “whatever a person sows he will also reap” (Galatians 6:7). It’s in the dark that we see our truest selves—who we really are when nobody’s watching. Usually, it’s in times of great stress that our private character is exposed with potentially public consequences. If you’re anything like me, this truth is difficult to admit.  \nIn 1 Samuel 28:5, Saul was under great duress as the Philistines closed in for battle. When Saul sought God for rescue, God was silent. We know God had already sealed Saul’s fate, a promise previously relayed to him through the prophet Samuel (1 Samuel 15:28).\nSaul’s true character is exposed when he secretly turns to a medium hoping for a way out. The answer Saul receives is ironic. The spirit of Samuel seems to appear in the cover of darkness to further confirm God’s previous word, the word the desperate king hoped he could to escape: Saul’s kingdom would fall.\nChristian wisdom tells us that while godly character may manifest itself in great moments, it is forged in small ones—seemingly small moments of obedience. Conversely, patterns of unrepentant rebellion will eventually lead to final judgment. Saul had long before prepared his own table (1 Samuel 2:29-30). Now he would swallow a last meal prepared by a witch. “The LORD [had] done exactly what he said” (28:16-19, 24-25). \nSaul had abandoned the way of obedience his entire life, and the Lord had stopped speaking to him. Sadly, it seems Saul was never truly repentant. But before we cast the first stone, let us again admit that we are no better than Saul. The good news is our story doesn’t have to end like this.\nWhen we are truly repentant and cry out for salvation, God is not silent. In fact, He has already spoken. On the cross, Jesus has already reaped what you have sown (Romans 6:23). He consumed the full plate of judgment that you and I deserved. Because of Christ, instead of groping in the dark like Saul, we can walk into the light—exposed, repentant, and forgiven.\nIt is often said, “As the king goes, so do the people.” Thankfully, God delivered ancient Israel from the wickedness of King Saul, who fell at the hands of the Philistines. In our case, God delivers us through the righteousness of Jesus. He is the eternal King who died at the hands of men, but rose again to set men free. His kingdom will never fall.\nBecause of the grace of Jesus Christ, we can humbly accept the warnings associated with the life of Saul. Every word of warning before the final judgment is actually a word of mercy. \nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day18.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 25:1-44, 1 Samuel 26:1-25, 1 Samuel 27:1-12, Romans 12:19, 1 Peter 2:22-25",
        "devo_title": "David and Abigail",
        "devo_summary": "\n                    \n                    A few mornings ago I was having breakfast with my daughters, and it came time to pray before we headed out for our respective days. It dawned on me then that my older daughter had prayed a few days prior for confidence and focus in a performance she was part of. The performance went off without a hitch, so I brought that up as a reminder of ways in which God answers prayer and works on our behalf. It was a helpful, if small, lesson for us.\nOften this is how we think of God working: we ask and He helps. But more often than that, perpetually in fact, God is working in ways that are deeper and wider and more complex than we know. The stories of David and Abigail, and then of David and Saul, show this so clearly.\nWhen David was insulted and shamed by Nabal, he was ready to mete out vengeance. His overtures had been made with respect, his men had protected Nabal’s shepherds, and they were in need of help. So of course, he became enraged when he was not only turned away, but with insults. \nThis is where we see God intervene on behalf of David. The story says Abigail—Nabal’s wise and beautiful wife—rode to meet him, offer assistance to his men, and plead for mercy. What we should see in that is God being merciful to David by protecting him and his future kingship from his own rage. \nDavid recognized it. He saw in Abigail a wise and beautiful messenger from God sent to redirect and protect him, so he blessed the Lord and the Lord blessed them.\nA few verses later we see David fleeing from Saul. Again, an opportunity for revenge arises. David could have ended his problems in a single blow. He could have dealt with Saul the same way he intended to deal with Nabal. Instead, he showed humility and discretion. Maybe God’s intervention earlier had made a lasting impression.\nGod’s direction in David’s life was not always obvious and not always asked for, but David saw it. He saw God leading him, and he learned to trust God even through the odd and unexpected. David had the power to take vengeance, to act on his own behalf, but he learned to let God do that. The more David looked for God’s hand at work, submitted to it, and let God work, the more God led and blessed him. Do we think it should work any different for us?\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day17.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 23:1-29, 1 Samuel 24:1-22, Psalm 54:1-7, John 19:10-11",
        "devo_title": "David Spares Saul",
        "devo_summary": "\n                    \n                    Not long ago, I was listening to an interview with an actor who had to play a truly despicable character. When asked if it was hard to play the role, the actor said, “What you have to do to play guys like this, is you have to figure out what, in their minds, makes them believe they are right. Figure out what twisted sense of justice drives them, and you can get inside their heads.”\nImagine you’re King Saul today as you read these verses. Not David. Saul. What, in his mind, justifies his venom? Maybe that’s not hard for you to do. Maybe you carry the burden of failing to live up to your calling. Maybe you feel you’ve been cut out of a deal that should have paid off for you. Maybe you are at war with God in your heart because you feel He owes you something, or has withheld something, or has favored someone else instead of you. \nCandidly, I have been Saul in this passage many times—lashing out at others because there is a war in my heart against God. Can you relate?\nSaul’s commitment to kill David had become so resolute that David had to go into hiding. His mighty men went with him. There were times when Saul got close enough to David that David’s men wanted to take the fight to Saul and end it, but David wouldn’t let them. As far as David was concerned, Saul, for all his venom, was still the king the Lord anointed over Israel. Who was David to depose God’s anointed one? (1 Samuel 24:1-7).\nOn this one occasion, though, David and his men came closer to Saul than he ever could have dreamed. Saul ducked into the very cave where David and his men were hiding. David’s men wanted to kill Saul, but David forbade it. Instead, he snuck over and cut off the corner of Saul’s robe.\nWhen Saul stepped out into the daylight from the mouth of the cave he heard a familiar voice, “My Lord the King!” Saul spun around. David emerged from the darkness holding up the corner of Saul’s robe. He had spared the king, and Saul knew it (1 Samuel 24:16-22). Mercy for the bloodthirsty. David also promised to show mercy to Saul’s family when he became king. \nThe text describing this moment shows that Saul understood he had become David’s new Goliath. He knew the story was already written. He knew he would fall. And he knew that this was never really a fight against David. What must have chilled him even more was that he knew David knew this too. Saul’s fight was with the Lord. David rested in that. Saul could not. For the rest of his days, he wrestled with this.\nMy question for us all today is simple: where in our lives are we locked in a fight with God like Saul? The promise of the gospel is that for those whose faith is in Christ, there is only mercy. So why do I still fight? Why do you?\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day16.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 20:1-42, 1 Samuel 21:1-15, 1 Samuel 22:1-23, Psalm 34:1-3, Matthew 10:34-39",
        "devo_title": "David and Jonathan",
        "devo_summary": "\n                    \n                    One of my favorites albums from the ‘90s is Wildflowers by Tom Petty. Nearly every summer that album gets a few listens straight through. It’s a complete work—a puzzle of many parts that, when put together, create a striking picture. But there is one song I think about even when I’m not listening to the album.\nWhen Petty sings, “It’s Hard to Find a Friend,” I cannot help but think how true a statement it really is. I think about my kids, my oldest daughter in particular, who has struggled to make and keep friends because of her disability. Whenever I see people who look or sound lonely, I think of that song, of that line. It’s truly one of those lyrics that rings in my head even when I haven’t listened to the album for a long time. \nThe longing for friendship is so innate, so obvious, that I am struck by anyone who seems content in their loneliness. It makes no sense to me because I really feel the longing for deep friendship in my own life, even to the point of pain.\nThe story of David and Jonathan is rightly told as a story of deep and meaningful friendship. David is a friend to Jonathan, despite Jonathan’s father, Saul, trying to kill David. Jonathan pledges his friendship to David, even though his commitment is an act of treason against his  father, the king. This is a costly friendship, and I believe God wants us to see the beauty in it.\nBut I think we make a mistake when we read this story and walk away trying to be a friend like these men. I think this story is best read as a way to whet our appetites for true friendship. And not just any friendship. We all long for a friend who will love us and stand by us, even if it might cost them something—convenience, time, or in the case of David and Jonathan, reputation and even life. \nIn Matthew 11:19, Jesus is called a friend of “tax collectors and sinners,” and it’s not meant as a compliment. The people Jesus befriended tarnished His reputation among the religious leaders of the day, but He didn’t care; those were the people He’d come to care for. Jesus knew those were the ones most likely to come to a place where they found they needed someone. He came to meet that need, ultimately, at the cost of His own life.\nYou see, the story of David and Jonathan’s friendship is read best when it points us to our own longing for the costly and beautiful friendship of Jesus with sinners like us. His friendship is the deepest imaginable, the most loyal. He is the friend who sticks closer than a brother, who chose us and gave His life for us (Proverbs 18:24; John 15:16-17). \nThere is nothing we can do to lose Christ’s friendship. This is good news for all of us who find it “hard to find a friend.”\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day15.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 2:2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This verse, from Hannah’s prayer of thanksgiving, celebrates the holiness and steadfastness of God.\nThere is no one holy like the LORD.\nThere is no one besides you!\nAnd there is no rock like our God.\n-1 Samuel 2:2\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/4-12Samuel-2.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "Psalm 59:16-17",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut I will sing of your strength\nand will joyfully proclaim\nyour faithful love in the morning.\nFor you have been a stronghold for me,\na refuge in my day of trouble.\nTo you, my strength, I sing praises,\nbecause God is my stronghold—\nmy faithful God.\n—Psalm 59:16-17\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day13.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 18:1-30, 1 Samuel 19:1-24, Psalm 59:1-17",
        "devo_title": "David and Saul",
        "devo_summary": "\n                    \n                    No matter how manly you think you are, when a storm knocks your power out at night—lights gone, Netflix dead, A/C out—there’s a micro-moment of uncertainty and concern. Where are the flashlights? Do we even have flashlights? How long is this going to last? I hope the kids don’t wake up. Man, it’s getting hot in here already. \nDarkness has a way of making us feel cornered, alone, unsure. Light is much safer. We gather information in the light, see our surroundings, and act accordingly. There’s also power and comfort in knowing you aren’t alone—especially in knowing the Lord is with you.\nDavid’s life is filled with high watermarks of walking by faith, living with a behind-the-scenes awareness that the Lord is with him. As David led Israel’s military to defeat impressive battalions from other nations, the Lord was with him. And when Saul hurled spears at David’s head, God was with him then, too. \nSaul wasn’t exactly a scrub. It’s not like David had more raw talent and ability than Saul. Remember, the people elected Saul because of his impressiveness. But Saul lost a step. He lost his edge. David, on the other hand, “Continued to be successful in all his activities because the LORD was with him” (1 Samuel 18:14). \nSo why did Saul’s sparkle fade while David became a mega-watt star to the people? Scripture tells us, “The LORD was with David but had left Saul” (1 Samuel 18:12). When Saul pursued his own ways, contradicting the ways of God, the Lord removed His blessing, and put it on His faithful servant David—the lion-killing, giant-slaying, shepherd from Bethlehem.\nWho are we in this story—Saul or David? We’d like to think we are more like David: rugged, handsome, faithful. Sadly, in our own strength, we’re a lot like Saul. We are unfaithful. We pursue our own ways. \nBut if we are in Christ, we don’t have worry about God departing from us (Deuteronomy 31:8; Romans 8:31-39). The faithful Shepherd-King from Bethlehem—God’s own Son—died for our faithlessness, our sin, our high treason against God. And then He rose from the grave, forever forgiving and uniting us to Himself, welcoming us into His kingdom. \nHe will never leave us. He promises, “I am with you always, to the end of the age” (Matthew 28:20). No matter the darkness you face, the Lord is empowering you to be faithful to Him today. The Lord is with you. Always.\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day12.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 17:1-58, Ephesians 6:12, Hebrews 2:14-18",
        "devo_title": "David and Goliath",
        "devo_summary": "\n                    \n                    I got into a few fights in middle school, but the time I duked it out with a teammate on the football team—who was about 100 pounds heavier than me—is the most memorable. Not because I won the fight handily; it didn’t go so well for me. Rather, it was memorable because I stood up to him in front of a large group of people, and I earned his respect and the respect of my peers. I was David fighting Goliath, with a whole nation watching.\nThe difference, of course, is that David clearly won his battle with Goliath. He wasn’t merely respected or revered because he had the guts to fight a giant; he was exalted because he defeated a national foe and stood his ground for an entire nation.\nSunday school lessons often teach us that there are many “Goliaths” in our lives, and we just need to trust in God for the strength to slay them. On this thinking, if I’d prayed a little more, maybe I would’ve toppled the Goliath on my middle school football team! It is true that we face all sorts of opposition in life that we cannot defeat on our own, but fighting the inconveniences and hateful people in our lives isn’t the point of the David and Goliath story.\nAs Ephesians 6:12-14 tells us, our battle is not against flesh and blood, but against spiritual oppression. And there is no amount of stones we can throw at the Goliath of personal sin and demonic oppression threatening our eternal existence.\nThe true David, Jesus Christ, has slain the spiritual Goliath of sin and death on our behalf. Like David, He walked onto the battlefield as a humble Shepherd and walked away a victorious King. Though His beaten and bloodied body on the cross may have looked like the King was slain, the cross was actually His weapon of a choice, a stone thrown right between the eyes of sin and death’s mocking face.\nMay we not try to topple the Goliaths in our lives, but rather look to the One who’s already done everything to win the war. Our King stands victorious, and His victory is also ours. May we worship Him.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day11.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 15:1-35, 1 Samuel 16:1-23, Ruth 4:18-22, Luke 6:45",
        "devo_title": "Samuel Anoints David",
        "devo_summary": "\n                    \n                    The morning of June 1, 2013, finally arrived after a long, soggy night. By the grace of God, the river rushing down the road in front of my parents’ house disappeared, but it took our sleep with it. I don’t know how much rain fell between our rehearsal dinner and the morning of our wedding, but it was enough to flood my parents’ basement, my future mother-in-law’s house, and two friends’ cars.\nFew wedding attendees knew we were running on virtually no sleep, for the joy of a long-awaited wedding is enough to cover even a week of sleepless nights and sopping basements. But Susie and I knew. We knew that, as merry as our wedding may be, our sleeplessness would threaten whatever energy our adrenaline could create. How we looked on the outside was the opposite of how we felt on the inside.\nHow exhausting it would be to live in such a state every day before the all-knowing God of the universe. As we read in 1 Samuel 15, God rejected Saul as king of Israel because he tried to please people instead of God. After this, the Lord instructs His prophet Samuel to make the trek to Bethlehem where he would find the one God had chosen to replace Saul as king.\nSamuel initially mistakes the chosen one as the firstborn son, Eliab, but the Lord reminds him in 1 Samuel 16:7, “Humans do not see what the LORD sees, for humans see what is visible, but the LORD sees the heart.”\nGod and people see reality differently. Even a prophet of God like Samuel cannot discern the heart of a man and his fitness for king. \nThe fundamental flaw in our human perspective is that we can only see what is visible, while God can see that which is invisible: the heart. The temptation, then, in our effort to impress others, is to put on a show—to prove to others that we have it all together. But God is not fooled by our foolishness.\nThe light of God’s wisdom pierces the darkness of our outward performance to illuminate the depths of our inward being. No amount of spiritual showboating, good looks, cool toys, or theological knowledge is more important than a heart that’s more interested in pleasing God than man. \nDavid, the one who would be selected by God as king over His chosen people, wasn’t even present when the sons of Jesse paraded in front of Samuel. He was tending to his sheep, without hope of great renown or riches.\nOur God is not interested in spiritual performances, whether inspired by the life of Jesus or aimed to please others. Instead, the Lord desires for our hearts to be humbled, transformed by the gospel of Jesus Christ, with the intent of glorifying Him.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day10.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 13:1-22, 1 Samuel 14:1-52, Numbers 18:7, Acts 13:21-23",
        "devo_title": "Saul’s Kingship",
        "devo_summary": "\n                    \n                    I seldom read the foreword in a book. More often than not they’re a hat-tip from another author extolling the virtues of the book’s author and/or its content. There’s nothing wrong with that; I’m just usually not interested. But the acknowledgments page? That’s a different story. I always read that because I love hearing about the others who helped that book come to pass—the publishing team, friends, family, children, spouses. All honest authors know a book is only birthed with a little help from their friends.\nI’ll never forget the way one author described his wife in his book’s acknowledgements. He wrote: “She is the warmth behind the light.” What a beautiful way to describe the reality that any wonder one might find in his words was due to her, “the warmth behind the light.”\nToday’s text in 1 Samuel reminds me of that phrase. There was plenty of attention-grabbing light in the army of Israel, not all of it positive by any stretch, but all of it noteworthy. The most inspiring in these chapters surrounds the gutsy actions of Jonathan and his armor bearer. Crossing a treacherously high mountain pass, and then charging up on all fours into a group of Philistine soldiers, is the stuff of which legends are made. Their bravery lit a fuse in the rest of the ranks and turned the tide of the day. But as bright as that scene is, the writer wants to ensure we know the real source of that day’s victory, the warmth behind the light. So he pens a mini-acknowledgment in verse 23 of chapter 14: \n“So the LORD saved Israel that day.”\nIn a sense, you could say most of the trouble in the Old Testament occurred when that truth was unacknowledged, when men took things into their own hands and began to believe their own press. In a sense, you could say most of the trouble that occurs in our own lives stems from a similar refusal to remember and give credit where credit is due.\nThis acknowledging does not diminish the achievements of men like Jonathan and his armor bearer, or us. But it does keep a sobriety of spirit alive, a clear-eyed humility in check that the warmth behind and within the light of our lives is the LORD. Any wonder one might find in us is only due to Him.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day9.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 11:1-15, 1 Samuel 12:1-25, Isaiah 5:8-12, Micah 6:1-5",
        "devo_title": "Samuel’s Final Speech",
        "devo_summary": "\n                    \n                    In 1796, George Washington gave his farewell address to the American people. This would become the first of 35 farewell addresses given by a President of the United States (the other eight who served would die in office). The farewell address gives the outgoing President the opportunity to recap his accomplishments, principles, and concern for the people. \nThis, of course, was not something unique to the American political system. The great leaders in Israel’s history also often gave farewell addresses. This is seen in Moses’ farewell speech, as Israel transitioned to the leadership of Joshua (Deuteronomy 31-33). Samuel also gave his own farewell speech, as God’s people transitioned to the leadership of King Saul (1 Samuel 12). In both of these speeches, the outgoing leader highlights the way in which he conducted himself, the work of God, and a call for the people to remain committed to God.\nThe people of God had asked for a king. The Lord had granted their request by anointing Saul. When Israel was facing the threat of the Ammonites, Saul rose to the occasion by becoming their defender and leader (1 Samuel 11:1-14). In doing so, he stepped into the role of the king, and Samuel became the last of the judges. With that transition complete, Samuel took the opportunity to address his people. \nYou see in his speech that Samuel first appeals to the way in which he has conducted himself as God’s appointed judge (1 Samuel 12:3). He explains that he has not acted with sordid gain in mind, or taken a bribe to pervert justice. He then reminds the people of the great redemptive works of the Lord throughout their history (vv. 6-18). Finally, Samuel charges the people of God with the following exhortation: “If you fear the Lord, worship and obey him, and if you don’t rebel against the Lord’s command, then both you and the king who reigns over you will follow the Lord your God… Above all, fear the Lord and worship him faithfully with all your heart; consider the great things he has done for you” (vv. 14, 24).\nSamuel reminded the people of their need for an upright leader, of the mighty work of God, and of their own responsibility to respond properly to what God had done for them. These three things find their ultimate fulfillment in Christ—the great Judge and King of the Church. \nIn His farewell discourse in the Upper Room (John 13-17), Jesus told His disciples of the way in which He led them: with His love, joy, and peace. He reminded them of the work of God in His laying down His life for them and in sending the Holy Spirit to them. And He charged them to abide in Him, to obey Him, and to love one another (John 15:1-17). This is the farewell discourse from which we, as those who’ve been redeemed by Christ, must ever turn our attention.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day8.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 8:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through 1 & 2 Samuel together, we will memorize five pivotal verses from these books. This week we are memorizing the key verse for 1 Samuel, a turning point in the story of God’s people: Israel asked for a king.\nBut the Lᴏʀᴅ told him, “Listen to the people and everything they say to you. They have not rejected you; they have rejected me as their king.”\n-1 Samuel 8:7 \nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/4-12Samuel-1.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "Luke 1:50",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHis mercy is from generation to generation\non those who fear him.\n– Luke 1:50\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day6.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 9:1-27, 1 Samuel 10:1-27, Psalm 2:1-12, Ephesians 1:15-23",
        "devo_title": "Saul Anointed King",
        "devo_summary": "\n                    \n                    When I think of Saul, I tend to remember him as the man who ultimately failed to fulfill his responsibilities as Israel’s first king. One of my first recollections is of him mercilessly pursuing David and his compatriots through the wilderness, which makes a compelling backdrop for many of the psalms. But today’s reading gives us a different glimpse into the life of Saul.\nAlthough the Lord foresaw Saul’s abuse of power, He still gave Saul more than a fighting chance as a leader. Before Saul was ever proclaimed king, God sent His spirit upon him (1 Samuel 10:6,10). Imagine that: even though God knew Saul would eventually go astray, He still set Saul up for success as a king. \nThis speaks to the deep compassion our Creator has for each one of us. If God is calling you to something, He will equip you for it. Whether it’s leadership in a traditional sense, evangelism, hospitality, a position at work, or a volunteer role through your church—if God is calling you to it, He will give you the tools you need to faithfully serve Him in that call. \nNow, that doesn’t mean God will always raise you up to glory, nor does it mean God’s Spirit is with us for our own gain. Rather, as we can see in countless places throughout Scripture, God gives the opportunities, talents, and skills we need to make His name great. \nHowever, much like Saul, the moment we stop directing our passions and pursuits toward God and His glory, it’s likely He’ll raise up someone else for His eternal and divine purposes. We make a big mistake when we assume, whether consciously or subconsciously, that God needs us to restore this world to Him. Yes, He takes joy in preparing, equipping, sending, and walking with each of us, but let us never be fooled into thinking He needs us to bring forth His will or complete His plans. \nMaybe you’re in a place where you know you need a new heart. Don’t hesitate to ask God for it! His mercies are never-ending and new every morning (Lamentations 3:22-23). Maybe you need to be revived by His Spirit for the very first time. Or perhaps you want to grow in intimacy with Christ, for your relationship to be renewed. Don’t let this day go by without pausing before our Creator—the One who calls us, sends us, equips us, and has forever redeemed us. \nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day5.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 7:1-17, 1 Samuel 8:1-22, Proverbs 1:29-33, Hebrews 1:1-3",
        "devo_title": "Israel’s Demand for a King",
        "devo_summary": "\n                    \n                    Think about the last big purchase you made. Maybe it was a television, laptop, camera, car, or appliance. Did you read any reviews beforehand, scrolling through websites for a few hours and looking for pros and cons? \nWhen my wife gave me the green light to buy a new camera for our family, I spent hours researching cameras within our price range, reading reviews from both professionals and amateur consumers. It’s good to get input from others, especially trusted authorities in those areas. I don’t know enough about cameras to make a safe and wise decision. I need some guidance. \nIf I don’t know enough to make a purchase like that one on my own, why do I think I know enough to make decisions about my life without the Lord’s help? I know I don’t, but I still plow forward anyway, doing my thing. \nThe nation of Israel took their eyes off of the Lord and worshiped idols, bowing down to other gods instead. They thought they knew what was best for them. They had their self-prescribed wants and they thought God wasn’t meeting them, so they looked elsewhere. \n“There is a way that seems right to a person, but its end is the way to death” (Proverbs 14:12). \nSelf-generated spiritual guidance will always lead to disaster. When God’s ways are tossed to the side, we enter a spin-cycle of sin and destruction.\nIsrael came out of their dizziness, confessed their sin to the Lord, and experienced a moment of serenity in 1 Samuel 7. But did you see what happened in chapter 8? They rejected the Lord’s leadership, His authoritative review, His thoughts—the cons of choosing to follow a mere human king, versus trusting the almighty God to lead them. Israel looked around at the surrounding countries and wanted to be like them, to live like them. Every day we find ourselves looking out onto the same horizon, choosing whether to follow the rest of the world or to follow God.\nToday, the crucified and risen Lord Jesus sits on His throne, speaking to us from His Word, reminding us there is a narrow path leading to life and a wide road leading to destruction (Matthew 7:13-14). There’s the way of Calvary or the way of the world. \nWhere will you go today? Which path will you follow? \nMay we answer like our brother Peter: “Lord, to whom will we go? You have the words of eternal life. We have come to believe and know that you are the Holy One of God” (John 6:68–69). Who else is worth following? No one but Christ alone. \nLet’s confess our sins, knowing they’ve been forgiven through Jesus’ sacrificial death and resurrection (1 John 1:9). And let’s choose to seek Him, His Kingdom, and His ways, instead of our own. \nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day4.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 5:1-12, 1 Samuel 6:1-21, Exodus 10:1-2, Leviticus 5:14-17",
        "devo_title": "The Ark of the Covenant",
        "devo_summary": "\n                    \n                    Without fail, every time I think about the ark of the covenant, I’m reminded of Raiders of the Lost Ark, a movie I saw many, many times in the theater. \nBack in those days—before movies were sold in stores, let alone downloaded or streamed—a big, successful movie might stay in theaters for months. The really big blockbusters, like Raiders, would play for a year or more. And so I made countless trips to see it at the Cinema City 8 theater, complete with its Vegas-style lights illuminating the Roebuck shopping plaza.\nIt is possible I heard lessons about the ark of the covenant in Sunday school, but I don’t remember any of them before seeing that movie. Do you remember the scene where the Nazis have the ark and are having a “ceremony” to open it? Their goal was to use the power of the ark to fight the Allies. Of course, Indiana knows they are making a big mistake by opening it, so he tells Marion to look away and close her eyes when the ark is opened.\nAnd then it happens: one of the most iconic, terrifying moments in my movie-watching history. The faces of all who look at the ark melt off, the presence of God spreads, and everyone is obliterated—except for Indy and Marion, who knew better than to look at it.\nI had heard so many sermons and lessons on the holiness of God growing up in our Baptist church. But that movie is what brought this question home for me: “Who is able to stand before the Lord, this holy God?” (1 Samuel 6:20).\nThe answer, of course, is no one. When you read 1 Samuel 5 and 6, the point is clear. Not only are the Philistines going to pay for approaching the holy God in the presence of the ark, but so are God’s people. After all, Israel should know better. They should know the power of the ark and the depth of God’s holiness better than anyone.\nWho is able to stand before the Lord, this holy God?\nIt almost seems like a helpless situation. God’s holiness and power come together and no one can stand in the presence of either of those things. Our sin and lack of holiness separate us from God in such a dramatic fashion that we cannot look on Him without fear of death.\nThere is one way we can stand before the Lord, in all His holiness. Jesus, the God-man, made a way for us. He stood in our place and died the death we deserved so that we could approach our holy God with confidence (Ephesians 3:12). He took on our sin and gave us His righteousness in return, making the impossible possible. Because of Christ’s sacrifice, we can now “stand before the Lord, this holy God,” face to face (and still intact), welcomed with open arms (1 Corinthians 13:12). \nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day3.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 3:1-21, 1 Samuel 4:1-22, Psalm 78:58-66, Acts 4:23-31",
        "devo_title": "Samuel’s Call",
        "devo_summary": "\n                    \n                    When I was a child, I learned many Bible stories in Sunday School, summer camp, and from my parents. I knew the Old Testament adventures and characters through and through. As I’ve grown older, though, I’ve realized that I almost inevitably missed the point of nearly every story and have since had to relearn them. The story of Samuel’s calling is just such a story. \nFor years I thought of this as the heartwarming story of a naïve and innocent little boy learning to obey God. It is that in part, but like most Bible stories, it’s more than a simple lesson about obedience. When Samuel said, “Speak, for your servant is listening” (1 Samuel 3:10), he wasn’t just setting an example for all the little boys and girls. He was committing himself to God’s will and God’s plan, even though he likely didn’t know it. He was offering himself to the service of God wholeheartedly and with his whole life. \nThe news and command God gave Samuel wasn’t heartwarming. He became God’s messenger to Eli, the priest, about his certain downfall for the way his family had dishonored God. This boy, this little flannel-graph-and-illustrated-Bible boy, was the mouthpiece of God’s judgment, and he would declare God’s promises and judgments over Israel for decades hence. \nThis is a story about God’s commitment to Israel and the lengths He went to bind Himself to them. When those who were supposed to be leading the people in obedience failed, God raised up a child to be a mouthpiece of righteousness. And God acted in accordance with the prophecy He gave Samuel; Eli’s family was thrown down for their disrespect of God’s house  and His ark. They treated the first like a brothel and the second like a talisman of good luck. \nThis is no cutesy story about a little boy’s obedience; it is the origin story of a man God used to raise up His king and to lead His people in faithfulness. Samuel’s willingness to listen and to obey was more than just a good example for our Sunday School lessons; it set the course for the house of Jesse to be established. From this house came both the king God intended to rule Israel (1 Samuel 16) and the King God intended to save the world (John 3:17-18). \nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day2.jpg"
    },
    {
        "book_title": " 1 & 2 Samuel",
        "devo_passages": "1 Samuel 1:1-28, 1 Samuel 2:1-36, Jeremiah 7:12-14, Luke 1:46-55",
        "devo_title": "The Birth of Samuel",
        "devo_summary": "\n                    \n                    This study of 1 and 2 Samuel focuses primarily on three people and their role in the establishment of the kingdom of Israel. Samuel was the last of the Judges; Saul was the first king of Israel; and David was the king they celebrated most.\nSo many familiar biblical stories and characters are found in these historical books; Goliath, Bathsheba, Mephibosheth, Jonathan, and Nathan the prophet are all here. But the story begins as a surprising number of biblical stories do—with a miracle birth. We see this in the Old Testament with Abraham and Sarah (Genesis 17:15-22), and Isaac and Rebekah (Genesis 25:19-26). Both couples faced apparent infertility. We also see it also in the New Testament with Zechariah and Elizabeth (Luke 1:5-25), and Joseph and Mary (Luke 1:26-38). Both conceived when it wasn’t thought possible. \nAgain and again in Scripture, hope is birthed into this world against all odds. \nEven though the books of Samuel relay the epic unfolding of a mighty kingdom, they begin small with the grief of a sorrow-filled woman who wants more than anything for the Lord to give her a child. The Lord gives her a son whose life foreshadows Christ. Hannah conceives Samuel, who leads Israel into a relationship with their king. We’re reminded in these early chapters how the story of the Lord’s work in the world, while global, is also deeply personal.\nFrom Hannah wanting a child to Israel wanting a leader, these books always keep eternity in view. Beyond the page-turning adventure of kings and battles and political gamesmanship, 1 and 2 Samuel tell the story of a greater King—the Lord God who calls His people by name and establishes His throne forever.\nLike Israel, we want to be protected and provided for. When Israel asked God for a king, what they were really asking was for God to give them someone to protect them and provide for them. The Lord had been doing this for them for centuries, but they wanted someone they could see, touch, and seat on a throne. Though their request was made in fear, the great irony of the gospel is that this is exactly what God gave us when He sent Christ to live among us—a King who would be one of us, seated on a throne that could never be defeated.\nAs you read these books, pay attention to Israel’s hunger for peace and stability. That hunger has not gone away, and no nation has ever chosen a king who could satisfy it. Only God can do this, which is not only the point of 1 and 2 Samuel, but of the Christian faith as well.\nOur King has come, and He will reign forever.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/07/HRT-12-Samuel-instagram-Day1.jpg"
    }
]