[
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 1:1-2:7, Psalm 45:1-17, Isaiah 11:1, 1 Corinthians 13:1-13",
        "devo_title": "A Song of Love",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Song of Songs 1:1-2:7, Psalm 45:1-17, Isaiah 11:1, 1 Corinthians 13:1-13\nI am such a fan of love poetry. At root, all love poetry is aiming for the same thing: connection. Although ancient love poetry has a different flavor than modern love poems, we can see the same longing for intimacy in both.\nFor centuries, Song of Songs was primarily read as an allegory for Christ’s love for His Church. And while a purely spiritual interpretation of the poem certainly does seem possible, we can also see from other passages of Scripture that God celebrates married love (Ephesians 5:25), and He values our human connections (John 15:17). So it is safe to read this poem as a human love story, while also noting that we can only love because we are loved by Christ (1 John 4:19). And indeed, in the history of Israel, the theme of marital unfaithfulness is a common one.\nAs we look at this poem, it’s helpful to have a little roadmap to give structure and understanding. Many Bible commentators point out that Song of Songs was written using a chiastic structure, meaning the poem sort of mirrors itself when it’s folded in half. So the first day parallels the last day, beginning and ending with an invitation to enjoy a spring day and culminating in the middle with the marriage.\nBeyond that, this love story is also structured like a play, with speakers given for each role. As you read, it might be helpful to imagine this as a stage play and see each of the speakers as characters distinct from the others.\nAnd finally, we can consider Song of Songs in light of God’s covenant with King David, who was Solomon’s father. God had promised David that his people would be God’s people.\nUnfortunately, his son Solomon didn’t have a great reputation when it came to fidelity. But through Solomon’s marriage to Shulamith, she was joined to the same covenant God had promised to David. Once an outsider, she was brought into the fullness of all the blessings afforded to David’s people, and therefore, God’s people. In this way, the poem also illuminates the beauty of God’s covenantal blessings.\nThe layers of imagery and complexity are rich indeed. But even without all these tools, we can  look into this intimate love poem between two lovers who lived thousands of years ago and find the truth, goodness, and beauty of the gospel. \nHow wonderful that God tells us the story of His love for us not only in commandments, in teachings, in lessons of history, and in the very person of His Son, but also in a love poem. God’s design for love is both intimate and grand in scale, presenting love in the context of marital fidelity and covenantal blessing. The central idea is an intimate tie: “I am my beloved’s and my beloved is mine.” He protects us under His banner, and that banner is love (Song of Songs 6:3; 2:4).\nIn this Song, God provides us with a rich celebration of faithful love between the bridegroom and the bride. It’s about a couple on their wedding night, and it’s about a God who loves His people more than they can understand. “It is a profound mystery,” the love Christ has for the Church (Ephesians 5:32).\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-1s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 2:8-17, Isaiah 62:5, Ephesians 5:31-33",
        "devo_title": "Invitation to Enjoy a Spring Day",
        "devo_summary": "\nBY Guest Writer\n\nText: Song of Songs 2:8-17, Isaiah 62:5, Ephesians 5:31-33\nI had a death grip on my husband for the first decade of our marriage. So desperate was my craving to see us through “till death do us part” that I white-knuckled it in our relationship. I was determined to hold on tight enough for both of us. \nBut I could never fully grasp the security I craved so deeply. Holding on that tightly squeezed the love and fun out of our relationship. \nSince marriage is ultimately a picture of Christ and the Church, this approach to covenant love has also caused strain in my relationship with Jesus. Always secretly fearful that He would change His mind about me, I have tried to keep us glued together with works well done and duties faithfully fulfilled. \nBut as desperation and anxiety couldn’t bolt the door on my marriage, striving couldn’t make Jesus love me more. Through years of tender care and collisions with His Word, I am learning that security flows out of devoted love, not anxious control. \nIn Song of Songs, Shulamith is the soon-to-be bride of wise King Solomon, and she has her own need for security. Right before the wedding, she says these words:\n“My love is mine and I am his.”\n– Song of Songs 2:16\nBut, as Shulamith and Solomon’s love story unfolds, her tone begins to shift. After the wedding she says, “I am my love’s, and my love is mine” (6:3). Then, as Shulamith and Solomon mature into an old, married couple, she says, “I am my love’s and his desire is for me” (7:10). \nLet’s drag a magnifying glass over this subtle progression. \nAt first, Shulamith’s security is found in knowing that her man belongs to her. Her possession of him is primary; his possession of her is secondary. (As I’ve already mentioned, I’ve seen what this looks like in real life. It’s not pretty.) Then, after the wedding, Shulamith’s possession of Solomon was secondary: “I am my love’s, and my love is mine.” And finally, it’s gone altogether: “his desire is for me.” \nIt took decades for the bride in this story to understand that her security did not come from her possession of her groom, but from his devoted love to her. \nSong of Songs is much more than a human love story. As is the case throughout Scripture, God uses marriage as an illustration for the love between Himself and His people. God is always represented by the groom and we are always the bride. His love hinges on His faithfulness, not ours. \n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-2s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 3:1-5, 1 Kings 4:20-34, Isaiah 55:1-13",
        "devo_title": "Night of Separation Before the Wedding",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Song of Songs 3:1-5, 1 Kings 4:20-34, Isaiah 55:1-13\nFriends, we are so close to the wedding scene, the main event of this beautiful poem. But first, before he details wedded bliss, Solomon details the night before. After all, before the morning must always come the night. \nOut of the entire Song of Songs, this passage might be the one I resonate with most. Many commentaries suggest this portion represents a dream Shulamith has the night before her wedding in which she is separated from her beloved. She resolves to get out of bed and seek after him. The repetitive language shows the desperation of her quest: “I sought the one I love; I sought him, but did not find him… I will seek the one I love. I sought him, but did not find him” (Song of Songs 3:1-2).\nThat frustration of knowing what it is like to be united with your love, and then being suddenly separated—it is anxiety-inducing. It is frightening. The night feels dark without him. You feel lost without him, and you are not at rest until you are in his arms again. \nThis, I would say, is what most of our time here on earth feels like—like the night before the dawn, the night before the reuniting. We feel afraid and lost and desperate. We feel like something—someone—is missing, and we begin this search until we find it. \nChrist, our Beloved, has come and He is coming again. But until He does, the night feels long. \nSomething I like about Shulamith’s quest is how focused it is. She is looking for one person and one person only: her beloved. She doesn’t get sidetracked or distracted; she knows her heart only beats for one man. \nI cannot say so much for myself. Though I know what I ache and long for is actually my Savior, I have often set off on quests in the wrong direction, believing maybe this relationship or that person’s approval is actually what I need. I spend money on what is not bread and my labor on what does not satisfy (Isaiah 55:2), instead of going to the living water that has promised me life. I get confused in the night and restless, and too often this results in seeking the wrong person, place, or thing. \nShulamith eventually finds her love, and when she does, she holds on to him and does not let him go (Song of Songs 3:4). Think about that. When your desperate nighttime quest leads you into the arms of Christ, and you recognize Him as what your soul has been longing for this whole time—as the redemption you are so undeserving of, yet so in need of—you do not let go. You cling to the cross and thank God that the night is almost over and the morning is near. You’ve been reunited with your love, your Savior.\nFor now, we cling to Christ in the night. His return has not yet come, but it soon will. And when it does, the final union between us and our Bridegroom will be even more wonderful and holy and beautiful than Solomon’s poetic words can capture. Until then, may we continue our quest in the night, and may it lead us to the arms of Christ. \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-3s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 3:6-11, Psalm 144:1-15, Luke 12:22-31",
        "devo_title": "Wedding Day",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Song of Songs 3:6-11, Psalm 144:1-15, Luke 12:22-31\nThese are the unforgettable words my best friend chose to exchange with me, her maid of honor, before walking down the aisle:\n“Don’t faint up there…or else.”\nWhile most would have taken these words as a warning regarding the air conditioning-less chapel we’d soon be standing in for the ceremony, I knew we were both bracing each other for something else. The incoming emotional swell that would accompany this banner day was headed straight for us, and we weren’t quite sure where it would land. Maybe on tear-stained cheeks or sweaty palms, or in the excitement of our hurried steps?\nBefore we could manage to prepare for its arrival, it was my turn to walk down the aisle, followed closely by hers. The swell arrived as a flurry of tissues and gasps overcame the guests, each as bewildered as I was by our luck at witnessing such a glorious event. \nHer face was ablaze with joy, but the feeling didn’t culminate until I glanced over at the flame’s source—her groom. His stance remained as steady as the stream of tears that fell from his face. It was the day of his heart’s rejoicing, and his joy caused a swell in our own hearts too. \nI brace myself with this same kind of anticipation when we get to Song of Songs 3. Scripture tells us the wedding guests participated in Solomon’s own rejoicing as his attendants rose from the wilderness like clouds of smoke and his mother placed a crown on his head. Beauty and nature linked arms for this lavish celebration of love and promise, every detail covered and each onlooker provided for. \nI hope the wedding guests didn’t miss it. I hope they turned their heads to behold the groom’s face, the evidence of his heart’s rejoicing. I hope we don’t miss our Groom’s joy, either. As we observe the details of this elaborate wedding day, we may feel like we’re only onlookers of Solomon and Shulamith’s vows. But we forget, the same vows have been made to us by God. \n “Consider how the wildflowers grow: They don’t labor or spin thread. Yet I tell you, not even Solomon in all his splendor was adorned like one of these! If that’s how God clothes the grass, which is in the field today and is thrown into the furnace tomorrow, how much more will He do for you—you of little faith?”\n-Luke 12:27-28\nNot even the day of Solomon’s heart’s rejoicing compares to the way our own hearts rejoice— partly now, in knowing Christ, and fully then, in seeing Christ (1 Corinthians 13:12). This passageway called Earth is the aisle we walk to our perfect love, perfect peace, perfect Prince. May we never take our eyes off Him, acknowledging the way His heart rejoices over His bride. Amen. \nHappy are the people with such blessings.\nHappy are the people whose God is Yahweh.\n-Psalm 144:15\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-4s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 4:1-16, Proverbs 4:23, Revelation 22:1-5",
        "devo_title": "Wedding Night",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Song of Songs 4:1-16, Proverbs 4:23, Revelation 22:1-5\nI once had a box of love letters that I kept way past their expiration date.\nThe author of the letters was a boy I knew when I was a teenager. We lived in different states, met at a church event, and “dated” – or something? – long distance for a while, seeing each other only a handful of times. This was back when high school kids didn’t have email addresses and dinosaurs roamed the earth, so letter-writing was our primary means of communication. You know—paper and pens, envelopes and stamps. \nI kept those letters long after the boy and our young relationship faded away, and thinking back on it, I’m not exactly sure why. It wasn’t because I was pining for the boy himself—I hardly knew him, after all. I think I kept them because of my feelings for feelings.\nI liked remembering the anticipation the distance between us created, and the way my stomach did flips each time his handwriting appeared in my mailbox. I liked recalling the connection I felt as I read his letters, even though they were about normal things like school or work or car trouble. (He drove an Acura, my high school dream car. You can see the appeal.)\nLove—even faint glimpses of it—forces us to feel. Romantic love awakens our senses, making us keenly aware of our built-in longing for intimacy and connection. Maybe this is one of the reasons God included this human love letter in the middle of His divine love letter to us: to wake us up.  \nAs we read today in Chapter 4, Solomon could hardly contain himself when it came to Shulamith. He enthusiastically praised every part of his beautiful bride, comparing her hair to “a flock of goats,” her brow to “a slice of pomegranate”—even rejoicing that she has all her teeth! We roll our eyes at the absurdity of his metaphors because we know his bride was human and imperfect, but at the same time, we get it. Whether we’ve experienced the thrill of romantic love firsthand or just blushed at the thought of it, we can imagine the weightless feeling that comes from a stolen glance, or the electricity of a first kiss.\nReading this love song out loud makes me uncomfortable, like I’m eavesdropping on a private conversation. But you know what? It does not shock or embarrass God. He created us for relationship and established boundaries in which those relationships can flourish and honor Him. Solomon is finally joining with his bride, and we don’t have to be embarrassed about it. The Bible celebrates it! \nLove, relationships, and yes, even sex, remind us that we are alive—created by a God who loves us, and created to love each other. We misuse and abuse His gifts—and pain, tears, and shame result when we do—but the gifts themselves are good. Solomon is right to rejoice.\nLove and its songs are grand, but there is only one love that fulfills our expectations. Christ’s love for the Church has no blemishes or flaws; He never falters or forgets. And while love here on earth comes with its share of heartache and tears, the fulfillment of our heart’s truest desire will not disappoint. “He will wipe every tear from their eyes. There won’t be death anymore. There won’t be any grief, crying, or pain, because the first things have disappeared” (Revelation 21:4).\nThere will be no more eye rolling, no more shame—only the ultimate joy and perfect peace that comes from being in the presence of God. We are most alive when we are joined with Him.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-5s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "1 John 4:19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nWe love because He first loved us.\n—1 John 4:19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-6s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 8:6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nFor our study of Song of Songs we will memorize two consecutive verses from this book of the Bible. We begin this week with this verse on the power of love. \nSet me as a seal on your heart,\nas a seal on your arm.\nFor love is as strong as death;\nardent love is as unrelenting as Sheol.\nLove’s flames are fiery flames—\nthe fiercest of all.\n– Song of Songs 8:6\nPunch out the memory card for this passage in the back of your book and place it somewhere you’ll see it often. As you memorize these verses, contemplate God’s rich gift of covenant love to His people.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/4-SOS-1.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 5:1-16, Psalm 128:1-6, Colossians 3:12-17",
        "devo_title": "Night of Separation After the Wedding",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Song of Songs 5:1-16, Psalm 128:1-6, Colossians 3:12-17\nLove makes me uncomfortable. It makes me feel vulnerable and exposed, like the whole world can read my innermost thoughts. Love catches me off guard, it clouds my decision-making, it questions my motives. Love causes me to frantically build walls, and then love tears them all down. Love feels risky. I’m uncomfortable with risk.\nIn chapter 5 of Song of Songs, our young couple is newly married and experiencing all the highs that come with that emotional milestone. But, as is true with human love, the highs are accompanied with lows, the pendulum of emotion often swinging dramatically between the two.\nMany scholars believe this passage to be the description of a dream. So while Shulamith may not literally be searching the street for her love or beaten by the city guards, her vivid description helps us understand her emotional state. Her deep love for Solomon makes her feel euphoria, that “intoxication” with love promoted by the narrator in 5:1, as well as desperation, the lovesickness that comes with these overwhelming feelings (5:8).\nThe part that intrigues me most about this passage is what Shulamith does with this range of emotion. She does not camp out in either extreme, but rather chooses to confirm, once again, her love for her beloved. Even amid her emotional struggle, she recounts her bridegroom’s attributes, summing them up in one telling declaration: “This is my love, and this is my friend” (5:16). She returns to and affirms their love, despite the vulnerability it demands.\nIs this picture of the “work” of love—this constant turning and returning when emotions run awry—what we expect when we think of love and happiness? I’m not sure it is. Take Psalm 128, for example. Too often when I come to Scripture, I want to sit in a safe place like verse 2: “You will be happy, and it will go well for you.” Great! Let’s stay here, yeah? But the psalmist makes it clear that true happiness is not a destination, a place where we arrive and set up camp. Instead, he exclaims, “How happy is everyone who fears the Lord, who walks in His ways!” (v.1).\nHappiness involves a posture of fearing and following God. He is the God who teaches us that love is active, not passive; the God who made the ultimate demonstration of His love by laying down His life for ours (Romans 5:8).\nThis world is passing away, and even those vows exchanged between a couple hopelessly in love, like our bride and groom in Song of Songs, aren’t certain (Matthew 24:35). Promises of love and the realities of relationship involve emotional and circumstantial trials, with bright highs and dark lows. Only the vows made by God Himself are certain to last.\nThe good news is, God did make vows to us. Those vows are called a covenant, and Christ is our down payment of its fulfillment (2 Corinthians 1:21-22). We can love one another because He loved us first (1 John 4:19).\nGod’s love for you and me is more than a feeling; it is a choice. He planned, from the beginning of time, to rescue us from sin and darkness, from false loves and shame. Even in our most intimate of relationships, we rely on Christ’s perfect love to enable us to love—today, and tomorrow, and all the days after that. Thanks be to God.   \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-8s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 6:1-13, Psalm 48:1-14, Romans 12:1-2, 12:9-13",
        "devo_title": "In the Garden",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Song of Songs 6:1-13, Psalm 48:1-14, Romans 12:1-2, 12:9-13\nThe word “garden” gives me heart palpitations. Although I come from a long line of green thumbs, I only remember to water the plant sitting on my coffee table approximately once every three weeks. The friends who gave it to me as a birthday gift promised it was a low-maintenance variety, heavy on the grace. Unfortunately, I’m heavy on forgetfulness.\nWe seem to be doing okay so far, this little plant and me. But the thought of having a whole garden has me pre-grieving the blooms that would be under my care. I did once live across the way from the most wonderful garden—one that made me set aside my preconceived notions and wish for a greener thumb. It was in the center of a thriving artist community, and quickly became my favorite place to gather my people. We spent afternoons sprawled out on blankets, surrounded by those who came to make art with their hands, their paintbrushes, or their conversation.\nGod loves to gather His people in gardens, too. And not only that—it’s also where He does His best art, growing up glory as only The Creator God can. From Eden, the garden of sin; to Gethsemane, the garden of suffering; to Golgotha, the garden of victory; and to eternal paradise, or “garden of delight”—we see that clearly, God faithfully waters what He plants. \nMatthew Henry tells us, “Christ’s church is a garden enclosed, and separated from the open common of the world; it is his garden, which he has planted as he did the garden of Eden, which he takes care of, and delights in.” I think that was my favorite part about my own neighborhood garden: because someone else delighted in it and cared for it, I could enjoy its beauty. I’m still in awe of that individual who was so fruitful in an area where I was so lacking. \nWhile gardens are a recurring theme in Scripture, Song of Songs highlights just how lush and beautiful gardens—and love—can truly be.\nMy love has gone down to his garden,\nto beds of spice,\nto feed in the gardens\nand gather lilies.\nI am my love’s and my love is mine;\nhe feeds among the lilies.\n-Song of Songs 6:2-3\nThe garden is a delight, but what we see happening inside its walls is even more beautiful. The couple is lavishing honor on one another, making clear their love by the way they hold one another up above themselves. The self-sacrifice of the One who is love does the same for us—His bride, the Church. He cares for us and tends to us, but even more than that, He reconciles us to Himself. \nIt was in a garden that paradise was found and lost.\nIt was in a garden that we are lost and found.\nIn gardens, God calls His Beloved in and teaches us about Himself. He reminds us of the ways He has provided for the soil, so that we might remember He is also tending to our hearts. Only when we learn more about the Gardener and the soil of redemption we’ve been planted in, do we begin to see that our broken seeds of faith will grow into holy and living sacrifices after all (Romans 12:1). \nWe are His Beloved, and His faithful love endures forever (Psalm 118:1). Hallelujah. \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-9s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 7:1-9, Ephesians 5:22-30, Revelation 19:6-10",
        "devo_title": "Praise of Love",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Song of Songs 7:1-9, Ephesians 5:22-30, Revelation 19:6-10\nI have to admit, today’s reading was a hard one for me, and not because of the descriptive language. As it’s been said throughout this study, Song of Songs can be read as an allegorical text—a poem that parallels God’s love for Israel and points toward Christ’s love for the Church. When I read Song of Songs 7:1-9 in light of Ephesians 5:22-30, I noticed a depth to Christ’s love for us that I hadn’t really considered before, and, if I’m being honest, am still grappling with now.\nFor some reason, it’s easier to formalize Jesus’ love for us, the Church—to think of Him as a benevolent politician who cares for His people. It’s easier for me to keep Christ’s love at a distance, to imagine Him standing at a podium, rather than by my side. But this is not the type of love we see in Song of Songs. \nIf the way Solomon speaks of his bride is any indication as to how Christ views us, His bride, then He’s in no way a distant politician waving to a crowd. What we see in Chapter 7 is a deep, intimate, and passionate affection.\nSolomon and Shulamith have been reconciled after a time apart, and upon their reuniting Solomon praises his bride’s body and character. He knows every inch of her, every curve and feature. Not one part of her goes unnoticed, unpraised, or unaccepted. Solomon has nothing to say about Shulamith but adoring words of love, devotion, and awe. She is “the handiwork of a master” (Song of Songs 7:1).\nThis is what made me feel uncomfortable while reading these verses. To allow yourself to be loved in this way takes an incredible amount of vulnerability. To be examined and aware of your every flaw and sin, then be told you are the exact opposite of how you see yourself—that you’re actually the beloved and beautiful handiwork of a master—is a truth that can sometimes be harder to live with than the lie of shame.\nYet, this is what Christ’s passionate affection means for us. As Ephesians 5 says, “Husbands, love your wives, just as Christ loved the church and gave himself up for her to make her holy, cleansing her by the washing with water through the word, and to present her to himself as a radiant church, without stain or wrinkle or any other blemish, but holy and blameless” (Ephesians 5:25-27). \nBecause of Jesus’ atonement for our sin, this is who we now are: holy, blameless, without stain or wrinkle. \nThere is an element in our relationship with Christ that requires great vulnerability from us if we are to fully experience His great love. For the striving, earning, and achieving Christian—as well as the guilt-ridden one—this may be one of the greatest challenges of the Christian life: to let ourselves be loved by Him. To allow Him to examine us and declare us good and right and lovely in His sight. \nI wonder what would change in your life and mine if we allowed ourselves to bask in Jesus’ love for us, as Shulamith does in Solomon’s—to just sit in it and learn to accept and embrace it. I wonder how we would see ourselves, those around us, and how it would change our relationship with our Savior. \nI pray this is the new truth we walk in today: that we would see the purity and passion in Christ’s affection for us, and that we would walk in confidence as His beloved. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-10s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 7:10-8:4, Genesis 3:14-19, Psalm 85:10",
        "devo_title": "Invitation to Enjoy a New Spring Day",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Song of Songs 7:10-8:4, Genesis 3:14-19, Psalm 85:10\nWhen asked how he and my grandmother met, my grandfather would tell us, “I came to town and asked where the prettiest girl lived.” The rest, as they say, was history. \nAlthough I never learned the actual details of their first date, I can imagine Papa was far more nervous than he’d let on, and that Grandmother had spent the afternoon prior positioning the rollers in her hair just so. I don’t know what they ate for dinner or what jokes made them laugh, but I do know it led to a second date, and that Papa became a regular visitor and eventual husband to the prettiest girl in town. What began as an invitation to dinner became a call and a promise to choose their relationship again and again.\nInvitations are exciting, but second invitations are better. In Song of Songs, we see Solomon and Shulamith enjoy a spring day together twice, but much has happened between these two significant days. This is where, if we were to fold Song of Songs in half, the two spring days would serve almost as a call and response. \nThe first spring day, in chapter 2, is during courtship—Solomon invites Shulamith to leave her house and enjoy a spring day with him, and concludes with a request to hear her voice (2:14). The second, in chapters 7-8, is during marriage, and this time it’s Shulamith extending the invitation to enjoy a new spring day, concluding with a request for intimacy (8:14).\nAren’t you glad Solomon didn’t stop with their “happily ever after” wedding? The second half of this book is filled with the good stuff, the kind of stories their grandchildren got to witness. Shulamith’s invitation is also extended to us, an opportunity to see a past the lavish celebration to what’s next. There, we find that though the lovers find themselves in a “new” spring season, the covenant has come with them, just as they promised. They kept choosing each other.  Self-sacrificing love has built the trustworthy covenant borders in which intimate love can reside. \nWe’re not told precisely what kept their love alive day to day. Maybe one offered to do dishes and the other loved to put away laundry. The Song gives us tiny glimpses into their trials, but a little research behind their names may give us a clue as to how their partnership worked. “Solomon” means “peace-giver,” and “Shulamith” means “peace-receiver,” illustrating the active ebb and flow of an intimate relationship. \nActive, too, is the relationship between Christ and the Church. He gives peace; we receive it. As Solomon and Shulamith remain belonging to one another in their faithfulness, so we remain Christ’s in His faithfulness to us. \n“Faithful love and truth will join together; righteousness and peace will embrace.”\n-Psalm 85:10\nGod is actively keeping His promises to us. He continues to invite us into His covenant, reminding us of His faithful love again and again. We’re invited to enjoy fresh mercies and kept promises with Him today, tomorrow, and forever. Thanks be to God. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-11s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 8:5-14, Deuteronomy 4:24, John 10:27-30, Hebrews 8:8-13, 1 John 4:19",
        "devo_title": "Made for Love",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Song of Songs 8:5-14, Deuteronomy 4:24, John 10:27-30, Hebrews 8:8-13, 1 John 4:19\nWhat makes you blush? \nWe don’t always blush from embarrassment; we sometimes blush in surprise and delight. Can you remember a time you blushed with delighted surprise? Sometimes I blush over gifts and sometimes I blush about compliments, but my cheeks were at their rosiest when I first met my love. There’s a certain look he used to give me that told me he was utterly slain by me—and, oh, how it made my cheeks burn. The surprises of love, the power of love, and love’s delights are the sweetest things I have ever experienced.\nGod didn’t have to allow us to fall in love with each other. I imagine that we could theoretically procreate, carry on the species, and get our jobs done without love. But God is love, and He gave us the subtle delights of love to hold all of life’s pieces together. Love elevates the mundane to magical. \nEarly on in our relationship, I remember us sitting in a car together; we talked and he touched my fingers—that was all. But when the car door opened for me to get out, I literally fell on the ground, I was so incapacitated. God didn’t have to let us fall ridiculously in love with each other. But He made us for love!\nSong of Songs makes me blush. In fact, it makes me blush like a wedding night makes us blush—at the surprise and joy of intimacy.\nThere are two beautiful parallels between Christ as the bridegroom to the Church and the husband as bridegroom to his bride that stand out: People who love each other desire time together, and they pursue that time with one another in spite of obstacles.\n“A huge torrent cannot extinguish love.” Have you ever longed to be with your beloved? We desire that Christ will write our name on His heart and in His book. He has done this, saying, “look, I have inscribed you on the palms of my hands” (Isaiah 49:16). And He invites us to write His name as a seal on our own hearts (Song of Songs 8:6-7).\n“Rivers cannot sweep it away.” Have you ever loved in spite of obstacles? Just as the pains of disappointed love are like a death, the love of Christ for the Church is as strong as death. Our love for Christ makes us dead to everything else. Indeed, we cannot be separated from the love of Christ even by death (Romans 8:38, Song of Songs 8:7).\nWithout love we have nothing (1 Colossians 13:1). God’s intimate adoration cannot be bought or traded; we can’t earn it. It is impossible, inexplicable, and overwhelming. Just like falling in love.\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-12s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Psalm 85:10",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nFaithful love and truth will join together;\nrighteousness and peace will embrace.\n—Psalm 85:10\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/SRT-SOS-Instagram-13s.jpg"
    },
    {
        "book_title": "Song of Songs",
        "devo_passages": "Song of Songs 8:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nFor our study of Song of Songs we will memorize two consecutive verses from this book of the Bible. This week’s verse is a declaration of love’s endurance.\nMighty waters cannot extinguish love;\nrivers cannot sweep it away.\nIf a man were to give all his wealth for love,\nit would be utterly scorned.\n—Song of Songs 8:7\nPunch out the memory card for this passage in the back of your book and place it somewhere you’ll see it often. As you memorize these verses, contemplate God’s rich gift of covenant love to His people.\nWe want to be a community that is intentional about Scripture memorization. Will you join us? \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/02/4-SOS-2.jpg"
    }
]