[
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 17:29",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nAs we’ve read through Acts, we have been memorizing a 6-verse passage, Acts 17:24-29, one verse at a time. This passage is from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. This week, we’ve come to the last verse:\nBeing God’s offspring then, we shouldn’t think that the divine nature is like gold or silver or stone, an image fashioned by human art and imagination.\n–Acts 17:29\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/4-HActs6.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 20:32",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Praise the Lord, the gospel is true!\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\n“And now I commit you to God and to the message of His grace, which is able to build you up and to give you an inheritance among all who are sanctified.”\n–Acts 20:32\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram41.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 28:11-31, Isaiah 6:9-10, 2 Timothy 4:6-8",
        "devo_title": "Paul in Rome",
        "devo_summary": "\n                    \n                    I do not know how my life will end. Neither do you. \nThe Lord, in His wisdom, protects us from knowing these sorts of things—and this is most certainly a kindness. A mercy. If we knew such things, we might spend more time preparing to die than actually living.\nAs we come to the end of the book of Acts, we know some of what happens to Paul, but not everything. We know he is taken to Rome as a prisoner. And we know that he most likely died there as a martyr, although he was in Rome for several years before his death.\nWhen the book of Acts ends, the author Luke does not reveal (and maybe doesn’t know) what would come of Paul. But when he tells us Paul made it to Rome, I detect a note of joy in his words. This was a dream of Paul’s—to take the gospel into the heart of the Roman Empire (Romans 1:8-15).\nIn today’s passage, Luke does not frame Paul’s imprisonment there as a negative, but as a situation that actually served to strengthen the Church. Christians who had come to know Jesus through Paul’s teaching heard he was there, and they came to care for him and learn from him (Acts 28:17). Because he was under house arrest, Paul’s place of incarceration became a gathering ground for those who had been set free by the gospel he proclaimed. This went on for at least two years (Acts 28:30).\nThe traditional position is that Paul was released from this imprisonment but stayed in Rome as a missionary, and was arrested again later. This second imprisonment was the one scholars believe led to his execution.\nWhen we consider the arc of Paul’s story—from his early days as a persecutor of the Church, to his missionary journeys, to his last days in Rome—we see a man who had to lose everything in order to find the life he knew. He lost his position, his reputation, his career path, his circle of friends, even his hometown. Paul’s life looks to me like a candle that was lit on the road to Damascus, and from then on was burning down to its inevitable end.\nI believe the reason Paul continued to boldly minister to the people of Rome, even though the gospel he proclaimed was the very reason he had been brought there as a prisoner, was because this had become his life. Paul knew nothing else but this cycle of risking his freedom to bear witness to the One who could set others free.\nWhen we come to the end of Paul’s story, we find him not preparing to die, but continuing to live, confident in the gospel and unafraid of what might come his way. \nI don’t know what is coming my way, and neither do you. But the book of Acts tells us the story of what we have—a risen Savior, an indwelling Holy Spirit, a continuing Church, and a gospel with the power to set captives free. For these things, may we give thanks to our Father in Heaven, and trust Him for all that we cannot see as we continue to live on.\nWritten By Russ Ramsey \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-Instagram40.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 27:1-44, Acts 28:1-10, Luke 12:4-7, Mark 16:17-18",
        "devo_title": "Paul Taken to Rome",
        "devo_summary": "\n                    \n                    I’m old enough to have seen the first Indiana Jones movie in the theater six times. It was at the Cinema City 8 for at least a year. This was just before VCRs, when good movies would be shown for months in the theaters.\nFor the life of me, I cannot understand why I went to see that film over and over. It was a great movie and universally loved, but I had nightmares for months. Not about the scary scenes of melting faces. No, I had nightmares about snakes. I was terrified of them then and I still have an irrational fear of them today. \nAs many times as I’ve sat through that movie, I have never been able to watch the entire scene where they actually find the ark. I have also never been in the building that houses the snakes at the zoo. And I feel like I’ve really accomplished something when I cut the grass without getting a snake bite.\nBeing bitten by a snake is my biggest fear. Second to that is just seeing one.\nIn Acts 27, Paul is in the custody of the Roman authorities for preaching Christ. He is on a ship. The ship is full of prisoners, and when it is shipwrecked, someone thinks it’s a good idea to kill them instead of letting them escape. Thankfully, they are spared. But once they get on land, Paul is bitten on the hand by a snake. The viper is so poisonous that everyone assumes Paul will die. Furthermore, the island natives assume he must be a murderer and he is receiving justice. But Paul lives, and he is able to use that hand to turn around and heal the father of the chief of the island.\nLet’s review. Paul is under arrest. He then survives a shipwreck only to have his life threatened again by the soldiers on the boat. Then, my worst fear—on an unknown land he is bitten by a very deadly snake. And Luke, the writer of Acts, makes it clear that Paul continues throughout all of this to minister to everyone around him. \nWherever you read about Paul in the New Testament, there is this “To live is Christ, to die is gain” hum happening. Sometimes it is in the background but, more often than not, it is in the foreground.\nEvangelicals today are fond of saying “It was a God thing” when something really good happens. While I refuse to ever say that out loud, I emotionally respond that way. I tend to see good events as sent by God. I also see bad and challenging events as sent by God, but I lean toward thinking they are punishment for some sin—sometimes to the point that I find myself feeling wrecked with guilt.\nBut Paul, who once terrorized the Church, was so convinced of God’s affection for him that he could see all the good and the bad as a “Christ thing.” To Paul, everything was about Jesus and His glory and His mission to save sinners.\nMy prayer? To see every won parking place and every cancer diagnosis, every triumph and every disappointment, every new and shiny gift and every loss as being about Christ and the glory of His grace toward sinners.\nWritten By Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram39.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 25:1-27, Acts 26:1-32, Proverbs 2:6-8, Psalm 37:28",
        "devo_title": "Paul Appeals to Caesar",
        "devo_summary": "\n                    \n                    Sometimes what is just is not right, and what is right is not just – at least in legal terms. Sometimes the law’s rigidity actually keeps people from doing right, yet obeying the law and abiding by it is right. It’s a conundrum, one that Paul found himself facing in Acts 25 and 26.\nAfter being arrested, Paul was transported to Caesarea where he would go before Festus, the Roman governor. Paul pled his case to Festus, and that’s when things went awry. In the same way that Pontius Pilate once privately declared Jesus innocent but then handed Him over to be crucified, so also Festus declared Paul innocent yet did not set him free. \nInstead, he kept Paul until Agrippa, the Jewish King, could come down and hear him too. What Paul did, when given the opportunity to face Agrippa, was astounding. He did not plead his case legally. He did not argue his innocence, though he did make it clear that he was innocent. He did not try to argue the law at all. Instead, Paul gave full testimony to why he followed Jesus and why everyone else in the court should too.\nThe most natural thing for Paul to do would have been to try to save his own life. But what he did instead was try to save the souls of everyone present. Agrippa even scoffed at Paul, asking if he really thought he could convince Agrippa to believe, in such a context and in such a short time. \nPaul’s response? “I absolutely hope so!”\nPaul was drawing on the promise that God does not forget His saints and that the Lord gives power to His people in the moment they need it. He trusted in this and he declared it. He did not fear or cower or try to manipulate.\nIn the end, Paul was sent to Rome to face Caesar. It was legal, but it was not right. He was innocent but he was condemned. A Roman governor conspired with a Jewish king to kill an innocent man for honoring God. And the innocent man went willingly. Paul did not wonder what Jesus might have done. He did precisely what Jesus had done—he let them take him. \nIn a culture where we demand our rights, Paul’s humble obedience to the Lord in the face of a personal injustice gives us a gut-check. God works through seasons of ease as well as hardship, which means whatever season we’re in, God is with us, no matter how unfair things seem.\nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-Instagram38.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 24:1-27, Jeremiah 29:10-14, Hebrews 13:15",
        "devo_title": "Journey to Rome",
        "devo_summary": "\n                    \n                    I sat in the dentist chair getting a filling. Through my pain, Dr. Bailey told me about her recent jury duty—eight days long! Eight days without work. Eight days of taking scrupulous notes in order to follow the arguments and render a verdict. She was proud of her service, but glad to be finished. I was glad to get out of that chair. \nIn today’s text, Paul has been summoned, but not for jury duty. He’s there for another round as the accused. He’s in and out of court, always in trouble for one reason or another. If he’s not in some sort of official predicament, he’s getting shipwrecked, or he’s raising money, or he’s dealing with some new conflict. \nYet here he is, offering up his sacrifice of praise and acknowledging God’s providence and grace, just like the author of Hebrews writes in 13:15. I’m not sure I would start my speech with this opening line: “Knowing that for many years you have been a judge over this nation, I cheerfully make my defense,” (Acts 24:10) but Paul pulls it off. He knows God is in charge. He trusts that all will be for good, that Jeremiah 29:11-14 still applies— that God has a plan for him and that nothing can separate him from the love of Christ. \nWhat about you? What about me? I often think God abandons me or is distant and uncaring. But I’m likely to do so under far tamer circumstances than those Paul endured—like when I have a big test, or when I have to file an important project, or when I have to have a difficult conversation, or when I have to go to the dentist. I don’t like going through hard things. So, of course, when I do, I feel like God has abandoned me! \nFor this, I have to admit my weaknesses and lack of faith, and rely on Christ and His riches, His love, and His care for me. Paul displays this, even standing before high priests and governors. Yes, it’s courage. But more than that, it’s Christ. He is our Advocate, our Great High Priest, the Lord of Lords and King of Kings. He’s our Redeemer, so I can stand with confidence and tell my story—His story. \nWritten By Doug Serven\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-Instagram37.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 23:12-35, 2 Corinthians 4:8-12, Job 33:4",
        "devo_title": "The Plot to Kill Paul",
        "devo_summary": "\n                    \n                    I’ve always wondered what happened to those 40-some-odd men who took oaths not to eat until they had killed Paul. Paul, as it turns out, lived for quite some time after those vows were taken. I reckon those men eventually just gave up. The zeal and fervor of the wicked cannot overcome the sovereign providence of God.\nThe cause of the Jewish religious leaders’ hatred for Paul was his ministry to the Gentiles. Considering themselves devout and committed to their false version of the faith, they took a sacred oath. This was not merely a personal vendetta, but a satanic commitment to oppose Christ. As Jesus declared in John 8:44: “You belong to your father, the devil, and you want to carry out your father’s desires. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.” \nThe religious leaders hated the gospel of Christ, and so were opposed to Paul, the apostle of Christ. \nIn contrast to the rashness of the religious leaders, we see Paul’s measured and wise response. He neither panics nor despairs in the face of the threat, but trusts himself to God’s good care, while at the same time prudently engaging the means of help available to him. The civility of a centurion, the power and might of pagan Rome under the Julian law code, and the Pax Romana, in God’s providence, were the means by which God not only preserved Paul’s life, but also furthered the apostle’s ministry among the Gentiles.\nThere are really only two views of Providence we can take. Either God is sovereign over all, or else the course of time and history is in the hands of men. If men govern the tide of time, then plots and oaths and human connivings are perhaps the best means to gain ground. \nBut “the earth is the Lord’s, and everything in it” (Psalm 24:1). No plot, no priesthood, no zeal, no army can confound His will or harm those in His care. All men belong to God. Rome was God’s. Caesar and all his legions were God’s. Even the devil is God’s (Job 1:9-12). Paul knew that he need not be anxious about anything, because God, the Almighty, gave him life and no man could snatch it from him apart from God’s will (Philippians 4:6, Job 33:4, John 10:28, Matthew 10:28).\nDo we have this same confidence? Do we fret and fear in the face of the world’s might? Do we trust our own strength and resolve to make our way in the world? Remember, it is the Almighty who gives us life. No power, human or spiritual, can snatch us from His care. \nThough we may be afflicted, perplexed, and persecuted, we can yet walk in hope, joy, and confidence, knowing that “we who live are always being given over to death for Jesus’ sake, so that the life of Jesus may also be manifested in our bodies” (2 Corinthians 4:11). \nThanks be to God.\nWritten By Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram36.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 17:28",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\nFor in Him we live and move and exist, as even some of your own poets have said, ‘For we are also His offspring.\n–Acts 17:28\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/4-HActs5.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 16:31",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    There is no greater prayer we can pray for those we love than for them to know the fullness of God’s love in the saving grace of Jesus Christ.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\n“Believe on the Lord Jesus, and you will be saved—you and your household.”\n–Acts 16:31\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram34.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 21:37-40, Acts 22:1-30, Acts 23:1-11, 1 Peter 3:21-22, Hebrews 10:19-22",
        "devo_title": "Paul Preaches to Jews in Jerusalem",
        "devo_summary": "\n                    \n                    I am intensely afraid of heights. Like, paralyzed-on-a-second-story-roof afraid. I once was helping a friend put Christmas lights on her house, and though I was petrified to climb a ladder and get onto the roof, I put that fear aside in order to help her out. Unfortunately, once I got on the roof, I was toast. My brain said, “Just climb back down to the ladder. You won’t fall or break anything—it’s perfectly safe.” But my body wouldn’t respond to logic. My legs were like Jell-O. I was stuck.\nI took a risk for a friend—which was the right thing to do—but I suffered embarrassment and stress in the process. And I vowed to never feel like that again. If I were on a courtroom TV show, I would’ve definitely sued that roof for causing me mental anguish.\nIn today’s passage, we see Paul taking a risk for not only his friends, but ultimately his Lord. That might be the last time I ever climb on a roof, but this is not the first or last time Paul put himself in harm’s way for the sake of Christ.\nIn this scene, he is at the temple teaching something he knew the crowd would likely reject. But this crowd wasn’t merely unbelieving pagans who didn’t know him; these people were Jews—God’s people, Paul’s people. This crowd was predisposed to despise Paul because, though he was one of them, his gospel was an affront to their beliefs. Knowing that, he and his companions still entered the temple and preached the gospel.\nSo why did Paul enter the temple knowing the danger? The obvious answer is that he knew the Great Commission. Sure. But more than that, he did it out of love.\nRemember what he says to the Romans: “I have intense sorrow and continual anguish in my heart. For I could almost wish to be cursed and cut off from the Messiah for the benefit of my brothers, my own flesh and blood” (Romans 9:2-3). Paul wanted those closest to him to know Christ and be saved, so much so that he was willing to trade his own eternal fate for theirs. He was willing to be embarrassed—and much worse if that’s what it took.\nThis passage speaks not simply to door-to-door evangelism or handing out pamphlets at the mall; it speaks to sharing Christ with those closest to us. After all, why would we spend hours and hours trying to tell strangers about Jesus when our own family, friends, coworkers, and classmates don’t know him?\nMy risk was not Paul’s risk. But we both suffered at some level because love compelled us to take a risk for someone else. The difference between Paul and me is that he was more willing to be beaten for the gospel than I am to climb on another roof. He risked over and over again, and I’ve not stepped foot on a roof since.\nFor many of us, our instinct is to avoid risk, even when the risk in question is motivated by love. We can look up that ladder and talk ourselves into believing it’s not worth the personal pain or hassle. But in the gospel, the real risk is not loving others. \nThe question for us is, which do we see as a greater risk—self-preservation or gospel-motivated love?\nWritten By Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram33.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 21:1-36, Joel 2:28-29, John 19:13-16",
        "devo_title": "Paul Goes to Jerusalem",
        "devo_summary": "\n                    \n                    How many times have you watched a movie and thought, or maybe yelled, “Don’t go in there!” when the main character is about to head up to the attic or into the cave but you know what awaits? \nThat’s a bit of the feeling we should have reading Acts 21, as Paul begins his journey back to Jerusalem. His friends pleaded with him not to go, but off he went. He knew it might be to his demise, but he also knew that ignoring the prodding of the Holy Spirit would have been even worse than death.\nWhen he arrived, Paul went straight to James, the brother of Jesus, who was the most respected leader of the church in Jerusalem. Paul shared what God had done during his journeys.\nThis was significant. Paul was Paul, the most prominent of the apostles, but he went to James for counsel in a posture of humility. He didn’t arrive as the conquering hero or star preacher. He abided by decisions made by the counsel of elders. He saw himself as part of the Church, not the star of the Church.\nWhat Paul did next was the true “Don’t go in there!” moment. We felt it when he headed toward Jerusalem, the ominous music in minor tones playing in our minds. But when he entered the temple, we knew he was walking into the den of the beast (“beast” being the religious leaders of Israel who hated him and the work he was doing). \nWhen some of the people who despised Paul saw him enter the temple with four others, they assumed one of the men was a Gentile named Trophimus, who had been seen with Paul earlier in the day. They assumed Paul had brought a Gentile into the temple area, defiling their customs, and they turned on him. \nThrough lies and false accusations they riled up a crowd so rabid Paul would have been torn apart if Roman soldiers hadn’t arrested him. The fervor and ire of the religious leaders echoed back to a number of years earlier in Jerusalem when a man was arrested on false premises and killed on a cross a few hours later. That was the man who Paul sought to honor with his whole life. And this arrest would eventually lead to Paul’s death too.\nBut Paul knew this. He knew he “shouldn’t go in there.” Was Paul a fool? By human standards, maybe; but by that standard so was Jesus. What Paul did was the same as what Jesus did – the thing that the Holy Spirit compelled Him to do in order to give glory to God. Such actions are never foolish, no matter the cost.\nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram32.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 20:1-38, 1 Corinthians 16:1-4, Philippians 1:20-21",
        "devo_title": "Paul Says Goodbye to the Ephesians",
        "devo_summary": "\n                    \n                    I remember sitting in a wooden chair at my grandfather’s feet. He lay stretched out in his recliner, covered with soft blankets, the pillows behind him carefully arranged. A plastic cup with a lid and a straw stood on the small table beside him. We spoke quietly, but I did not have much to say. \nI was hearing his final words of exhortation to me. He knew his end was near, and it gave weight to his every syllable. Time slowed down. I remember listening very carefully, treasuring up each word in my heart. I remember, too, how confidently and peacefully he faced eternity.  \nAs Paul journeys toward his own final trials, everything seems to slow down. Luke records the names of each friend that fellowshipped with them along the way: Sopater, Aristarchus, Secundus, Gaius, Timothy, Tychichus, Trophimus, and the elders of Ephesus (Acts 20:4). This was a time of final goodbyes, and we read that “there was much weeping on the part of all” (Acts 20:37).\nLuke records each stopping place: Greece, Macedonia, Troas, Assos, Mitylene, Chios, Samos, and Miletus. He also counts the months and days. Each detail of that final voyage is stretched out. Even Paul’s sermon one evening at Troas extends well into the night, until young Eutychus fell asleep and “fell down from the third story and was taken up dead” (Acts 20:9). \nBut, as the story of Eutychus reveals, this lengthening of months, weeks, days, and hours is marked by God’s favor and direction. From the healing of Eutychus to the Spirit filled confidence of Paul, we see God at work. And it is precisely this which God desires us to see: Christ is at work, and His grace abounds.\nUpon arriving at Miletus, Paul summons the Ephesian elders to give them his final exhortations and instructions. \nWhat would you say if it was your final word?\nPaul’s declaration is simple: “I do not account my life of any value nor as precious to myself, if only I may finish my course and the ministry that I received from the Lord Jesus, to testify to the gospel of the grace of God” (Acts 20:24). \nIn the face of impending death, in the face of sorrowful and final goodbyes, Paul had set his heart upon Christ alone, and His kingdom. Paul’s hope, his confidence, his purpose, and his joy were fixed in Christ. As he declared in his letter to the Philippians, “For to me to live is Christ, and to die is gain” (1:21).\nThis too must be our eager hope and expectation. \nAnd, as Paul warns, we will face many obstacles. Wolves will come in among us, seeking to harm the flock of God. From our own midst will arise some who will deceive and seek to draw us away. How will we remain alert? \nPaul declares: “I commend you to God… remember the words of the Lord Jesus” (Acts 20:32, 35).\nThese two truths are our security: \n\nWhether in life or in death, our lives are in God’s hands, and there is no better place to be, and,\n\nIn this world full of trouble, we have a sure source of comfort, purpose, confidence, peace, and life in the words of our Lord.\n\n\nThanks be to God!\nWritten By Caleb Faires \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram31.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 19:1-41, Luke 3:16, Ephesians 6:12",
        "devo_title": "Paul’s Third Missionary Journey",
        "devo_summary": "\n                    \n                    “You gotta serve somebody.” –Bob Dylan\nWe were created for worship. This is why, when we’re not directing our worship at God, we automatically begin investing it in something else.\nAs far as we know, idols have existed from the earliest days of post-Fall creation. It’s easy for us to scoff at ancient worshipers for thinking that a carved log or chiseled stone could be a god; but perhaps that’s our fault for misunderstanding the custom. The small totems and family idols weren’t meant to be actual gods, but rather physical manifestations or meeting places where the natural could fellowship with the supernatural.\nThe craftsmen in Ephesus were working from this framework. Their idols of Artemis, the goddess of the hunt, were not meant to be Artemis herself, but a physical place where the common could connect to the divine.\nPaul’s ministry in Ephesus confronted at least two major problems with this system of worship. The first and most notable was that Artemis was not a true god in any sense. At best, the people of Ephesus were worshiping a figment of their imagination. At worst, they were playing around with dark spiritual powers. \nThe second problem was that the worship of Artemis in Ephesus had been highly commercialized. It’s easy to see that a large catalyst for the riot in Ephesus was that the merchants and craftsmen were getting hit where it hurt—not in their hearts, but in their pocketbooks.\nIn spite of the healings they had witnessed and the miracles they had seen, the leaders at Ephesus were outraged because Paul’s ministry was cutting into their sales, distribution, and profits. Fewer faithful servants to Artemis meant a decrease in demand for idols, which meant a decrease in demand for silver, which meant a decrease in demand for fine craftsmanship, which meant less revenue for all involved.\nThese leaders had been confronted with powerful, life-changing, life-giving truth; but it was far more comfortable and far more profitable for them to protect the idols they knew. They chose to stick with what they knew instead of embracing what Paul continually demonstrated to be actually sacred and true. \nIt’s easy to judge the Ephesian craftsman and the riotous mob for their stubbornness or perhaps even their greed, but it seems like all too often we make similar decisions with our own lives.\nLike the man with his lizard in C.S. Lewis’ The Great Divorce, we all have idols or pet sins we hold onto because they are convenient, make us feel better, or in some way seem profitable. We are not foolish enough to think that our idols are actual gods. Rather we use them as a meeting place where we hope to find peace or security.\nThere are times when following the one, true, and everlasting God will be costly, even painful. It probably won’t be because you’re manufacturing idols to Artemis, but it could be because you’re involved with the production or worship of other cultural idols (less easily recognized as such, but idols all the same).\nWe are like the Ephesians. We all have things that we worship and adore that are not the one true God. Whether we hold on to them out of fear of letting go, or we protect them to hedge in our comforts, we are called to release them and to lay them down. \nTrue freedom is found in surrender to the one, true, and everlasting God. When we search the deepest recesses of our souls, we know this to be true. All we need to do is ask, and God will deliver us.\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram30.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 18:1-28, James 4:13-15, Isaiah 51:1-2",
        "devo_title": "Paul’s Second Missionary Journey Ends",
        "devo_summary": "\n                    \n                    Who do you know who seems to exude raw talent in everything they do? We all know the brilliant mind, natural athlete, gifted artist, or charismatic leader. You may even know someone who is a sickeningly awesome combination of all four.\nIn today’s text we meet someone I imagine was like that—a man who will become a very influential leader in the early Church—the eloquent Apollos.\nApollos reminds me of another character we’ve already studied, Barnabas, in that he appears several times in Acts but never really as the primary character in any of the passages. So if we don’t try to pin him down a bit, we might never really see him. \nApollos was a man who had embraced the teachings of John the Baptist concerning Jesus (Acts 18:25), either by traveling to Jerusalem to hear him personally, or by hearing one of John’s disciples who traveled to Alexandria after John was beheaded by Herod (Mark 6:25).\nEither way, as a result of his interest in John the Baptist, Apollos believed a lot of things that were true. It’s just that he didn’t have the full picture. But, boy, was he a gifted speaker.\nWhat do you do with someone like this? Well, Aquila and Priscilla heard Apollos teach, and they knew something needed to be done. But what? Should they warn his hearers that his teaching was deficient? Should they brand him a heretic? Should they try and steal away his students?\nIt seems what they did was invite him over for dinner.\nApollos wasn’t the enemy. He was, if anything, a gifted asset to the Church—which he’d later prove to be in Corinth, where he would serve in a long, fruitful ministry. Aquila and Priscilla took Apollos under their wing and filled out the picture for him. They told him the rest of the story. \nWhat all they taught him, we can’t know for sure. But what we do know is this: 1) Apollos was humble enough to be corrected, 2) he embraced what Aquila and Priscilla taught him, and 3) his effectiveness as a preacher only grew.\nSo, apparently, Apollos was also gifted at being humble and teachable. Sheesh.\nApollos and his gifts were an asset to the Church. But here we’re reminded of something crucial to the health of any Christian fellowship: doctrine matters. \nApollos seems like a man people would follow based on his polish and pedigree alone, regardless of what he taught. This happens all the time. We like being around gifted people. But you can have all the gifts in the world, all appearances of a “successful looking” life, use all the right trendy words by which to introduce yourself; and when you’ve finished listing all your appealing qualities, if your doctrine is weak, incomplete (intentionally or not), or false, what then?\nI love this passage for the way it speaks not into our weaknesses, but our strengths. It says, Don’t trust your strengths carry you. One of the best gifts Apollos had working for him was people who would take him as he was and seek to deepen his understanding of the truth.\nWhere are you relying on gifts and talents to carry you beyond what you actually understand? Who would your Priscilla and Aquila be? What would it look like to seek their help to grow beyond your natural talents into a deeper understanding of the truth? What would that sort of humility look like?\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram29.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 17:27",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\nHe did this so they might seek God, and perhaps they might reach out and find Him, though He is not far from each one of us.\n–Acts 17:27\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/4-HActs4a.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 13:38-39",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Connect with the members of your family and community in prayer as you pray the Scripture below for them and for yourself:\n“Therefore, let it be known to you, brothers, that through this man forgiveness of sins is being proclaimed to you, and everyone who believes in Him is justified from everything that you could not be justified from through the law of Moses.”\n–Acts 13:38-39\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/07/HRT-Acts-instagram27.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 17:1-34, Zechariah 12:10, Romans 3:21-26",
        "devo_title": "Paul Preaches at the Areopagus",
        "devo_summary": "\n                    \n                    Uomo senza nome. It’s Italian for “the man with no name.” \nIt also refers to the protagonist played by Clint Eastwood in Sergio Leone’s trilogy of westerns: A Fistful of Dollars, For a Few Dollars More, and The Good, the Bad and the Ugly. \nA key element in those genre-bending westerns was keeping the main character nameless, and thus mysterious, almost otherworldly. Nobody knew where he came from or where he was going, but they sure as shooting were witnesses to his brand of cinematic high plains justice. The man with no name.\nPaul rode into Athens, so to speak, and was appalled at the number of idols/shrines. But he reined in his anger and set about to discussing this with the philosophers in town: “It is plain to see that you Athenians take your religion seriously…I even came across an altar to THE GOD WITH NO NAME” (Acts 17:22-23, my paraphrase). \nBut rather than leave them in their ignorance, Paul introduced them to the one, true God—He is the God who created all there is, the God who doesn’t need a shrine or any human help for that matter, the God who spoke into existence the entire human race, the God who is always near, the God in whom we live and move and have our being, the God who commands people everywhere to repent and turn to the Man God has appointed as judge, the very Man God raised from the dead.\nAnd just like that, the GOD WITH NO NAME was named: Jesus.\nJesus’ genre-bending narrative was like nothing the people of Athens had heard before. And once they heard it they had no excuses. They could choose His brand of cinematic-technicolor mercy, or they could refuse it. What they couldn’t do any longer was ignore it. Actually, they could no longer ignore Him—the God with a name, JESUS, who was crucified, died, buried, and raised from the dead.\nIt is the same choice before us today. Refuse, or choose the known God with fists full of justice and mercy. He is good, and His name is Jesus.\nWritten By John Blase \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram26.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 16:16-40, 2 Corinthians 10:3-4, 1 Peter 2:19-21",
        "devo_title": "Conversion of the Philippian Jailer",
        "devo_summary": "\n                    \n                    Has God ever brought you to the end of yourself?\nWhen I was an RUF campus minister at the University of Oklahoma, I received a phone call from one of my students on the Saturday of the OU-Texas football game. This match-up is played every year in Dallas, and it’s a huge party.\nMy student had already called his dad, who had instructed him to call me next. He told me he was calling from jail. He’d been arrested for public intoxication. I told him I was glad to hear from him, that I hoped he was okay, and that I’d talk to him next when he returned home. But that was all I could do for him.\nGoing to jail might be one of the most stressful things that can happen to a person. My student’s incarceration turned into a time of gospel renewal for him. His embarrassment became a turning point in his life.\nThough I wish my student had been in jail for a different reason, the Lord used that time to change his life. But in Acts 16, when Paul and Silas were also sent to jail, their time behind bars ended up changing their jailer’s life. This chapter tells a fascinating, and rather odd, story. Read the text and you’ll see what I mean.\nPaul commanded an evil spirit to come out of a slave girl who was being used to make money for her masters. The owners weren’t happy their fortune-teller could no longer profit them. So they had Paul and his buddy Silas put in jail. \nWhat happened next was nothing like the story my student told about the night he spent in the drunk tank in the West End in Dallas. The earth shook and the prison doors opened and prisoners were free to escape—but they didn’t. The jailer knew this was somehow connected to their God. \nLuke describes it this way: \n“Then he brought them out and said, ‘Sirs, what must I do to be saved?’ And they said, ‘Believe in the Lord Jesus, and you will be saved, you and your household.’ And they spoke the word of the Lord to him and to all who were in his house. And he took them the same hour of the night and washed their wounds; and he was baptized at once, he and all his family. Then he brought them up into his house and set food before them. And he rejoiced along with his entire household that he had believed in God” (Acts 10:30–34).\nIt’s amazing that God uses things like incarceration for His glory. He did this both for Paul and Silas and for my student at OU. God uses evil for good. He redeems bad situations. This is His way. One of the ways God gets our attention is by bringing us to the end of ourselves. \nHow has He done this, or how is He currently doing this, in your life?\nWritten By Doug Serven \n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram25.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 15:36-41, Acts 16:1-15, John 15:26, 1 Corinthians 9:19-21",
        "devo_title": "Start of the Second Missionary Journey",
        "devo_summary": "\n                    \n                    Relationships are complicated, aren’t they? \nSometimes I think if I just could manage them correctly, all my friendships would be devoid of conflict. But that’s not true. You know that, right? \nConflict is part of relating to others, and not all conflict is born out of sin. In fact, some of it comes from God desiring to do something in your life that He does not plan to do in another’s.\nPaul and Barnabas found themselves in conflict, and it separated them. But before we search for who’s to blame, let’s look at it. \nEarlier, these two men had been set apart by their church to take the gospel to the Roman Empire (Acts 13:1-3). They had already completed one missionary journey, and now they set out to plan a second. That’s when we get the unsettling news that Paul and Barnabas were parting ways over whether Barnabas’ cousin, John Mark (Col. 4:10), who’d left them on the first missionary journey, could come with them on the second.\nPaul knew this journey would only be harder, so he said “no”—apparently regarding Mark’s leaving as, at best, an indication of weakness or, at worst, a form of desertion. They would, after all, return to the same cities they’d previously been thrown out of, even stoned in. Lives were at stake here. Paul needed his team to have clear eyes and committed hearts.\nBut how could Barnabas tell his own cousin he couldn’t come? This wasn’t in Barnabas’ chemistry. He got his name, “Son of Encouragement,” for his willingness to believe the best in people. Barnabas believed in John Mark so strongly that it led to a “sharp disagreement” between him and Paul, which led to their separation (Acts 15:39).\nThe Apostle took a stand for the intensity of the mission. The Son of Encouragement took a stand for his cousin. We can’t be too hard on either of them for this. Our strengths are often our weaknesses too. Still, their conflict carried with it this consequence: Silas would go in Barnabas’ place.\nThis is the classic struggle over choosing which to put first—relationships or the work at hand. Sometimes we have to make that choice. Barnabas had invested so much in Paul, yet Paul’s work was to the Gentiles throughout Rome. \nWhat would you have done? The principle Paul applies here is that the call to do what Christ had set Him apart to do was prime. Anything that jeopardized that mission was second to the mission itself. This is consistent with Paul. He was one who contended for the gospel to be heard among the nations.\nLater references in 1 Corinthians 9:6, Colossians 4:10, and 2 Timothy 4:11 suggest that Paul, Barnabas, and John Mark went on to consider each other as co-laborers in the gospel, but this split had to have hurt all three. \nWhere are you wounded from a relationship strained by mission, loyalties, or some sort of change in call?\nEverything God does is motivated by His perfect love. We can rest in knowing that even when His call means relationship are strained, we can trust Him. Because God has decreed by His wise providence that a life spent making His grace known is richer by far than a life spent pursuing comfort.\nWritten By Russ Ramsey \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram24.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 15:1-35, Romans 2:17-24, Galatians 5:1",
        "devo_title": "Is Christ Enough?",
        "devo_summary": "\n                    \n                    I’m sitting here reading Acts for the thousandth time. I’ve always read this story of the Jerusalem Council and focused on the theological implications. I’ve reviled in my heart those who were part of the Pharisees. I’ve identified with Paul and Barnabas and the others in their desire to deliver a gospel of grace.\nBut I’ve never really thought about what it must have been like to receive that news from the Jerusalem Council.\nWhen our second child was born we were living in a small Mississippi Delta town. The day we came home from the hospital, we noticed his lips would turn blue whenever he would go to sleep. We rushed to the ER at the local hospital, and within 24 hours we were at the Children’s Hospital down in Jackson and no one knew what was wrong. He would just quit breathing.\nOver the next few days, our son was run through every test imaginable. We wondered if he would live, or if he would have health issues for the rest of his life. We were exhausted, anxious, and emotionally spent. Then the breathing problem just stopped. He was pronounced healthy. You can imagine our relief when we got the news.\nThey told us to keep an eye on him (as if we’d be able to stop). And they told us he would need regular checkups but he was as healthy a baby as they had ever seen. Our hearts, once so unsure, were now encouraged.\nWhen the representatives from the Jerusalem Council went down to Antioch, they gathered the congregation and delivered the letter. “And when they had read it, they rejoiced because of its encouragement” (Acts 15:31).\nUp until then, these believers had been getting mixed messages. From Paul they had heard they did not need to be circumcised, but other voices said that was incorrect. Yes, they would have dreaded circumcision because of the physical pain, but I’m sure they also didn’t like wondering whether they were justified before God. Their hearts, which were so unsure, were now encouraged.\nStill, I doubt the matter was ever completely settled among them. There were—and still are—plenty of Pharisees who want to add to the gospel and do not believe we are fully justified by faith in Christ’s work on our behalf. Heck, I live with a constant Pharisaical conscience that tells me there is something else I need to do before God will truly love, accept, and forgive me. Every time this happens I am unsure how to proceed. My first instinct is that I need to do something really painful or sacrificial to make things right with God, but that is not the gospel.\nWhat we all need to hear in those situations is what those believers in Antioch were so encouraged: we have already been justified by faith and we need to rest in the work of Christ. With this knowledge, and by the power of the Holy Spirit, we can fight the voices that insist we need to add our own works to a salvation perfectly accomplished by Christ.\nWritten By Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram23.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 14:1-28, 2 Timothy 3:10-12, Colossians 4:2-4",
        "devo_title": "Growth and Persecution in Iconium",
        "devo_summary": "\n                    \n                    People love adulation. We all do. We love to be praised and celebrated, and we love all the influence that comes with it. The more we get, the more we want. It’s addictive, and and it affects our brains like a drug. We become stupefied and begin doing foolish things to gain further acclaim or hold on to what we’ve got (Think reality TV).\nMany of us believe that with popularity comes happiness and fulfillment, and we ignore all the signs that indicate just the opposite.\nWhat happens when our addiction to praise puts us in direct conflict with God’s Word? That’s precisely what happened to Paul and Barnabas in Acts 14, in the town of Lystra. Paul was preaching when he saw a crippled man in the crowd, and in the man he saw a spark of faith. So Paul called out to him and said, “Stand upright,” and the man did. His faith had made him well. \nAt this, the whole crowd turned to Paul and Barnabas and declared them to be gods—Hermes and Zeus, respectively. They brought out bulls to sacrifice and placed garlands on them. What a scene!\nMost people, followers of Christ or otherwise, would likely balk at being called a deity. But I don’t think many of us would protest very hard. We might offer a token, half-hearted, “C’mon guys, don’t do that.” But that’s not how Paul and Barnabas responded. They rushed into the crowd, pleading with them not to do this, proclaiming that they were men just like everyone else. They declared their God was a better way and wanted no part of this celebration. Paul and Barnabas knew their place before God and how much the people needed to hear His good news, and no amount of praise would deflect them from their course.\nJust days later, the same crowd that had praised them turned on Paul to stone him. They rejected his message and left him for dead. This is the fickle turn of fame and the cost of standing up for the gospel. \nIn his second letter to Timothy, Paul would write, “All who seek to live a godly life will face persecution” (3:12). That’s quite the juxtaposition to the pursuit of praise. But it was worth it to him. Even from prison at the end of his life, Paul prayed that a door would be opened for the gospel—the same gospel that put him there.\nThe hope and truth of the gospel drove Paul. Fame and fortune seemed to mean nothing to him, though I’m sure he battled their stupefying power. \nWhat would it look like for us to live lives life free from the need for earthly acclaim? What would have to change? What would have to take hold?\nMaybe the best first step would be for us to own that we’re at least a little tempted to seek the praise and favor of men, and to open a prayer for help with that confession.\nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram22.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 17:26",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\nFrom one man He has made every nationality to live over the whole earth and has determined their appointed times and the boundaries of where they live.\n–Acts 17:26\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/4-HActs3.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": " Acts 8:36-37",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    We give thanks to God for His cleansing gift of baptism through His Son.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\nAs they were traveling down the road, they came to some water.\nThe eunuch said, “Look, there’s water! What would keep me from being baptized?”\n And Philip said, “If you believe with all your heart you may.”\nAnd he replied, “I believe that Jesus Christ is the Son of God.”\n–Acts 8:36-37\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram20.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 13:1-52, Galatians 3:10-14, Isaiah 49:6",
        "devo_title": "Paul’s First Missionary Journey",
        "devo_summary": "\n                    \n                    “The wind blows hardest at the top of the mountain.” –Unknown\nPerhaps you’ve heard the quote above in one variety or another throughout the years. I first become most intimately familiar with the concept through Steven Pressfield’s The War of Art. Pressfield penned War with writers and creative types in mind, but its message broadly applies to all of us.\nWhile not a Christian (as far as I know), Pressfield’s writing contains some deeply spiritual themes. I for one believe this is because every act of creation sparks within us the image of God. Regardless, Pressfield names a force called “the resistance,” which simply put is the sum total of all that stymies or impedes our endeavors. Some call it writer’s block, others call it procrastination, others yet call it leisure time. Whatever you call it; the resistance is real. I’ve felt it and fought it, and I’m sure, regardless of your profession or calling, you have too.\nI believe there is a spiritual sort of resistance all Christ-followers encounter. It’s a tangible opposition to the work of redemption. Certainly Paul and the earliest apostles felt it. In fact, it was rare for them to enter a city and not experience opposition. Their arrival in Antioch was no exception. Wherever they found eager and open hearts, they also found hostile and dissenting parties.\nThere are a couple quick lessons we can learn from Acts 13 concerning spiritual resistance and opposition.\n1. If we’re preaching the gospel, if we’re attempting to expand the Kingdom of God whether in word or deed, we will experience resistance.\nThis could be as direct as verbal objections, terse words, or ad hominem attacks. Or it could be as subtle as the passive resistance of systemic injustices that oppose godly change. Paul and Barnabas experienced this in nearly every town they entered.\n2. Redirection is not the same thing as resistance.\nNot once, but twice, Paul was turned back from a location by the power of the Holy Spirit (Acts 16, 21). We sometimes have a tendency to interpret all challenges as spiritual attacks and persecution, but this is not always the case. There are times when we experience pushback because God is course correcting. Other times, we experience pushback because we’ve made a foolish decision. Neither one of those situations should be considered persecution or spiritual opposition. Rather, they are opportunities to learn, grow, change. Be careful in discerning the difference between these different scenarios. Paul and Barnabas certainly had to be. \n3. Sometimes we’re called to rebuke the resistance.\nIn Acts 13, we see an instance in which Paul and Barnabas rebuked the resistance (v. 10).  Paul, being filled with the Holy Spirit, didn’t mince any words about it either. He was incredibly direct. Likewise, there are times when we are called to push back against the resistance to the gospel with boldness.  \n4. Other times we’re called to endure the resistance.\nIt takes careful and discerning conversation with spiritual leaders and intentional time in prayer to know the difference, but there are times when our posture is to be one of endurance and perseverance. Not every manifestation of the spiritual resistance or oppression can be immediately rebuked and overcome.\nWhether from a stage or in a break room, whether online or in a coffee shop, if we preach the gospel or enact gospel-centered justice, we will encounter resistance and opposition. Remember though—we, like Paul, can only confront and endure by the power of the Holy Spirit. \nMay we be rooted and established in His love, trusting that knowing how to respond when we face opposition will become clear as we venture on.\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram19.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 12:1-25, Mark 10:35-40, Isaiah 42:8",
        "devo_title": "Peter Rescued by an Angel",
        "devo_summary": "\n                    \n                    The providence of God is mysterious business. If you’ve ever looked at the hand you’ve been dealt and felt confused by God’s logic, you know what I’m talking about. Job 14:5 tells us that God determines the number of our days, and we cannot pass the limits He has appointed. We live every one of our days in these mysterious boundaries.\nActs 12 is a sweeping narrative dealing with God’s prerogative to determine the number of days for those who love Him and also for those who don’t.\nThe chapter opens with of the death of James, the brother of John. Herod unceremoniously killed James in an effort to please the Jews. What is so stark about this is that the entire story of this key disciple’s beheading is told in just one verse—“Herod killed James the brother of John with the sword” (12:2). James, one of Jesus’ closest disciples, present at the transfiguration, was killed by a vicious, paranoid ruler, and this is all we’re told about it.\nWe then learn that, when Herod discovered that James’ death pleased the Jews, he detained Peter with the same intent. However, due to the fact that Peter was arrested during Passover (which would have made a public execution offensive to the very people he was trying to please), Herod left Peter in jail under the watch of four guards at a time. Peter was chained directly to two of them. On the last night of Passover, an angel loosed Peter’s chains and led him safely into the dark streets of Jerusalem. \nThese two encounters with Herod leave us asking, “Why did Peter live and James die?” Sure, Acts tells us people prayed for Peter’s safety (12:12), but can’t we assume they prayed just as fervently for James? So why did James die and not Peter? \nDon’t we often ask similar questions about our own lives? Why am I going through what I’m going through when my neighbor isn’t?\nThe rest of the chapter (vv. 19-25) answers the question: How much power did Herod really have over James and Peter? Can anyone, regardless of their influence, wealth, or fame, cross the limits God appoints? No. Not even Herod. How can we be so sure? When Herod denied giving God the glory due His name, God struck him down (Acts 12:23).\nJohn Stott observed, “This chapter opens with James dead, Peter in prison, and Herod triumphing; it closes with Herod dead, Peter free, and the Word of God triumphing.” \nAs ominous as Herod must have been, he was just a man, and his attempt to derail the Church amounted to less than a kid trying to derail a train with a nerf gun. This ruler who appeared so powerful was gone in a moment, but the Word of God still stands.\nIt can be unsettling to live in uncertainty, but there is nothing for it. We simply don’t get to know all that we’d like to. But we can rest in this: God determines the number of our days, and we cannot pass the limits He has appointed. There is no safer place to be than under His wise providence.\nWritten By Russ Ramsey \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram18.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 11:1-30, 1 Peter 4:16-19, Romans 15:25-28",
        "devo_title": "Salvation Is for Everyone",
        "devo_summary": "\n                    \n                    This year, the world will be watching the 2016 Summer Olympics in Rio de Janeiro. My family and friends will be watching in America, and of course we’ll be rooting for the Americans. And why wouldn’t we? They’re a part of us. They represent us. As the games unfold, we’ll get to know their stories and we’ll track their accomplishments. We’ll hope to be near the top of the medal count leaderboard, and we’ll take pride in our athletics.\nThe United States has won 2,401 Olympic medals. With a population of 313 million, that translates into one medal for every 130,000 people. That medal per population number puts the US 37th on the list! Did you think that rank would be higher? We’re winning a lot of medals, but we have a ton of people to choose from; so our numbers are high, and our efficiency is actually pretty low.\nTopping the charts is Finland at number one. They’ve won 302 medals with a population of 5.4 million for an index number of one medal for every 18,000 people. Then comes Sweden, Hungary, Denmark and the Bahamas (only 11 medals but only a population of 353,000 people, so that’s one medal for every 32,000 people). It will take the US winning a lot of medals to gain ground on Finland, but I’ll still root for that to happen.\nIs it right that we root for our own country? Every person competing in the Olympics has a story, regardless of the flag they represent. Each person has to fight some battle to get to this point. Our athletes are not automatically better—better people with better stories. \nStill, we all have a bias toward some people over other people. Rooting for what we know makes sense to us. And though we don’t often see it this bias, we inherit it. We sustain it. We buy into it. We promote it. \nThese inherent biases are at the forefront of what was happening in Acts 11. In Peter’s world, there was a dividing line between Jews and Gentiles. The two groups were separate. But when salvation came to Cornelius’s house, and when he, a Gentile, received the Holy Spirit, it broke through a cultural barrier that had stood in many people’s minds for centuries. The barrier was the idea that the God of Israel belonged to the people of Israel. Even Peter himself needed some convincing of the reach of the gospel (Acts 11:8-9).\nCornelius’s salvation was not only cause for God’s people to open their minds to the idea that the gospel could reach beyond what they imagined, but it was also cause to celebrate. Jews were not just called to accept the conversion of Gentiles, but to root for it.\nHaving biases is natural, but God calls us to what is supernatural. He calls us to a different way. He calls us not to see everyone as the same and without any distinction, but to love people as they are—in, with, and through the love of Christ. He calls us to see ourselves as people in need of the grace and mercy and Christ, and to extend that same mercy and grace to everyone. \nWe may all nod our heads to that, but Acts 11 pushes us to do something about it. It shows us that life in the good news of the gospel is not business as usual. The gospel transforms us.\nWhat might this look like? We might root for someone else besides those in our own tribe. Or appreciate what others contribute. The gospel calls us to set aside our own rights, privileges, and prejudices for something even better—God’s glory in His church. \nLet’s look for ways to do that.\nWritten By Doug Serven\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram17.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 10:1-48, Isaiah 52:7-10, Galatians 3:13",
        "devo_title": "Good News for the Gentiles",
        "devo_summary": "\n                    \n                    A white sheet, heavy with livestock and lowered from the heavens, is a surprising way to communicate equality. But this vision from God came to Peter as an alarming and powerful announcement of freedom. Like the ceremonially unclean animals in the sheet, we also are unclean in our sin, except that God, being rich in mercy, credits to us His righteousness and makes us clean. \nAll men come to salvation by grace, and grace alone, Jew and Gentile alike.\nAlthough God shows no partiality, we are always at risk of judging by false standards (Acts 10:34). God’s ways are higher than our ways, and He calls us to set aside our inclinations toward human partiality. \nOur inclination to partiality is rooted in a selfish narrowness of perspective and a great underestimation of God’s grace. Like Peter, we find the ordinary needs of human frailty intruding on our prayers. Like Peter, when God gives us instruction and direction, we are often, at first, perplexed. I wish I could say that, like Peter, I am quick to respond in obedience, but that is often not the case. Instead, I like to understand what I’m doing before I do it. I want answers and clarity before I walk forward in faith. I want to manage God’s grace.\nBut God’s grace is mysterious, and it intrudes upon our lives in the most unexpected ways. Here in Acts we see a striking example of God’s unexpected and intrusive grace. \nFirst, we see that God is working at all times, everywhere. As Peter goes about his day, God has already sent an angelic vision to a devout centurion named Cornelius, who would summon Peter to bring the gospel to the Gentiles (Acts 10:3-9), so that “all the ends of the earth shall see the salvation of our God” (Is. 52:10).\nSecond, God often provides what we need to know one step at a time (Acts 10:16-17, 29).  Peter’s calling is not a step-by-step instruction. God calls Peter to walk in faith, by the Spirit, rather than by sight.\nThird, God has already prepared the way. Notice that when Peter arrives at the house of Cornelius, he’s not sure what to do. When Cornelius says, “We are all here in the presence of God to hear all that you have been commanded by the Lord” (Acts 10:33), Peter did not have a prepared talk. But God prepared Peter long beforehand with the words to say. Peter’s job was simply to bear witness of Christ, to preach the gospel (Acts 10:33, Matt. 28:19).\nFourth, God’s work is His doing, not ours. God has graciously invited us into the joy of participating in what He is doing, but the work is ultimately His. Indeed, we read that “while Peter was still saying these things, the Holy Spirit fell on all who heard the word” (Acts 10:44). Peter had not even finished his brief sermon, and God was already working. The Gentiles were not won over by Peter’s persuasiveness or eloquence, but by the Word of God and the work of His Spirit.\nWhat a glorious reminder this is. Because God is at work, because His grace is surprising and sufficient, because His Spirit is active and enlivening, we can, like Peter, enter into the work of the Kingdom with great joy and confidence. We need not be hindered by uncertainty, nor worried about what we will say (Matt. 10:19).  God is always at work, and we have the great joy and privilege of proclaiming His salvation to a world in need, “preaching good news of peace through Jesus Christ” (Acts 10:36).\nWritten By Caleb Faires \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram16.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 9:32-43, Mark 5:21-43, Psalm 36:8-9",
        "devo_title": "Peter Heals in Christ’s Name",
        "devo_summary": "\n                    \n                    Have you ever seen a dead body? Maybe at a visitation or wake? It’s a strange experience, especially if you knew the person. In death they cease being the person you knew. Something is absent, and they look like a mannequin version of the person you loved. When life ends, the person is gone and what is left is but a shell.\nDeath is final. What’s the old joke? The two things you can count on in life are death and taxes. But try to imagine a scenario where death is not final, when it’s an intermission but not the end of the story. That’s hard to do, isn’t it?\nSomehow, that’s what we see in Acts 9. After Peter visited Aeneas, who had been paralyzed for eight years, and healed him in the name of Jesus, Peter was summoned to a nearby town. A beloved saint named Tabitha had passed away. Her friends were stricken. She was the sweetest, gentlest, most generous woman they knew, and now she was gone forever.\nYou’d expect Peter to comfort them with hope for the future and reminders of the resurrection. He might sit with them and be a good pastor who listens and cares. But what he actually does is, well, unusual. Peter goes into the room where Tabitha’s shell of a body is laid out and prepared for burial, sends everyone away, and prays over her. She’s gone, Pete. What’s the point?\nIn that moment he must have thought back to the time he saw his Savior do the same thing in the room of a young girl who had died. He must have remembered that Jesus not only raised that girl with a word but that He also rose from the dead Himself. Peter must have realized that when Jesus sent the Holy Spirit, it was for more than preaching and speaking in tongues. It was a spirit of power—the Spirit of Christ. Besides, hadn’t he just seen a man healed days before? \nSo Peter prayed with a certainty that death was not final.\nTabitha awoke. Her intermission ended and her story continued. She went from waxen to awakened, from absent to present.\nYou know what’s amazing about this story (aside from the woman rising from the dead)? The same Holy Spirit Peter depended on, who breathed life into a corpse, is with us today. All who follow Christ have the Holy Spirit. \nNo, we may never heal a paralytic or raise the dead, but the Spirit did raise the dead when He brought us from spiritual death to life. We have life because of the same miraculous power that brought a little girl and a woman back from the dead.\nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram15.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 17:25",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\n Neither is He served by human hands, as though He needed anything, since He Himself gives everyone life and breath and all things.\n–Acts 17:25\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/4-HActs2.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 3:19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Seeing the depth of our sin, a painful sight though it is, brings freedom when it compels us to confession and repentance.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\nTherefore repent and turn back, so that your sins may be wiped out, that seasons of refreshing may come from the presence of the Lord\n-Acts 3:19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram13.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 9:1-31, Galatians 1:11-16, 2 Corinthians 3:12-13",
        "devo_title": "The Road to Damascus",
        "devo_summary": "\n                    \n                    I like to remind the members of our church that three of the foremost authors of Scripture were murders: Moses, David, and Paul. This is important. The grace of God can only be understood adequately against the background of our own unworthiness. Of these three men, the grace of God is most fully displayed in the conversion and calling of the one who would come to be known as “the Apostle Paul.”\nWhile Saul of Tarsus was on his way to arrest Christians in Damascus, Jesus arrested him and brought him to his knees. There is something wonderful about the way God’s sovereign grace is displayed here. Saul did nothing to contribute to his own redemption. He was not seeking after Jesus; rather, he was seeking to destroy the work of Jesus (Acts 9:5). \nThe conversion of Saul is a beautiful picture of the interruption of grace. Jesus interrupted Saul’s ambitions and plans. Jesus invaded Saul’s life in order to remake him.\nBlinded and brought to his knees, Saul cried out, “Who are you Lord?” (v. 5) and “What would you have me do” (v. 6)? These are the two questions that all men must ask. The answers to these two questions are the ground upon which the Christian life is built. Saul learned the answers to those questions on that particular day on the Damascus Road. When Jesus reveals Himself to us, we also learn the answers to those questions in our spiritual experience.\nWe can, however, see another aspect of grace in Saul’s Damascus Road experience. \nThere was converting grace on the Damascus Road, but there was also calling grace. The day of Saul’s redemption was the day of his being called by Christ into gospel ministry. What more grand display of God’s grace than that He should take the chief persecutor of the Church and make him into the chief laborer in the Church for the salvation of the nations.\nHaving sent Saul to be baptized by a believer named Ananias, Jesus revealed His plan for Saul. He explained to Ananias that this one who had persecuted the church was, “a chosen vessel of Mine to bear My name before Gentiles, kings, and the children of Israel” (v. 15). How amazing that God’s converting grace is followed by His calling grace. Not only does God redeem the worst of sinners, His grace can make them instantly useful in His kingdom.\nThis usefulness would not come without suffering. We know how much the great Apostle Paul did ultimately suffer for the name of Christ (v. 16); but, we also see how he endured that suffering with joy and purpose.\nMany years after his conversion and calling, the Apostle Paul would reflect on his former life and see in it the purposes of God for the salvation of others. When writing to his young protégée, Timothy, Paul wrote: “for this reason I obtained mercy, that in me first Jesus Christ might show all longsuffering, as a pattern to those who are going to believe on Him for everlasting life” (1 Tim. 1:16). \nWhen Jesus met Saul of Tarsus on the Damascus road, He made him the great example of the precious biblical truth, “where sin abounded, grace abounded much more” (Rom. 5:20). \nThis is the same grace we, too, rely upon.\nWritten By Nick Batzig \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram12.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 7:54-60, Acts 8:1-40, 2 Kings 2:11, Isaiah 56:3-5",
        "devo_title": "The Early Church Grows",
        "devo_summary": "\n                    \n                    “Most merciful God,\nwe confess that we have sinned against you\nin thought, word, and deed,\nby what we have done,\nand by what we have left undone…”\nThere comes a point in the service each Sunday where our congregation bows in a moment of corporate confession. This time serves to prepare our hearts for the Lord’s Table and provides an opportunity for reflection, confession, and connection with God.\nUsually the things that I’ve done come to mind much more quickly than the things that I’ve left undone. Nonetheless, I’m thankful when the Spirit of God calls to my attention sins of omission: things that I probably should’ve done, but for some reason or another neglected to do.\nWhen recounting the stoning of Stephen, Luke inserts a short clause that if we’re not careful, we can easily read over: “And the witnesses laid down their garments at the feet of a young man named Saul” (Acts 7:58b). This seems like an unusual detail to include, but it actually tells us quite a bit about Saul’s involvement.\nThe men who stoned Stephen had entrusted themselves to the authority and oversight of Saul. While he probably did not physically cast a stone at Stephen, Saul was present, approving, and guilty by inaction (Acts 8:1). He had given his stamp of approval to the persecution and martyrdom of Stephen (and presumably many other early believers).\nWhen Saul finally encountered the resurrected Jesus on the road to Damascus, he needed to seek repentance not merely for the evil things he had done (which were many), but also for things that he’d left undone. The conversion of Saul to Paul is one of the miraculous events recorded in the New Testament, and it is also one of the most encouraging. It’s a demonstration to all of us that God can use anyone, no matter their past.\nNo matter what you’ve done, or left undone, there is mercy, forgiveness, and redemption to be found. Maybe you’ve stood idly by when someone needed a hand. Maybe you’ve failed to act in love in a difficult situation. Maybe you turned a blind eye to a situation you knew was just plain wrong. Regardless of the circumstance, there is great hope and grace abundant for all who ask.\nSaul spent a good chunk of his life ignoring and actively contributing to the persecution of God’s people, yet God forgave him and eventually raised him up to a position of leadership.\nEach time I find myself in a moment of confession, corporate or otherwise, I also find myself in a place of deep gratitude and thankfulness. There is joy in asking for forgiveness and receiving it with no strings attached. For what we have done, and for what we have left undone, for our deepest regrets and failures, we ask forgiveness in the name of Jesus Christ, and He gives it. \nLord give us the strength and peace that we need to delight in Your will and walk in Your ways, to the glory of Your name. Amen.\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram11.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 7:1-53, Genesis 15:13-14, Deuteronomy 18:15",
        "devo_title": "Stephen’s Sermon",
        "devo_summary": "\n                    \n                    Three points and a poem. That was the go-to structure of most of the sermons I sat through in my youth. The preacher (I grew up Baptist, and Baptists have preachers) would find three main points, or hooks, in a passage, and hang his thoughts on them. Then he’d select a few lines from a poem as a sort of wrap-up to everything. These lines were the coup-de-grace, the mercy blow designed to cause us to engage in self-examination, and respond publicly and accordingly during the invitation (a.k.a, tons of verses of “Just As I Am”). \nI guess the Baptists stole this sermon approach from Stephen though. Just so you know, Stephen’s sermon in Acts 7 was his last, his coup-de-grace designed to cause the listeners to look at their hearts. They did, then picked up stones and killed the young preacher, just as he was.\nHere’s the outline of Stephen’s sermon.\n\nTHIS LAND IS YOUR LAND (WELL, IN 400 YEARS) – As Stephen started his sermon (and it was a doozy), he went straight for the jugular. He talked about how prominent the LAND had become in the mind of his audience. To be fair, Israel had to wait a long, long, long time for the land God had promised Abraham. But the land became a “thing” overshadowing the Giver of the “thing.” In other words, the land had become an idol. This did not sit well with God.\n\nWHO’S YOUR DADDY? – Near the end of those long 400 years, the children of Israel got sloppy and blurred their worship of the one, true God by constructing TEMPLES for the many false gods of war and sex. Those temples took on the nature of a “thing” or idol. God their Father wasn’t pleased with this behavior, but He let them continue on and suffer the consequences of their wandering.\n\nEYES BUT DON’T SEE – Interestingly enough, the Israelites had a tabernacle of the covenant LAW with them all that time, built to the exact specifics God had provided to Moses. And while for a season it did represent the presence of the Almighty, it was not the Almighty. It was a “thing” that eventually became an idol, and we know God demands no other gods/idols/things before Him. In fact, that was the very first line written on the tablets of the Law, they just couldn’t see it.\n\n\n\nDON’T FENCE ME IN (closing poem; use expressive voice)\nHowever, the Almighty does not live in houses made by carpenters or masons, never has, never will. As the poetic prophet wrote:\n“Heaven is my throne,\n  and the earth is my footstool.\nWhat kind of house will you build for me?\n  says the Lord.\nOr where will my resting place be?\n  Has not my hand made all these things?”\nLet us pray.\nWritten By John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram10.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 6:1-15, Genesis 4:3-7, 1 Timothy 3:8-13, Exodus 34:29-30",
        "devo_title": "Evidence of the Spirit’s Work",
        "devo_summary": "\n                    \n                    I naturally think like a dualist. In my mind, I effortlessly partition off the spiritual things from the practical day-to-day busyness of life. The here and now, the schedules, and the tasks can easily overwhelm my day, crowding out my seemingly less urgent but vitally important spiritual life. \nToday’s Scripture describes an intensely practical and urgent matter: the Hellenist widows were being neglected. The dualist in me sees this as an administrative task, needing a real nuts and bolts solution. Surely, the next best step is to look over the resumes and pick the most qualified people to deal with the issue. \nBut the apostles carefully unfold the criteria: they seek men “of good repute, full of the Spirit and of wisdom” (Acts 6:3). The spiritual health of these men was their first concern. The apostles certainly didn’t overlook natural gifting and skill; we see very clearly that they differentiated between their own calling to serve in preaching and the calling of these men to serve with their hands. But there is no dividing line between the practical things and the spiritual things. \nOne of these men, Stephen, a man of very practical gifting, proved to be one of the most potent witnesses in the early church. His opposers “could not withstand the wisdom and the Spirit with which he was speaking” (Acts 6:10). What was the root of his powerful witness? It was not his earthly talents, his intellect, or his cunning. Indeed, we find in this passage echoes of Acts 4:13, where Peter and John, ordinary and unschooled men, nonetheless spoke with power and conviction. The Jewish rulers, we are told, “took note that these men had been with Jesus.” So also, Stephen’s witness was born of his walk with Christ. \nToo often, we neglect the weightier matters. We operate by an earthly wisdom, being sure to tidy our workspaces, balance our checkbooks, and organize our tools, long before we get on our knees, open our Bibles, and sit at the feet of Christ. Is it any wonder that our countenance falls? (Gen. 4:6) \nThe first and most urgent matters are those of the heart. When our hearts are filled with the Spirit, we are then prepared for even the most practical matters.\nThe content of our hearts shows up in our hands, on our faces, and in our words. Though for a while men may pretend and even deceive many, what is inside always comes out. When Stephen faced his accusers, he did not wilt at their accusations. Rather, the whole assembly could see that his face shone brightly. \nMay we walk with Christ and be filled with His Spirit, and may His light shine in us, that we may be faithful serve with “great confidence in the faith that is in Christ Jesus” (1 Tim. 3:13).\nWritten By Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram9.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 5:12-42, Isaiah 40:6-8, 1 John 2:15-17, John 6:66-69",
        "devo_title": "The Apostles Preach the Gospel",
        "devo_summary": "\n                    \n                    Back when I was a youth minister, I took my first youth group to New York City on a mission trip. We worked with kids from the Dominican Republic in Washington Heights. I’m from Alabama and hadn’t experienced anything like NYC. I was blown away. The whole time I walked around that huge city, I marveled at how different it was. This was especially true in Washington Heights where all the signs were in Spanish. I remember thinking, “This is a totally different world.”\nWhen I read Acts 5:17-42, I feel like I am reading about a world that is different from my own.\nThe world of Acts was a world of persecution. In the Western world, we don’t have to worry about this. We can teach and preach and even those who do not like what we say will leave us alone. They will not beat us and put us in prison. It’s a very different world indeed.\nBut that is not what seems so otherworldly to me. What Strikes me most is how they respond to the imprisonment and the beating.\nThe apostles are arrested and put in prison. Then to everyone’s great relief, they are supernaturally freed by an angel. But instead of enjoying their freedom, they go out and preach again, doing the very thing that got them put in prison in the first place. So, they are brought in again and beaten before being released.\nThere is no record of complaint. No cries of injustice. No plans for revenge. No, they rejoice because they have been treated terribly, just like the One they follow.\nTheir response to being imprisoned? They go back out and publicly preach Jesus. Their response to being beaten? Joy, because they had suffered like Jesus.\nThese apostles lived in a world so foreign to the world I live in. I live comfortably in a world where I demand my rights and complain about my pain. I walk around in a world paved with expecting pity for hardship. But I don’t want to reside in that world.\nI want to reside in a world where my freedom is about Jesus and my suffering is about Jesus.\nMaybe you do too. How do we get there?\nIf you are anything like me, your first inclination will be to resolve to do better, to be more willing to do things that might bring on suffering. That’s not a terrible way of thinking, but if that’s all that drives me, I will just get worn down and give up. And that sounds like a world of my own making anyway.\nNo, sheer determination was not the thing that fueled the apostles’ desire to live for Jesus. They lived like this because they believed the gospel— to the point that it was their only hope for this life and the next, as the old confession says. They lived in a world where the gospel left no room for fear; where suffering couldn’t crowd out joy.\nOh, to live and believe in that world.\nWritten By Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram8.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 17:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day.\nAs we read through Acts, we will be memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the  Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end.\n The God who made the world and everything in it—He is Lord of heaven and earth and does not live in shrines made by hands.\n–Acts 17:24\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/4-HActs1.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 1:14",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    The early church was dedicated to prayer. May the same be true of us.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for yourself and your community:\nThey all joined together constantly in prayer, along with the women and Mary the mother of Jesus, and with his brothers.\n-Acts 1:14\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram6.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 4:23-37, Acts 5:1-11, Deuteronomy 15:4-6, Hebrews 6:13-20",
        "devo_title": "The Effects of the Gospel",
        "devo_summary": "\n                    \n                    Proverbs 9:10 says, “The fear of the Lord is the beginning of wisdom.” Conversely then, the absence of the fear of the Lord is the heart of folly. Acts 5 tells the story of how a lack of the fear of the Lord led to ruin, and it is a hard passage. But any time God endeavors to instill in His people a reverential fear of His holiness, it is a gift, because God is and always shall be holy.\nWhat exactly did Ananias and Sapphira do wrong? As members of the church, they did what others were doing. They sold possessions and gave the proceeds to the apostles, who used those funds for the work of the church. (Barnabas had done the same thing.)\nAnanias decided to keep part of the proceeds for himself. This decision was not a sin. He was free to do that if he wanted. The end of Acts 4 tells us people were giving “what they had decided in their hearts to give.” This means that before God, people were thinking through what their contributions to the church should be, and giving accordingly. The apostles didn’t decide for them. Ananias was free to give what he wanted. He gave, and it was probably a lot of money.\nSo what was the sin? What Ananias and his wife had decided in their hearts to do was to deceive people and represent their gift as being larger than it truly was. When Ananias gave his offering, he led everyone to believe it was everything he had gained from the sale. As one pastor I know said, “Ananias wanted to look like an especially good Christian without actually having to be one.” It was this deception, not the amount he gave, which led to God’s judgment.\nAnanias and Sapphira died as the result of their sin. They are the only two we hear of this happening to in Acts, although no doubt countless others had committed and continue to commit very similar sins. But the writer of Acts tells us that as each one died, all who heard of it were filled with fear.\nWe, too, should listen. \nIf God is Holy, if God is all-powerful, if God’s demand for righteousness could be satisfied only by the sacrifice of Christ on our behalf, then we should fear Him.\nAnd if we are prone to forget that God is Holy, then it is gracious of God to call our hearts to fear Him. If we are prone to seek glory for ourselves, though God alone is to be glorified in our lives, it is grace that teaches our hearts to fear. If we are prone to live as though God isn’t really real, it is grace that He should arrest our hearts with a fear of His holy, present power.\nThe fear of the holiness of God is a gift because God is, in fact, holy. To regard Him as anything less is to miss who He really is. \nThe sober story of Ananias and Sapphira invites us to commune with God as He is—the holy One who created the heavens and Who knows our names—the Lover of our souls. May He give us the gift of a holy fear.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram5.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 4:1-22, 2 Corinthians 3:12-18, 1 John 5:12",
        "devo_title": "No Other Name",
        "devo_summary": "\n                    \n                    Ours is a society obsessed with “before and after.” Advertisers know this about us, and they use our curiosity to their advantage, displaying then-and-now photos for any and everything. We love to see transformations, and we want to know how we, too, can be transformed.\nScripture has its own collection of striking “before and after” pictures. That of the pre- and post-Pentecost Simon Peter might be one of the most significant—and significantly overlooked—transformations in the Bible. Before Pentecost, we see Simon Peter denying the Savior, while warming himself at the fire outside of the High Priest’s palace. But after Pentecost, we find Simon Peter boldly proclaiming Jesus and the resurrection inside that very same palace.\nWhat changed? What happened to bring about this radical transformation? In short, it was the power of the death and resurrection of Jesus applied by the Holy Spirit to Peter’s heart.\nPeter tasted the grace and redemption that is found only in Christ when Jesus restored him (John 21:15-19). After his restoration, this man who had been so timid and fearful to bear witness to Christ was emboldened to proclaim that same grace and redemption to everyone he met. He was now unashamed of the fact that “there is salvation in none other, for there is no other name under heaven given among men by which we must be saved” (Acts 4:12) because he himself had become an object of that salvation.\nWhen we have our souls restored by Christ, we are eager to proclaim His excellencies for the salvation of those around us. Rather than seeking to please ourselves, we seek to bring glory to the One who alone is qualified to be the Redeemer.\nThe healing of the lame man was the event that sparked Peter’s sermon to the rulers who arrested him (Acts 3). Peter, together with John, told the people and rulers that God had performed this miracle through them as an attestation of the resurrection power of Jesus. Just as Jesus’ own miracles proved His Messianic kingdom and power, so too did the miracles that Christ worked through His apostles.\nThe end result of the healing of the lame man was that it brought glory to Christ by highlighting the essential fact that salvation is found in Him alone. This is always the end result when God works through His people. Peter and John had not performed that miracle by their own wisdom or power. They had not even received formal theological education. But they had been with Jesus, and that was all that mattered!\nIf we have tasted and seen that the Lord is gracious, we too will be eager to tell others about Christ. When we recognize that the One who has saved us by His grace is the only Savior of sinners, we will want to tell others where they too can find this salvation. \nOur own experience of redemption in Christ should fuel our zeal to hold Christ forth as the only way of salvation. May God use the “before and after” pictures of our lives to bring glory to the only Savior of men.\nWritten By Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram4.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 3:1-26, 1 Corinthians 15:1-4, Deuteronomy 18:15-19",
        "devo_title": "Christ Gives Peter Power to Heal",
        "devo_summary": "\n                    \n                    I have a tough time with some televangelists. It’s not so much that they’re on TV, but when their message sounds more like crowdsourcing, I get a little uneasy. Recently, one such leader garnered a great deal of attention because he said he believed God was calling him to raise sixty-five million dollars for a private jet. This is not a joke. This really happened.\nWhile there are pastors and teachers using television as a positive medium, it’s difficult to think that a sixty-five million dollar jet (for example) was being explicitly purchased to further the glory of God.\nWhat a contrast this draws to the very real healing and teaching ministry of Peter and John that we see in Acts 3. They were incredibly clear about their allegiance to God and the message He had given them. They healed not to gain attention or power, but because it was an imitation of the work of Christ.\nPeter exclaimed to the lame man: “I have no silver and gold, but what I do have I give you. In the name of Jesus Christ of Nazareth, rise up and walk!” (Acts 3:6). Not in Peter’s name, not in John’s name, but in Jesus’ name. That distinction is crucial.\nAs would probably happen today, a large crowd gathered around Peter and John in the wake of the miraculous healing. Again, we witness the apostles paying tribute to the plans and power of God. Peter proclaimed: “Men of Israel, why do you wonder at this, or why do you stare at us, as though by our own power or piety we have made him walk? The God of Abraham, the God of Isaac, and the God of Jacob, the God of our fathers, glorified His servant Jesus, whom you delivered over and denied in the presence of Pilate, when he had decided to release Him” (Acts 3:13).\nThe “whys” and “hows” of physical healing and restoration are still a mystery to me, but what is clear is that Peter and John could not have brought healing apart from the power of God. Their mission had a distinct emphasis on making the name of Jesus great among the nations.\nPeter and John didn’t pull any punches about this mission when addressing the crowd. Instead of leveraging their moment in the spotlight for their own glory and gain, they actually risked quite a bit when they told the people that the very power which healed the lame man also was condemning the people for their lack of repentance.\nNo jets here, folks. In fact, I imagine Peter and John didn’t receive much of a love offering in exchange for their encouraging message.\nSo, what’s the point?\nThe sixty-five million dollar speck in our neighbor’s eye is often easier to see than the plank in our own. For you and me, the temptation to glorify our own names might be wrapped in seemingly benign packaging. \nWhen we invest in our family life or career, it’s easy to pay lip service to God. But all good things can become ways we seek to inflate our reputations and perceived importance. However, with the right posture, these relationships and actions can also work to give credit where credit is due. They can point back to God, the Giver of all good gifts.\nTo have the most meaningful impact, we have to worry about our success and influence less and less, and the gospel more and more. \nIf we are really committed to the work of following Jesus, it looks and feels like picking up our crosses and following Him. We get to participate in the resurrection, to be sure, but to get there we too have to die to ourselves, our desires, and our need to make our own kingdom great. For Christ to increase, we must decrease (John 3:30).\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram3.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 2:1-47, Joel 2:28-32, Psalm 16:8-11",
        "devo_title": "The Coming of the Holy Spirit",
        "devo_summary": "\n                    \n                    When I was a child, I longed for Christmas Day more than anything else. This was, no doubt, partially on account of the expectation of opening the gifts my parents had so neatly wrapped and placed under the tree. But it was also because of the eager anticipation that it would snow on Christmas, spreading a white covering over everything outside our living room window. If that were not enough, our family would then spend the entire day together singing, reading, praying, and eating.\nThe combination of presents in our home, snow-covered fields outside, and the warmth of fellowship with loved ones made for a particularly wonderful—and now extremely nostalgic—experience. It was as if all the other days of the year built up to Christmas Day and existed to make it extraordinary.\nIn the same way, there was a special day in redemptive history on which God gave a combination of blessings to His people—the outpouring of the gift of the Spirit, the proclaiming of the gospel to the nations, and the new creation of a worshiping and fellowshipping community of believers. This was the day of Pentecost (Acts 2) and there was nothing like it in redemptive history.\nAnyone reading the New Testament must draw the conclusion that these were no ordinary times. The powerful events accompanying the outpouring of the Holy Spirit—as had been promised by Jesus—was part of His once-for-all saving work. In a very real sense, Pentecost belongs as much to the accomplishment of redemption as does the death, burial, resurrection, and ascension of Jesus.\nThe coming of the Spirit on Pentecost signaled several important things about the saving work of Jesus Christ. The details of the day of Pentecost in the book of Acts are meant to draw the believer’s mind back to the Exodus, when God led His people out of Egypt by means of the cloudy pillar by day and fiery pillar by night.\nAt Pentecost, the Spirit came down on the people of God and appeared as tongues of fire. We might envision hundreds of tiny pillars of fire coming down and resting on each of the disciples. This was, of course, signaling that God had come down—by virtue of the redemption He had accomplished in Christ—in the person of the Spirit to lead the true Israel through the wilderness of this world. At Pentecost, the Spirit was coming down on the living stones of the new Temple that God had raised up with Christ.\nThe gift of tongues also carries our minds back to the early chapter of Scripture where God came down in judgment and scattered the people of earth, confusing their languages (Gen. 11:1-9). Now, having fulfilled all things in Christ, the Lord came down in mercy to unite those who heard the “wonderful works of God” in Christ, each in their own language (Acts 2:4-12).\nThe uniting work of the Spirit of God through the preaching of the gospel to the nations, in turn, brought about the knitting together of a new community of believers. Those who believed the gospel were all together and had everything in common. These new converts sat at the feet of those who had been taught by Jesus (Acts 2:40-47).\nWhile there was something unique—a once-for-all-ness—about Pentecost, there is nothing unique about the ongoing work of Christ in giving His Spirit to His people for our redemption and sanctification, in sending His ministers to proclaim the gospel to the nations, or in His continuing to create a worshiping community of believers. This is the everydayness of the work of redemption. \nWritten By Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram2.jpg"
    },
    {
        "book_title": " Acts of the Apostles",
        "devo_passages": "Acts 1:1-26, Matthew 28:16-20, Romans 6:11-14",
        "devo_title": "Ascension",
        "devo_summary": "\n                    \n                    Waiting is hard. And it can seem pointless. But the opening chapter of Acts shows us it is not.\nA number of years ago, I went to my brother’s deployment ceremony for the Army. He was leaving his wife and daughter behind in the great state of Texas to spend a year in the Middle East as a soldier. The send-off was a sober event that involved many lengthy farewells.\nBut as the troops left the stadium, they didn’t immediately board a plane for Kuwait. Instead, they went to a military base seven miles away from my brother’s house, where they spent the next two weeks preparing to leave. So my brother was only a few miles away from his family, but might as well have been on the other side of the world. He said that was the hardest week of the year because he was stuck waiting so close to home.\nIn the first chapter of Acts, we find Jesus’ disciples waiting close to home. That must have been a difficult stretch. Jesus had risen from the grave and walked among His disciples for forty days, teaching them that the Holy Spirit would indwell the people of God and empower them for the work of building the Church around the world. And right before He ascended into heaven, He told His disciples to remain in Jerusalem and wait for the Holy Spirit. They waited there for 10 days.\nWhat are you waiting on now? Or better, how are you waiting? It’s hard to wait because waiting can feel wasteful, which also feels “unspiritual.”\nThe reality is that sometimes God calls us to wait on Him, and rather than the waiting being a time of inactivity, God uses these periods as times of preparation. What kind of preparation? For the disciples in Acts 1, it was preparation to be His witnesses. They spent their time in fellowship with one another (1:13-14), in devotion to the Lord (1:14), and in anticipation for how He would work through them when the time came—evidenced in their determination to shore up their group by replacing Judas (1:21-26).\nIf we believe that God is pleased to use our lives for His glory as His witnesses throughout the world, then even our seasons of building, establishment, and waiting are filled with significance. \nSo how do we wait well? We spend our time seeking the face of God, studying and obeying His Word. We spend time in fellowship together. We regard every day as a precious gift of time to spend in preparation for what He will do through us.\nAs we bear witness to Him, let us spend our time waiting for His return; for although He does not need to use us as His witnesses, He is pleased to use us as His witnesses by His grace and for His glory. \nMay we spend our lives in response to that grace.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/06/HRT-Acts-instagram1.jpg"
    }
]