[
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 1:1-26, Matthew 28:16-20, Romans 6:11-14",
        "devo_title": "Ascension",
        "devo_summary": "\nBY Raechel Myers\n\nText: Acts 1:1-26, Matthew 28:16-20, Romans 6:11-14\n“This very Jesus who was taken up from among you to heaven will come as certainly—and mysteriously—as he left.”\n– Acts 1:11, MSG\nCertainly and mysteriously. It feels significant, doesn’t it? Even the “men in white robes” acknowledged there was a mystery to Jesus’ comings and goings (Acts 1:10). The way Jesus departed was mysterious; it didn’t make sense. And it was also somehow certain—beyond a shadow of a doubt—according to the tribe of eyewitnesses. \nWhen I think about the mysterious and certain things I’ve experienced in my 33 years, my mind immediately goes to Thin Mints® cookies. There have been occasions upon which I have settled into a stack of four or five cookies and a nice book, only to find myself shocked when, as I reach to lift another cookie from my stack, they are all certainly, and mysteriously, gone.\nI sometimes daydream when I’m driving on the interstate and suddenly realize I have mysteriously, but quite certainly, missed my exit by three miles. \nThen there was the time when the life of our friends’ son was mysteriously, but certainly, spared. He climbed out of a crumpled car that had flipped over several times and wrapped around a telephone pole—yet he walked away with nary a scratch. \nGranted, disappearing cookies are far less mysterious than a spared life that, by all practical and scientific realities, should have been taken. Sometimes things are mysterious because we’re not paying attention, and other times they are a mystery because we were never meant to fully comprehend them. Not yet. \nThe mystery of the gospel is the latter. Jesus ascended mysteriously into heaven with the words, “It is not for you to know,” fresh on His lips. I love that so much. “But you will receive power,” He continued, “and you will be My witnesses.” And with that, He was taken up “as they were watching” (Acts 1:7-9). It was mysterious, but certain. \nOne element of Jesus’ ascension, however, was not mysterious at all: He left with a clear command to get up and go “to the ends of the earth.” To go become a Church. Go spread the good news of His life, death, and resurrection to the entire world. And to go with a parting gift: the power of the Holy Spirit, who would accompany them, and from whom they—and we—would receive power to carry out this not so mysterious commission. \nThe book of Acts begins with a heavenly mix of both mystery and certainty, and the combination will dance artfully across all 28 chapters. \nThere will be mystery: the things of God’s Kingdom might not seem to add up, as they so often do not by our earthly standards.\nAnd there will be certainty: the gospel of Jesus Christ will move with the clarity that only comes from the Father. It will sprout and spread, beginning in Judea, then moving on to Samaria, and to the ends of the earth.\nThe birth of the early Church is our story. This is where we come from, and it’s where we are going. It’s the story of how we are called to reach out, and how we are called to come together. \nCome, read with us—all six weeks, all 28 chapters. Watch the gospel grow legs and walk around. Watch the early Church figure things out, learn how to love each other in community, and discover how to resolve legitimate conflicts with care. See how they give their lives in faith for the Man they watched—with their very own eyes—live, die, rise, and ascend into heaven.The Man they knew, beyond a shadow of a doubt, really is the Son of God. The Man the Church still believes will return, just as certainly and mysteriously as He left. \nLet’s enter into the book of Acts with hearts full of wonder and minds filled with confidence that the gospel changes everything.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram1s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 2:1-47, Joel 2:28-32, Psalm 16:8-11",
        "devo_title": "The Coming of the Holy Spirit",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 2:1-47, Joel 2:28-32, Psalm 16:8-11\nBig grew from small.\nTrue to form, God chose a small house, in a small city, in a small country, to be fertile ground for a new gospel Kingdom—the one Jesus had been preaching about, training His disciples to understand, and preparing the Jews to anticipate.\nOn the day of Pentecost, the promised Holy Spirit burst forth into this Kingdom, rolling outward and across the city, the nation, and beyond. If the book of Acts is the birth story of the Church, then the coming of the Holy Spirit was the initiating event—the dramatic impetus powering every account we read about in the rest of the book.\nSo let’s take a closer look and mull this over a bit. Let’s take the time to appreciate the magnitude of what happened on that very first Pentecost.\nHe knew they were distraught, but Jesus assured His disciples that it was necessary for Him to leave the earth. It was for their benefit that He go so that Someone else—the Counselor and Advocate—could come “convict the world about sin, righteousness, and judgment” (John 16:5-8).\nJesus taught,\nand the Holy Spirit would illuminate and convict.\nJesus held all knowledge,\nand the Holy Spirit would come and declare those truths to the world. \nJesus had authority over the future,\nand the Spirit would “declare what is to come” (John 16:13).\nThe Counselor is not a consolation prize. The Holy Spirit is God’s gift to the Church.\nWhile Jesus’ coming was as quiet as a Holy Night, the Holy Spirit’s arrival was radical (Acts 2:2-4), and rightly so. It had to be. The impressive signs—the thunderous sound of wind, tongues of fire, and speaking in foreign languages—were intentionally bold, giving credence to the equally audacious claims the disciples were about to make. But their words would not be their own. When Jesus commissioned His uneducated, ragtag crew, He promised they would “be given what to say at that hour” (Matthew 10:19). The Spirit of God Himself would speak through them.\nPeter’s first sermon showcased the power and authority of the Spirit (Acts 2:14-40). He delivered a rousing message, but not because of his religious pedigree or even his training under Jesus. Peter’s soul-splitting message was the Holy Spirit’s glory on display. Without such extravagant signs, the crowd most likely would have dismissed Peter’s outrageous claim that Jesus, the Messiah promised of old, was very much alive.\nFrom that first sermon on, the Holy Spirit’s influence spread like holy concentric circles, empowering each new believer to live in a revolutionary way—selling personal possessions to meet the needs of others, sharing meals together, and living in harmony with other sinners (Acts 2:41-47). By the power of the Spirit, the early Church learned to do life together in gracious, generous, and intentional ways.\nGod’s new Kingdom was worthy of its epic announcement. As Jesus said new wine must be poured into new wineskins or both will be lost (Mark 2:22), this new Kingdom needed a new paradigm to be effective in spreading the gospel to the nations. God got their attention on that very first Pentecost. He allowed them to see the Holy Spirit on the move, rolling out like a wave across the city of Jerusalem and beyond, filling new believers with a power no one saw coming.\n\nJessie Minassian is an author, blogger, and speaker, who prefers to be known for her ability to laugh at herself, a weird obsession with nature-ish stuff, and a penchant for making up words. Learn more about Jessie and her ministry at LifeLoveandGod.com.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram2s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 3:1-26, 1 Corinthians 15:1-4, Deuteronomy 18:15-19",
        "devo_title": "Christ Gives Peter Power to Heal",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Acts 3:1-26, 1 Corinthians 15:1-4, Deuteronomy 18:15-19\nBisque. It’s a soup I’d stirred in a bowl, warmed in a saucer, slurped with a spoon, but never actually learned how to pronounce. (Say it with me now: “bisk.”)\nThat is, until it was too late.\nI was an over-eager high schooler, working my first job as a waitress in a retirement home. My first task at the beginning of each shift was to shuffle my non-slip shoes to each table of residents and recite that evening’s dinner menu. They would all nod in unison at the mention of pork chops and green beans, mashed potatoes and yeast rolls—a rotating list most of them could have recited themselves. Oh, and the soup of the day, you ask? Butternut bisque.\n“Butternut bis-kway,” I projected enthusiastically. (In my defense, the “q” makes it look all fancy and foreign and makes me want to speak in an accent, okay?)\nEyebrows furrowed and whispers ensued as I skipped confidently into the kitchen to inquire about—what I assumed to be—an exotic new dish I’d get to introduce. But I was soon called out, forced to correct my mistake. Butternut “bis-kway” was, in fact, the same ole butternut “bisk” that had been served every Tuesday for years. Those sweet residents never trusted me with their soup orders again.\nIn Acts 3, Peter is calling out the early Church—not because of a silly mistake or mispronunciation, but because of a miracle. When a crippled man known around town for begging at the temple gates encountered Peter, he didn’t get the silver or gold he asked for; he got something much, much better.\n“I don’t have silver or gold, but what I have, I give you: In the name of Jesus Christ the Nazarene, get up and walk!”\n-Acts 3:6 \nThe man was healed. He could walk. A miracle indeed! But when the crowd around them looked at Peter and John with shocked faces, Peter asked, “Men of Israel, why are you amazed at this?” (Acts 3:12).\nWhy was Peter so frustrated? What did the people get wrong?\nThe Israelites misread the miracle. \nIn Acts 3, God empowered Peter to give the crippled man more than what he asked for, yet exactly what he needed, surpassing human limitations in doing so. The onlookers’ amazement suggested they believed this extraordinary act was the result of superhuman powers or even a fluke. But Peter set them straight, explaining that everything they witnessed was in line with the Truth he’d been trying to tell them all along.\nThey would misunderstand the purpose of miracles altogether. \nSince this is the first miracle mentioned in the book of Acts, it’s a pivotal time for the early Church—and you and me—to learn the real deal about miracles. Peter didn’t start a fire with his hands or make the beggar levitate—he healed him. Miracles are given to awaken confidence in God and to heal humanity. Each miracle Jesus and His apostles performed gave a glimpse into God’s plan to restore all things (Acts 3:21). Each act pointed to the truest miracle of all: Christ Himself.\nThey would mispronounce the gospel of Christ. \nThe crowd watched as the beggar took his first steps, but they themselves would walk away believing and preaching a false gospel. They missed the point entirely; miracles aren’t just for our physical benefit, but for our spiritual benefit. While Peter said, “Get up and walk!” to the beggar, the miracle whispers two more words to us: “to Christ.” \nGet up and walk to Christ. \nFriends, may we do the same. Instead of skipping away with false assumptions, may our hearts rest in the Truth of the One, true miracle.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram3s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 4:1-22, 2 Corinthians 3:12-18, 1 John 5:12",
        "devo_title": "No Other Name",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 4:1-22, 2 Corinthians 3:12-18, 1 John 5:12\nAnnas and Caiaphas were trying to do damage control—and fast.\nThey’d conspired to kill Jesus, and as far as they could tell, the plot had been successful. Of course, a rabble of people claimed Jesus had risen from the dead, but that was preposterous—wasn’t it? All they needed was to imprison a few more people, defame a few more miracles, and then this whole charade would be over for good. Things could get back to normal.\nNormal. That sounds familiar.\n“I just can’t wait for things to get back to normal.”\n“I’m looking forward to getting back into our regular routine.”\n“Once _______ (fill in the blank) happens, things will settle down again.”\nI’ve said these words before. They give me a false sense of control, a sense of hope that soon all the chaos will be behind me and the storm will pass.\nI’ll go to great lengths, trying to maintain a sense of normalcy. I’m desperate for it. So desperate that, the more God tries to change my circumstances, the more I gripe and moan and disobey because it hurts to lose what I’ve worked so hard to construct as mine.\nAnnas was the father-in-law of Caiaphas (John 18:13). As high priests, their “normal” meant power, prestige, and position. The two worked side by side to make atonement for the people of Israel (Leviticus 16:32-34). Minor celebrities in their culture, they spent their days clothed in beautiful linen garments and purifying the holiest of places within the temple. Without their atoning work of sacrifice, all of Israel would fall away from the Lord into sin and destruction.\nThat is, until Jesus.\nIf what Peter and John preached was true, then Annas and Caiaphas’ work no longer held any meaning. If Jesus had really risen from the dead, then He was the real High Priest (Hebrews 4:14-16), and life as Annas and Caiaphas knew it was over. It meant they were unemployed, power-hungry murderers, with no role to play in society. And rather than accept the fact that they were just as sinful as the people they’d been trying to atone for, they tightened their fists around their own power.\nBut Peter and John stood before the Lord’s murderers unfazed. Filled with boldness, eloquence, and joy, they proclaimed the Truth: there is salvation in no one else (Acts 4:12).\nHow’s this for a paraphrase: Hey, Annas, Caiaphas. You think you’re making a legacy for yourselves, but this is all going to come to an end. Your efforts to circumvent God are not going to work. And you are just as sinful as you’re afraid to admit. \nI imagine Solomon nodding his head: in Ecclesiastes, he reminds us that everything we pursue is absolute futility (Ecclesiastes 1:1-11). And in Corinthians, we’re told that even feeding the poor, having faith, and donating all our money mean nothing unless we have Love Himself (1 Corinthians 13:1-3).\nThere is salvation in no one else. Not outside of your marriage. Not inside a better routine. Not with that pair of shoes. Not once you lose fifteen pounds. The storm of change has come into your life, and His name is Jesus. His rival is your sense of control over what’s “normal.”\nPeter and John knew that the storm was only just beginning. They could be bold and fearless because they knew, without question, that they were anchored in the only Truth that can sustain the volatile winds and waves of that storm.\nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram4s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 4:23-37, Acts 5:1-16, Deuteronomy 15:4-6, Hebrews 6:13-20",
        "devo_title": "The Effects of the Gospel",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Acts 4:23-37, Acts 5:1-16, Deuteronomy 15:4-6, Hebrews 6:13-20\nWhen I was a kid, I was scared of the dark.\nAt night, I would quicken my step down the hallway when passing a darkened room. My own room was upstairs, and before bedtime, I would run up to dark windows to pull down their pink shades; large trees loomed just outside, holding who-knows-what in the darkness.\nI was afraid of what I did not know, and certain that the unknown could, and would, hurt me.\nMy heart’s inclination is to treat the story of Ananias and Sapphira like those darkened windows in my childhood bedroom. I want to run past it, afraid to stop and look for fear of what I might find. \nThe chief priests and elders were afraid too. They saw the wonders and heard the testimonies brought on by the spread of the gospel, and they demanded that the apostles stop preaching (Acts 4:17). They were afraid of what they did not understand. But the gospel is true even when we don’t believe.  \nThe apostles knew this. Their intimate experience of Christ’s salvation so affected them, they not only refused to stop preaching and healing in the name of Jesus, they prayed that the Holy Spirit would equip them to preach and heal all the more (Acts 4:29-30).\nAnd so the effects of the gospel continued to spread, in spite of the Council’s warnings. The power of the gospel was so great that this newfound church poured out all they had for the glory of God and the good of their fellow believers. “There was not a needy person among them” (v. 34).\nThis was the context in which Ananias approached Peter with a portion of the proceeds from the land he’d sold, and a premeditated lie about the full amount of the sale. Picture that: while the church was literally giving their all—preaching the gospel and being arrested, giving freely and relying individually and collectively on the grace of Jesus—Ananias and his wife cooked up a plan not only to deceive the church, but to deceive God. \nThe couple did not fear God as holy. They did not trust God as good. They believed God could be tricked, and they set out to do just that. And we know what became of them: in pretending to give all, they lost all.\nBut the story of Ananias and Sapphira isn’t about money. \nThis story is not a departure from the stories of gospel power demonstrated in the chapters preceding it—power that healed the sick, fed the hungry, provided for the poor, and saved souls by the thousands. This, too, was the living God at work, and the living God is to be revered as holy and powerful and good, because He is.\nI don’t have to be afraid of this holy God the way I was once afraid of the dark. He is not unknown, like the night time darkness lurking outside my bedroom windows. No, our God has intentionally and carefully made Himself known. Through the person of Jesus Christ and through His Word, we are invited to know the real, holy Him. \nWe may not fully understand His ways, but we can see His fingerprints on each page of the whole Story. We see them when He gives His covenant to Adam and Abraham and David, and when He pursues His people, though they run. We see them in Jesus’ life and death and in the glory of the resurrection. We see them when we are given forgiveness and mercy, instead of judgment and death. And we see them in this story, too, as God reveals His unquestionable, uncompromising holiness to His people in a powerful way.\nHe is holy. And He is wholly good. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram5s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 1:14",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nThe early church was dedicated to prayer. May the same be true of us!\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for yourself and your community:\nThey all joined together constantly in prayer, along with the women and Mary the mother of Jesus, and with his brothers.\n-Acts 1:14\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram6s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 17:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nAs we read through Acts, we will be memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. It’s going to feel great to be able to recite this beautiful, important passage!\n The God who made the world and everything in it—He is Lord of heaven and earth and does not live in shrines made by hands.\n–Acts 17:24\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/4-Acts1.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 5:12-42, Isaiah 40:6-8, 1 John 2:15-17, John 6:66-69",
        "devo_title": "The Apostles Preach the Gospel",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 5:12-42, Isaiah 40:6-8, 1 John 2:15-17, John 6:66-69\nI have always been enchanted by the glamour, music, and energy of the Roaring Twenties. Naturally, The Great Gatsby is a favorite book of mine. If you haven’t read the book or seen the movie, the plot centers on Jay Gatsby, a man with one goal: to win the heart of the charming Daisy Buchanan.\nMr. Gatsby doesn’t consult God about his grand plans to win over Daisy. Rather, he sets out to make himself a new man worthy of her pedigree—a man of fame and fortune. But despite Gatsby’s best efforts, (spoiler alert) he does not ultimately end up with his lady love. And while hundreds—maybe thousands—once attended his infamous parties, Gatsby’s funeral is a lonely affair, and he’s quickly forgotten by most.\nHow could someone who worked so hard with such a singular purpose, fail and be forgotten?\nWhen we look at the book of Acts, we see the apostles giving everything they have to accomplish a goal. Unlike Gatsby, these men are driven by God’s purpose rather than their own desires. And the outcome couldn’t be more different.\nEven with God leading them, the apostles’ journey wasn’t without difficulties. When the apostles started to gain a following for the Lord, the jealous Sadducees imprisoned them. But the plans God had set in motion could not be stopped, and the men were miraculously freed to continue preaching. When dragged before the Sanhedrin, they remained committed to the mission the Lord had called them to, bravely proclaiming:\n“We must obey God rather than men.”\n-Acts 5:29\nHonest though the apostles’ explanation was, it didn’t sit well with the Sanhedrin, who’d become intent on killing them (Acts 5:33). But Gamaliel, a wise and respected Pharisee among the council, persuaded the others to leave the men alone. “For if this plan or this work is of men, it will be overthrown; but if it is of God, you will not be able to overthrow them. You may even be found fighting against God” (Acts 5:38-39).\nJay Gatsby was a man with plans to make his own name great, but his plans failed and his legacy was forgotten. The apostles, on the other hand, were not working in their own power or crafting their own strategy for success—they were listening to the Lord and joining in His plans as “fellow workers” (1 Corinthians 3:9). Even when the apostles faced imprisonment, beatings, and the threat of death, they were strengthened in the Spirit to endure such trials and to spread the gospel, a teaching with eternal value.\nIt’s tempting to follow our own desires apart from God, striving for recognition and trying to make a name for ourselves. We can easily become confused by our own motivations. Are we pursuing this job or relationship to bring glory to God, or to build our own kingdom? Are we walking in our own strength, or by the guidance of the Spirit? \nJesus promised that apart from Him, we can do nothing (John 15:5). Instead, we will struggle to build false kingdoms of our own that won’t last and will never fulfill. But thanks be to God, whose plans can never be thwarted! Like the apostles, may we seek to obey Him, rather than man.\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. Jesus dramatically changed her life in high school, giving her a heart for those who don’t yet know the love of Christ. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram8s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 6:1-15, Genesis 4:3-7, 1 Timothy 3:8-13, Exodus 34:29-30",
        "devo_title": "Evidence of the Spirit’s Work",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 6:1-15, Genesis 4:3-7, 1 Timothy 3:8-13, Exodus 34:29-30\nWe can disavow the prosperity gospel with our words but still believe it in our hearts. We shake our fists at God, saying, “I did what you told me to and this is how you repay me?” I’ve done this a time or two in my life and am guilty of doing it again as recently as this morning. \nStephen was a man full of faith and of the Holy Spirit (Acts 6:8). He reminds me of a few other men who came before him: Abraham, Noah, Job—men the Bible tells us were full of faith and for whom things went terribly wrong. I sometimes wonder if being “full of faith” is a prerequisite for all sorts of calamity. Not exactly the way we were told it would turn out, though, right?\nCome to Jesus and the things of earth will grow strangely dim.\nCome to Jesus and He’ll make your life better.\nCome to Jesus and His beautiful plan for your life.\nThese are true things, but the caveat to the clause should read something like this: \nCome to Jesus, die, and then be raised to life with Him eternal. \nComing to Jesus involves a death of self we’d often rather forget. \nDid Stephen know this when his name was counted among the first deacons of the early Church? Being full of faith and the Holy Spirit, did he know he’d be arrested just a few short verses later? \nCome to Jesus, display His fruit, and stand before the council for your stoning!\nI’ve spent a good portion of my Christian life in pursuit of the faith, grace, and power the Holy Spirit brings. I’d be just fine with being known as “that girl”—the one full of faith. But I now know enough about suffering that, as I stand before the council of the world, I’m unsure and wobbly, shaky and fearful. I’ve disavowed the prosperity gospel, yet I’ve believed it all the same. Do this, be like this, follow this, and it will always go well for you. Yes, but… well, what about when it doesn’t? \nGod was not in the debt of a man like Stephen or anyone else. It was Stephen—the servant and deacon who performed great wonders in His name—who was indebted to God. We get this backwards all too often. We center our energies on what God owes us, center our beliefs on what we’ve done for Him. While He is a good, faithful, kind, and generous God, He’s no puppet on the strings of our whims. \nGod was with Stephen there, in the place of his arrest, before the appointing of his death, and Acts 6:15 tells us, “They saw his face was like the face of an angel.” There’s a certain type of unshakeable peace for those who are the true servants of God, and Stephen knew this before he ever opened his mouth to speak. His peace wasn’t a peace the world could give, and it wasn’t something he could conjure up himself. It was the peace of God, given to a servant of God. \nThere is peace for the one who knows there is no bargaining with the God of the universe. \nBe full of faith, friends, and full of the Holy Spirit, grace, and power. Do mighty wonders in His name (Psalm 77:14). But do not fear or be surprised when you’re called before the council, when hard things happen, calamity occurs, and difficulties rise. There is a good and strange peace for you there. \nWe serve a God whose actions do not depend on our goodness. Let us praise Him for it.\n \nLore Wilbert is the Director of Community and Formation at Park Church, Denver, and writer at Sayable.net. Find her on twitter @lorewilbert.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram9s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 7:1-53, Genesis 15:13-14, Deuteronomy 18:15",
        "devo_title": "Stephen’s Sermon",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 7:1-53, Genesis 15:13-14, Deuteronomy 18:15\nDragged before the Sanhedrin, Stephen’s platform was a courtroom packed with men determined to put an end to the shockwaves caused by Christ’s resurrection. He’d endured a trial shored up by false witnesses and fabricated stories. And now, staring down the barrel of a trumped-up guilty verdict, perhaps knowing he’d be sentenced to death for his faith, Stephen went for the spiritual jugular. \n“Which of the prophets did your fathers not persecute? They even killed those who announced beforehand the coming of the Righteous One, whose betrayers and murderers you have now become. You received the law under the direction of angels and yet have not kept it.”\n-Acts 7:52-53\nStanding before them, Stephen mapped out the long history of idol worship among the Jews. He didn’t have to bribe witnesses or plant evidence to prove that God’s people chronically looked to idols instead of turning to the one true God. The Jews were prone to put their hope in: \nTheir promised land instead of the God who created it (vv. 2-3).\nTheir house of worship instead of the intended object of worship (vv. 43).\nTheir law instead of the God who handed it down (vv. 53). \nWhen we look at Scripture through a rearview mirror, it’s easy to adopt a posture of chronological snobbery. We read stories like Stephen’s and see the religious leaders through the lens of “us vs. them.” They are the villains of the New Testament. Perhaps when we read Stephen’s sermon, we imagine ourselves in his place, preaching our guts out for the glory of God. But it’s good to remember that we could easily swap places with the judges who condemned him to death.  \nIdols have a gravitational pull on our hearts too. There is a tendency among God’s people in every generation to worship something or someone other than the one true God. And we still have a nasty habit of throwing stones toward those who remind us that our own idol worship is futile and sinful. \nBut read Stephen’s sermon again. Let it marinate. Stephen’s words map out Israel’s rebellions, but there’s a parallel trajectory telling the story of God’s remarkable faithfulness. \nHe was faithful to Abraham, and to Joseph, too (vv. 2-6, 9-10).\nHe never turned His back on Jacob, the deceiver (vv. 12-16).\nHe remained with Moses (vv. 17-36).\nThe Israelites may have rejected their human leader as they wandered around in the desert, but God never did. He never has. He never will. \nStephen was sharing this key truth with the Sanhedrin: all of humanity—every last one of us—is prone to reject God’s gifts and worship idols instead, prone to hide from the God who made us. That’s been true in every generation since the Garden of Eden.\nBefore a call to repentance pierced our own hearts, we also rejected the Truth that Jesus is the Promised Savior we desperately need. But even so, God is faithful and merciful in every season. Therefore, we ought to repent and believe, because Jesus, the Righteous One, was murdered to pay the penalty for all our sins for all time.\nOur hope is built on Christ alone—not land, or temples, or laws. The religious leaders may have covered their ears and tried not to listen, but they couldn’t change the truth Stephen died telling: God is faithful. He was with Stephen that day, and He is present with us now. Looking back we see His grace and forgiveness. Looking forward we see His coming rescue.\n \nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram10s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 7:54-60, Acts 8:1-40, 2 Kings 2:11, Isaiah 56:3-5",
        "devo_title": "The Early Church Grows",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 7:54-60, Acts 8:1-40, 2 Kings 2:11, Isaiah 56:3-5\nAt this point in the book of Acts, God’s Spirit is moving and empowering the members of the early Church to emulate the gospel-bellowing boldness of Peter. They’re fleshing out the declarative promise of Jesus at the beginning of this New Testament story: \n“But you will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem and in all Judea and Samaria, and to the end of the earth.”\n-Acts 1:8 ESV (emphasis mine)\nAlthough not everyone they witnessed to was so receptive. In his final sermon before the Sanhedrin, Stephen rebuked their stubbornness before God, and he condemned their murdering of Jesus, the Promised Messiah. Being confronted with these truths, the leaders became infuriated, ultimately murdering him as well (Acts 7:51-60). \nStephen, likely a relatively new Christ-follower, was also was one of seven men the apostles had chosen to manage and allocate charitable giving, because there’d been some fussing about how some of the needy folks were getting more financial assistance than others. So they chose a few good men (which many congregations now refer to as deacons) to sort it all out (Acts 6:1-4). \nTherefore, it stands to reason that Stephen, being a chosen member of the very first deaconate, was a wise, honorable, well-liked kind of guy. And we know for sure that he was passionate about the gospel because Luke literally describes him as “a man full of faith and the Holy Spirit” (Acts 6:5). \nSo it’s not hard to imagine the collective shock and grief that rippled through that neophyte church community when he was stoned to death by a militant, anti-Christian mob, simply because of one straightforward sermon about their generational stubborn streak and desperate need for Jesus.\nHumanly speaking, it would’ve made sense for the early Church to recoil and then retreat after the tragedy of their dear friend’s gruesome murder. It would make sense if they’d chosen to circle their proverbial wagons and focus on consoling the core group of their fellowship—maybe hire a grief counselor, a crisis manager, and some administrative help to wade through all the insurance and liability issues. \nBut they didn’t shrink back in fear. They didn’t go underground and become a secret, self-protective, cultish kind of crew. They didn’t allow a horrific homicide to curb their cause. Nope. They did the exact opposite. \nOn that day the church of Jerusalem began to be persecuted, and all the believers, except the apostles, were scattered throughout Judea and Samaria. And some religious people buried Stephen and cried loudly for him. Saul was also trying to destroy the church, going from house to house, dragging out men and women and putting them in jail. And wherever they were scattered, they told people the Good News.\n-Acts 7:51-8:4 NCV (emphasis mine)\nTheir commitment to love others for the sake of Christ didn’t get buried with Stephen—it rose up and got bigger! The enemy’s knock-out punch didn’t send them reeling to the canvas; it propelled them out to share the gospel in every corner of the world.\nHere’s the ironic thing about hardship: it tends to have the reverse effect on those of us who’ve put our hope in Jesus rather than in our circumstances. Instead of staying down when we’re walloped, God’s people tend to bounce back with more oomph. In fact, church history proves that opposition often works like Miracle Gro on the Body of Christ. The power of the Holy Spirit enables us to have Rocky-like comebacks, pointing to the undefeatable, redemptive power of the Gospel. We may be down, but we’re never out.\n\nLisa Harper is a master storyteller with a masters of Theological Studies from Covenant Seminary. She’s lauded as an engaging, hilarious communicator as well as an authentic and substantive Bible teacher. She’s been in vocational ministry for 30 years and has written 15 books and Bible study curriculums but says her greatest accomplishment by far is that of becoming Missy’s (her adopted daughter from Haiti) mama! They live on a hilly farmette south of Nashville, Tennessee, where they enjoy eating copious amounts of chips, queso, and guacamole.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram11s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 9:1-31, Galatians 1:11-16, 2 Corinthians 3:12-13",
        "devo_title": "The Road to Damascus",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Acts 9:1-31, Galatians 1:11-16, 2 Corinthians 3:12-13\nCan you imagine if Paul had not done what God called him to do? If he’d had the show-stopping, life-altering moment on the road to Damascus and then went home and holed up, instead of spreading the gospel fervently to the nations? Paul’s miraculous conversion ordained by God would have gone no further than Paul. He himself would have been saved, but what about the countless others he would go on to meet, as well as those of us who read his words today?\nPaul had excuses to shrink back and hide away. As soon as he was converted, his ministry was met with opposition. His former cohorts, the Jews, conspired to kill him (Acts 9:23), and his new tribe, Jesus’ disciples, were afraid of him (Acts 9:26).\nMy (recovering) people-pleasing heart and I would have had a hard time with this. Whenever I am taking the first shaky steps toward something God has called me to do, it is always the opinions of those closest to me that can make or break me. If they hesitate, or question, or pose all-out opposition, I begin to question what the Lord said. Wait, God, did you really want me to do this? Because so-and-so says this, and so-and-so thinks that… \nWe don’t see this type of hesitation in Paul. In fact, we see the opposite. Scripture says Paul immediately began preaching the name of Jesus in the synagogues (Acts 9:20), the very place he once condemned believers and the very place his old buddies hung around. We also read that he preached boldly (v. 28)—as opposed to me, who would have been afraid for my own life, fearfully whispering over and over again the words of what others thought of me. \nIf Paul were reading this today, he’d be quick to point out that it wasn’t Paul who made Paul bold. In his letter to the Galatians, he says, “I no longer live, but Christ in me” (Galatians 2:20). It wasn’t Paul’s boldness that set him apart; it was Christ in him who set Paul apart and promised to complete a mighty work in him (Philippians 1:6).\nI love what Paul says about conversion in his first letter to the Thessalonians: “For our gospel did not come to you in word only, but also in power, in the Holy Spirit, and with much assurance” (1:5). When we believe in Christ, it’s not just a cognitive shift. It’s a full-body, full-heart shift. We are changed completely, as we see in the complete 180 Jesus made in Paul’s heart.\nThis truth—that we have the power of the Holy Spirit—is a game-changer when it comes to taking those first shaky steps into ministry and into calling. For if we have the same Holy Spirit that Paul had, whose opinions do we have to fear? What opposition can make us crumble? What power can come against the power that lives inside of us? \nSure, we may not always have people cheering us on from the sidelines, but we will always have the Holy Spirit in us, giving us the strength and assurance we need to keep going.\nLet’s Praise God for this today—for the grace of His Son, the power of His Spirit, and the promise to complete the good work He began in us, by no power of our own.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram12s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 3:19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nSeeing the depth of our sin, a painful sight though it is, brings freedom when it compels us to confession and repentance.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\nTherefore repent and turn back, so that your sins may be wiped out, that seasons of refreshing may come from the presence of the Lord\n-Acts 3:19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram13s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 17:25",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\n Neither is He served by human hands, as though He needed anything, since He Himself gives everyone life and breath and all things.\n–Acts 17:25\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/4-Acts2.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 9:32-43, Mark 5:21-43, Psalm 36:8-9",
        "devo_title": "Peter Heals in Christ’s Name",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 9:32-43, Mark 5:21-43, Psalm 36:8-9\nYears ago, after returning from a mission trip, I joined my church staff for lunch to share my experiences. As I described some patients we’d met while visiting an infirmary, I noticed my tablemates shifting uncomfortably in their seats. I couldn’t blame them. I pushed my plate away, my appetite dissolved in the memory of such deep and devastating need. \nWhen faced with the reality of true abject poverty, my instinct is to look away. I’ll never be able to unsee the sick and dying, lying in beds crammed ten to a room, but deep down I don’t want to. Witnessing that cloud of suffering has helped me to see God’s rich mercy and compassion with greater clarity. \nIn Acts 9, we meet two people in desperate need of such mercy. Their stories reflect the realities I saw in a third world infirmary and the suffering I see all around me when I force my eyes to look up. The first is Aeneas, a paralytic who’d been bedridden for eight years (v. 33). The second is Dorcas, a disciple of Christ and vibrant member of the Church who’d fallen ill and died (vv. 36-37). Their two stories illustrate a stark juxtaposition. \nAeneas was from Lydda, a pagan settlement filled with blue-collar workers.\nDorcas lived in Joppa, a beautiful and thriving port city with a long Jewish history.\nAeneas had been bedridden for nearly a decade.\nDorcas had lived a vibrant life of service before becoming sick and dying unexpectedly.\nAeneas had nothing to offer, no good works to give, as she’d been immobilized.\nDorcas was “full of good works and acts of charity” (v. 36).\nYet, by the power of Christ, both of them were fully healed. \nThere are ugly corners of my sinful heart that think healing can be earned, that God’s touch is reserved for the deserving. I see the reality of my own brokenness and worry He’ll turn away from my need. But the contrast between these two miracles proves that Christ’s compassion is not dependent upon our deservedness.\nOver and over again during His earthly ministry, and later through His disciples, Jesus offered healing to people on every rung of the social and economic ladder. Each miraculous encounter shows us that His grace is a free gift, extended to both the greatest and least of us. We can’t twist God’s arm to make Him intervene in our lives. Nor can our good works or earthly belongings offer Him anything in return. His work in our lives is always an outflow of His mercy and grace. \nAeneas and Dorcas were tied together by a God who saw their suffering and refused to look away. Their stories remind me that I can ask for God’s help and expect Him to respond based on His character, not my merit. He shows compassion to me, not because of what I deserve, but because of who He is. \nLet us then with confidence draw near to the throne of grace, that we may receive mercy and find grace to help in time of need.\n-Hebrews 4:16\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram15s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 10:1-48, Isaiah 52:7-10, Galatians 3:13",
        "devo_title": "Good News for the Gentiles",
        "devo_summary": "\nBY Raechel Myers\n\nText: Acts 10:1-48, Isaiah 52:7-10, Galatians 3:13\nThe gospel is for everyone. Thanks be to God. \nEven when we aren’t sure it can extend to cover our sins.\nEven when we want to keep it just for ourselves like Jonah.\nEven when we cannot imagine it being powerful enough to cover the wickedness of the world.\nChrist died for the world and ascended into heaven, leaving His disciples with a command to preach His gospel to all people. \nToday’s passage is deeply significant to us as believers. It is the moment in church history—in world history—when God makes plain to both Jews and Gentiles that we “should not call any person common or unclean” (Acts 10:28) as “God shows no partiality” among those who fear Him (Acts 10:34).\nThis is the moment that allows us to trace our fingers across the pages of our Bibles to see God’s gospel plan throughout, beginning with the Abrahamic Covenant in Genesis, where God “brought [Abram] outside and said, ‘Look toward heaven, and number the stars, if you are able to number them… So shall your offspring be’” (Genesis 15:5). \nAs our fingers follow the hand of God across centuries and generations, tabernacles and temples, kings and kingdoms, we stop here at this moment in Acts chapter 10—where the children of Abraham grow exponentially to “sand and stars” status—when God extends His family of sons and daughters to every kindred, tribe, and nation. \nHis long-ago promise of “I will be your God and you will be My people” (Exodus 6:7), which was once kept for the Jewish nation only, is now made available to all, the entire world, making “no distinction.” Repentance is now for everyone. \nDo you see it, too? God’s covenant to Abraham is fulfilled in the new covenant by Christ’s blood, right here in black and white, in the pages of His Word (Luke 22:20).\nOf course, God operates in significance, and this moment is no exception. From Acts chapter 1 until chapter 10—from Christ’s Great Commission to Peter’s vision—there were exactly three categories of people: Jews (God’s holy nation), Gentiles (anyone who wasn’t a Jew), and converted Gentiles (non-Jews who believed in the gospel of Jesus).\nHis invitation of life to the rest of the world was significantly personal. He did not send a Jew to tell the Gentiles they’d been grafted into God’s plan (Romans 11:11-31); He sent one of His own angels to appear to the newly converted Cornelius, a Gentile. Only then—a day later—did He send an angel to appear to Peter with the official word that from that point on, “God shows no partiality, but in every nation anyone who fears him and does what is right is acceptable to him” (Acts 10:34).\nIt was a meeting arranged by God. He gave Peter the message to share and Cornelius ears to hear it. He made sure both of His sons knew they were both equally His, that there was no longer any distinction or need for categories. No matter Jew or Gentile, we who believe are now all sons and daughters of Abraham.  \nPerhaps you haven’t looked at it this way before. Perhaps you’ve forgotten that you, too, “were once far off” (Ephesians 2:13). But now because of Jesus, “God has granted repentance that leads to life” for all who believe (Acts 11:18).\nHe has granted us repentance. It is a gift, an invitation to bow before Him and not be called common. An invitation to repent and to be forgiven. To be called sons and daughters of Abraham—sons and daughters of God Himself. Thanks be to God, indeed.\n“The Lord has displayed his holy arm in the sight of all the nations;\nall the ends of the earth will see the salvation of our God.”\nIsaiah 52:10\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram16s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 11:1-30, 1 Peter 4:16-19, Romans 15:25-28",
        "devo_title": "Salvation Is for Everyone",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Acts 11:1-30, 1 Peter 4:16-19, Romans 15:25-28\nI slinked into my church’s Saturday night service and quietly sat in a row near the back. It had been a hard week, and I wanted to be alone. With a quick glance, I saw a few people I knew scattered about the room. It would have been good for me to stick around and chat with them, but instead I left after the closing prayer and sat in my car. Alone. \nThis is often my default when things get hard: be by myself, pray, journal, figure it out. It might be your default, too, and that would be understandable since we’re both living in a culture that promotes individualism and a DIY attitude toward all things. \nI don’t know the origin of this isolating cultural perspective, but I know it wasn’t learned from the book of Acts. In this chronicle of the early Church, we’ve read story after story of unity and togetherness. Scripture tells us “all the believers were together and held all things in common,” that they “were of one heart and mind” (Acts 2:44; 4:32).\nActs 11 carries on this unity theme, first with Peter defending the Gentiles. To say a Gentile could also be saved and receive the Holy Spirit was a big deal at the time. Until then, only Jews were considered candidates for Christianity; so letting Gentiles into the club was sort of like letting freshmen on the varsity team without a try-out. You just don’t do that. But Jesus did. \nAfter listening to Peter’s defense, the skeptics responded, saying, “So God has granted repentance resulting in life even to the Gentiles!” (Acts 11:18). Here we see the Church embracing the outsider in the name of Christ. In Jesus, salvation was—and is—offered to all, regardless of our labels.\nNext, we hear about the revival at Antioch. The number of conversions was so great that Barnabas went searching for his buddy Paul for help. At Antioch, they labored together for an entire year. Barnabas could have manned the Antioch church by himself, but he pulled in a friend to be with him on the journey. The disciples knew that ministry together was better than ministry alone. \nFinally, we get to the part that is my personal favorite, where believers are united not only in deed, but also in name as the term “Christian” is introduced (Acts 11:26). Before any other title we may hold—Jew, Gentile, mother, daughter, sister, friend, co-worker—is this one: Christian. It sets us apart as believers in the death and resurrection of Christ. Even stronger than a bloodline, is the Christ-line we all share. It is what makes the Church body a family. \nI thought of this while I was sitting in my car, in the church parking lot, alone. A building full of family sat in front of me, yet I was operating like the Lone Ranger. I had forgotten that the purpose of the Church is to do what Barnabas did at Antioch: “He encouraged all of them to remain true to the Lord with a firm resolve of the heart” (Acts 11:23). I had forgotten that salvation was for all weary sinners and I was welcome here, even on my worst days.\nSo I did what was not in my nature to do—I reached out to the Body, in the form of a group text. Thirty minutes later, I was sitting with friends, eating chips and guacamole. I shared a little and laughed a lot, and I was reminded that we were never meant to do this alone, that believers are united by an unbreakable thread in Christ. Before we are anything else we are Christians, and that makes us more than friends. That makes us family. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram17s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 12:1-25, Mark 10:35-40, Isaiah 42:8",
        "devo_title": "Peter Rescued by an Angel",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Acts 12:1-25, Mark 10:35-40, Isaiah 42:8\nPeter’s position seemed dire. He was in prison and scheduled for execution the following day (Acts 12:6). But I love the response of the Church here; they didn’t start a letter-writing campaign, or stage a protest—they gathered together to pray. And after they gathered together, instead of just angrily shouting about what to do next, they actually prayed.\nThis was their solution to an impossible situation. God was teaching His people what it means to be the Church. He was teaching them—and us—how to solve impossible problems. The answer is simply this: pray. It’s such a simple answer that they found it hard to believe it would actually work. They were surprised when Peter showed up at the door with the shackles off his hands (Acts 12:6-16).\nGod is so abundantly good, sometimes we don’t even see it. When He moves in a direct response to prayer we are inclined to miss it; we’d never dare to dream that His goodness extends far enough to answer our requests. In fact, sometimes we forget to pray at all!\nWhat if God uses pain to draw us to Him? It’s possible that dangers and struggles come to drive the Church to prayer—not because He needs us to pray, and not because He needs us to give glory to Him, but because He’s turning our gaze back toward Him. Surely, God’s glory and purposes aren’t subject to what we do or don’t do. In his book The Problem of Pain, C.S. Lewis put it this way: “For you will certainly carry out God’s purpose, however you act, but it makes a difference to you whether you serve like Judas or like John.”\nGod uses trials to bring us to prayer—to change us. He calls us to do His work, and sometimes that work feels impossible. Unthinkable things happen to us, marriages fail, parents get sick, our sweet new babies die—our hearts are broken. But we are not called to despair, or even to fear (Isaiah 41:10), because it’s in the places of deep darkness that God does His greatest work.\nLet us join with the saints of the early Church and use every hardship as an occasion to pray. We, too, can believe in God’s abundant goodness, and see how the gospel can flourish and multiply (Acts 12:24), even in times of persecution. \nAre you hurting today? Are you mourning the loss of the life you imagined? Does it seem like there is no solution, no hope? You are not alone. Receive that: you are not alone. Let your sadness, hurt, and despair prompt you to pray. \nGod is at work, even when we struggle to believe. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram18s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 13:1-52, Galatians 3:10-14, Isaiah 49:6",
        "devo_title": "Paul’s First Missionary Journey",
        "devo_summary": "\nBY Missy Fuller\n\nText: Acts 13:1-52, Galatians 3:10-14, Isaiah 49:6\nThey had been given a great responsibility. Paul and Barnabas knew what was at stake and that at any moment their lives could be taken from them. But God had given them a task: to preach the good news of Jesus Christ to the nations. \nWhat an emotional roller coaster they must have experienced those few weeks in Pisidian Antioch. One week they proclaimed the truth that Jesus is the promised Messiah, and the people were receptive to their message. So much so, they invited Paul and Barnabas to speak again. I envision Paul and Barnabas as they headed away from the crowd, jumping for joy and praising God for the incredible response from that day. \nThe next week, the whole city turned out to hear the word of the Lord (Acts 13:44). Can you imagine? It must have been so encouraging for Paul and Barnabas to realize the part they were playing in spreading the message of Christ. \nBut then it happened. The Jews became filled with jealousy (Acts 13:45). They began to oppose Paul and Barnabas and their message. \nThis wasn’t the first time Paul and Barnabas had faced opposition to the gospel message (Acts 9:29). Had they given up at the first sign of trouble, they would have missed out on participating in the incredible work God was doing in spreading the good news.\nPaul and Barnabas were able to withstand the emotional highs and lows they faced throughout their ministry because they were resolved in their task, and they knew God was with them. They were confident God had called them to preach the message of Christ to the Gentiles. Regardless of what happened, they would do their very best to remain faithful. \nGod has given all of us tasks as well. He has placed them on each of our hearts and calls us to complete them. Maybe it’s a short-term task, changing daily. Or maybe it’s long-term, spanning the days and weeks and months ahead. \nWhatever our unique calling, God doesn’t expect our perfection, but He does desire our faithfulness. As God used Paul and Barnabas to proclaim the truth of Scripture to the people in Pisidian Antioch, He has called each of us to be part of His saving work on this earth. \nEven so, the outcome is not up to us. Paul and Barnabas were faithful. They may have felt like they had failed when the Jews rejected their message. But in His sovereignty, God used what seemed like failure to bring many Gentiles to Himself. \nFriends, let us keep pressing on. Let us aim to be faithful to God’s calling, and learn to let go of our own expectations for perfection. We can rest easy in this truth: we are ultimately not responsible for the outcome of our efforts. That lies in the hands of our incredibly powerful and overwhelmingly sovereign God.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram19s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 8:36-37",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nWe give thanks to God for His cleansing gift of baptism through His Son.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\nAs they were traveling down the road, they came to some water.\nThe eunuch said, “Look, there’s water! What would keep me from being baptized?”\nAnd Philip said, “If you believe with all your heart you may.”\nAnd he replied, “I believe that Jesus Christ is the Son of God.”\n–Acts 8:36-37\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram20s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 17:26",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\n From one man He has made every nationality to live over the whole earth and has determined their appointed times and the boundaries of where they live.\n–Acts 17:26\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/4-Acts3.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 14:1-28, 2 Timothy 3:10-12, Colossians 4:2-4",
        "devo_title": "Growth and Persecution in Iconium",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 14:1-28, 2 Timothy 3:10-12, Colossians 4:2-4\nI have a friend who understands the illusion of fame well. \nOne summer, he was on stage in front of thousands of teens. As he walked behind a group of girls before a performance, he overheard them talking about how much they loved him. In a bold move, he approached the girls and entered into a conversation with them. Realizing they didn’t recognize him, he even offered to introduce them to that “guy on stage.” They giggled and talked excitedly, never knowing they had just been talking to the “star” himself. \nIt’s part of human nature to look up to those we admire. Obviously, that’s not all bad, but we can easily inflate and blow that admiration out of proportion. Paul and Barnabas learned this lesson nearly two thousand years ago.\nThey were empowered by the Holy Spirit; their words were eloquent and cut to the heart. Scripture tells us that when Paul and Barnabas preached, they “spoke in such a way that a great number of both Jews and Greeks believed” (Acts 14:1). They were certainly well-known, and in today’s culture we might even say they’d grown “famous.” And like most prominent people, they evoked two common—though extreme and unhealthy—responses: they were either loved or hated.\nWe see the first example of this in Iconium. The Jews were piping mad at the apostles’ powerful message. In response, they made personal attacks, threatened physical violence, and stirred up as much trouble as they possibly could (Acts 14:2). \nBut the people of Lystra had a different destructive response to Paul and Barnabas: they went absolutely gaga for them! The people were so taken with the message they preached that they began to idolize them. I know—garlands and animal sacrifice sound a bit extreme (Acts 14:18), but don’t let their pagan cultural response blind you to the modern implications. \nThink about the famous teachers of our time. More often than not, they teach—verbally or through written word—in ways that move us deeply and stir our hearts toward God. We are drawn to gifted teachers and come to admire, respect, and learn from them. But because of our sin nature, we’re also tempted to idolize them.\nAs for Paul and Barnabas, they weren’t having it. The apostles refused to receive the people’s misplaced accolades. \n“Men! Why are you doing these things? We are men also, with the same nature as you, and we are proclaiming good news to you, that you should turn from these worthless things to the living God, who made the heaven, the earth, the sea, and everything in them.”\n-Acts 14:15\nWe will always be tempted to worship gifted people with powerful messages. So we must guard our hearts against worshiping the messenger instead of the God to whom we all belong. At the end of the day, the gospel will flourish because of Him, just as it thrived in those early days of the Church. \nThat’s what I love most about the close of Acts 14. Despite the misguided responses of Jews and Gentiles alike, the good news was preached, and souls were added to the Kingdom. God can and will use the power of earthly fame for His purposes, but He alone is worthy of our praise and adoration.\n\n\nJessie Minassian is an author, blogger, and speaker, who prefers to be known for her ability to laugh at herself, a weird obsession with nature-ish stuff, and a penchant for making up words. Learn more about Jessie and her ministry at LifeLoveandGod.com. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram22s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 15:1-35, Romans 2:17-24, Galatians 5:1",
        "devo_title": "Is Christ Enough?",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 15:1-35, Romans 2:17-24, Galatians 5:1\nThose first Jewish individuals who converted to Christianity were initially a bunch of scrupulous rule-followers. It’s no wonder they were having a hard time with the fraternity of Gentile converts, who’d seemingly sailed in from a laissez-faire, lawless background without “earning” the grace of God they were now reveling in. \nAnd so, the Jewish Christians decided to erect a hierarchical ladder with a few more steps leading to redemption (Acts 15:1-6). They adapted the “Faith in Jesus + Nothing = Salvation” message that Peter, Stephen, and Paul had preached, into a “Faith in Jesus + A More Restrictive Menu and Circumcision = Salvation” lecture. I imagine they secretly surmised it was a harmless enough edit.\nI mean, we aren’t expecting non-Jews to adhere to all 613 Torah rules or anything—just the biggies. All they have to do is order their steaks medium-well and agree to get their private parts tweaked a bit. That’s just a teensy outpatient surgery. Heck, we’ll even pay for the ice packs!       \nThis prejudiced-based friction between Jews and Greeks—officially titled “The Jerusalem Debate”—endangered the fellowship of the early Church. It caused such a rift in Antioch that Paul and Barnabas left, traveling back to Jerusalem to sort the matter out with the rest of the elders and apostles. Imagine the murmurs of differing opinions rippling through the multi-ethnic congregation of our mother Church when Peter stood up to address them:\n“Brothers, you know that in the early days God chose me from among you to preach the Good News to the nations. They heard the Good News from me, and they believed. God, who knows the thoughts of everyone, accepted them. He showed this to us by giving them the Holy Spirit, just as he did to us. To God, those people are not different from us. When they believed, he made their hearts pure. So now why are you testing God by putting a heavy load around the necks of the non-Jewish believers? It is a load that neither we nor our ancestors were able to carry. But we believe that we and they too will be saved by the grace of the Lord Jesus.”\n-Acts 15:7-11 (NCV)\nThe first point Peter argues is that the gospel they’d been preaching (Faith in Jesus + Nothing = Salvation) had already resulted in an international harvest of salvation. Obviously, the Holy Spirit was able to soften sinners’ hearts unto repentance without first whacking them over the head with a 50-pound rulebook. The testimony of Jesus Christ crucified and resurrected was perfectly sufficient to compel the lost to find their living hope in Him. \nI bet most of the men listening to Peter argue his case were now dumbfounded, slack-jawed with the realization that he’d just nailed them to the wall with his observation: the weight of the law almost broke your back, so why in the world are you so determined to strap it on someone else’s shoulders?     \nHere’s the deal about the judgment God declared as a result of humanity’s sin against Him (Romans 3:23): WE CAN NEVER BEHAVE WELL ENOUGH TO SATISFY IT. We can’t get good enough. No matter how many biblical rules we’re able to keep, it’s impossible for humans to attain perfection, and perfection is the only remedy for God’s wrath. This is why He sent His only begotten Son into the world, wrapped in a suit of skin: to live a perfect sinless life and shed His perfect blood during a sacrificial death, making perfect atonement for our sin. \nJesus is the only One who could justify us and reconcile us into a right relationship with our heavenly Father. If we could close the gap with God ourselves, Jesus could’ve just kept chilling out in Glory and skipped the whole sordid “Redeeming Mankind” mission.    \nThe Mosaic Law these well-intentioned Jewish Christians were so eager to push onto the Gentiles never had the power to save anyone. That wasn’t God’s intention when He gave it to Moses in the first place. God didn’t proclaim those commandments on that ancient pinnacle so that by them we could be saved. He gave them so we’d realize we can’t save ourselves! \nThe Old Testament moral and ceremonial stipulations underscore our absolute inability to achieve perfection. They were always, always, always meant to lead us to Jesus.\n\nLisa Harper is a master storyteller with a masters of Theological Studies from Covenant Seminary. She’s lauded as an engaging, hilarious communicator as well as an authentic and substantive Bible teacher. She’s been in vocational ministry for 30 years and has written 15 books and Bible study curriculums but says her greatest accomplishment by far is that of becoming Missy’s (her adopted daughter from Haiti) mama! They live on a hilly farmette south of Nashville, Tennessee, where they enjoy eating copious amounts of chips, queso, and guacamole.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram23s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 15:36-41, Acts 16:1-15, John 15:26, 1 Corinthians 9:19-21",
        "devo_title": "Start of the Second Missionary Journey",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 15:36-41, Acts 16:1-15, John 15:26, 1 Corinthians 9:19-21\nIf you’ve been a Christian for any length of time, you’ve probably heard countless stories of rifts, splits, and politics in the Church. Maybe you or someone close to you has been really hurt by the way the imperfect people of the Church handled certain situations. It’s devastating when God’s people let their flaws get in the way of ministry, doing more harm than good.\nHowever, the Church is sometimes so afraid of discord that it swings too far the other way. Trying to maintain the unity Christians are called to (1 Peter 3:8), we can unintentionally create cultures that stifle any questioning or difference of opinion. The push for unity can be taken so far that it seems sinful to disagree at all. There must be a better solution to preventing the type of pain that church conflict is known to cause.\nThe struggle of Christians to balance unity with uniqueness is nothing new. In Acts, we read about the ministry of Paul and Barnabas, two exceptional men who gave their lives to preaching the gospel. But even these god-fearing men had a sharp disagreement. Barnabas wanted to bring Mark with them on their journey, but Paul didn’t think it would be wise, given that Mark had ditched them on a past journey. \nThere doesn’t seem to be a moral issue here, just a difference of opinion or perhaps a difference in what these men felt God was calling them to do. Barnabas was thinking about his cousin, and Paul was thinking about the dangers ahead. Even though the men decided to part ways, this story doesn’t paint either man as a villain. \nIt is so rare for us to view a disagreement like this without assigning blame to one party or the other. Surely someone is in the wrong! That was my reaction when I first read this story of Paul and Barnabas. But the more I dug, the more I found that most scholars don’t see a moral issue in the way these two godly men disagreed and parted.\nWhile it might not have been ideal for Paul and Barnabas to be on different pages, God used their parting of ways to reach more people and spread the gospel. In the end, their disagreement does not lead to a damaged relationship, nor do they appear to hold any ill will toward one another. In fact, Paul goes on to later speak very respectfully of Mark, calling him a fellow worker who had brought him comfort (Colossians 4:10-11). \nSometimes there is unavoidable pain from conflict because one or both parties are in the wrong, acting out of sin. Those situations are distinctly different in nature from the disagreement we here see between Paul and Barnabas. \nTheir conflict affirms that we can disagree and even be angry without sinning (Ephesians 4:26), if we do it with a gentle and humble spirit. We can part ways when needed without hurting others, if we understand that there does not always have to be a villain. Conflict can feel yucky, but in non-moral issues such as this, God can use it for His good purposes.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. Jesus dramatically changed her life in high school, giving her a heart for those who don’t yet know the love of Christ. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram24s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 16:16-40, 2 Corinthians 10:3-4, 1 Peter 2:19-21",
        "devo_title": "Conversion of the Philippian Jailer",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 16:16-40, 2 Corinthians 10:3-4, 1 Peter 2:19-21\nLocked in prison and bound in chains, Paul and Silas make strange poster boys for freedom. When we conjure up images of freedom, we are more likely to picture an eagle in flight or a child running uninhibited through a field, than to picture two fellas in a shared prison cell. But make no mistake, even in prison, Paul and Silas were free. Their story reminds us that when God’s people live as though they’re free, the shock waves of radical faith radiate out into the world.\nIf you’re someone who likes to underline (or circle, doodle beside, or watercolor), grab your Bible and pen or paintbrush, and get to work highlighting verse 25: \n“About midnight Paul and Silas were praying and singing hymns to God, and the prisoners were listening to them.”\n-Acts 16:25\nPaul and Silas had been arrested for disturbing the peace, and were then dragged into the marketplace where they were stripped and beaten with rods. Their response? They had church.\nThere simply wasn’t a dungeon dark enough to snuff out their status as the “light of the world” (Matthew 5:14). No earthly shackles could compare to the chains of sin Christ died to free them from. The key had been turned on the cages of death and condemnation, and no prison sentence could strip them of that freedom. Though imprisoned, they chose to live out the message of that favorite children’s song, “Hide it under a bushel? No! I’m gonna let it shine.” The prisoners in chains all around them couldn’t help but listen in. \nI can’t get enough of the jailer’s conversion from this passage. This man who held the keys to an earthly prison exchanged them for the keys to the Kingdom of heaven (Matthew 16:19). What a beautiful picture of the gospel!\nAs the earth shook beneath him and the prison doors flew open, perhaps he saw his own chains for the first time. When God’s people live freely, those in bondage all around us are moved to look at their own chains and repeat the jailer’s question:\n“What must I do to be saved?”\n-Acts 16:30\nDon’t miss this! If we are in Christ, we are free indeed (John 8:36).  \nFree from the law of sin and death (Romans 8:2).\nFree from the enslaving weight of sin (Galatians 5:1).\nFree from the bondage of corruption (Romans 8:21).\nFree from eternal condemnation (Romans 8:1).   \nJesus is the great abolitionist. From the cross, He shook the foundations of our prison cells and flung open the doors to our hearts, freeing the bound and enslaved so that we might freely live. \n“For freedom Christ has set us free; stand firm therefore, and do not submit again to a yoke of slavery.”\n-Galatians 5:1\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram25s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 17:1-34, Zechariah 12:10, Romans 3:21-26",
        "devo_title": "Paul Preaches at the Areopagus",
        "devo_summary": "\nBY Ellie Holcomb\n\nText: Acts 17:1-34, Zechariah 12:10, Romans 3:21-26\nI’ve read Acts many times before, but something changed for me as I was preparing to write this. The She Reads Team suggested that, in addition to reading through the whole book of Acts, we might want to listen through the whole book as well. (There are tons of free ways to do this online. Try it!) I’d never thought to do it before, but it was remarkable. \nAs I simply listened to the story Paul was so adamant in telling—of his conversion, Jesus’ resurrection from the dead, and the crazy beautiful way God brought Jews and Gentiles together with the gospel of good news—I was transported from my own story and swept up into God’s. And like Paul, it made me want to share the gospel.\nIn Acts 17, we see that Paul continues to look for any opportunity to share the gospel of the resurrected Jesus. But while in Athens, he is greatly troubled to find that the city is full of idols.  \n“…as I walked around and looked carefully at your objects of worship, I even found an altar with this inscription: TO AN UNKNOWN GOD. Now what you worship as something unknown I am going to proclaim to you.”\n-Acts 17:23\nI had to press pause on my phone. The phrase, “I looked carefully at your objects of worship” echoed in my heart. \nI don’t have images in silver or gold placed throughout my house that I treat as idols, but I was so convicted as Paul spoke about worshiping an unknown god. I thought about how many things I’ve tried to replace the love of God with in my life, and I began to ask the Lord if there were currently any unknown gods I’ve been worshiping. \nThat’s where it began… a “re-ordering of the loves” in my heart, as Augustine called it. As of late, I’ve been searching for my worth in the way that I perform as a mom, as a daughter, and as a friend. I measure how much I matter by what other people think about me or by how they respond to me. And once again, I am so deeply convicted of ascribing more worth to what others think of me than to what God thinks of me—of what He has done for me. \nI feel it deep in my bones, the discontent that comes when I look to anything other than Jesus for my identity and happiness. Tim Keller says it like this: “Disordered love always leads to misery and breakdown. The only way to reorder our loves is to love God supremely.” Loving Him first is the only way (John 14:6).\nPaul goes on to proclaim to the Athenians the beautiful truth about our God:\nHe “made the world and everything in it” (v. 24).\nHe “gives everyone life and breath and all things” (v. 25).\n“He is not far from each one of us,” for it’s in Him that we live (v. 27-28).\nHe counts us as His children (v. 29).\nThis is the God Paul points us to. May we learn to love Him supremely and find sweet satisfaction in His grace.\nFather, forgive us for worshiping false, even unknown, gods. By Your grace, please reveal them to us. Help us to shift our gaze from all the lesser loves to You, the One true lover of our souls. By your mercy, re-order our hearts as You see fit, and teach us to worship You alone. Amen.\n \n \n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/SRT-Acts-Instagram26s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 13:38-39",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Connect with the members of your family and community in prayer as you pray the Scripture below for them and for yourself:\n“Therefore, let it be known to you, brothers, that through this man forgiveness of sins is being proclaimed to you, and everyone who believes in Him is justified from everything that you could not be justified from through the law of Moses.”\n–Acts 13:38-39\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram27s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 17:27",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\nHe did this so they might seek God, and perhaps they might reach out and find Him, though He is not far from each one of us.\n–Acts 17:27\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/4-Acts4a.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 18:1-28, James 4:13-15, Isaiah 51:1-2",
        "devo_title": "Paul’s Second Missionary Journey Ends",
        "devo_summary": "\nBY Missy Fuller\n\nText: Acts 18:1-28, James 4:13-15, Isaiah 51:1-2\n“There’s nothing to be afraid of.”\nThey were lying. I had plenty to be afraid of.\nI had just climbed up a steep lakeside embankment with nothing more than a swimsuit, Chaco sandals, and the intent of jumping off a 50-foot cliff into the water. My brother and his best friend were doing all they could to convince me everything would be fine, that there was nothing to fear. \nWhat if I slip as I’m jumping and hit my head?\nWhat if I hit the water at a bad angle?\nWhat if this water isn’t as deep as we think it is?\nWhat if I land on a floating tree branch?\nFear. It’s a big deal. It can keep us from doing things we’d really like to do. It can also keep us from doing exactly what God has asked of us. It can even cause us to live our lives in ways that leave us no room for faith; we become so seemingly independent that we begin to believe we don’t need God or anyone else. \nI don’t know if you’re like me and have every “Do not fear” in the entire Bible circled, underlined, and highlighted. It makes sense to see it in the Old Testament, when the heroes of Israel are heading into battle. But Paul? Is this the same Paul who had already faced oppression, persecution, and imprisonment for the gospel? That Paul was afraid? \nThen the Lord said to Paul in a night vision, “Don’t be afraid, but keep on speaking and don’t be silent. For I am with you, and no one will lay a hand on you to hurt you, because I have many people in this city.”\n-Acts 18:9-10\nDo not be afraid. The Greek phrase used in verse 9 means “you must not be afraid any longer.” Literally, stop being afraid!\nThis is confirmation that yes, Paul was, in fact, already afraid. The text doesn’t give us much more context for Paul’s fear. Was his fear the “thorn in his flesh” that would always plague him (2 Corinthians 12)? Was this a one-time situation where he was especially afraid? The Jews had opposed him and abused him before, but that can’t be something one gets used to. \nRegardless of the details, we can be sure of one thing: Paul was afraid and God commanded him to not be afraid any longer. \nLike Paul, I’ve faced some crippling fears (yes, even more terrifying than that time I jumped off a cliff). God has called me to things and I’ve stood frozen, still paralyzed by a fear of failure or defeat. Instead of embracing the strength and victory He promises (1 Corinthians 15:57), I’ve let fear dictate what I believe and what I do. \nEven in the most intimidating situations, God is faithful. He gave Paul the assurance that He would protect him. Just look at how perfectly God provided for Paul: \nHe brought him fellowship and friendship with Aquila and Priscilla (Acts 18:18).\nHe provided for his physical needs, allowing him to continue working as a tentmaker (v. 3).\nHe allowed him to spread the gospel in Corinth for another year and a half (v. 11).\nOur God provides for us too. Despite the moments we feel crippled with fear, He knows exactly where we are and what we’re feeling. We can trust that God is bigger than all our fears. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram29s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 19:1-41, Luke 3:16, Ephesians 6:12",
        "devo_title": "Paul’s Third Missionary Journey",
        "devo_summary": "\nBY Guest Writer\n\nText: Acts 19:1-41, Luke 3:16, Ephesians 6:12\nI’ve been spending a lot of time in New York City lately, and I love it. People there are beautiful and stylish, moving at a pace that seems faster than humanly possible. You get the feeling that everyone is on an important mission, chasing their dream and making it happen. The energy is intoxicating. \nBut there’s also a sense that it’s all hanging in a very tight balance. Life in the commercial center of the world is expensive, fast, and hard. The margins are slim between living and not being able to make rent. That energy is fraught with anxiety, loneliness, and an underlying fear that it all could slip away.\nThis is the world Paul stepped into when he arrived in Ephesus. \nLocated in the far western corner of modern-day Turkey, Ephesus was the epicenter of the Mediterranean. The city’s theater had capacity for 25,000 people and the temple of the goddess Artemis towered over the city, nearly four times larger than the Parthenon in Athens. This was a place to see and be seen. A place to live your dreams. And Paul wasn’t just passing through; he moved in. \nUnlike his peers in the city, Paul had no economic agenda. Genuine and unassuming, he was a person people wanted to be around because he wasn’t there to leverage every relationship into a better job or status. He just wanted the Ephesians to know the Truth. It was only a matter of time before someone realized they were staring at a serious economic opportunity. \nSceva’s sons name-dropped with the best of them, hoping to ride Paul’s and Jesus’ momentum to fame and fortune. They were enamored with the miracles, but not with the One who made them possible. \nIn the oddest way, I love the evil spirits’ response to their half-hearted healing (Acts 19:14-15). Even demons believe in God and shudder (James 2:19), but speaking His name is powerless unless you truly know Him. \nAfter this violent encounter, a wellspring of believers realized their own mistake with the prosperity gospel. Convicted and impassioned to make a change, they made a public display of their repentance, setting aflame 50 thousand drachmas—the equivalent of 136 years’ worth of work. A huge portion of Ephesus’ GDP.\nClearly, that shift in values didn’t sit well with everyone in the city. As more Ephesians fell in love with Jesus, the silversmith, Demetrius feared for his livelihood, the future of the temple, and the future of his city. Perhaps he was driven by more than money, or maybe he wasn’t. Regardless, Demetrius chose to riot rather than repent. \nHaven’t we all? \nHas God ever messed with your economy? \nIt isn’t easy to let go of our jobs, our money, or our city. Those things feel like life. But God loves us too much to let money be our god, to let fame lure us away from Truth, or let us live a life of name-dropping, rather than heart-knowing. \nIs it possible that Jesus was calling Demetrius to abandon his meaningless silver souvenirs, into a more creative life? Did fear kidnap his chance to be the artist God created him to be?\nOne thing is certain. Jesus promises us a full, abundant life—greater than anything we can ask or imagine (Ephesians 3:20-21). His whisper is honest and true. There’s more, beloved. There’s more.\nIt waits for you on the other side of the fire.\n\n\nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram30s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 20:1-38, 1 Corinthians 16:1-4, Philippians 1:20-21",
        "devo_title": "Paul Says Goodbye to the Ephesians",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Acts 20:1-38, 1 Corinthians 16:1-4, Philippians 1:20-21\nThe price we pay for the sun-drenched joys of summer camp are the sad farewells. I was seventeen and my legs were completely covered by bug bites, from my athletic sandals to my cuffed jean shorts. Bending over to scratch an ankle while Emily and I propped up the last of the mattresses in our cabin, I allowed myself a moment to peek into my sadness. Back at home, I was “Becky,” but at camp, I’d managed to introduce myself as “Rebecca,” and after a summer of feeling so grown up, I was sad to leave.\nEmily, sunburnt and still wearing a camp t-shirt, hugged me and said, “See you in heaven!” And she left. Just like that. I remember sitting alone in the fading light of our empty cabin, smelling the warm cedar and thinking, “See you in heaven?! Can she even say that to me?” It felt so final, and yet so hopeful. No one has said those words to me since, and I don’t think I’ll ever see Emily again, so she was probably right.\nHer words stuck with me, however, and when I read Paul’s lingering goodbyes to the Ephesians, I’m reminded of how hard it is for us to say our final farewells. Small things receive huge significance when they are the last things. Even the dust motes floating in the air, illuminated by shafts of sunlight, seem important in our last moments with those we love. \nSet in the context of eternity, all these things—all these moments—are the last things. My summer camp goodbyes are mostly forgotten, but that one reminded me that this world is passing away (1 Corinthians 7:31). Paul’s last address to the Ephesians invited them to see the world in the light of eternity, to make much of little things, because our goodbyes in this world are many and often.\nKnowing that none of them would ever see his face again, Paul slowed everything down to cry and savor their time together. Some of Paul’s last words to them were simple: \n“But I count my life of no value to myself, so that I may finish my course and the ministry I received from the Lord Jesus, to testify to the gospel of God’s grace.”\n-Acts 20:24\nIn his final moments with dear friends, Paul wanted to speak to them about only the things that truly matter. Whether we die at the ripe old age of 110 or at breakfast tomorrow morning, these moments on earth are so dearly short compared to eternity. These sunlit days are brief and full of petite goodbyes. Paul uses these moments to commit his beloved friends “to God and to the message of His grace” (Acts 20:32).\nIn the midst of the sadness of all our goodbyes, the small and the huge farewells, God’s presence continues to go with both parties. When we are joined together in Christ, He promises that we will share an inheritance together in heaven (Romans 8:17). Indeed, we have His word that, “In the world you will have tribulation. But take heart; I have overcome the world” (John 16:33).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram31s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 21:1-36, Joel 2:28-29, John 19:13-16",
        "devo_title": "Paul Goes to Jerusalem",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Acts 21:1-36, Joel 2:28-29, John 19:13-16\nYou know those movies with the sad endings you watch again and again? You know how they end, but something in you hopes beyond hope that somehow the ending will be different this time. The guy and the girl will get together. The epic battle scene will end in the good guy’s favor. But it never happens, does it? Because the ending has already been written.\nThis is how I feel when I enter the final chapters of Acts. I know Paul’s imprisonment is coming, but I want it to end differently this time. I want Paul to be free to bring the gospel everywhere and to everyone. When I read Acts 21, I don’t want that fateful day in the temple to come—the day that changed Paul’s course forever. For the remainder of the book, our friend is either in prison, en route to prison, or under house arrest. This is the last we see of Paul as a free man. \nWho hasn’t experienced a change of course? There we are, trucking along, doing fine and—BOOM—something happens that changes our direction. Something messes with the end of the story we’d planned for ourselves—an unexpected, and often unwanted, shift. \nWhen this happens to me, I look at God with shrugged shoulders. “What are You doing?” I ask. “Why is this happening? What now?” \nI’m not often given specific answers to these questions, but these shifts always remind me that God is the author of my story, not me. When I surrendered my life to Christ, I gave up ownership of myself (Galatians 2:19-20). I no longer call the shots, and a change of course is a good, though hard, reminder of this critical part of the Christian life.\nWhile we can’t predict how or when these shifts in our stories will occur, we can expect them. Paul did. When his friends warn him about his potential fate in Jerusalem, he asks, \n“What are you doing, weeping and breaking my heart? For I am ready not only to be bound but also to die in Jerusalem for the name of the Lord Jesus.”\n-Acts 21:13\nKnowing full well the danger he faced, Paul continued the ministry he was called to. He didn’t allow the unknown to paralyze him. He had been transformed on the road to Damascus (Acts 9:1-25), filled with the Spirit, and now he lived as though his life were not his own.\nAs a Christ follower, I want to do just that: follow Christ. I want to live life with open hands, being prepared and ready for what God has in store, rather than resistant to it. Under God’s care, we may not always know what’s coming next, but we can trust Him, come what may.\nSome of the stories in our lives will have sad endings we’d like to change. But the Story of our lives? We know how it ends. We’ve been promised the best ending imaginable. Our good and faithful God will prevail, and we will get spend eternity with Him. \nIn the meantime, let’s trust God with the other stories, the changes of course—no matter how trying, no matter how unexpected. Knowing that He is God and He is good, let us say with confidence, “The Lord’s will be done!” (Acts 21:14).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram32s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 21:37-40, Acts 22:1-30, Acts 23:1-11, 1 Peter 3:21-22, Hebrews 10:19-22",
        "devo_title": "Paul Preaches to Jews in Jerusalem",
        "devo_summary": "\nBY Guest Writer\n\nText:  Acts 21:37-40, Acts 22:1-30, Acts 23:1-11, 1 Peter 3:21-22, Hebrews 10:19-22\nIn the last few verses of Acts 21, we find Paul has been arrested yet again and taken by Roman soldiers to the barracks. There he makes his defense, culminating in the reality that he is a Roman citizen and, as such, cannot be treated like he is being treated (Acts 22:23-29). When the Romans realize they have made a serious political mistake, they hand him over to the Jews, where Paul pulls the same defense—that he is one of them, a Pharisee and a son of Pharisees (Acts 23:6). That’s some impressive genealogical gymnastics, and it’s a lesson for us all. \nWho are we? \nMy pastor once said that every time the Enemy comes to remind him of his sin, he reminds the Enemy he’s right. \nHe is a liar.\nHe is guilty of the lust of the flesh.\nHe is like a murderer in his heart.\nHe is a thief, a scoundrel, and an unworthy son of God.\nBut no matter what we are or what we’ve done, the truest thing about us is who we are in Jesus. As my pastor so faithfully reminds me, Christ has taken our sin and borne it on our behalf. So though we are guilty of countless things, we are not identified by them. \nThe Enemy is a liar, but his best tactic is to take the truth and twist it just enough—leave out enough of the whole truth—that I am caught in his lair. I forget who I am, or I exaggerate who I am, or I minimize it. And, what’s more, I forget who God is. \nIn this passage, Paul is caught in the lair of two enemies—the Romans and the Jews—and his best defense is to say the whole truth to both. \nTo the Romans, he is a Roman citizen by birthright. He is endowed with all the rights and perks of his citizenship. And to the Jews, he is a Pharisee of Pharisees. He is a prince of Pharisees, student of the Torah, and righteous rabbi. Paul is not swinging from two extremes in this passage; he is telling the truth—the whole truth. \nSo often we get caught in the web of lies about who we are and who God is. In those moments, it’s easy to forget the cross, the blood of Christ, the resurrection, and the hope of eternity. It’s easy to forget who we are by our birth in Christ. \nIn those moments, remember Paul. Say to the Enemy who comes to kill, steal, and destroy (John 10:10), “I know who I am and who God is. I know my sin and my wrongdoing. And I know that all the righteousness of God has covered over me.” \nWe, like Paul, are on trial with “respect to the hope and resurrection of the dead” (Acts 23:6). And, friend, we will one day rise again with all the people of our eternal home country. Until then, this is the gospel antidote to the lies of our enemy: “Yes, but…” \n…we have an advocate with the Father—Jesus Christ the Righteous One.\nHe Himself is the propitiation for our sins…\n– 1 John 2:1-2\n\nLore Wilbert is the Director of Community and Formation at Park Church, Denver, and writer at Sayable.net. Find her on twitter @lorewilbert.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram33s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 16:31",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nThere is no greater prayer we can pray for those we love than for them to know the fullness of God’s love in the saving grace of Jesus Christ.\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\n“Believe on the Lord Jesus, and you will be saved—you and your household.”\n–Acts 16:31\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram34s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 17:28",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through Acts, we are memorizing a 6-verse passage, Acts 17:24-29, from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. By memorizing one verse per week of the study, we will have all six verses memorized by the end. Here is this week’s verse:\nFor in Him we live and move and exist, as even some of your own poets have said, ‘For we are also His offspring.\n–Acts 17:28\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/4-Acts5.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 23:12-35, 2 Corinthians 4:8-12, Job 33:4",
        "devo_title": "The Plot to Kill Paul",
        "devo_summary": "\nBY Rebecca Faires\n\nText:  Acts 23:12-35, 2 Corinthians 4:8-12, Job 33:4\nPaul was on the road to his death, a journey to Rome he suspected would end in martyrdom. Yet, in spite of the uncertainty ahead, he was exuberantly alive in Christ. This paradox of death and life exists for us all. Trusting in God’s good providence is life, but trusting in our own strength means only death.\nThough faced with a fierce opposition that constantly threatened his life, Paul did not set his hope on his own strength, nor place his trust in earthly and human things. His sight was always set upon Christ and His kingdom. The Jews, however, were a remarkable contrast. They, too, were committed to a kingdom in this life-and-death struggle, but it was not the Kingdom of Christ. \nForty of these men swore an oath not to eat until they killed Paul (Acts 23:12). Translators render this phrase both as “oath” and “curse,” and it comes from the Greek word anathema. I’ve heard this word used in English for strong dislike (i.e., “After she stole my boyfriend at the party, she is anathema to me.”), but that’s such a sad watering-down of this big, meaty word. Anathema is a declaration, a curse, or vow that a thing is devoted to destroying (Numbers 21:2-3, Joshua 6:17). It is a thing accursed—something set aside because of moral worthlessness.\nIn fact, another place this word is used in the Bible is Peter’s third betrayal of Christ. Peter was using his strongest language to emphasize the distance between himself and Christ:\nThen he started to curse and to swear with an oath, “I don’t know this man you’re talking about!”\n-Mark 14:71\nIn His mighty grace, Christ forgave Peter. His forgiveness is so deep. But to plot evil is to seek death instead of life. The prophet Micah reminds us that to lie in bed at night and devise evil schemes is bad, but to wake up the next morning and vow to commit yourself to them is to make a covenant with evil (Micah 2:1). It’s like the difference between crimes committed in the heat of passion and a cold-blooded resolve to do evil. \nIn cold blood, these men took a vow devoting themselves to the destruction of Paul, believing it was for the good of society. This combination of spiritual blindness and self-reliance is deadly. They believed that if they didn’t act, justice would never be done. But trying to take justice into our own hands shows contempt for God’s providence. The plans of those forty Jews were foiled because they’d bound themselves to do evil, which is death itself.\nHow often do we believe that God depends on us to wrangle our version of justice in the world? Instead, we must depend on Him and His sovereignty. Let us bind ourselves to Christ and His Kingdom, not to death and anathema or by taking things into our own hands. God is sovereign, and His is the way of life.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram36s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 24:1-27, Jeremiah 29:10-14, Hebrews 13:15",
        "devo_title": "Journey to Rome",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Acts 24:1-27, Jeremiah 29:10-14, Hebrews 13:15\nOn my daughter’s dresser sits a white ceramic sheep that sat on my own dresser when I was about her age. The sheep is small—a couple inches tall—and sits on its bottom, straight-legged, like a person sitting on a floor. Its front legs are pointed up, two little sheep-feet wrapped over the top of a stack of small 1×3-inch cards, each displaying a Bible verse.\nI always loved that sheep. Even now, when I go in my daughter’s room, I can’t resist the nostalgic urge to slide the stack out of its arms and put a new verse on top, then slide it carefully back into place.\nThere is something strangely compelling about encountering a Bible verse in this happenstance sort of way—a momentary feeling of mystery that ignites when I come across a verse unexpectedly. I stare at it like a puzzle piece, wondering where and how its truth fits into my current circumstances. “What does it MEAN?” I wonder.\nPut me in a situation like Paul was in—standing trial before yet another ruler, facing yet another set of false accusations—and I’m sure to read into every detail. Conflict isn’t exactly my specialty, so I’d probably internalize it all, anxiously assessing how each and every factor affects my main character: me. Leaving the matter unresolved is my worst-case scenario. Uncertainty is my kryptonite.\nThis back-and-forth with Felix went on for two years (Acts 24:27). TWO YEARS. While I’m pretty sure the uncertainty alone would be enough to kill me, I don’t get the vibe that it kept Paul up at night. I’m not sure he even regarded uncertainty as uncertainty. In his monologue before Felix, Paul said, “I worship the God of our fathers, believing everything laid down by the Law and written in the Prophets” (Acts 24:14). It follows, then, that Paul knew and believed this little gem:\n“For I know the plans I have for you, declares the Lord, plans for welfare and not for evil, to give you a future and a hope.”\n– Jeremiah 29:11\nHere’s the difference between Paul and me (as if there’s only one): I believe God has good plans for me, but I assume His plans fall within the boundary lines of my own. In other words, God’s good plans for me are His expert version of my first draft. Paul knew better.\nThat little verse, presented all alone on the sheep’s card, is true because God’s Word is true. But in the context of Jeremiah 29, it is even better. That verse and those around it are God’s message sent to His people in exile through the prophet Jeremiah. We don’t have to zoom out very far to see that this message of hope from God to His people was not the quick, tidy bow we often make it out to be:\n“For thus says the Lord: When seventy years are completed for Babylon, I will visit you, and I will fulfill to you my promise and bring you back to this place. For I know the plans I have for you, declares the Lord… I will bring you back to the place from which I sent you into exile.”\n– Jeremiah 29:10-14\nSeventy years. That’s how long they’d be in exile—an exile that, according to verse 14, God sent them into. Were these the plans they were hoping for? Not likely. Were they a ridiculously good promise from their ever-faithful God? Absolutely. Their exile was not the end. \nPaul knew this, too. He knew Scripture is true—not in part, but in whole. He knew the gospel of Jesus is true—not in part, but in whole. Paul knew God is sovereign and good—not sometimes, but all the time. Not within the boundaries we give Him, but through all of history and time and space. Our hope does not die when our hands are chained or when life seems at a standstill. Our God is sure and faithful. \nPaul did not know how all the pieces would fit together, but he knew his exile was not the end. Because of Jesus, neither is ours. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram37s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 25:1-27, Acts 26:1-32, Proverbs 2:6-8, Psalm 37:28",
        "devo_title": "Paul Appeals to Caesar",
        "devo_summary": "\nBY Guest Writer\n\nText:  Acts 25:1-27, Acts 26:1-32, Proverbs 2:6-8, Psalm 37:28\nAt just the right time of day, my home floods with sunlight. There are only two front-facing windows downstairs, but for a few moments the sun angles in just right and, from front to back, there’s a rush of light across the house. It’s my favorite time of day. \nThis morning, I am sitting at our dining room table trying to sort through my workday needs (this post being at the top of the list). And in that stream of light, all I can see are the particles of dust floating, the worn edges of chairs and tables in the living room, and the small cobweb growing in the corner of the window. The light, beautiful as it is, reveals the grime. \nI’ve been busy, see, trying to do what I think God has called me to these days. I’m caring for the needs of my home and trying to figure out what my purpose is in this new foreign place we’ve moved to. I’ve been so preoccupied with learning to be faithful in these things, that I haven’t even noticed the cobweb in the corner of the window. But the light reveals my lack.\nNone of us likes to have our sin brought out into the light and revealed to ourselves, let alone to others.\nNo one wants to have that Paul-on-the-Road-to-Damascus moment, where the light as bright as the sun shone around him, pinning him to the ground, and delving into the darkest parts and intentions of his heart (Acts 26:13-14). But God once called the light good (Genesis 1:4), and we have to believe this is one of the reasons why. The light reveals what the night has hidden and brings to sight what has been forgotten. \nPsalm 37:28 says, “the Lord loves justice,” and I am a little like that. But mostly I love justice when it’s given to others. I squirm when I myself come under the light—my faults revealed and my sins displayed. I hate justice then. I feel the same about the dust particles and cobwebs as I feel about my propensity to doubt, to fear, to sin with my words and deeds. \nIn the light I am embarrassed, ashamed, and fearful of being found out. But God loves the light. \nAs we see in this passage, He wants His children to turn away from darkness and step into the light. The thing that makes us feel most naked and exposed is one of the things our God loves most—not because of the pain and discomfort we feel in the midst of it, but because it reveals our greatest need: God Himself. \nWhat is the light exposing in your life today? What dust particles and cobwebs have been lurking in the living room of your heart? What besetting doubts and fears have taken up residence in your soul? \nGod is preparing for you a Damascus Road experience, whether here or in eternity, in which every one of your thoughts and sins will be exposed. But He is also like the father of the prodigal son in this and in every moment: picking up His robes and running, undignified, toward His child who has come to his senses and come home (Luke 15:11-32).\nDon’t run from the light today, friends. Go stand in it, be blinded by it, and see the manifold magnificent grace of the Father who shines it on you. \n \nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, tweets @lorewilbert, and posts photos @loreferguson. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram38s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 27:1-44, Acts 28:1-10, Luke 12:4-7, Mark 16:17-18",
        "devo_title": "Paul Taken to Rome",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText:  Acts 27:1-44, Acts 28:1-10, Luke 12:4-7, Mark 16:17-18\nI don’t think Gladys and Ragamuffin #3 would have been friends. In fact, I don’t think they even knew each other existed or had anything in common, except for the fact that they were characters played in the same production of 42nd Street by the same actress—me. \nThey were polar opposites. Gladys was a seasoned Broadway showgirl, singing her heart out while teaching the lead how to tap dance. Ragamuffin #3 was an unnamed beggar, wearied by the Great Depression. I’d love to know what was running through the director’s mind as she cast the roles. When she spread out all of the submitted headshots and stared into those hopeful faces, I wonder what made her point to mine and think, Gladys! and… Ragamuffin #3.\nBackstage, my dressing room had two separate racks. Gladys’ was all sequins and show, while Ragamuffin #3’s was bare and battered. During the show, I’d shuffle behind the curtains to apply or remove lipstick, change and adjust wigs, and look down to make sure I wasn’t wearing tap shoes with my beggar’s clothes. Any small change could poke holes in the audience’s perception of the story, so it was up to me to make sure Gladys and Ragamuffin #3 didn’t meet during the show. \nIsn’t it funny how even the smallest details can create or destroy our perception? \nIf I take a seat in the audience of my own life, I begin to cast myself and my circumstances in the leading role. When I get a new job and move to a new city, I’m bathing in sequins for days. But when I’m tossing and turning, worrying about my relationships, I’m costumed in tattered old rags. \nI wonder if those aboard the ship in Acts 27 felt like they were auditioning for forgotten, unnamed roles. The ship was seemingly built to wreck, the storm to destroy, the disease to kill, the crew to die. Any audience member would assume they’d been cast and chosen for the role of suffering. And yet, our circumstances don’t write our story; God does. \nThe ship crashes on the island of Malta and the turning point is seemingly nowhere in sight, when Paul breaks out of character, shedding the costume of suffering, and healing those around him. Now, the curtain could fall here and tell the wrong story, encouraging us to serve from our suffering and applaud the go-getter. \nBut what if that’s not what God has for us here? What if Jesus wants to meet us backstage and between the curtains, past the crowd and the circumstances? I don’t think God spreads our faces across a board, separating His children into categories of “suffering” and “celebrating.” Instead, He just claims us as “His,” over and over again. We are a chorus of His beloved sons and daughters. \nWhen we let His truth about our identity create our perception, the focus is no longer the role of suffering or serving, but the One who combined the two on the cross. We need Ragamuffin #3 just as much as we need Gladys; but just as they are cast to tell a story, so are we. \nMay we renew our faith in the Director, and assume our appointed roles in the truthful pages of His gospel. Amen.\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram39s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 28:11-31, Isaiah 6:9-10, 2 Timothy 4:6-8",
        "devo_title": "Paul in Rome",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText:  Acts 28:11-31, Isaiah 6:9-10, 2 Timothy 4:6-8\nI recently came across a picture from my dad’s final months. He is wearing his hospital gown, sitting in the chair in his hospital room, and my three small children are sitting next to him, perched in a row on the window sil. Dad is grinning at them, eyes bright, and the kids are all carefree smiles and laughter, no idea the end was so near.\nWe visited him as often as we could back then, in the hospital and at home, stealing every moment with him we could get. And he was always glad to see us, drinking up our presence even on his hardest days. \nIt never occurred to me that he didn’t have to welcome us in. I never considered that the vulnerability of those final days was not just thrust upon him, but something he chose to embrace. We saw each day as an opportunity to be with him, and despite having every reason to opt out, he chose to see it as the same.\nThis last chapter of Acts does not tell us about Paul’s death, but we know he was eventually martyred in Rome. And we know this is how he spent his final years:\n“He welcomed all who visited him, proclaiming the kingdom of God and teaching the things concerning the Lord Jesus Christ with full boldness and without hindrance.”\n– Acts 28:30\nIf it were me, I think I would need a minute. All those years of faithfully preaching the gospel, traveling from city to city, raising up young churches and mentoring new pastors, not to mention being falsely accused and imprisoned time and time again for speaking the truth—after all that, I would view house arrest as an overdue opportunity for a long, well-deserved nap. Not Paul. Paul didn’t need a minute.\nPaul knew what awaited him.\nCould he see his martyrdom coming? Possibly. But he could definitely see beyond it. Paul wasn’t living for this vapor of a life here on earth. He was living for something bigger. Paul was living for the gospel. And here’s how he did it: he lived for the eternal by making the most of the temporary.\nThe apostle didn’t while away his time on earth just to get to the next chapter. He did something radical—he believed the good news was true and he lived like it.\n“From dawn to dusk he expounded and witnessed about the kingdom of God.”\n– Acts 28:23\nThe book of Acts reminds us that, like Paul, we are part of the biggest picture—we, the Church, are part of God’s story. This is our story, and Paul is our brother. But the call of this book is not to be like Paul. The call of this book is to be like Christ.\nJesus, too, looked beyond the present while embracing it. Jesus, too, poured Himself out “as a drink offering” to His final day (2 Timothy 4:6). But He did so much more. \nThe Christ who was the hope of the Apostle Paul is also our hope, having taken upon Himself all of our sin—past, present, and future—and suffered separation from the Father so that we might be reconciled to God (2 Corinthians 5:21). Then, having endured the punishment of death that was due us, He was resurrected, making us alive in Him (1 Corinthians 15:20, 22). And now—right now—He sits at the right hand of the Father, actively advocating on our behalf (Romans 8:34).\nThis Christ is our hope. \nYou and I are vulnerable like Paul. We, too, will have last days. But we can live those and all our days fully, joyfully pouring out every last drop, knowing that our hope in Jesus will never, ever end. Thanks be to God. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram40s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 20:32",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nPraise the Lord, the gospel is true!\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Pray this Scripture for a specific person in your life and for yourself:\n“And now I commit you to God and to the message of His grace, which is able to build you up and to give you an inheritance among all who are sanctified.”\n–Acts 20:32\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/SRT-Acts-Instagram41s.jpg"
    },
    {
        "book_title": "Acts of the Apostles",
        "devo_passages": "Acts 17:29",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we’ve read through Acts, we have been memorizing a 6-verse passage, Acts 17:24-29, one verse at a time. This passage is from Paul’s eloquent yet succinct presentation of the gospel to the Greek philosophers at the Areopagus. This week, we’ve come to the last verse:\nBeing God’s offspring then, we shouldn’t think that the divine nature is like gold or silver or stone, an image fashioned by human art and imagination.\n–Acts 17:29\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/07/4-Acts6.jpg"
    }
]