[
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 1:1-31, Exodus 19:5-6, James 1:18",
        "devo_title": "Christ the Power and Wisdom of God",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: 1 Corinthians 1:1-31, Exodus 19:5-6, James 1:18\nI work with a truly spectacular group of people, but we don’t always see eye to eye. \nJessica, for example, is fiercely protective of words, watching over grammatical details like comma placement and hyphen length with laser-like focus. Ryan, I’m convinced, will defend the creative integrity of the She Reads Truth brand as long as he has breath, and Abby has yet to sit through a meeting without bringing to our attention the needs and desires of you, the Shes who read Truth with us. We all have different jobs, and sometimes it is our job to disagree. \nRaechel and I learned this early on in working together, back when it was just the two of us: seeing things differently is a gift to be stewarded, not a tension to be avoided. Today there are eighteen of us at SRT headquarters, each bringing different skills and perspectives to the conference room table. But we are a team. We are here for each other, for the work set before us, and for you. Above all, we are here to hold out God’s Word and bring glory to Him. Our differences help, not hinder, this pursuit. \nIt’s easy for me to see God’s provision in the differences among our team members. But I’m embarrassed to admit that I often expect homogeneity in the Church. I find myself frustrated by our differences, bothered that we can’t all agree on large and small aspects of our faith and life as followers of Jesus. I’m saddened when these differences go beyond disagreements to cause division, and discouraged when these divisions are not easily overcome. I forget that God’s Word and perfect wisdom are not diminished by our limited understanding or altered by our various opinions. \nIn his letters to the church at Corinth, the Apostle Paul encourages this congregation of young believers to embrace their common and primary identity in Christ. He desires for them to know and act on the truth that “we were all baptized by one Spirit into one body” and “we were all given one Spirit to drink” (1 Corinthians 12:13). The image of the Church as one body appears throughout these letters, making clear Paul’s resounding declaration: We are many, but we are one in Christ. \nEven here, in the first chapter of 1 Corinthians, we can sense Paul fighting for the unity of the Church. His tone is somber, even harsh at times, because the topic is not casual; it is critical. God has welcomed us—different as we are, different as we are designed to be—into His family through the grace and power of Jesus Christ. He did not call us because we are wise or powerful or strong. Rather, Christ Jesus “became wisdom from God for us—our righteousness, sanctification, and redemption, in order that, as it is written: Let the one who boasts, boast in the Lord” (1 Corinthians 1:30-31). We are part of this fellowship by grace alone, and it is by grace that we live and grow in unity with one another.\nAs you read 1 & 2 Corinthians, ask the Holy Spirit to open your eyes to see the Church all around you. Ask Him to teach you more about Himself, His body of believers, and the truth of His Word. Like the church at Corinth, we come to this text from a colorful array of backgrounds, experiences, and traditions. But we have a Savior who binds us. May His mercy and grace unite us as we read. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day1-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 2:1-16, Romans 8:26-30, Ephesians 1:13-14",
        "devo_title": "Spiritual Wisdom",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: 1 Corinthians 2:1-16, Romans 8:26-30, Ephesians 1:13-14\nI recently listened to an interview with Jimmy Wales, the founder of Wikipedia. Wales said he started Wikipedia because he wanted to make information available to everyone for free. Today, I’m sure most of us with an internet connection have benefitted from Wales’s aspirations.\nWith Wikipedia, as well as countless other sites on the web, we can know almost anything about any person, place, or thing. It is the Information Age, after all. The Information Age has given us the illusion that we can know everything. It has given us the illusion that we no longer need to grapple with the unknown. And it’s tempting to believe that knowledge—the kind that’s available to us with the click of a button—is equivalent to wisdom.\nBut it’s not.\nIn 1 Corinthians 2, Paul writes about the difference between the wisdom of men and spiritual wisdom. The wisdom of men is “coming to nothing,” he says. “On the contrary, we speak God’s hidden wisdom in a mystery, a wisdom God predestined before the ages for our glory” (vv.6-7). \nPaul then explains that God’s wisdom is no longer hidden in mystery because it has been revealed to us by God’s Spirit. What is this wisdom? In short: “Jesus Christ and him crucified” (v.2). It seems so simple—too simple, especially in the Information Age—for the idea of wisdom to be boiled down to this one simple truth. And yet, this is what Scripture tells us.\nThe temptation is to fill up our minds with as much “wisdom” as possible. We gather knowledge in an attempt to be the smartest in the room and because we find security in thinking all of our questions can be answered with a Google search. \nBut spiritual wisdom frees us from relying on our own knowledge. It frees us from having to answer every question, and it opens up our lives to the power of the Spirit. In this, paradoxically, Scripture says we are able to “evaluate everything” (v.15). When we are not sure what to do, where to turn or who to talk to, we have the Spirit. When we are confused, disheartened, angry, we have the Spirit. And this Spirit is wisdom. This Spirit gives us more than the entire archive of Wikipedia ever could. It gives us “the mind of Christ” (v.16).\nDo you believe you have the mind of Christ? Do you trust the Spirit who has been given to you? Or are you still scrolling the internet looking for answers?\nKnowledge is a wonderful tool, and I am grateful to live in an age when we have such ready access to it. But no matter how much knowledge I acquire, it will never measure up to the Holy Spirit within me. That quiet, still, discerning voice. The very Spirit of God who gives me the very mind of Christ. \nLet us seek spiritual wisdom first. Let us ask the Spirit for guidance first. Let us cling to our hope that is not in knowledge or the Information Age, but in Christ Himself.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day2-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 3:1-23, John 5:24, Romans 5:1",
        "devo_title": "The Role of God’s Servants",
        "devo_summary": "\nBY Guest Writer\n\nScripture Readings: 1 Corinthians 3:1-23, John 5:24, Romans 5:1\nMy first year of high school, I was placed on the junior varsity cheerleading squad. This shouldn’t have been such a big deal. I was a freshman, after all. But most of friends had made it to the varsity squad, where the girls were clad in glittery uniforms, while the JV team only had t-shirts with iron-on decals. \nAt the first JV football game of the season, I tumbled across the track, throwing my back handsprings like a circus performer. I wanted to make sure the varsity cheerleaders knew a mistake had been made: clearly, they should have given me a spot on their coveted squad. When I got home that night, exhausted yet satisfied that I’d done the job, my mother let it slip that she’d “enjoyed the Claire show.” Her words stung, but I got the message. I was being prideful, and she’d seen right through my charade.\nWhen I think about pride, I often think about myself at that JV game. I was so convinced I deserved a position on the varsity squad that I spent the night showing off, rather than actually paying attention to the football game. After all, football was the whole reason we were there. The cheering was secondary.\nPaul calls out the Corinthians on this same kind of sophomoric pride. He calls out their useless squabbling over their allegiance to a teacher—as if by following Paul, they were more righteous than their friends who followed Apollos. Whether they knew it or not, the Corinthians had lost sight of the most important point of all—that is, Jesus—and had turned their focus completely on themselves. \nThat’s what pride does. It turns all of our attention inward. \nFor adult-me, self-pity is the most common form of pride. When I feel left out by a group of friends, the sadness that creeps up isn’t just sadness at the rejection; it’s also a prideful entitlement, which shouts, I should have been invited! Pride can hide in our allegiances—to particular brands, particular books, particular ways of eating, thinking, or voting. Rigid loyalty to anything other than Christ should alert us to destructive pride hiding beneath the surface.\nPaul criticizes the Corinthians for falling victim to that distraction, and he doesn’t mince words. He calls them babies! He says they’re acting like typical, worldly people. And I wonder, Am I really all that different from them?\nPerhaps my cheerleading story is a silly example, but I think it applies. When it comes to Christianity, what am I holding onto that is secondary to the gospel of Christ? Do I take pride that I’m a part of a certain Bible study, small group, or online devotion series? Do I feel hurt to be left off of a specific worship team? Do I have allegiance to a certain writer, church community, or social-justice mission? \nThose things are all well and good. As Paul says, they might be part of the house we’re building, but they will never be the foundation. The gospel is never Jesus and—it’s only Jesus. When it comes to our faith, Paul calls us to let go of everything that’s not Him.\nWe are not typical; we are temples. The Spirit of God lives in us (1 Corinthians 3:16-17). And as such, we need no ornaments. We need no special brands. No special invitations. No special groups or labels. No allegiances to a specific preacher. The foundation is Jesus. Anything else can stay or go; only our pride tells us otherwise.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day3-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 4:1-21, Zephaniah 2:3, 1 Peter 5:5",
        "devo_title": "The Faithful Manager",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 4:1-21, Zephaniah 2:3, 1 Peter 5:5\nYou don’t have to have a Bible college diploma hanging on your wall. You don’t need a passport stamped from developing countries. Your name need not appear on the official list of staff members for your church. Plant your feet firmly in this truth: If you are a follower of Jesus, you are already a minister for the gospel. Because the stakes are high, this reality can paralyze us. We throw around words like “calling” and “ministry” so often, but we secretly suspect we’re somehow doing it wrong. \nWhile confirming our assignment to be followers and leaders, Paul invites us to rest in this call. He offers us a two-word job description for ministry here in 1 Corinthians 4, inviting us to throw giftedness, opportunity, and needs into a pot, and boil ministry down to its very essence. What is ultimately required of us as ministers? To be “servants of Christ and managers of the mysteries of God” (v.1).\nWe are “managers of the mysteries of God.” Gulp! That sounds weighty, but in the same passage, Paul warns us “not to go beyond what is written” (v. 6). In other words, stick with Scripture. The mysteries of God we’re responsible to carry are the good news of the gospel and the Word of God. \nEvery believer—from the youngest to the oldest among us, both Bible scholars and Bible newbies—is a carrier of the good news with a shared responsibility to know and proclaim the Word. Paul is urging us, as disciples in ministry, to think of the Bible like a treasure. And it is! Like finding a cache of jewels buried in the backyard, we didn’t create this treasure, yet we get to claim it as our own as we carry it and deliver it to both the fellow believers and non-believers we rub elbows with each day. \nGod’s Word is a treasure because it reveals who God is. He is supreme, sufficient, spectacular, and in the full-time business of saving us from our sin. This cannot help but bend our knees and turn our hearts. As we steward God’s Word, we step into the other shoe that comes with ministry; we become servants. \nWe are willing to serve Christ’s Church because of all He has done for us. We are willing to serve those who don’t know Him by sharing who He is. We are willing to serve each other because we know now, deep in our guts, that none of us deserves a seat at this table. The chord we are bound to is grace, and it makes us want to share it in abundance with one another. \nRegardless of your day job, no matter what titles you hold, and in spite of your sin and failures—you are a minister of the gospel if you are in Christ Jesus. His grace is your qualification. So serve faithfully and joyfully the God “who will both bring to light what is hidden in darkness and reveal the intentions of the hearts. And then praise will come to each one from God” (v.5). Amen.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day4-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 5:1-13, Leviticus 18:8, Galatians 6:1-10",
        "devo_title": "Church Discipline",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Corinthians 5:1-13, Leviticus 18:8, Galatians 6:1-10\nAre you shocked when you read the latest news headlines? According to Paul’s letter to the Corinthian church, we shouldn’t be surprised at all by the terrible acts of the world. After all, if a man is not anchored in Christ, why should he walk in the way of Christ? Why wouldn’t his every action ultimately come from greed and selfish ambition?\nPaul tells us there is a fundamental difference between Christians and the world. We are fully changed by Jesus, and therefore, we are measured by a different stick altogether. Everywhere you look, the world is going to cheat and deceive, but why not? If we do not know Christ and are not changed by Him, there is no reason not to cheat and steal if we can get away with it. But as Christians we claim the name of Christ, and He has changed our hearts. We have every reason to choose what is right, even when no one is looking. And not only do we have reason, we have a responsibility. \nIn 1 Corinthians 5, Paul takes on the topic of immorality with the Church, and he does not do so casually. Sin among members of the body of Christ affects the whole body of believers. “Don’t you know that a little leaven leavens the whole batch of dough?” Paul asks, an undeniable urgency in his tone. Though he is not with them in person, Paul is “present in spirit,” and he demands his brothers and sisters act in a manner worthy of Christ’s sacrifice (v.5). He asks them to remember their new measuring stick: the gospel and grace of Jesus.\nSo what are we to do with those in the world who don’t know Jesus, and who continually and exuberantly choose what is evil? Paul addresses this, too, explaining that it is God and God alone who judges (1 Corinthians 5:13). \nIt’s such a relief that it’s not our job to busybody around and judge the world for doing exactly what the world is wont to do. God will judge. Instead of our judgment, God is calling us to give our energy and “not [tire] of doing good” (Galatians 6:9). We can share the gospel and we can do good, but there’s no need for us to hustle our judgment on the world—it’s not even our job.\nAnd what about our brothers and sisters in the faith who do wrong? According to Scripture, reconciliation is the goal. Listen to these fiercely kind words from Galatians:\nBrothers and sisters, if someone is overtaken in any wrongdoing, you who are spiritual, restore such a person with a gentle spirit, watching out for yourselves so that you also won’t be tempted. Carry one another’s burdens; in this way you will fulfill the law of Christ.\n—Galatians 6:1-2\nLook out for each other! “As we have opportunity, let us work for the good of all, especially for those who belong to the household of faith” (v.10). Have zeal for doing what is right, restore your Christian brothers and sisters with patience, and do not grow weary in your work of doing good. The Lord transforms His children, and He makes them fit for the task.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day5-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "Romans 5:1",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY Ellen Taylor\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nTherefore, since we have been declared righteous by faith, we have peace  with God through our Lord Jesus Christ.\n—Romans 5:1\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day6-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 1:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY Ellen Taylor\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 1 Corinthians.  \nGod is faithful; you were called by him into fellowship with his Son, Jesus Christ our Lord.\n—1 Corinthians 1:9\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/4-12Corinthians-1-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 6:1-20, Matthew 18:15-20, Titus 3:4-7",
        "devo_title": "Glorifying God in Body and Spirit",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: 1 Corinthians 6:1-20, Matthew 18:15-20, Titus 3:4-7\nLast August, I started snapping photos of waiting rooms in doctors’ offices. In an attempt to manage my pre-medical exam nerves, I snapped the first picture in an empty, grey walk-in clinic during my lunch break. I assured myself that when I walked out of the room and closed the door, I’d look back at the picture on my phone and laugh at how silly my fear was.\nAlmost a year later, I’ve amassed quite a collection of waiting room images. I still have the strange spasm in my shoulder that causes pain and is now considered chronic, at least by those doctors. It keeps me up at night, and hurts most while doing the work I love and feel called to—namely, writing. This year has brought more questions than answers, leaving me insecure about my pain. In the end, I feel like my body is more a vessel of shame and weakness than a temple of praise.\nIn some ways, our bodies ache with sin and pain. Our muscles, memory, and metabolism may fail us. Our bodies betray us with limits, and we betray our bodies when we disregard those limits. All this brokenness is an ever-present reminder of Christ’s body broken for us, our sin, and our shame.\nThe apostle Paul tells us we’ve been washed, sanctified, and justified “in the name of the Lord Jesus Christ and by the Spirit of our God” (v.11). Therefore, because of Christ’s sacrificial death and resurrection for us, our bodies are no longer our own; they were bought with a price. “So glorify God with your body” (vv.19–20).\nPaul tell us to flee from sexual immorality, to not be mastered by anything, to avoid legal disputes with one another—all in an effort to glorify God. Without the context of Jesus, this can begin to sound like a legalistic to-do list. But as theologian Henri Nouwen says, “The church is not an institution forcing us to follow rules but a community inviting us to still our hunger and thirst at its table.” \nIn 1 Corinthians 6, we find ways to still our hunger and thirst (1 Corinthians 4:11), but when we try to do so without filling them up with heavenly things instead, our bodies still feel like empty vessels of shame. Jesus is the only one who can truly fill us up and sustain us. When we turn to Him, we’re reminded that it was His body that was broken, His blood that was shed, for us. \nTo glorify God with our bodies means to place physical trust in His plan to bring redemption to our brokenness. It means taking part in the groans of humanity and the painfulness of sin. It means remembering His promises to bring wholeness and healing now, even if we don’t know when it’s coming. \nAcknowledging our aches and limitations is at the heart of what it is to be a child of God. He is all that we will ever need to withstand our heartache, pain, and sin. In our weakness, His power is perfected, and He is glorified (2 Corinthians 12:9). \nWe are not our own. We are His glory vessels. Thanks be to Him.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day8-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 7:1-40, Genesis 2:24",
        "devo_title": "Principles of Marriage",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Corinthians 7:1-40, Genesis 2:24\nAlmost half of marriages end in divorce, and the average length of a marriage that ends in divorce is only eight years (according to 2014 US census data). Eight years! It’s shocking that we stand up and promise “‘til death do us part,” yet only half of us make it past eight years. Marriage is hard. And indeed, the skills necessary to simply get along long-term with other people, not just spouses, are really difficult to come by. When we concede that marriage doesn’t have to last, we also allow that friendships don’t need to last. When the going gets tough, it’s just so much easier to find new friends and start over. Except it’s not.\nOn paper, marriage is an unachievable task. Paul commands wives to submit to their husbands, and then he turns to the husbands and piles onto the first unbelievable task this astonishing humdinger: “Husbands, love your wives as Christ loved the church” (Ephesians 5:22-25). In one fell swoop, it seems Paul is making an open-and-shut case that marriage is just never going to work. He even follows this up by saying, essentially, marriage is too much for him, and he’s chosen to keep out of the fray; and if anyone else has the constitution for it, they should stay unmarried also (1 Corinthians 7:8).\nBut here’s the problem: not everyone has Paul’s self-control, and instead we, ahem, “burn with desire” (v. 9).  We fall in love, and that love leads us to make wildly extravagant promises to each other. We promise, in our best clothes, in front of all our aunts and uncles, to love and honor one another for the rest of our lives. These are the bravest, most ridiculous promises I’ve ever made.\nI want to write a book titled, ’Til Death Do Us Part, and Other Lies I Told While Wearing a White Ball Gown. Because even though I’ve been married for thirteen years, have I truly kept my wedding vows? Have you? Even before we’d driven off into the sunset, I had already broken my vows. My heart was full of love, but my soul was still inclined to offer my new husband far less than the love I’m called to give. But that’s really the whole point. And that is why marriage is a covenant. We make extravagant promises that we cannot keep, but God keeps His promises. He created marriage and designed it to last. \nGod has called us to live in peace (v. 15), and it’s His peace that makes it possible for us to do so. I can rely on Him. He keeps His promises. He is there in the ceremony, walking through the covenant just like He did in the Old Testament. He makes our covenants, and He keeps up both ends of the deal. May we look to Him to preserve our marriages, our friendships, and our families. He is the One who takes our brave words made on brave days and makes them come true.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day9-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 8:1-13, John 10:14, 2 Timothy 2:14-19",
        "devo_title": "Food Offered to Idols",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 8:1-13, John 10:14, 2 Timothy 2:14-19\nI love the phrase “read the room.” I distinctly remember the first time it became a phrase our friend group started to use. We were hanging out, reacting to a situation that had not gone the way I’d hoped it would. Some folks in the room were making light-hearted remarks, and I started glowering at them. READ THE ROOM, I thought, not even bothering to veil my frustration. I was hurting, and they didn’t see it. The words might not have been directed at me, but I was intensely vulnerable. \nPaul is helping the Corinthians navigate a similar sort of tension in this passage. Someone has asked Paul a question: Is it okay for Christians to eat meat that has been previously sacrificed to pagan idols? In Corinth at the time, most meat available had been used as part of temple sacrifices. So Corinthian Christians were wondering if it was okay to eat that meat, whether they purchased it in a market or were dining with non-Christian friends. \nPaul’s answer is pretty straightforward. Basically, if you’re asking this question because you’re a Christian, then you know that idols are nothing, so it would be totally fine because “all things are from him, and we exist for him” (1 Corinthians 8:6). But it’s not really about you, Paul explains. “Not everyone has this knowledge,” he says, so “be careful that this right of yours in no way becomes a stumbling block for the weak” (vv. 7,9). The warning Paul gives here isn’t about eating meat; it’s about how knowledge leads to pride and a feeling of superiority over weaker brothers and sisters in Christ. It’s about reading the room. \nFor some new Christians, eating meat that had been sacrificed to an idol would have been difficult. Paul says it could “wound their weak conscience,” which is a sin against Christ (v.12). If Christians who were still a bit unsteady in their faith saw more mature Christians eating sacrificed meat, it could cause confusion. Those who had been tempted to pray to pagan idols in the past might be tempted to see the meat as something more than it was, while to more mature, discerning eyes, it was just meat. \nPaul gives the Corinthians, and us, a basic template for answering this and similar questions: put others first. Let your conscience be guided by whatever is best for your brother or sister in Christ. Throughout 1 Corinthians, Paul makes this point that we are to act in love, care for others, and live in the freedom of Christ that allows us to put others first. \n“Read the room” is a sarcastic, modern phrase that reminds us that there are others present. Paul is much more winsome, but no less pointed, in reminding more mature Christians that there are new believers watching, learning from them. This reminder is poignant for me as well. I’m often tempted to be sarcastic, to push the boundaries of humor, or cross other lines that might be confusing for non-believers or new Christians.\nBut putting my witness to Christ first and caring for those around me requires that I live differently. It requires that I always read the room, and know that how I act, speak, and treat others reflects my identity in Jesus. Paul says that if meat were to cause a brother to stumble, he would never eat meat again. I pray for that sense of discernment in my own life. I long for a careful, caring heart like Paul’s and, even more so, for a heart like Christ’s.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day10-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 9:1-27, Matthew 15:11, Romans 15:17-19",
        "devo_title": "Paul’s Example",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 9:1-27, Matthew 15:11, Romans 15:17-19\nI was a gangly eighth grader with the athleticism of an opossum. As one does in middle school, I signed up for the track team strictly because my friends had done the same. There was not a cell in my hormonal body that wanted to run the four-lap race assigned to me. I lumbered to the starting line hauling a bundle of nerves and a posture of defeat. \nThen… Bang! The starting pistol fired, and we began circling the track. As I crested the final turn of my third lap, I noticed a few frontrunners were crossing the finish line a full lap ahead of me. Hungry for glory, I sealed my fate in the Track Hall of Shame. I squared my shoulders and crossed the finish line in style, confident no one would notice I still had a lap left to run. \nAssuming I’d successfully cheated my way onto the winners’ platform, I celebrated my victory. It was a brief moment of glory followed by a humiliating spectacle of defeat. As the last of the runners crossed the finish line, I felt a tap on my shoulder. \n“You,” said a man with a stopwatch in his hand. “Run your last lap.” I ran the final lap of the race on an empty track. It was the opposite of a victory lap. \nSuch is the image Paul paints for us. As disciples and disciple makers, we are runners on the track of faith. God’s truth is a baton that has been passed from Abraham to Isaac, to the apostles, to Paul, to us. We are pushing toward the prize of making Christ known. Yet, it’s easy to forget what we’re doing here. We’re so often distracted by the crowd in the stands or the other runners pumping and huffing beside us. Paul reminds us that those sideways glances can cost us the victory. \n\n“Do you not know that in a race all the runners run, but only one receives the prize? So run that you may obtain it. Every athlete exercises self-control in all things. They do it to receive a perishable wreath, but we an imperishable. So I do not run aimlessly; I do not box as one beating the air. But I discipline my body and keep it under control, lest after preaching to others I myself should be disqualified” (vv. 24-27). \n\nThe apostle isn’t writing about salvation here. No amount of training or self-discipline could earn us that. Salvation is ours forever because of Christ’s work, not ours. But, let’s be honest; it’s possible to be saved, but not sowing. To be redeemed, but not reaping. To be an ambassador of faith, but not a good one. It’s possible to run the race of faith, but not run it well. \nPaul’s obsession with the gospel (vv. 15–18) is what glued his eyeballs to the finish line. He could face criticism, hardship, and scarcity, and still keep running because allegiance to the gospel was the medal he imagined hanging around his neck. \nSince we don’t want to cross the finish line with heads hanging in defeat, how do we keep our own eyes on the prize? Like a runners cadence, we repeat. . . \nIt’s about the gospel.\nIt’s about the gospel.\nIt’s about the gospel.\nLet us keep running!\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day11-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 10:1-32, 1 Corinthians 11:1, Exodus 13:17-22, Philippians 2:1-2",
        "devo_title": "Warnings from Israel’s Past",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 10:1-11:1, Exodus 13:17-22, Philippians 2:1-2\nWhen I was a little girl, I loved doll babies. I’m sure I’m not alone here, but I will admit that my affection for the plastic figures may have been a little extreme. I didn’t have any sisters, and my one and only brother is six years older than me. So in a lot of ways, my dolls were my friends. I’d spend hours dressing them, teaching them, taking them for walks. I sat them in circles for storytime, and made sure they were “fed” before bedtime. They were special to me, and although I had way more than I needed, I still longed for the latest, prettiest, most updated versions available. And I never wanted to share any of them, with anyone. \nI remember one particular day at my grandparents’ house, a new friend was visiting. As usual, I was busy playing with the set of babies my grandparents purchased just for their house. I was doing what brought me joy, and it never occurred to me to share. Before long, my grandfather casually said, “Wynter, which doll can your friend play with?” Unsurprisingly, I refused to part with any. \nIt’s easy to think back on this story and see my actions for exactly what they were: selfish. My loving grandfather would have been completely justified in taking each of my dolls from me. After all, my actions had proven me to be undeserving. But in his love for me and his desire to see my heart changed, he did not take my dolls. Instead he pulled me close and explained how my lack of care for another person had not only hurt someone else, but had also disappointed him.\nWhen our Heavenly Father notices our selfishness, He gently reminds us of what real love actually looks like. In 1 Corinthians 10, the apostle Paul says, “No one is to seek his own good, but the good of the other person” (v. 24). We have all been blessed by God’s matchless goodness. Jesus didn’t just give up a part of what He had every right to hold onto. Instead, He gave it all, His very life. \nJesus’ choice to pursue goodness for everyone is the ultimate measure of seeking goodness for another. May we imitate His love because He first loved us.\nIf then there is any encouragement in Christ, if any consolation of love, if any fellowship with the Spirit, if any affection and mercy, make my joy complete by thinking the same way, having the same love, united in spirit, intent on one purpose.\n—Philippians 2:1-2\n\nWynter Pitts is the founder of For Girls Like You, a resource ministry for both tween girls and their parents. The mother of four girls herself, Wynter’s mission is to empower and equip women of all ages in becoming who God created them to be, and to support parents in raising strong Christ followers. She is the author of several books, including You’re God’s Girl Devotional and She Is Yours: Trusting God As You Raise the Girl He Gave You.  Wynter, her husband Jonathan, and their daughters (ages 7-13) live in Dallas, Texas. Follow her on Instagram @forgirlslikeyou.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day12-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Timothy 2:19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nNevertheless, God’s solid foundation stands firm, bearing this inscription: The Lord knows those who are his, and let everyone who calls on the name of the Lord turn away from wickedness.\n—2 Timothy 2:19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day13-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 6:19-20",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a reminder that Christ’s sacrifice for us includes the entire self—body as well as soul. \n Don’t you know that your body is a temple of the Holy Spirit who is in you, whom you have from God? You are not your own,  for you were bought at a price. So glorify God with your body.\n—1 Corinthians 6:19-20\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/4-12Corinthians-2-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 11:2-34, Matthew 26:26-28, Romans 3:25-26",
        "devo_title": "The Lord’s Supper",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Corinthians 11:2-34, Matthew 26:26-28, Romans 3:25-26\nIn an early episode of I Love Lucy, Lucy is pregnant, distracted, and she hasn’t fixed Ricky dinner. The poor man is irritated, miserable, and hungry. He declares his need for steak and potatoes, but with time running short, Lucy counters with a fried egg sandwich—and he scoffs at this paltry offering. At this point, my husband and I had to stop the episode and look at each other: “He literally can’t make food for himself? She’s had a busy day and he won’t accept a simpler meal?” The difference between the dinner expectations of 1952 television husbands and 2018 television husbands are surprisingly different.\nThe cultural expectations for the roles of men and women have changed even more dramatically since Paul wrote this letter to the Corinthians. Paul’s instructions about head coverings and spheres of authority make us a little uncomfortable. But head coverings for women were pretty normal, even as recently as 100 years ago. Just because our husbands can make their own dinner and we wear our hair in loose, glorious ringlets, doesn’t mean we’re getting it exactly right. It just means we happen to be the generation walking around right now. It doesn’t make us smarter or better equipped to appreciate authority than generations past.\nWho should be making dinner? And who’s hair should be blowing in the breeze? It’s tempting for us to get caught up here in these little brambly questions but miss the important issue here of authority. Who is our authority? First, you know what my answer will be: Christ is the Lord of creation, the Lord of men, women, communities, families. All authority has been given to Him on heaven and on earth. So, if you had any adorable delusions whether the ultimate authority is your own self, or the president, or your two-year-old, put them to rest. There is one final authority.\nThis same Lord of all, the ultimate authority, yielded up all on our behalf, giving His very body and blood to rescue us from just condemnation.\n\n“On the night when He was betrayed, the Lord Jesus took bread, and when He had given thanks, broke it, and said, ‘This is my body, which is for you. Do this in remembrance of me.’\nIn the same way also He took the cup, after supper, and said, ‘This cup is the new covenant in my blood. Do this, as often as you drink it, in remembrance of me.’ For as often as you eat this bread and drink the cup, you proclaim the Lord’s death until he comes” (1 Corinthians 11:23-26).\n\nThe question of authority comes down to yielding our own will to the will of someone else. When we eat and drink “in remembrance of” Him, do we truly yield our all to Him? Do we remember the glory He laid aside for us, or do we seek our own glory? When we hold back in order to honor ourselves—seeking our own will, based on our own understanding—the result is the same as it was in Corinth: divisions arise, each man seeks his own gain, and some fall to excess, while others are neglected.\nHe served us dinner and washed our feet, without hesitation and without reservation. And for the meal before Him, which signaled His own agonizing death, He gave thanks. Our hearts ought to be full of thanksgiving in turn, full of a desire to serve and honor others. When we see the world as Christ’s, we can make the dinner, we can love our neighbor, we can honor our husbands, we can yield to God’s will for us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day15-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 12:1-31, Romans 12:4-5, 1 Thessalonians 5:19-21",
        "devo_title": "Unity and Diversity in the Body",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: 1 Corinthians 12:1-31, Romans 12:4-5, 1 Thessalonians 5:19-21\nMusic and theater were a big part of my upbringing. My sisters and I were not the most athletic kids, so choir, voice lessons, and musicals were our sport. I was never really content with just being a member of the choir, or a background part in a musical. I always wanted the solo or the lead.\nPerhaps there was a church member or two in Corinth who felt the same way. Maybe they were trying to steal the show, or maybe they were trying to prove their gifts were better than someone else’s. Paul enters and tells them that as believers, we operate as one unit, not solo performers. We are all members of one body, and “the body is not one part but many” (1 Corinthians 12:14).\nEven though I said goodbye to my music and theater days long ago, I still struggle with this truth. I still want to stand out. I still want the “best” gifts. I still crave that recognition. (My family didn’t nickname me “Drama Mama” for nothing.) But if we look at what I Corinthians 12 really says about our gifts, we see that it has little to do with our individual talents, and much more to do with the way they unify us as believers.\nThe variation of gifts in Christian community highlights our need for one another. Where I am weak, another member of the body is strong. Where someone else is weak, I am strong. Individually, we can only go so far with our own gifts. Together, we are a full cast, the complete body of Christ. This makes us able to serve our community, one another, and in turn, bring glory to God. Our gifts serve a greater purpose: unification.\nAs Paul explained, “Now there are different gifts, but the same Spirit. There are different ministries, but the same Lord. And there are different activities, but the same God activates each gift in each person” (vv. 4-6). The emphasis here is on what’s the same about us, not what’s different. We all have the same Spirit. We all have the same Lord. We all have the same Father.\nThe Church is at its best when we operate as one unit, not as talented individuals trying to outshine each other. When we operate as a unit, we reflect Christ,  “[f]or as the body is one and has many parts… so also is Christ” (v.12).\nIn spite of my desire for the spotlight, I am learning that the Christian life is not always a loud one. What we do in love and service to our Lord may not always have an audience. So much of this journey is spent using our gifts in quiet ways that may not bring us individual attention, but will bring balance and unity to the body—this is how our gifts were intended to serve.\nMay we stop running after the spotlight and find contentment working backstage. May we seek unity above our own glory, and may we be grateful for diversity in the body and all the gifts of the Spirit bestowed on us by the Father.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day16-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 13:1-13, Ezekiel 20:35, Galatians 5:5-26",
        "devo_title": "Love, the Superior Way",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 13:1-13, Ezekiel 20:35, Galatians 5:5-26\nLove, as framed in 1 Corinthians 13, was framed for me as a child of six. It was a perfect square made of 15 smaller squares, each cross-stitched in pastel blues and pinks and yellows. I stared at it for hours of my childhood because it sat above the baby grand piano at which I endured years of piano lessons. \nEvery week I would stare at those squares in the dim light of my piano teacher’s studio and count with the metronome until I could leave. It’s no wonder she told my parents I was a hopeless case and to put me in soccer or horseback riding when, after four years of lessons, I was still incapable of playing the most rudimentary scales. I wasn’t listening to a word she said. But I still remember the cross-stitched squares perfectly today. \nI don’t know about you, but love is hard for me. Love as a noun is okay. It’s very ethereal and nebulous and conjures up good feelings, emotions. “Love is love,” is what the cool kids are all saying. Okay, well… yes, but milk is milk and books are books and, of course, a thing is what it is. But what does that mean? Love as a noun is something, yes, but love is so much more than the smell of a newborn, or the flutters of a new relationship, or the feeling you have toward street tacos or 230-calories-per-serving ice cream or getting the thing you want. Love is so much more and so much harder than those things. It often feels more like a tone-deaf person practicing scales than it does anything sweet or nice or pastel.\nIf I’m honest, real love (the kind Paul writes about in this chapter) sounds like a symphony I’m never going to be able to play. It sounds beautiful and hopeless at the same time. I am never going to be capable of being perfectly patient, perfectly kind, perfectly without envy or boasting. I can barely bear some things, but how could I possibly bear all things? If what Paul is talking about is the definition of love, I’ve been practicing for a long time, and I need to find another hobby.  \nThe comfort of this chapter, for the ones who are as hopeless about love as I am, is further down: “Now I know in part; then I shall know fully, even as I have been fully known” (v. 12, emphasis mine).\nThe harmony of these two sections clue us in to the true meaning of this text: just as my knowledge is partial, my love is partial. But just as I am fully known, I am fully loved. By whom? By the only One whose love is perfect. By the only One whose love is perfectly patient, perfectly kind, perfectly able to bear all things, believe all things, hope all things, and endure all things. There is only One who has endured all things, and this is Christ. \nPractice will not make my love perfect or even easy in this Christian life, no matter how hard we run our scales. Discipline is good and sanctification is sure; kindness will come more easily, patience more freely, but still imperfectly. But Paul assures us our dim sight won’t last forever and the scales will someday fall. Even still, “these three remain: faith, hope, and love” (v. 13). One day we will see fully and be seen fully by the greatest of all these—Love Himself, Jesus.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day17-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 14:1-39, Exodus 25:8, 1 John 4:1-3",
        "devo_title": "Gifts from the Holy Spirit",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: 1 Corinthians 14:1-39, Exodus 25:8, 1 John 4:1-3\nIn a few short weeks, my husband and I will board a plane to China to bring home our son. We’ve never met in person. He’s seen photos of us, and he knows to call us “Mama” and “Baba.” But he doesn’t know us, not really, nor do we know him. Yet God has tethered our hearts to one another in a way I think I may not fully understand this side of eternity. God has made us a family even now, before we’ve met, and that is a fact that overshadows all others. \nI’m nervous about bringing our boy home. I’m excited, overjoyed, in tears with anticipation; but the unknowns that lie ahead make my chest tighten. I have to remind myself to practice what I learned when waiting for our first three children to arrive: Breathe. Just breathe. \nI wonder how he’ll adjust to his new home, to his big sister and big brothers, to his two big dogs and the cat and the chickens in the backyard. I wonder how he’ll take to American culture and American food. But lately, I’m most nervous about the language. He speaks Mandarin; we speak English. Will we be able to communicate? Will he understand our botched renditions of “I love you” and “You are our son” and “It’s okay” in his native tongue? \nHow and what we communicate to our son matters. Everything we say, from playful banter to earnest conversation, should flow from our love and desire to care for him. Our words are rooted in the fact that we are family. \nWhen Paul addresses the gifts of the Spirit in 1 Corinthians 14, specifically the gifts of prophesying and speaking in tongues, he says some things that are tough for our modern ears to understand. But if we look at the chapter as a whole, we can see a theme emerge: “Seek to excel in building up the church” (v. 12). In this lengthy chapter, Paul acknowledges that the Holy Spirit is real, that the Spirit indeed gives gifts that can only come from God, and that these gifts are good and God-honoring. But in the same breath, he offers a warning about how these gifts are to be used—and, as importantly, why they are to be used. According to Paul, the reason is more straightforward than we might expect: “Everything is to be done for building up” (v. 26). \nThe Church, the body of believers, is God’s dwelling place on earth. Just as God’s presence filled the tabernacle in the Old Testament, His Spirit fills those who have put our faith in Jesus. The way we conduct our worship and our gatherings matter because God is in our midst, and “God is not a God of disorder but of peace” (v. 33). Furthermore, our interactions and our meeting together ought to be governed by unity, not discord. We are a family—a family established by God Himself. Our words and actions are rooted in this eternal truth. \nThe diversity within the family of God is a beautiful, purposeful thing. May the Holy Spirit that binds us make our hearts tender toward our fellow family members, seeking to love the Church and build her up in all we say and do. May we worship in a way that causes the unbelievers in our midst to proclaim, “God is really among you.” \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day18-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 15:1-19, Ephesians 2:4-7, Hebrews 2:5-9",
        "devo_title": "Essential Resurrection",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 15:1-19, Ephesians 2:4-7, Hebrews 2:5-9\nI thought I was going to be a lawyer when I grew up. I wanted to be a doctor for the longest time, but once I got to high school and realized science was not my strong suit, those dreams flew swiftly out the window. Being a lawyer was the next best option; I enjoyed reading and writing, and history was my best subject. And, as my parents would tell you without hesitation, I could pick an argument with anyone over anything, and I usually won. I presented many cases to my parents over the years, from bedroom renovations to puppies, and everything in between.\nIn 1 Corinthians 15, Paul is making a case for the resurrection of the dead. Paul accuses some of the Corinthians of saying there is no resurrection of the dead: that is, once Christians die, they will not be raised with Christ. Paul then argues that if they believe in the resurrection of Christ, then they must also believe in the resurrection of the dead. Paul’s argument is not to prove that Christians will be raised in resurrection with Christ, but to say that the people who deny the resurrection of the dead are wrong. His argument forces the Corinthians to come to the realization that there is, in fact, hope for the future resurrection of those who believe in Christ.\nPaul’s argument to the Corinthians is fit for a trial court. He’s making them decide whether or not they actually believe what they say they do. Paul reminds the Corinthians that “Christ died for our sins… that he was buried, that he was raised on the third day according to the Scriptures” (1 Corinthians 15:3-4). Paul challenges the Corinthian church to remember what they say they believe, because if those things are not true, then all of their proclamations are in vain.\nThis passage is one that is read often at funerals and memorial services of loved ones who have passed away. It’s comforting to think about the resurrection in the face of death. It grounds us, reminds us of who we are and where our true home lies.\nToday, let this passage remind you of the power and might of a God who sent His Son to die for us, and raised Him on the third day so that we, too, might live with Him in eternal resurrection. We should put our faith and our hope in this God, the God who “raised us up with him and seated us with him in the heavens” (Ephesians 2:6). Our citizenship does not belong here on earth, but to the new heavens and new earth that come with the resurrection. Thanks be to God.\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of iced coffee, ugly dogs, and the Oxford comma. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day19-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "Ephesians 2:4-5",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n But God, who is rich in mercy, because of his great love that he had for us, made us alive with Christ even though we were dead in trespasses. You are saved by grace!\n—Ephesians 2:4-5\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day20-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 12:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse describes the unity we have in the Spirit.  \nNow there are different gifts, but the same Spirit.\n—1 Corinthians 12:4\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/4-12Corinthians-3-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 15:20-58, Philippians 1:12, 1 Thessalonians 4:17",
        "devo_title": "Victorious Resurrection",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: 1 Corinthians 15:20-58, Philippians 1:12, 1 Thessalonians 4:17\nTexans are obsessed with our state flower, the bluebonnet. Bluebonnets are wildflowers that bloom in early spring. For several weeks each season, they line our interstates and take over our fields. They are a sudden flower, nowhere to be seen for months and months and then, suddenly, they are everywhere. They don’t space out their arrival. It feels like they decide to bloom all at once. And overnight, Texas is a sea of blue.\nThis is why I was surprised to learn that if you want to plant bluebonnets to bloom in the spring, experts suggest planting the seeds in late summer or early fall. Though it looks like the wildflowers appear overnight, they are actually growing beneath the soil for months.\nI thought of the bluebonnets while reading Paul’s words in 1 Corinthians 15, when he compares our resurrection to seeds being sown: “So it is with the resurrection of the dead: Sown in corruption, raised in incorruption; sown in dishonor, raised in glory; sown in weakness, raised in power; sown a natural body, raised a spiritual body” (vv. 42-44). In the resurrection, we will be completely transformed, and Paul says this change will happen suddenly, “in a moment, in the twinkling of an eye” (vv. 51–52).  \nMy temptation when reading these words is to look forward to the change to come, and ignore my need to change now. Great, I think, in the end when I am resurrected, all will be well. I will be the person I was made to be. I, and the entire world, will be restored and redeemed.\nBut the last verse of this chapter suggests another way to think about this sudden change. Paul says, “Therefore, my dear brothers, be steadfast, immovable, always excelling in the Lord’s work, knowing that your labor in the Lord is not in vain” (v.58).\nThe instruction isn’t, “Therefore, sit back and relax, it’ll all be okay in the end.” The instruction is, “Therefore keep working, steadfastly, immovably, excelling at the Lord’s work because none of this is in vain.” The change to come will seem sudden, but really, just as the bluebonnet is sown in fall to bloom in spring, we will have been working toward change all along.\nThis is incredibly convicting for me. This is incredibly convicting for the church. We have been sown, and now we must do the hard work of growing. This is the Lord’s work: we care for the poor. We work toward reconciliation. We confess. We repent. We forgive. And we do all of this now because we know it is not in vain. What the Lord plants, He will grow. The work He begins, He will complete (Philippians 1:6).\nSo today, may we look toward our final resurrection, made possible through the resurrection of Christ, with great hope. But let’s not allow our hope for the future to distract us from the work at hand. There is much to do. Therefore, let’s be steadfast, immovable, and excel at the Lord’s work on earth, knowing we may not see all the fruit of our labor now, but all will be in bloom when the trumpet sounds.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day22-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 16:1-21, Leviticus 23:15-22, Deuteronomy 31:6-8",
        "devo_title": "The Lord’s Work",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 16:1-21, Leviticus 23:15-22, Deuteronomy 31:6-8\nAlmost everybody works in some way. Whether we’re raising kids, conducting high-powered business meetings, teaching in a classroom, or polishing nails at the local salon, most folks know what it’s like to have a job. You know what’s frustrating, though? Doing a ton of work, but having no idea what’s expected of you. This is what the apostle Paul is trying to avoid in his letters to the Corinthian church. \nThe Corinthian church was multicultural, multiethnic, and socioeconomically diverse. It seems the only thing everyone in this group of folks had in common was their decision to follow Jesus. I’m guessing the members of this community had their work cut out for them! Not only were they charged with the tasks of being the salt of the earth and the light of the world, but they also had to figure out how to live and work together in order to present themselves to Christ and to the world as a unified body—not an easy undertaking.\nPaul is aware of this, and so, in a way, the book of 1 Corinthians serves as a job description for the early Church. The apostle makes clear what is expected of the community of believers who bear the name of Jesus Christ, and in the very last chapter, he closes with highlighting three growth areas for the Corinthian church. \nGenerosity. Paul is encouraging this church to share liberally from their financial resources to support the church in Jerusalem, which was experiencing difficult times. Note this: he didn’t ask the Corinthian church as an institution to support the Jerusalem church, but instead asked each person to set aside a portion of their income for the cause, every week. And if you earned a higher income, you were expected to give more.\nHumility. Paul acknowledges four leaders who should be honored because of their work in the Lord. For Paul, honor and submission go hand in hand; you honor others by submitting your will to theirs. \nLove. Paul commands, “Do everything in love” (v. 14). The motive for every word and every action should be love. It’s love that compels Paul to labor for the sake of the gospel, and it’s love that prompted him to write this letter to the Corinthian church in the first place.\nGenerosity, humility, and love. What do these three have in common? They are major attributes of Jesus Christ, the common denominator in the Church. Jesus was generous to humankind, becoming poor so that we could become rich. He humbled Himself by obeying the Father, even to the point of death. Jesus’ love was so great that He laid down His life for those who were His enemies. \nThis is good news for us! Just like the Corinthians, working as a unified Church is tough. But thanks be to God that we’ve got clear expectations lined out for us in God’s Word. And not only that—we have a perfect example in Jesus Christ, who sent the Holy Spirit to empower us to be the people God has called us to be.\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day23-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 1:1-24, 2 Corinthians 2:1-4, Isaiah 40:1-2, Romans 5:8-10",
        "devo_title": "The God of Comfort",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: 2 Corinthians 1:1-24, 2 Corinthians 2:1-4, Isaiah 40:1-2, Romans 5:8-10 \nOf all the people excited about my parents moving into a new house, I wasn’t one of them. Although I live in an entirely different state, hours away, I was under the impression that my mom and dad would live in the house I grew up in for the rest of their lives, tending to my childhood belongings and keeping our memories safe. But ultimately, that wasn’t the best plan for them, and while I understood that, I didn’t want to accept it.\nAll I could think about was how their new house wouldn’t have the staircase I’d walked down while wearing my high school prom dress, the room where my brother learned to play the trumpet, or the end of the driveway where the school bus used to wait for us. It wouldn’t have a hidden nail polish stain on the bedroom carpet, or our cat’s favorite spots to lie in the sun. It wouldn’t have neighbors who stopped by on birthdays or just because, and it certainly wouldn’t have an address already known by heart.\nAnd yet, after the moving trucks had gone and the boxes had been unpacked, I visited my parents’ new house and was surprised to find it less empty than I’d imagined. Inside, I was greeted by a hallway of family photographs, the scent of my favorite brownies wafting through the air from the kitchen, and the cat snuggled up and basking in the sunlight. Sometimes, comfort comes with us. God’s presence always does, that’s for sure.\nMany times, it’s easy to forget that we don’t face suffering alone the way Christ did. Because of His sacrifice, we get pain and comfort in equal proportion, not one without the other. “For just as the sufferings of Christ overflow to us, so also through Christ our comfort overflows” (2 Corinthians 1:5).\nSuffering may bring us to new places we’d never choose to go, but God’s comfort promises to follow. It may not take away all the pain or change the situation entirely, but it does something even more significant: it reveals to us God’s heart for His people, His love for us. He didn’t want us to know the wrath of pain without knowing the eternal promise of its relief. Comfort reminds us of the end game of eternity. It acknowledges God’s power and ultimate plan to set things right again.\nMay God’s comfort be the thing to rearrange our afflictions and lift us to joy. May the promises of His tenderness meet us in our griefs and sorrows, disappointments and not-yets. May the kindness of His character find us and make even darkness an occasion to seek light. And may we feel at home and at rest in His comforting presence. Amen.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day24-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 2:5-17, Matthew 6:14-15, Colossians 3:12-17",
        "devo_title": "A Sinner Forgiven",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 2:5-17, Matthew 6:14-15, Colossians 3:12-17\nFor weeks, I have grappled with these passages in 2 Corinthians. Forgiveness is such a complicated, messy, and integral part of the Christian faith. And if I’m honest, I don’t know if I understand how it works, or whether I’m practicing it well in my life. \nWhen I really let myself think about forgiveness, it touches raw nerves. It calls up painful memories of the times I’ve been hurt, and the times I’ve done the hurting. And that doesn’t feel good. In fact, I’d rather just forget about those parts of my life and move on. \nBut contrary to popular belief, Jesus does not call us to “forgive and forget.” Christian forgiveness does not require rose-colored glasses or some “spiritual” version of denial. What it does require is faith that if Jesus has carried the weight of our sin, He can also carry the weight of our wounds.\nGod doesn’t minimize our offenses. He doesn’t wave them away with a magic wand of denial. Nor does He offer empty cop-outs. Instead, He enacted an eternal, and costly, plan to set things right. \nThe God-man of great sorrow, Jesus, was well acquainted with the evil of this world (Isaiah 53:3), and He refused to ignore it. Instead, He chose to bear the debt on His own back. Knowing that God could not be in the presence of unholy people, Jesus put on our unholiness and gave us His perfect record in return. The sin was heavy, and Jesus carried it, though He didn’t resent us while carrying the cross. He didn’t wait for us to ask Him to do it, either. He forgave us before we even knew we needed forgiveness—because He loved us first. \nAs impossible as it sometimes feels, we are called to emulate Christ. “For to God we are the fragrance of Christ among those who are being saved and among those who are perishing” (2 Corinthians 2:15). Still, forgiveness is not easy. It does not eliminate pain. Forgiveness is an active, voluntary choice to carry the weight of someone else’s sin. It does not guarantee that we will be reconciled to that person, nor that the relationship will ever be the same. Forgiveness says, “You no longer have to make up for what you did to me. I will carry the cost.”\nBut I’m not Jesus. So even my ability to forgive is imperfect. One of Jesus’ disciples once asked whether it was fair to forgive someone seven times, and Jesus replied,\n“I tell you, not as many as seven… but seventy times seven” (Matthew 18:22).\nI don’t believe that is a call to be abused over and over again by the same person. In my life, that has meant actively forgiving someone for the same crime, even as I find myself feeling resentful again. When the bitterness returns, I can choose to let that old wound fester, or I can put on the salve of forgiveness. There may still be a scar, but I am no longer keeping the wound open in order to prove how much I’ve been hurt. \nWhen forgiveness is hard, faith reminds me to focus less on what someone did to me, and more on what Jesus did for me. It is in that posture of humility that I can bring my wounds and my sins back to the feet of Jesus. It is there that He reminds me that even when my suffering feels heavy, He is the one who ultimately carries it all.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day25-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 3:1-18, Jeremiah 31:31-34, 1 John 3:2",
        "devo_title": "Living Letters",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 3:1-18, Jeremiah 31:31-34, 1 John 3:2\nAs someone whose greatest love language is words of affirmation, handwritten letters are a huge deal to me. My mom put a note in my lunchbox every day when I was growing up. My friends and family wrote letters to me before I left to study abroad for a semester. And my best friend knows that the quickest way to brighten my day is a quick note delivered with a fresh cup of coffee. I keep a box of letters from loved ones on my desk to read when I’m having a hard day. They have brought me encouragement in my darkest moments, reminding me that I am loved and cherished.\nIn the days of the early Church, letters served an even greater purpose than they do now. Letters functioned similarly to recommendation letters written for employment or educational purposes; they were vouchers for people when they entered into new churches and new communities. \nWhen I was applying for graduate school last spring, I toiled over choosing the professors and mentors who I would ask to write my recommendation letters. I wanted to make sure they had the best impression of me. I wanted to be confident I was worthy of their recommendation, that the letters they sent to admissions offices would include the best version of me I could present. And so I sent those professors my most stacked resume and the best version of my application essays. In short, I wanted to prove I was good enough—both to the people writing my recommendation letters, and to the people who would read them.\nWhen Paul tells the Corinthians that they are Christ’s living letters, he’s reminding them of their identity as the people of God. He’s reminding them of who they are, of their identity as the body of Christ. He’s reminding them that the Spirit of God has written the law of love on their hearts, doing away with the old covenant and making way for a brand new one: the covenant they can be part of because of Christ Jesus. Our recommendations and our accolades don’t hold any weight in the new covenant because “our adequacy is from God” (2 Corinthians 3:5). Our worth and our confidence are in Christ Jesus—not in ourselves, nor in the things that are praised by others.\nWe, too, are able to be a part of this new covenant—the covenant that replaced the law of Moses and gave us the ability to act in boldness. This covenant gives us life, hope, and freedom.\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of iced coffee, ugly dogs, and the Oxford comma. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day26-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "Deuteronomy 31:6",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“Be strong and courageous; don’t be terrified or afraid of them. For the LORD your God is the one who will go with you; he will not leave you or abandon you.”\n—Deuteronomy 31:6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Corinthians-Shareimage-Day27-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 1:5",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse emphasizes our unity with Christ in both joy and sorrow.\nFor just as the sufferings of Christ overflow to us, so also through Christ our comfort overflows.\n—2 Corinthians 1:5\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/4-12Corinthians-4-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 4:1-18, Romans 6:5-7, 2 Timothy 4:3",
        "devo_title": "The Light of the Gospel",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 4:1-18, Romans 6:5-7, 2 Timothy 4:3\nMy husband and I have a saying in our home, “Fidelity (or faithfulness) to the Word of God and not to an outcome.” We say it to one another and to others often, because the truth is we are often more interested in controlling the outcome of a situation than we are in abiding by the Word of God. \nWe want success.\nWe want freedom.\nWe want peace.\nWe want “the scoop.”\nWe want to be seen rightly.\nWe want to defend our actions.\nWe want time to ourselves.\nWe don’t want to confront sin.\nWe don’t want to do hard things.\nWe don’t want to be held responsible.\nHow then, we usually find ourselves asking, can we get the desired outcome out of any situation? \nI don’t think we’re alone in this. It’s human nature to spin the story, cast blame, make excuses. From the beginning of time, cunning words have been practiced and God’s words have been tampered with (Genesis 3). All it takes is a cursory glance around at the state of the Church, the government, family, and my own heart to see the practice of cunning words abounding and God’s Word still being tampered with. We are all playing chess with people, circumstances, God’s Word, and His timing—trying to get the outcome we desire or avoid the outcome we don’t want. \nWithin today’s passage, this is what strikes me most about Paul’s words to the Corinthians: “For we are not proclaiming ourselves but Jesus Christ as Lord, and ourselves as your servants for [Jesus’] sake” (2 Corinthians 4:5). The main thing we’re doing when we try to control the outcome, hide the truth, and circumvent the hard things, is proclaim our own glory and significance. We’re trying to make ourselves look good, look right (or at least less wrong). We’re trying to raise ourselves in the estimation of others. \nBut look again at what Paul tells the Corinthians: “God, who said, ‘Let light shine out of the darkness,’ has shown in our hearts to give the light of the knowledge of the glory of God in the face of Christ Jesus” (v. 6). This is a powerful picture, if we pay attention. \nGod’s glory (Christ Jesus) shines into our hearts (darkened by sin and brokenness), giving us the light of knowledge. As we’re tying ourselves into knots trying to control the narrative and the outcome, God is shining the light of Jesus into our dark hearts and giving us knowledge, the very thing we lack. (For if we had it, there would be no need to feel anxious about outcomes, because we’d always make the perfect decision.) And what knowledge is this? Look back to the beginning of the chapter: \n“Therefore, since we have this ministry because we were shown mercy, we do not give up. Instead, we have renounced secret and shameful things, not acting deceitfully or distorting the word of God, but commending ourselves before God to everyone’s conscience by an open display of the truth” (vv. 1–2). \nDo you want to walk in all of life with a good outcome? Do you want to be above reproach? A worshiper of the one true God? A humble, faithful, kind, gentle person? Let the light of Christ Jesus shine on your darkened heart, the one more prone to seeking out its own way than making way for God. And, having walked faithfully and according to God’s Word, let others see the outcomes in your life as they truly are—as someone holding fast to God’s truth, not their own, whose heart is alight with Christ Jesus—even if the outcomes of your life look foolish to the world. Your fidelity is to His Word and His will first.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day29-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 5:1-21, 2 Corinthians 6:1-2, 1 Thessalonians 4:13-18, Titus 2:11-14",
        "devo_title": "Our Future After Death",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 2 Corinthians 5:1-6:2, 1 Thessalonians 4:13-18, Titus 2:11-14\nLast summer, we ventured out west where we spent about a week sleeping in a tent with our five children. Driving from Washington back home to Tennessee, we passed the base of Mt. Rainer, the Grand Tetons, and other increasingly brave and out-of-the-way places. As we were driving through the Yakima Valley one evening, we realized it was late and getting dark, and we hadn’t settled on a place to set up camp for the night. And so we stopped along the Naches River on an abandoned stretch of highway with tall hills on both sides of the camp.\nBy this point we had a travel system in place; everyone knew their job, so we all worked together quickly to set up our tent. Once we’d settled in, we realized we were not alone. Just a stone’s throw away, tucked behind the sagebrush, cooking hot dogs over a fire, was Frank. I helped the kids play/bathe in the river and helped them to some supper, while my husband, Caleb, introduced himself. Frank lived in his tent full-time and had a lot of really good ideas for long-term, electricity-free refrigeration. We exchanged kindnesses and small gifts, and fell asleep in our respective tents. For us, that night was the bravest, most rugged camping we’d ever logged. But for Frank, it was just a Tuesday. \nI love the hope that Paul gives us in this passage from 2 Corinthians, because no matter how comfortable or uncomfortable we are in our earthly tents, they will all be packed up and folded away someday. Because of Jesus, this is not our home. The Father “made the one who did not know sin to be sin for us, so that in him we might become the righteousness of God” (2 Corinthians 5:21).\nPaul acknowledges that we are groaning in our earthly bodies, some of us living with pain that won’t go away until Jesus comes. Some of us carrying a weight of sadness that makes us long to go home. No matter what kind of tent we are living in, it will be destroyed.\nThe thought of my own death fills me with concern for my children. But setting that hefty thought aside and clinging to the truth Paul is teaching in this passage, I see that our earthly death means the ending of a short, uncomfortable camping trip, and the joy and relief of finally going home—where things are clean and warm and beautiful, and there’s good food and good company. But we have never seen it. So we hold on to our tents, even though they are fraying and growing holes and starting to let the rain in. These tents are awesome, don’t get me wrong. But they are not the final stop. In the meantime, Paul says, we sit in our tents and we groan.\nBut Paul exhorts us, “So we are always confident and know that while we are at home in the body we are away from the Lord” (2 Corinthians 5:6). While we are still here on earth in these awesome and leaky bodies, biding our time, we have the mighty hope of our future eternal home with Christ. During these camping days, we aim to be pleasing to Him and long for the day when He will finally bring us home.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day30-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 6:3-18, 2 Corinthians 7:1, Ezekiel 37:26-28, Philippians 2:12-13",
        "devo_title": "God’s Ministers",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 6:3-7:1, Ezekiel 37:26-28, Philippians 2:12-13\nSalt and light, stewards and servants—these are among the descriptors used to define the people of God. Like so much about faith, they feel like square pegs that refuse to be shoved into the round holes of the world’s expectations. \nAnd yet, these are more than pretty platitudes. Church, this is who we are. This is how God’s Word calls us to live. Having our paradigm for identity and success shifted so radically by the gospel can feel disorienting. There’s a temptation to use all the wrong litmus tests to gauge if we’re getting it right. In our homes and our churches, our culture and our community, how can we know if we’re building a ministry without fault? If success cannot be measured in accolades and “Atta girls!”, what rewards are given to faithful servants? These questions make me grateful that Paul provides us with a new set of gold stars to aspire to from today’s reading in 2 Corinthians 6. And they are: great endurance, purity, truthful speech, and the power of God (vv. 4, 6-7).\nPaul identified these as hallmarks of a ministry no one could fault (v. 3). He surely knew a thing or two about measuring ministry successes all wrong. His former colleagues in the religious elite considered his ministry a heresy. His fellow Christ-followers often questioned his methodology. Even his co-laborers questioned his decision-making on occasion. Yet, we find in Paul a minister unmoved. Though still sinful, Paul was steadfast. Paul knew why he ministered (to spread the gospel), and he knew how to measure his success. This, friends, is liberation. \nWe, too, are free to stop measuring our success as Christian parents by how our children behave in any given moment. We are free to stop considering the wishes and whims of culture as an indicator of the Church’s effectiveness. We are empowered to use our gifts to share the gospel and build up the body of Christ without fretting if no one seems to notice. We are set free from the doubt that inevitably comes when we worry God has our ministry under a microscope. \nSince none of this can be measured by human standards, we are free to throw out the measuring stick altogether. When we look to God alone to reward our faithful service, we find that He is the true reward. “For it is God who is working in you both to will and to work according to his good purpose” (Philippians 2:13). \nThe invitation Christ extended from the cross must bleed over into our concept of successful ministry. Christ does all the heavy-lifting, and thus He deserves every iota of glory. Our job is so simple in return. We keep serving, never tiring of doing good. We keep clinging to God’s Word, refusing to let other voices pollute the truth we know. We keep telling the truth, again and again and again. We keep bragging on our weaknesses, confident in how they bend the spotlight away from us and toward the indisputable power of God. \nSuccessful ministry rarely looks like we think it should. Paul reminds us that this, too, is grace.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day31-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 7:2-16, Lamentations 3:19-24, Acts 3:19-20",
        "devo_title": "Joy and Repentance",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 7:2-16, Lamentations 3:19-24, Acts 3:19-20\nHave you ever been confronted by somebody when you knew you were in the wrong? As a counselor, there have been many times when I’ve witnessed a spouse calling out their partner for some glaring, painful sin. When this happens, I’ve consistently seen one of two reactions take place: ownership or defensiveness. It’s hard to hear the truth about ourselves. To not only stare our failure in the face, but also have somebody else observe it too, can feel shameful. \nWhether we respond with ownership or defensiveness is a matter of the heart. Of course, all of this is presuming the confrontation takes place in a godly manner. I’m not talking about unhealthy conflict or persecution that is neither godly nor loving. But when our flaws are confronted or even rebuked in love, as Paul did with the Corinthians, how we respond shows what we believe about the gospel. Are we going to allow the Spirit to convict our hearts, or are we going to cover our ears and point the blame elsewhere?\nWhile it’s scary to admit we don’t have it all together, when we do acknowledge our sin we can turn toward Jesus in repentance and know we are forgiven. When our sin saddens us, we experience “godly grief,” which “produces a repentance that leads to salvation without regret, but worldly grief produces death” (2 Corinthian 7:10). \nThis is a heart pain we will never regret. If we’re not torn up by our brokenness, we won’t understand how badly we need to be saved from ourselves. As Jesus said, “It is not those who are well who need a doctor, but those who are sick. I didn’t come to call the righteous, but sinners” (Mark 2:17).\nIf we’re honest, it’s exhausting, trying to “manage” our sin and remain pure in our own strength. Luckily, it’s okay to admit we’re a mess! If we didn’t have a forgiving God, that would be a different story. But Scripture tells us that “if we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness” (1 John 1:9). Because Jesus’ sacrificial blood covers us so completely, the Father will never again look on us with anything but steadfast, unwavering love.\nWe can take responsibility for our wrongdoing because our God is outlandishly gracious. Of course, we shouldn’t abuse the Lord’s grace by purposely sinning (Romans 6:1–4). But when we do fail, we can remember the story of the prodigal son returning home and his forgiving father running toward him, arms opened wide to welcome him (Luke 15:20).\nIn the same way, our Father in heaven runs to embrace His returning daughters. When the Spirit convicts our hearts, we ought to lean in to that godly grief with nothing to fear in Christ. Our sins are already forgiven in the finished work of Jesus. When we turn to God in repentance, we are returning our gaze back to the One who longs to be gracious to us and show us compassion, over and over again (Isaiah 30:18).\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day32-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 8:1-24, John 1:1-3, Philippians 2:4-11",
        "devo_title": "The Collection",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 8:1-24, John 1:1-3, Philippians 2:4-11\nI like to think I’m a generous person.\nI happily give to people and causes that matter to me. My family supports campus ministers, international children’s relief organizations, and our local church. We donate stuff we don’t want or use anymore. We pat ourselves on the back, sometimes share on social media, and then go on our merry way. It doesn’t hurt, and it makes us feel good. But are we generous? \nHere’s what we really are: comfortable givers. \nPaul is writing to comfortable givers in this chapter of 2 Corinthians. He is fundraising for the Jerusalem fund, a task he mentions throughout his letters as he travels and writes to various Gentile churches. Specifically, he is asking Gentiles (non-Jewish converts to Christianity) to send money for the poor in Jerusalem (likely Jews), which Paul references in Acts 24:17. \nIn 2 Corinthians 8, Paul tells the wealthy Corinthians about the overflowing generosity of the poor Macedonians for the Jerusalem fund. “They begged us earnestly for the privilege of sharing in the ministry to the saints,” he writes of the Macedonians’ eagerness to give (v. 4). \nIn essence, Paul is describing the Macedonians with an unnatural equation: severe trial + affliction + extreme poverty = abundant joy + wealth of generosity. \nThis equation can only be true in the math of mercy. Paul has no shame about telling the Corinthians how generously the Macedonians have given, and that he expects them to do the same. He is asking them for money—and a lot of it—using words like “surplus” and “generous.” \nBut here’s why it seems Paul isn’t afraid to ask for money, why he is bold in telling the Corinthians just how much the Macedonians sacrificed to give: because we learn to give from the great giver Himself, Jesus. Paul is reminding the Corinthians—and us—that when we believe in Jesus, our hearts are molded in the shape of His. “For you know the grace of our Lord Jesus Christ: Though he was rich, for your sake he became poor, so that by his poverty you might become rich” (2 Corinthians 8:9).\nWe love because Jesus loved us first (1 John 4:19). We give because Jesus gave everything for us and to us. And so we don’t just give money; we give ourselves. This can look like radical or everyday hospitality—acts of service on a grand, public scale, or little ones like changing the millionth diaper or washing yet another dish, simply so someone else doesn’t have to. \nGenerosity isn’t a series of acts or financial decisions. Generosity is a posture, a way of living in the way of Christ. Generosity is worship, an act done in response to the ultimate generosity of our living King Jesus. We don’t give or act generously to feel good or to check a box. We give to respond to Jesus. We give to break our hearts of their grip on material, physical comfort and let them reset in the shape of Jesus’ perfectly generous heart. \nWe live in a world of self-care and me-time and “treat yo-self.” We are entitled to comfort, or so we believe. When the Bible’s call to radical generosity rubs up against our idol of comfort, it should chafe a little. As members of Christ’s church, we’re called to be more than just comfortable givers. We look to Jesus and we see everything poured out for us. And becoming like Him, as we endeavor to “adopt the same attitude as that of Christ Jesus” (Philippians 2:5), means pouring everything out for Him.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day33-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "Lamentations 3:22-24",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBecause of the LORD’s faithful love\nwe do not perish,\nfor his mercies never end.\nThey are new every morning;\ngreat is your faithfulness!\nI say, “The LORD is my portion,\ntherefore I will put my hope in him.”\n—Lamentations 3:22-24\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day34-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 5:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a summary of the gospel of Jesus.\nHe made the one who did not know sin to be sin for us, so that in him we might become the righteousness of God.\n—2 Corinthians 5:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/4-12Corinthians-5-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 9:1-15, Psalm 126:1-6, Hosea 10:12",
        "devo_title": "Motivations for Giving",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 9:1-15, Psalm 126:1-6, Hosea 10:12\n“Jesus talked about money more than any other topic!”\nGrowing up, my dad issued this statement every time he spoke about stewardship. I have no idea if he was actually right—I have never tallied up the passages myself—but he was certainly on to something. Jesus was, without a doubt, concerned about our possessions. Between His parables and His one-on-one interactions, Jesus often addressed wealth, greed, investment, and stewardship. Whatever the precise frequency may have been, Jesus talked about money a lot.   \nIn 2 Corinthians 9, Paul seems to pick up where Jesus left off. He is bold and unashamed in instructing the Corinthians to give. His tone is straightforward, and He seems totally unembarrassed by the indelicate topic of money. \nThe combined witnesses of Jesus and Paul remind us of an oft overlooked truth: how we talk about money matters. God doesn’t simply want us to give; He wants us to do it for the right reasons, and to think about our finances in a holy way. Along those lines, Jesus and Paul both steer us away from two common errors in our language about finances. \nThe first error is thinking of our finances as private. When it comes to money, many of us have a hands-off approach; we don’t want to be told what to do with it. I have heard stories of church attendees walking out of the service, never to return again, simply because the sermon was about stewardship. Money is a touchy subject, and as a result, pastors can be skittish about discussing it. Some even apologize to their congregations on the rare occasion that they do address finances.  \nPaul, on the other hand, is unapologetic. He does not mince words when he warns, “Whoever sows sparingly will also reap sparingly,” (v. 6). Based on passages like this one, it’s impossible to read Scripture and conclude that our money is nobody else’s business. God is not ambivalent about our wealth, but instead lays claim to it, so we cannot balk when our church community invites us to be generous.\nThe second error in our thinking about money is that of the prosperity gospel. This error gives inordinate attention to wealth, and it worships a transactional god whose grace is something we earn. The prosperity gospel interprets Paul’s words in a materialistic way, promising that if you give your money away, you are guaranteed to make much more in return.\nPaul’s words in 2 Corinthians 9 seem especially vulnerable to the distortion of prosperity preaching, since he promises “whoever sows generously will reap generously” (v. 6). However, what distinguishes Paul’s message from the prosperity gospel is motivation. The prosperity gospel is motivated by material gain, whereas the “cheerful giving” that honors Christ is motivated by gratitude. Put another way, we express our gratitude to God by being generous with others, just as He is generous with us. \nWhat is interesting about these two errors is that they produce the opposite effect. One discourages us from talking about money, while the other over-emphasizes it. But Scripture offers a third option. We can and should talk about money, but in the right way and for the right purpose: to the glory of God, the love of others, and the good of the world. \nIn truth, our finances are really not our own. They are God’s resources, which we are called to steward well. “And God is able to make every grace overflow to [us], so that in every way, always having everything [we] need, [we] may excel in every good work” unto to Him and for His glory (v. 8).\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She blogs at SheWorships.com, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day36-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 10:1-18, Jeremiah 9:23-24, Ephesians 2:8-9 ",
        "devo_title": "Paul’s Apostolic Authority",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 10:1-18, Jeremiah 9:23-24, Ephesians 2:8-9\nMany of us who engage with social media have seen it: folks emboldened by relative anonymity in the virtual world of the internet, or by the perceived distance from those with whom they interact. On social media a person can have a mouthful of opinionated vitriol to spew, but face-to-face they’re silent as a lamb. Those folks have what kids today call “Twitter fingers” (derivative of the phrase “trigger fingers”), a term used to describe someone who is always at-the-ready to take a proverbial “shot” at someone else on social media, while hiding behind an online persona or handle.\nI wonder if the Corinthians church thought Paul was guilty of the same kind of communication. His letters to them are certainly stern and authoritative, but in person, the apostle seems a good bit more tame. But Paul doesn’t take their accusations lying down. In 2 Corinthians 10, he fires back at the Corinthians’ claims, saying they are off-base because they are judging strength and boldness in the same way the world does. The world expects strength and authority to manifest as brute force or powerful, charming speech, but Paul argues that those things are inferior to the spiritual authority he’s been given in Christ. The apostle’s strength and authority are waging war in the spiritual realm—where the real work is done.  \nPaul’s words are strong, and they should be! He should speak as strongly as possible because he’s asserting that his authority comes from the Lord! It was by God’s power that Paul was even able to evangelize and establish the Corinthian church in the first place. It was because of the Lord’s grace that Paul had the strength, wisdom, and patience to have a shepherding presence for their community. \nThe Corinthian church had it all wrong. They thought Paul couldn’t support such bold words with action, and therefore, his spiritual authority shouldn’t be taken seriously. In truth, they should’ve been more eager to submit to his leadership because his authority was manifested with demonstrations of spiritual power. In fact, their own Christian lives were the fruit of Paul’s boldness and authority.\nFriends, I think the same is true of us. Yes, we’re supposed to be marked by our meekness and gentleness and patience, but let’s not mistake those characteristics for weakness. On the contrary, when we’ve cultivated the fruit of the Spirit of God, we are actually reflecting the God of heaven and earth more accurately. We don’t have to be the best speaker, the most outgoing, or the smartest person in the room to move and act in the power of the Spirit. I’d argue that the less emphasis we put on our own strength to win the favor of people, the more we rely on the Spirit of God to empower us to be the people God has called us to be. That way, whenever victory is won, all glory goes to God! \nSo be encouraged, and don’t worry about impressing others. Let us boast in the power of God instead, which lives in each one of us (2 Corinthians 10:17). May we be quick to boast of knowing Him, enjoying Him, being found in Him, and loved by Him (Jeremiah 9:24).\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day37-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 11:1-33, John 3:29, Revelation 19:7-8",
        "devo_title": "Paul’s Sufferings for Christ",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 11:1-33, John 3:29, Revelation 19:7-8\nStrong. It’s not a word I would typically use to describe myself in the classic sense. I’m rather small and hold limited muscle on my frame. I don’t exercise intensely, and frankly, I prefer rest and relaxation to exercise and exertion. What’s true of me physically is mirrored in my mental life. I’m a go-with-the-flow kind of girl with just enough “go” to make things happen, if needed. Striving and goal-setting aren’t ideas that get me too excited, and they definitely aren’t words that come out of my mouth with joy. \nWhen I’m operating at my best, I’m moving methodically, without too much urgency and typically without any real sense of the final destination. I prefer to envision the next stop along the path. And that is why it is absolutely hilarious when I’m asked, often, how I’ve accomplished what I’ve accomplished.  \nOver the years, I’ve met with success professionally. I’m now asked to speak and share my story of perceived success and strength with others. But what they are seeing isn’t me at all. They are witnessing the Lord’s hand in my life, and He has given me more strength than I could have ever imagined. God alone has grown and sustained the work in my life. At times it’s tempting to believe the hype myself and to focus on my accomplishments. Even to boast in them. But taking even a moment to dwell on these thoughts would be short-sighted and misguided.\nIn 2 Corinthians 11, Paul is sharing his temptation to do this very thing—to boast in his own strength. Some believed he was inferior to the “super apostles,” false prophets who were attacking him in order to discredit the gospel of grace Paul was preaching. \nIn a rebuttal of sorts, Paul begins to share his resume: his status as both an Israelite and servant of Jesus, whose accomplishments and suffering for the cause of Christ would supersede most anyone’s in his time and in ours. He brings up his shipwreck, his floggings, and the dangers he endured for the sake of the gospel. But just when you think he’s going to give the final uppercut, he flips the script and says:\nIf boasting is necessary, I will boast about my weaknesses.\n—2 Corinthians 11:30\nIn this chapter, Paul creatively reminds himself, the Corinthians, and us, that boasting of anyone or anything other than Jesus is foolish. Any boasting we partake in should point to God’s power and grace. Paul’s perspective brought him back to gratitude for our Savior. Finding Jesus in our weaknesses should do the very same thing for us. All glory and all praise belong to Him alone.\n\nWynter Pitts is the founder of For Girls Like You, a resource ministry for both tween girls and their parents. The mother of four girls herself, Wynter’s mission is to empower and equip women of all ages in becoming who God created them to be, and to support parents in raising strong Christ followers. She is the author of several books, including You’re God’s Girl Devotional and She Is Yours: Trusting God As You Raise the Girl He Gave You.  Wynter, her husband Jonathan, and their daughters (ages 7-13) live in Dallas, Texas. Follow her on Instagram @forgirlslikeyou.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day38-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 12:1-21, Mark 14:32-36, Philippians 4:10-13",
        "devo_title": "Sufficient Grace",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 12:1-21, Mark 14:32-36, Philippians 4:10-13\nIt was just a common cold, then an infection, and then another infection from the antibiotics the doctors had given me to fight the first infection. Then, after being in bed for a week, my lower back started to hurt. To add insult to injury, I cracked one of my molars on a seed in my bread, and ended up having to get a root canal. For four weeks it was one thing after another. I don’t get sick often, so this debilitating month was like an object lesson in the absolute frailty of my body. Nothing was really related to anything else; it was just a perfect cluster of unfortunate events all smashed up against one another. \nI don’t know about you, but I can manage a simple cold. I can even manage a tweaked back. But when all the world seems to conspire against me when I simply get out of bed, eat anything harder than yogurt, or I’m on my third round of antibiotics in a month—well, I begin to despair. In that moment, I couldn’t remember what it felt like to be well, let alone remember what it felt like to be cheerful or whole or able to manage anything. I felt like a walking mistake.\nHave you ever felt like that? \nMaybe it’s not physical for you; maybe it’s emotional. Or maybe it is physical, but to an extent that makes my month of maladies seem like a walk in the park. Perhaps it’s mental or spiritual—I don’t know. But I do know that sometimes God’s grace does not feel sufficient for my weakness. Nothing about me, or Him for that matter, seems sufficient in days and weeks and months like these. \nYet, in 2 Corinthians 12, Paul lists the weaknesses in which he finds contentment: insults, hardships, persecution, and calamities, not to mention the thorn in his flesh God hasn’t removed. Paul is not saying these things don’t exist or that they aren’t hard. He isn’t putting on a brave face or being courageous in the midst of difficulty. He’s not even saying it’s okay to simply accept the thorn as it is. No, he begs God to remove it. But, in the midst of all this very real pain and difficulty, Paul’s contentment is not in his ability to weather the storm, bear the pain, or be brave. His contentment is in the sufficiency of God’s grace. \nWhen I’m struggling with anything, I want to find contentment in God’s sovereign ability to change everything in an instant, to heal what is broken right now, to right what is wrong. What I don’t want to be contented with is simply walking through the difficulty—be it physical, mental, emotional, or spiritual—in the knowledge that His grace is sufficient, that He is bearing this with me, and He hears me. And even if He hasn’t answered my prayer according to my wishes, He is still sufficient for me in my weakness, emptiness, pain, and sorrow. \nPaul’s words to the Corinthians in this passage remind me that sometimes God doesn’t change our circumstances, not one bit. But He does change our hearts in the midst of everything, making us more like Him. Jesus’ words to Paul and to the Corinthians are a promise to us as well: \n“My grace is sufficient for you, for my power is perfected in weakness.”\n—2 Corinthians 12:9\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day39-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 13:1-13, John 15:1-8, Colossians 1:9-12",
        "devo_title": "Finally, Rejoice",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Corinthians 13:1-13, John 15:1-8, Colossians 1:9-12\nThink about the words you would use to describe the Church today. \nWhen Paul wrote his letters to the Corinthian church, he didn’t know what the Church today would look like. Designations like Catholic and Protestant, Reformed and Arminian, even conservative and liberal, didn’t exist. And yet, in the newly formed Church of Paul’s day, they still needed to pursue unity. Dissension fractured the new body of believers, much as it has for centuries. The study of Church history is the study of fractions, disjointed parts that make a whole. \nThe last chapter of 2 Corinthians is Paul’s plea to his Corinthian brothers and sisters. A brief review of Paul’s relationship with the church at Corinth might be helpful here as we close our study of both letters. \nFirst Corinthians is Paul’s instruction manual to Corinth. He clarifies new Christian traditions and social positions (everything from spiritual gifts to marriage to the Lord’s Supper). Factions in the church had begun to form around different interpretations of these traditions. Church leaders who opposed Paul began to gain traction around their interpretations, and Paul responded with a strong letter of rebuke (which was lost). \nMany Corinthian believers responded well to Paul’s rebuke, and found sure footing again. But dissenting factions remained, and it is to these people that Paul addressed 2 Corinthians. Paul really puts himself out there in this letter. It is his apologetic for himself as a leader, but also for the cause of Christ. 2 Corinthians is emotional and strong, like the closing arguments of a political debate or a courtroom drama. \nMany scholars and commentaries refer to 2 Corinthians as Paul’s apologia pro vita sua, a latin phrase which means “a defense of one’s life.” He defends himself, he defends the body of Christ, and he defends the faith. Church unity is one of Paul’s soapboxes. He returns to it over and over, and in his closing statements to the Corinthians, he says this: \nAim for restoration, comfort one another, agree with one another, live in peace.\n—2 Corinthians 13:11\nRestoration, comfort, agreeableness, peace—as the body of Christ, Paul calls us to these things in this important epistle. Can you imagine if those words described the Church today, let alone the Church throughout history? \nHere’s what I believe about the Church, in a rather church-y metaphor. When you look at a piece of stained glass, you see one of two things first. You can see the whole beautiful picture, or you can see the hundreds or thousands of smaller pieces of glass. All of those different pieces of glass have a purpose; they bring a unique color, perspective, shape, or function to the whole piece of art. But the primary goal of all of those little pieces is to come together to present one beautiful message to its audience. \nUntil Christ returns, the Church will always be made up of thousands of pieces, expressions, or denominations. Each one brings something different to the body, yet all too often, we err on the side of contentiousness, distrust, or outright anger toward those other parts of the body. But our prayer should always be, as Paul’s was, that we present a mature, unified picture of the body of Christ, being of the same mind, at peace with one another and with God. In this way, we will display the glory and the heart of our King, Jesus Christ.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day40-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "Hosea 10:12",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nSow righteousness for yourselves\nand reap faithful love;\nbreak up your unplowed ground.\nIt is time to seek the LORD\nuntil he comes and sends righteousness\non you like the rain.\n—Hosea 10:12\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/SRT-Corinthians-Shareimage-Day41-1.jpg"
    },
    {
        "book_title": "1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 12:9 ",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 2 Corinthians.  \n But he said to me, “My grace is sufficient for you, for my power is perfected in weakness.” Therefore, I will most gladly boast all the more about my weaknesses, so that Christ’s power may reside in me.\n-2 Corinthians 12:9 \nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/4-12Corinthians-6-1.jpg"
    }
]