[
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 12:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 2 Corinthians.  \n But he said to me, “My grace is sufficient for you, for my power is perfected in weakness.” Therefore, I will most gladly boast all the more about my weaknesses, so that Christ’s power may reside in me.\n-2 Corinthians 12:9  \nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/4-12Corinthians-6.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "Hosea 10:12",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nSow righteousness for yourselves\nand reap faithful love;\nbreak up your unplowed ground.\nIt is time to seek the LORD\nuntil he comes and sends righteousness\non you like the rain.\n—Hosea 10:12\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day41.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 13:1-13, John 15:1-8, Colossians 1:9-12",
        "devo_title": "Finally, Rejoice",
        "devo_summary": "\n                    \n                    My wife and I often joke that aside from our commitment to God and love for one another, a third reason we will never get divorced is because we don’t want to enter the dating scene ever again. Dating is just the worst, isn’t it? The uncertainty. The awkwardness. The mystery sounds fun, but ultimately it’s stressful and sometimes overwhelming.\nThe Bible teaches that God protects and seals those He saves (John 10; Ephesians 1). This means God isn’t like your high school ex-girlfriend, who you could never quite figure out—that girl who threatened to break up with you every time you got into a little tiff, and then played you against other guys to make you jealous and manipulate your behavior. If God has set His love on you, literally nothing can separate you from Him (Romans 8:31-38).\nOur passage today doesn’t contradict that truth. Rather, Paul is telling the Corinthians their salvation is so secure that they can judge for themselves if it’s real. It’s not a mystery or a fleeting thing. Those who love Christ are transformed and made more like Him by the power of the Holy Spirit (Romans 12:1–2; 2 Corinthians 3:18; Galatians 5:22-23). \nIf we are becoming more like Christ, even if slowly and painfully, we can have confidence that the Spirit is at work in us. If we fail miserably, we know that God’s grace is not dependent upon our works, but on Christ crucified. The great mystery of salvation is that we are sinful, yet forgiven; we are imperfect, yet growing more and more into Christ’s perfect image through the work of the Holy Spirit.\nPaul encourages the Corinthian believers to test their faith, to see to it that they keep becoming more mature. We are all weak, but God’s power works through us. He will never let us go. This truth helps us to both press into His love and push away sin. And it’s only by the power of the Holy Spirit that we can do either one.\nMay we rejoice in the work of Christ, both in our own hearts and in the world. And may we continue to mature and grow in our faith, doing what is right in His eyes and for the truth of His gospel (2 Corinthians 13:11,8). \nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day40.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 12:1-21, Mark 14:32-36, Philippians 4:10-13",
        "devo_title": "Sufficient Grace",
        "devo_summary": "\n                    \n                    When was the last time you played the “one up” game? You know, the game you play when you’re with other men and you start to tell stories. One guy starts sharing his story of conquest and achievement, and before you know it, the next guy puffs out his chest and tells a story that’s just a bit bigger than his friend’s. The boasting and bragging inflate with each subsequent story told. If there is an “alpha male” in the group, you can be confident he will bring out the biggest fish of all, thus ending the game with his dramatic achievement.\nPaul’s “boastings” here in this passage make you wonder if he is playing that game as well. Pitted against the “super-apostles,” Paul has had to defend his credentials and ministry before the very church that he planted in that city. As the church was seduced away from sound doctrine and living by flashy and false celebrity teachers, Paul sought to correct and restore them to the truth. But that came at a cost. The Corinthians had bought the lie that the super-apostle with the greatest boasts was clearly the one worth following, regardless of what he taught. If Paul wanted to bring the church under his leadership again, he knew he’d have to play the game to engage the Corinthians. \nHowever, unlike the boasting that Paul’s opponents give, Paul flips the script and lays out his weaknesses. Instead of puffing out his chest and talking about how many souls he’s converted, or churches he’s planted, or multitudes he’s spoken to, he lays out his thorns. He “takes pleasure in weaknesses, insults, hardships, persecutions” (2 Corinthians 12:10). But why?\nBecause faithfully following Jesus looks more like a cross than a crown. The power of the gospel is more profoundly displayed in human weakness and suffering than it is in demonstrated power and triumph. The reason for this is so God’s strength will be seen, even in our weakness. It’s so we can’t take any glory for what belongs solely to Him.\nPerhaps you’re tempted to boast in your spiritual victories and achievements. Here, at almost the end of this 1 and 2 Corinthians reading plan, you may feel a bit of pride that you’ve read every day and been in prayer. You may want God to notice and affirm your strength of will and dedication to Him. \nThe good news is that God’s not looking to affirm “one-up men.” His eye is to the weak and the humble. Why? So He gets all the glory for His grace. May we learn this “secret of being content” Paul spoke of, “whether in abundance or in need”—that in Christ Jesus we are able to do all He’s called us to do (Philippians 4:12-13). He alone is the source of our strength. He alone is worthy of our praise. Let us boast in Him.\nWritten by Jeremy Writebol\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day39.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 11:1-33, John 3:29, Revelation 19:7-8",
        "devo_title": "Paul’s Sufferings for Christ",
        "devo_summary": "\n                    \n                    “Godly jealousy” is not a phrase you hear much these days. If you use it in a sentence with your pals, you are likely to make someone uncomfortable. It isn’t a notion we like to ponder, because it runs so counter to our natural way of thinking. In an age that is indifferent to truth, the virtues of righteousness, purity, faithfulness, and holiness cause folks to squirm. It’s much easier to accept the call to holiness as a private pursuit or, to really water things down, a personal preference. Why? Because being set apart as the pure bride for Christ means we must lay aside our own selves. We must die to self. \nWhen Paul confronts the Corinthians, he is loathe to talk about himself and his own credentials. Yet it is a “foolishness” that serves to reveal the true nature of the gospel. He tells them, “If boasting is necessary, I will boast about my weaknesses” (2 Corinthians 11:30).\nThe world always sees the wisdom of God as foolishness, and the strength of God as weakness. Yet when Christ washed His disciples’ feet, this was true success. Christ’s silence before His accusers was a victory. When He remained on the cross as the crowd jeered, “He saved others, but he cannot save himself!” (Matthew 27:42), this was a triumph. Christ did not come into the world so that we could be like the world, but that we might be set apart from it and made to be more like Him. \nBut the lure of falsehood is strong, both for the Corinthians and for us. It often enters into our lives, not through an active rebellion, but through complacency, through a passive concession to lies. Like Eve, we are prone to give the serpent the benefit of the doubt. We like to have our ears tickled. We hear him out, consider his boastful appeal, making sure not to offend. Like Adam, we stand by idly, instead of confronting the dragon (Genesis 3). We exchange humility for tolerance, and courage for captivity.\nWe live in a world full of boasting and false teachers who proclaim false gospels—of prosperity, of self-worship, of self-righteousness, of permissiveness—but who fail to proclaim the Christ who came to make His bride holy. \nGiven that we are so much like the Corinthians, I am provoked to examine myself. “For the word of God is living and effective and sharper than any double-edged sword, penetrating as far as the separation of soul and spirit, joints and marrow. It is able to judge the thoughts and intentions of the heart” (Hebrews 4:12). \nIs my own heart devoted to Christ? Or do I make concessions to the world in my mind, my heart, my life? Do I sit idle while the serpent of old tickles my ears and strokes my pride? I have plenty of my own boasting and foolishness that I must yield to Christ. But I greatly rejoice at this opportunity, for He has purchased me by His blood and is preparing me for Himself. In Him alone is my joy complete.\nWe rejoice, therefore, in the service of Christ. We boast in our weakness, and we preach but one gospel: Christ, and Him crucified.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day38.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 10:1-18, Jeremiah 9:23-24, Ephesians 2:8-9",
        "devo_title": "Paul’s Apostolic Authority",
        "devo_summary": "\n                    \n                    Have you ever been in a conversation and realized you sound more like a walking, talking résumé than a human being? It’s easy to do, and Lord knows, I’ve been there. In a culture that so highly values and esteems credentials and qualifications, it’s easy to slip into a conversational pattern of only sharing your most recent wins. \nDon’t get me wrong, it’s good to celebrate our joys and successes with our friends, family, and community. But if we’re not careful, we can slowly digress into the realm of one-upmanship and humble brags. Maybe it’s not so overt for you, but rather an, “Aw-shucks, here’s my latest, awesome thing.” Or perhaps on social media you’re just harmlessly sharing your best, #blessed life. \nWhile a lot has changed for humanity and the body of Christ since Paul’s day, it seems like basic human inclinations have not. Paul’s reminder to “boast in the Lord” alone was as much a reminder to himself as it was to his audience (2 Corinthians 10:17). It seems like he would’ve been the first to admit this. \nI imagine for each of us, there are different areas of our lives or different social circles that prompt us toward more of a “look at me” posture. So apart from avoiding people and social media altogether, I think there are some practical steps we can take.\nThe first antidote to boasting is living with a focused memory. The Israelites lost their way when they forgot the history of God’s mighty deeds and His steadfast love. We are prone to do the same, focusing on our own strengths because we’ve forgotten the blessings of God that have led us to where we are today. \nAnother antidote to boasting is curiosity. In developing a healthy sense of curiosity, we begin asking more questions of others and seek to learn more of their expertise. Some of the most humble and influential men and women I’ve ever met are phenomenally curious question-askers. \nMy prayer for us today is that we’d hone our sense of memory, and deepen our sense of wonder and curiosity. These practices will help us boast more frequently in the Lord and His mighty works, acknowledging His rightful place of power and authority over our lives. They will also help us celebrate the victories of those around us. Surprisingly, I think we’ll find ourselves feeling more whole, purposeful, and confident in our calling and identity as a member of the body of Christ. \nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day37.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 9:1-15, Psalm 126:1-6, Hosea 10:12",
        "devo_title": "Motivations for Giving",
        "devo_summary": "\n                    \n                    Generosity is a trait we love—in others, that is. Most of us love the idea of giving. When we do give, we don’t regret it, because it feels good to give. Sort of. Maybe. Sometimes we miss the money or time we gave and would like to have it back, or at least get something back in return. It’s easy to regret the cost of giving, but that’s not the attitude of a cheerful giver; it’s the attitude of an investor. We want dividends paid in exchange for our “gift,” or rather, our “investment.”\nToday’s reading in 2 Corinthians 9 turns our attitude of investment generosity on its head. The picture it paints is that of a farmer sowing seed. In the spring he sows seed, and in the fall he harvests. How much he harvests and the quality of his harvest depends on how much he sows and the quality of his seed. If he scatters a few crummy seeds he will harvest a lean crop, but if he sows generously he will reap generously. \nAt first, this appears to be a similar metaphor to that of investing: you get out what you put in, plus a little extra. But Paul isn’t finished yet. Consider the farmer’s dependence on God. He puts little dead plant pods in dirt and prays God will transform it into growing, living sustenance. He hopes his seeds will bear fruit, but it isn’t up to him. \nNext, notice how Paul describes what is reaped: “And God is able to make every grace overflow to you, so that in every way, always having everything you need, you may excel in every good work” (2 Corinthians 9:8). \nPaul is not describing riches gained on a return investment. The harvest of generous sowing is due to “every grace,” so we can “excel in every good work.” Faithful, hopeful generosity results in abundant grace and growth in our lives, not necessarily our bank accounts. While these graces that help us do good work might include money or material gain, that is neither a guarantee nor the point. Our investment is in every good work, and that is our dividend. \nPaul goes on to emphasize thanks, not reward. The fruit of generosity is thankfulness and “shouts of joy” (Psalm 126:5). That response reflects a kind of generosity I rarely see or participate in, but wouldn’t that be amazing? It would mean giving as we have received from God—lavishly, sacrificially, whole-heartedly, lovingly, and without ceasing. This kind of sowing reaps thanksgiving and praise. It is a pouring out of life, not just dollars. And the harvest is rich, beautiful, and bountiful.\nWritten by Barnabas Piper\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day36.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 5:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a summary of the gospel of Jesus.\nHe made the one who did not know sin to be sin for us, so that in him we might become the righteousness of God.\n—2 Corinthians 5:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/4-12Corinthians-5.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "Lamentations 3:22-24",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBecause of the LORD’s faithful love\nwe do not perish,\nfor his mercies never end.\nThey are new every morning;\ngreat is your faithfulness!\nI say, “The LORD is my portion,\ntherefore I will put my hope in him.”\n—Lamentations 3:22–24\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day34.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 8:1-24, John 1:1-3, Philippians 2:4-11",
        "devo_title": "The Collection",
        "devo_summary": "\n                    \n                    I am in the process of launching a congregation with my home church. Starting a new work is filled with challenges, struggles, and things to work through-—enough so that there are many books and conferences on the subject.\nBut the challenges most church planters in the West face today are nothing compared to what Paul had to navigate. Today’s reading in 2 Corinthians 8 focuses on a collection Paul was taking to assist believers who were suffering for their faith. Christian churches in those days were born through suffering and affliction. It was hard to be a Christian in public. Sometimes it could cost you your life. And yet, Paul says, though they suffered, the believers in Macedonia (Philippi, Thessalonica, and Berea) remained generous with their giving to the needs of others, though they had little to give. \nPaul had been taking up a collection for believers in Jerusalem who were suffering persecution and famine. In this chapter, Paul is asking one group of believers who are suffering for their faith to contribute to the needs of another group of believers who are suffering for their faith.\nThis is about more than money. Paul is appealing to the Corinthians believers, and to us, to not cling too tightly to the things of this world. His argument is essentially this: “Think of what you’ve been given in Christ. Think of what His generosity gave others and cost Him. Walk in this way.” When it comes to money, let the generosity of Christ loosen your grip on material wealth, and let your boast be in how much you’ve been given in Christ, not in how much you’ve given away to others, or in how much you’ve built up for yourself.\nThis applies to so many other areas of life too, doesn’t it? Church planting. Reputation. Esteem in the eyes of the world. Relationships. How we go about our work. Generosity. Service to others. For the believer, because of what Christ has given us, we should live generous lives, seeking the good of others, even when we have needs of our own.\nThe irony here is that the biblical principle of generosity can seem limiting when, in reality, it’s freeing. We become great by becoming the servant of all. May the Lord give us generous hearts and open hands when it comes to our labors together in Christ.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day33.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": " 2 Corinthians 7:2-16, Lamentations 3:19-24, Acts 3:19-20",
        "devo_title": "Joy and Repentance",
        "devo_summary": "\n                    \n                    I thought I was headed for jail. Stealing baseball cards as a eight-year-old got me into a heap of trouble. As my cousin and I crept out of the grocery store that day, cards falling out of our pant legs, it didn’t take long for my Aunt Rosie to bust us. She marched us back into the store and made us apologize to the manager. Sure, we escaped a prison sentence as kids, but I was shook. Tears were flowing. I’m-so-sorrys were everywhere. I hated that I got caught.\nA few months after my crime of passion, I heard about Jesus’ death and resurrection saving people from sin, Satan, hell, and the wrath of God. It all “clicked” for me. I’d stolen baseball cards and lied to my parents—I realized then that I’m a sinner and that I needed Jesus to save me. I believed He could. From that day forward, the way I saw and understood my sin and myself changed forever. \nThe grief over my sin led to repentance—a 180-degree change. I admitted my sin and wanted to honor God. Twenty-five years later, I’m still following the same paradigm. Godly grief, motivated by love for God, “produces repentance that leads to salvation” and real heart change. Worldly grief, motivated by love for self, “produces death,” and therefore, no change for good (1 Corinthians 7:10). Paul wants us to see difference.\nIt’s no surprise as Christians that we still sin. What should be surprising is the way we handle it when compared to those who haven’t been crucified and raised with Christ. When your sin gets pointed out to you, how do you react? Do you ask for forgiveness, repent, and change course? Or do you put concrete around your heart, refusing to admit the transgression, and try to avoid the subject?\nOnly the cross of Christ could deal with our sin, once and for all. The cross tells us all our sins have already been paid for, aired out before the universe; and because Christ is alive, I have the power to change with the help of the indwelling Holy Spirit. I’m now aware of my sin and I hate it, but because of Jesus, I can now walk in newness of life. \nBrothers, the kind of grief that simply causes us to hate that we got caught and were embarrassed—that’s the way of the world. But godly grief leads to repentance, transformation, and an eagerness to make things right with those we’ve sinned against. Thanks be to Jesus for making us new. “Because of the LORD’s faithful love we do not perish, for his mercies never end” (Lamentations 3:22).\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day32.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 6:3-18, 2 Corinthians 7:1, Ezekiel 37:26-28, Philippians 2:12-13",
        "devo_title": "God’s Ministers",
        "devo_summary": "\n                    \n                    I’m terrible with cars. I always have been; there’s no two ways about it. I not only cannot fix my car in any meaningful way, I cannot even remember what has been done by my mechanic. Thankfully, there is a receipt box included in every car. You may call it a “glove box,” but I never wear gloves, and therefore, I’ve never placed a glove in that box. The only thing I can do with any confidence is change a tire and put gas in the car. And I use the word “confidence” loosely. Needless to say, I’ve never received a call from my mechanic that did not result in the significant depletion of my bank account. \n But I do know when my wheels are out of alignment. Inevitably, one day you get to a certain speed—usually on the interstate—and the front-end of your car starts to shake. (That’ll cost you about $60 with a Groupon, by the way.) The problem is that the wheels aren’t in sync; they are, in effect, not going the same way perfectly. This not only messes with the quality of travel down the road, but it eventually ruins your tires.\nIn 2 Corinthians 6, Paul is concerned about whom the believers in Corinth are aligning themselves with. He tells them, “Do not be yoked together with unbelievers. For what do righteousness and wickedness have in common? Or what fellowship can light have with darkness?” (v. 14).\nYou see, Paul had planted the church in Corinth, but some teachers who opposed his teaching had infiltrated the church. Though no one is absolutely sure what they were teaching, we do know they opposed Paul, and so we can assume they opposed his teaching of salvation by grace through alone. They may have been like the Judaizers, who taught that Gentiles had to follow the Old Testament laws (including circumcision) in order to follow Jesus. Needless to say, Paul was concerned about their false teaching.\nThink about what a yoke does. It gets placed over the neck of two animals, so they will go in the same direction. Imagine the problem if you place a yoke over a cow and a donkey, or an ox and a horse. It wouldn’t work. You need two oxen. Or you need two donkeys, so they will go in the same direction. They need to be aligned.\nOften, this passage is quoted in reference to marriage. That’s surely implicit, but what is even more explicit is the need to understand that Christians need to align themselves with others who believe in the gospel of grace through faith alone when working towards kingdom purposes. The temptation will be for individual believers and churches to look at the world’s way of getting things done, and then try to hitch themselves to those ways. But this temptation must be resisted, no matter how enticing the power and the glory promised are. Paul makes it clear: the world’s ways are not kingdom ways. They have nothing to do with one another, and the payoff will be costly.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day31.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 5:1-21, 2 Corinthians 6:1-2, 1 Thessalonians 4:13-18, Titus 2:11-14",
        "devo_title": "Our Future After Death",
        "devo_summary": "\n                    \n                    Do you ever find yourself driven to defeat or despair under the weight of your own sin? Do you wonder, If I am a saint, why can’t I live a victorious Christian life? If so, you are not alone. Consider these words from the apostle Paul and how often we, too, cry out to God in similar ways. “What a wretched man I am! Who will rescue me from this body of death?” (Romans 7:23). \nThe Christian life is a journey of killing sin; we are either killing sin or sin is killing us. And the pursuit of righteousness often teaches us that the more we grow in holiness, the more sin we see in ourselves. In the pursuit of righteousness, this may alarm us, but it should not disarm us. In fact, the gospel of Jesus Christ reminds us that we are far worse than we once realized, but God is better than we ever could have imagined. \nThis is why the gospel is good news! “[God] made the one who did not know sin to be sin for us, so that in him we might become the righteousness of God” (2 Corinthians 5:21). In other words, Jesus paid the price for our sin so that we could be counted as righteous before God. And the righteousness of Christ is credited to us when we trust in Him for salvation! \nTherefore, in the fight for righteousness, we should not be driven to despair or defeat when we consider the presence of sin in our lives. Instead, this should drive us to Christ, where we find grace and peace. Through faith, Jesus’ victory over sin and death becomes our victory over sin and death. \nAs Tim Keller has said, “The Christian gospel is that we are so flawed that Jesus had to die for us, yet we are so loved that Jesus was willing to die for us.” Did you catch that? We are so loved that Christ willingly died for us. It is in the security of His love, in response to His love, that we pursue righteousness. \nOne day, when Christ appears we will experience the fullness of salvation in eternal life without sin. Now, in this life, His grace has appeared bringing salvation, but also training us to renounce ungodliness. It is His grace that trains and equips us to live self-controlled and godly lives in this present age. \nTherefore, when the Spirit reveals sin in your life, it is an act of grace. In light of this grace, we must act in faith. Faith teaches us to trust that while our sin is great, Christ is greater. Faith repeatedly trains us to turn from sin and turn to Christ. You see, the victorious Christian life isn’t the sinless life; it’s the repentant life of faith. In this sense, a saint is one who falls and gets back up, turning again and again to Jesus, standing on the gospel that declares we are righteous in Him.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day30.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 4:1-18, Romans 6:5-7, 2 Timothy 4:3",
        "devo_title": "The Light of the Gospel",
        "devo_summary": "\n                    \n                    When my youngest daughter was only about 25 weeks in the womb, we thought we had lost her. My wife hadn’t felt her move in over 24 hours, so she called the doctor’s office. Thinking she was overreacting, she was relatively calm when she dialed the number. But after explaining her symptoms to the nurse, she was told to come in for an immediate ultrasound.\nWhen my wife texted me that news, I rushed home from the office. I made a 40-minute drive in 20 minutes, racing as fast as I could to be at my wife’s side when the ultrasound was performed. I cried the whole way home, begging God to save my baby’s life.\nAs it turned out, the ultrasound said that everything was basically fine, aside from a few things they wanted to monitor in the following weeks. Most importantly, my little girl was alive. Whether God revived her due to my prayers, or it was simply an overreaction on our part, we thanked God. Of course, even without that scare, every time her heart took a beat, it was a miracle. He is the God of life, and He’s the only one who controls it.\nPaul tells the Corinthian church that any suffering in life is meant for God’s glory through the thanksgiving of His people. I tell this story about my daughter often, primarily as a way to comfort others who have had similar experiences. As Paul says, “this momentary light affliction” was for our benefit, so that we could increase in faith and overflow in testimony (2 Corinthians 4:17).\nIt’s not always easy in times of suffering, persecution, or trial to remember that these difficult seasons are brief in comparison to eternity with God. Paul gives this advice multiple times in his letters, no doubt because he had to learn to be content in all circumstances in his own life. Paul wasn’t perfect—he surely struggled at times to believe in God’s goodness in the midst of his many difficulties—but that didn’t make his testimony any less true. In fact, we can trust Paul’s advice precisely because he experienced so many afflictions.\nThe fear of losing my daughter wasn’t my first struggle in this lifetime, and it certainly won’t be my last. Life is fragile. The world is broken. Terrible things happen every single day. But because of my trials and tears and begging God for mercy, I now believe in Him more than ever before. And I pray He continues to use our stories to encourage others.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/06/HRT-Corinthians-Shareimage-Day29.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 1:5",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse emphasizes our unity with Christ in both joy and sorrow.\nFor just as the sufferings of Christ overflow to us, so also through Christ our comfort overflows.\n—2 Corinthians 1:5\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/4-12Corinthians-4.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "Deuteronomy 31:6",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“Be strong and courageous; don’t be terrified or afraid of them. For the LORD your God is the one who will go with you; he will not leave you or abandon you.”\n—Deuteronomy 31:6\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day27.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 3:1-18, Jeremiah 31:31-34, 1 John 3:2",
        "devo_title": "Living Letters",
        "devo_summary": "\n                    \n                    Jesus’ ministry took place at dinner tables, beachside breakfasts, hillside picnics, on long walks, in garden respites, and in quiet homes as He broke bread and spoke the Word of life. His call was “come follow me” (Matthew 4:19). It was always a ministry of life on life. He came into the world and dwelt with us, and we beheld His glory. When Jesus ascended, He passed on His ministry to His disciples, to the Church, and to us—and the call is still the same: go, and make disciples (Matthew 28:19). You shall be fishers of men.\nThe gospel is not a system of behavior, though it does change our behavior. Nor is it a set of rules to follow, though in it the law is fulfilled. The gospel is Christ and His work of redemption. It is His life given to us, alive in us, making us alive in Him by His Spirit. The gospel transforms people because Christ transforms people by His own life. \nThis life-on-life transformation is what Paul speaks of to the church at Corinth. Paul calls them his “letter,” because through his ministry they came to know Christ (2 Corinthians 3:2). We are all “Christ’s letter,” made so by the Spirit of the living God. In Him is life, and if we abide in Him, and He in us, His life is ours. \nThe fruit of this life is freedom and boldness because our adequacy comes from God. We are His letter, His testimony—not our own. This is the glory of the new covenant, that the glory that is His has been given to us. It’s transforming us, so that we shall one day be like Him.\nHe has forgiven our sins and remembers them no more. Even more, He is making us like Himself. Do you hear how great is our privilege, that we should be called the children of God, that we should be His witnesses, and live in His life? If we have already received such a great treasure, how much more should we seek to walk in this new life! We ought to make every effort to seize hold of this life, and seek its transforming power. \nHow do we do this? \nThe answer is unique to the gospel, but it is the same as it has always been: Abide in Him. The veil that once separated us from Him has been removed. When you sit in your house, as you walk by the way, as you break bread, remain in the Word, walk by the Spirit, and abide in Christ. When we see Him as He is, we are transformed. May He so transform our hearts and lives and use us as His effective letters and witnesses to a watching world.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day26.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 2:5-17, Matthew 6:14-15, Colossians 3:12-17",
        "devo_title": "A Sinner Forgiven",
        "devo_summary": "\n                    \n                    Coming back home had to be a difficult thing to do. Not only had the prodigal son squandered his entire life savings and well-being, but in the process he had shamed and dishonored his entire family. His actions and words had effectively told his father he wished he were dead. As he walked back to his boyhood home, I imagine he dreaded the reunion with his family. How would they receive him? How would their judgmental gaze feel when they saw him? Would his father even speak to him? (Luke 15:11-32).\nFor the Corinthian church, this challenge stood before them as well. While we are left to guess the details of the situation Paul describes in 2 Corinthians 2, it is apparent that someone in the church had deeply sinned and wronged the body. Paul speaks of that person causing “pain,” not only to him but to the entire church (v. 5). The sin was devastating to the believers in Corinth. And yet, standing on the other side of the door, like the prodigal son, was this wretch of a human broken by his deeds and asking for restoration and forgiveness. How would they respond?\nRooted in the reality of the gospel, Paul calls the church to display the very forgiveness they have received in Christ. Instead of keeping the repentant outcast at an arm’s length and shunning him, the reality of the gospel calls them to “reaffirm your love to him” (v. 8). More than being a kind gesture, this is a test to the church. The test being this: Do you really understand the gospel? Does your understanding translate into obedience to the gospel?\nHerein lies the test for us as well. How do we receive those who have sinned against us? While the pain of others’ sin against us is deep, when they come to their senses and return to us repentant and asking for forgiveness, how will we respond to them? Will realities like “forgiveness” and “comfort” and “love” flow from us to those who have wounded us and our church community? Will we be “the fragrance of Christ among those who are being saved and among those who are perishing?” (v. 15).\nWhen we view the nature of what Christ has done, we are confronted with the reality that this is exactly what He has done for us. He has taken our guilt upon Himself and paid for our sins in His death. He has welcomed us, forgiven us, and what’s more, He loves us! This good news for us is exactly how we are to receive those who return back in repentance. Instead of shaming and shunning, the Father restores His prodigal sons. Because He loved us first, we, too, can receive them with love (1 John 4:19).\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day25.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Corinthians 1:1-24, 2 Corinthians 2:1-4, Isaiah 40:1-2, Romans 5:8-10 ",
        "devo_title": "The God of Comfort",
        "devo_summary": "\n                    \n                    Unfortunately, too many of us have imbibed a view on how men handle suffering that is similar to Ron Swanson from the TV show, Parks and Recreation. He told his boys’ basketball team that crying is acceptable at “funerals and the Grand Canyon.” In another episode, Chris gets emotional over a box Ron made for him. Ron replies, “Saltwater will warp the wood, so keep your tears in your eyes where they belong.”\nWe work hard at becoming immune to life’s pain, but when we do this, we also insulate ourselves against the immense comfort God offers when times are difficult. When we learn to be honest about how hard and painful life can be, we open ourselves up to the joy that we can experience, even in our suffering.\nAside from the vision of God in chapter 6, you probably don’t hear many sermons from the first 39 chapters of Isaiah. Through the prophet, God confronted the sin and faithlessness of His people while telling them about their coming exile at the hands of the Assyrians and the Babylonians. This brutal section ends with Isaiah telling Hezekiah that all he and his own son will be carted off to Babylon, where his sons will serve as eunuchs for the king (Isaiah 36–41). For a people who heard they would live forever in a land filled with milk and honey, this came as startling news.\nGod broke into this stark reality with words that would make His people glad: “Comfort, comfort my people” (Isaiah 40:1). While pain and suffering will come, they will not have the final word. God promised there would be a time when Jerusalem’s warfare would end and her sin would be forgiven. This is what God does over and over. He steps into our pain, even the pain we bring upon ourselves, speaking words of comfort and bringing peace to our weary souls. \nThe comfort God brings to us in our pain ultimately comes through the suffering of Christ Jesus. While we were foolish, running headlong into our sin and bringing misery upon ourselves, God demonstrated His love towards us by sending Christ to die in our place (Romans 5:8). He took our sin, misery, and guilt upon Himself, and in exchange, we get to experience His comfort and peace.\nPaul didn’t pretend life wasn’t hard. In fact, 2 Corinthians catalogued Paul’s sufferings in a way no other letter he wrote did. He spoke of beatings, imprisonments, cold, want, and the pressure of caring about the well-being of the churches he’d founded. He knew affliction and pain. He didn’t hide it; he wore it on his sleeve.\nYet, Paul testified that even though we know something of the afflictions Christ bore, through Him we can also know the abundant comfort God gives. We don’t minimize our pain. We don’t explain away our sufferings. “For just as the sufferings of Christ overflow to us, so also through Christ our comfort overflows” (2 Corinthians 1:5). When we honestly acknowledge our suffering, we can trust that God will meet us there in our pain, ministering to us with overwhelming comfort.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day24.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 16:1-21, Leviticus 23:15-22, Deuteronomy 31:6-8",
        "devo_title": "The Lord’s Work",
        "devo_summary": "\n                    \n                    When you come across the word “all” in Scripture, there’s no ancient secret hidden meaning that you need a special handshake or password to access. Then, as now, “all” means all. \n“My love be with all of you in Christ Jesus” (1 Corinthians 16:24).\nWhen it came to the Lord’s work, Paul did not adhere to any hierarchy of persons. In one breath he advocates for Timothy. In the next, he respects the plans Apollos has in place. Then he turns to throw major kudos in the direction of Stephanas and Fortunatus and Achaicus. And then he ensures that Aquila and Prisca get name recognition. Paul went to great lengths—not only in letters, but also in life—to make sure all meant all. As one who had experienced the grace of the Lord Jesus, Paul was serious about sharing with others what was shared with him.\nBut even within that wide net, Paul kept an eye on those in need. 1 Corinthians 16 starts out with pointed words regarding “the collection for the saints” (v. 1). Paul was clear. As you prosper, don’t forget to set some aside for those who are not. It is these verses that Leviticus refers to, Moses was clear: Don’t harvest it all. Leave a margin there for others (Leviticus 23:22). Such intentional kindness was truly a facet of the Lord’s work, a tie to bind the people together so that all always meant all.\nI’ve witnessed this repeatedly in the life of my pastor-father as he has been grandfather (Papa) to my children, and also to my nieces. I wrote a poem about this in my book Know When To Hold ‘Em: The High Stakes Game of Fatherhood (Abingdon Press, 2013). This truly is the Lord’s work.\nIf he knows the grandkids are coming\nhe leaves piles of quarters and\nnickels and dimes on his nightstand,\nalong with a few starlight mints.\nHe’s been doing this for years now.\nHe knows they never ask,\njust take, all they can get.\nHe gets joy out of it,\nthem getting away with something of his.\nIt’s his way of giving them a tie\nto bind, later, after he’s gone.\nRemember when we used to steal Papa’s change?\nAnd maybe, just maybe,\nthey will in turn love the small and poor\nas they were loved.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day23.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 15:20-58, Philippians 1:12, 1 Thessalonians 4:17",
        "devo_title": "Victorious Resurrection",
        "devo_summary": "\n                    \n                    My mother died over three years ago. Preaching her funeral sermon and standing by her graveside were the most difficult things I have had to do in life. A friend of mine reached out to me and said, “Nick, when you stand by your mother’s grave, remember this is resurrection ground.” Another friend comforted me with these words: “It’s at the graveside that we strengthen ourselves in the truth that the gospel really works.” My mother was a sincere and devoted follower of Christ. When Christ returns, she will rise from the dead unto eternal life. Right now she is “asleep in Jesus.”\nWhen the Scriptures speak of the death of believers, they do so under the idea of “sleep.” Before raising the little girl from the dead, Jesus told the crowds “the girl is not dead but asleep” (Matthew 9:24). When He took His disciples to the grave of Lazarus, in order to raise His friend from the dead, Jesus said, “Our friend Lazarus has fallen asleep, but I’m on my way to wake him up” (John 11:11). And here in 1 Corinthians 15, the apostle Paul says, “We will not all fall asleep, but we will all be changed” ( v. 51). Death for the believer is as if he or she is merely asleep because the certainty of the resurrection is the hope of God raising them to immortality. \nPart of the resurrection awakening we await is for our departed loved ones in Christ to awaken to a transformed and glorified body. We will have the same bodies we have now, but they will be transformed into the likeness of the glorified Christ. When He comes, Jesus will impart the glory that is now His to those who are united to Him, whether in the graves or still alive on the earth when He returns. Scripture is clear that God will wake those who have fallen asleep in Jesus first, and then He will bring those believers who are still alive to Himself. Our frail, mortal, sinful flesh will be automatically made new, immortal, and sinless in the presence of the Lord Jesus Christ. How we should long for that day!\nWhen the Scriptures speak of the hope of believers, it always does so by reminding us of these precious truths about the resurrection and glorification of our bodies. Whether it is the raising of those who sleep in Jesus, or the transformation of those who are still alive when He comes, we look with eager anticipation to that day. We long to be reconciled with those who have gone before us; but more than that, we long to be with them in the presence of Christ in glory.\nWritten by Nick Batzig\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day22.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 12:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse describes the unity we have in the Spirit.  \nNow there are different gifts, but the same Spirit.\n—1 Corinthians 12:4\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/4-12Corinthians-3.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "Ephesians 2:4–5",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n But God, who is rich in mercy, because of his great love that he had for us, made us alive with Christ even though we were dead in trespasses. You are saved by grace!\n—Ephesians 2:4–5\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day20.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 15:1-19, Ephesians 2:4-7, Hebrews 2:5-9",
        "devo_title": "Essential Resurrection",
        "devo_summary": "\n                    \n                    “You are being saved” (1 Corinthians 15:2). \nIt’s such a little phrase and, if we’re not careful, we can easily read right over it. Yet for Paul, this reality was important to note hand-in-hand with our key verse for today: “Christ died for our sins according to the Scriptures” (v.3). \nMany of us grew up in Christian traditions that emphasized a prayer of repentance which leads to immediate salvation and reconciliation with God. Praise God for that! There is much scriptural basis for this invitation (e.g., Romans 10:9). However, if we’re not careful to balance this beautiful exchange with Paul’s message in 1 Corinthians, we miss an important truth. We are being saved—currently, permanently, but also in process. \nThis does not negate the beautiful, mysterious transformation that happens the moment you enter into repentance in the name of Jesus for the first time, but rather it helps us grasp the manner in which Jesus is constantly interceding on our behalf and making us more like Him. \nDuring the day in, day out grind, it’s easy to lean on that initial moment of repentance, while overlooking the majestic exchange in which we’re currently participating. Perhaps that’s why Paul’s first words on the resurrection to the Corinthians are “Now I would remind you…” (1 Corinthians 15:1, ESV). He knew then, exactly what we experience today: it’s easy to become complacent in our pursuit of the spiritual. Said another way, our spiritual memory is short, and our spiritual vision constantly needs to be refocused. \nHave you ever bought a new car? Or a new-to-you car? There’s usually an excitement and happiness that comes on the heels of a purchase like that. But it doesn’t take long for the shiny, new feeling to wear off. Pretty soon, it’s just your daily ride, part of your routine. \nThis sort of experience is really common for believers as well. The shiny, new feeling of salvation wears off, and we can start to lose focus, passion, and energy in our walk with God. I wonder if you’ve ever had a season like this. Maybe, you’re walking in one now. \nPaul’s words to the Corinthian believers are relevant to us today. Though it’s easy to let your walk with God drift to the back burner when you lose passion about the newness of your salvation, we’re called to remember the newness of each and every day. Christ died for our sins in 33 AD, but He is going about the work of saving you each and every day in 2018, 2019, and beyond! We are being saved, and with that confession, we can celebrate the newness and wonder of how we’re being redeemed and transformed each and every moment.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day19.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 14:1-39, Exodus 25:8, 1 John 4:1-3",
        "devo_title": "Gifts from the Holy Spirit",
        "devo_summary": "\n                    \n                    The devil loves nothing more than believers taking our eyes off Jesus. It’s his sole mission—to pull people away from Christ—and he excels at it. One of the devil’s most devious and effective methods is stirring up dissension and debate within the church, what Scripture calls a spirit of confusion. We get mired in arguments, frustration, judgment, preferential tug-o-war, and all of it under the guise of defending truth or seeking good things. In reality, though, we’ve forgotten the reason for church: joining together to worship and reflect Jesus. Confusion has defeated us, and that’s what this passage in 1 Corinthians 14 is about. \nHere, Paul sets out to offer clarity, the opposite of confusion. From the top, he says he wishes people would pursue love and desire spiritual gifts, and he follows that up a few verses later by saying that all gifts are for the good of the church, to build one another up. This is Paul’s thesis, and everything else in the passage points to that. \nOur temptation is to tie others and ourselves in knots with debates over speaking in tongues and prophecy. What do they mean? How should people do them? Are they gifts for everyone? These questions matter enormously, and they’re also a temptation—a temptation toward confusion and distraction. \nWe can never forget that we are to “seek to excel at building up the church” so that, “everyone may learn and everyone may be encouraged” (vv. 12,31). This is why God grants gifts of the Spirit, and anything that doesn’t move the church in this direction is of a false spirit, as 1 John chapter 4 tells us. We are to test the spirits (vv.1–6). If this sounds oddly mystical or confusing, John clarifies: \nDoes the spirit profess Christ or does it not?\nDoes it point people to Jesus or distract them?\nDoes it diminish Jesus or make Him bigger? \nThis is a sharp knife to divide the false spirits from the true, and the helpful gifts from the unhelpful. \nWe ignore these instructions at our own peril and at the peril of our churches. We are called to be a sanctuary, a dwelling place of God, both individually and corporately. But when we allow chaos and confusion to supersede Jesus, we stop being a church and become nothing more than a gathering of people. Only when we seek to excel in building up the church with spiritual gifts, confessing Christ above all else, will we be the church God calls us to be through Paul’s words.\nWritten by Barnabas Piper\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day18.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 13:1-13, Ezekiel 20:35, Galatians 5:5-26",
        "devo_title": "Love, the Superior Way",
        "devo_summary": "\n                    \n                    I love the author E. B. White. I grew up reading (and crying my way through) Charlotte’s Web. It remains one of my favorite stories of all time. Right now, I have a collection of White’s essays on my nightstand. That man can write. Boy, can he write. I read one essay he wrote about the hens on his farm. I don’t really care that much about hens, but the way White wrote about them made the experience of reading about them pure joy. I could have read about his hens all day.\nWhite’s collection of essays is just that—a gathering of pieces that stand on their own, having no real connection to the other essays in the book. Charlotte’s Web, on the other hand, is a story. Each chapter connects to the others. They work together to convey a cohesive body of information.\nFirst Corinthians is not a collection of essays, where each chapter is its own thing, independent of what comes before or what follows. It is a letter, and like Charlotte’s Web, is meant to be read as a cohesive work. \nIn my experience, we seldom read 1 Corinthians 13 in this way. More often than not, we lift it up out of its context and treat it like a stand-alone love poem suitable for weddings and cross-stitch. And it certainly works on that level. But when we consider this famous chapter of Scripture in its actual context, it reads less like a love song and more like a rebuke.\nLet’s walk back a bit in the text. In chapters 10–12, Paul rebukes the Corinthian believers for not caring enough about each other’s consciences, for indifference to sexual immorality, for dressing in ways that would have been provocative in their culture, for gorging themselves at the Lord’s Supper while their poorer neighbors sit beside them hungry, for being confused about the value of various gifts and abilities. In other words, the Corinthian believers are struggling to live selflessly. They’re struggling to put each other’s needs and consciences above their own. They’re struggling to love one another.\nThen comes 1 Corinthians 13. If I have the most amazing gifts and popularity, but no love, I’m just making noise. If I’m the smartest, most devout person in the room, but don’t have love, I’m nothing. \nAnd what is love?\n“Love is patient, love is kind. Love does not envy, it is not boastful, it is not arrogant” (v. 4). Love is the opposite of what they’re being to one another.\nI like reading this chapter in the context of what came before it, rather than as a stand-alone piece. Reading this chapter as a word of correction, rather than as a flowery love poem, gives it teeth. It raises the stakes. As you read, think of someone you struggle to love, maybe someone you look down on in some way, for some reason, and ask the Lord to search your heart through His Word and help you see where you fail to love.\nAfter all, when we come to the end of this life, with all our struggles, pride, and resentments, those things will all fall away. Only love will remain. So why not receive these words from Paul as a correction, and practice the art of loving well now?\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day17.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 12:1-31, Romans 12:4-5, 1 Thessalonians 5:19-21",
        "devo_title": "Unity and Diversity in the Body",
        "devo_summary": "\n                    \n                    I’m sure the debate will end at some point, but for now, people love a good debate on who the greater basketball player is: Michael Jordan or LeBron James. You can compare championships, MVP awards, games played, points per game—stat after stat—and no decisive winner is proclaimed. The divide over Air Jordan and King James is a hallmark of NBA discussion. Everyone wants their guy to be the guy. No one wants to be the lesser, and sadly, this stat-and-status war can be found in the local church, too.\nThe Corinthians were struggling with spiritual gifts. They weren’t having a hard time exercising them—they were exalting them. They were comparing stats. Who has what gift? Who plays what role? They were dividing themselves over their differences, demeaning the unifying power of Christ’s cross, resurrection, and impartation of the Holy Spirit. They found their identity in what they did for Jesus, rather than who they were in Him. \nBrothers, we are not our ministries. Christ defines us. Just as we are prone to do, the Corinthians were turning the gifts of the Spirit into status symbols, assuming that people who have been given “Gift A” are more important, vital, and spiritual than people who have the less flashy, middle of the road, “Gift M.” Paul crushes this division with a vision of the body; toes, nose hairs, and eyelids are all a part of the whole. No one is more or less a part of the body than anyone else.\nWhy do we lift up the preachers and teachers among us and look right past the sound guys, the setup crew, and the people who print the bulletins? Don’t downplay your role, via the gifting of the Spirit, in your local church. Your service, encouragement, and giving matter to the mission of God. But don’t overplay your gifts either. We forget that the Spirit is at work in all of us. From the seminary-trained preacher to the volunteer children’s ministry teacher, and from the hands and feet to the vocal cords, the Holy Spirit is at work.\nWhen we remember that it’s the Spirit who is at work in our local church, we are less likely to compare stats and status. When we know this truth we will see, as Paul says, that “the members would have the same concern for each other. So if one member suffers, all the members suffer with it; if one member is honored, all the members rejoice with it” (1 Corinthians 12:25–26). Sure, we all have different gifts, but the source is the same Spirit. Everyone is valuable. God made it so.\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day16.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 11:2-34, Matthew 26:26-28, Romans 3:25-26",
        "devo_title": "The Lord’s Supper",
        "devo_summary": "\n                    \n                    Growing up, the Lord’s Supper never made much of an impact on me. I remember being jealous of those who were older and could enjoy it. And I remember playing with the little plastic cups after they were used.  \nOnce, when I was no more than eight years old, our church had communion on a Sunday evening. It must’ve been during the summer or over a holiday weekend, because after church I spent the night at my friend Chris’s house. His older siblings had brought home a bunch of those plastic cups and set up a communion table in their bedroom. We munched on crackers and used the cups to drink tiny cups of Kool-Aid. We laughed a lot that night, walking the line between irreverent play and doing what Jesus commanded of us (1 Corinthians 11:17-26).\nIt wasn’t until a few years ago that I began to truly appreciate the bread and the cup. Our bank account was empty—not an exaggeration. Everything in the house seemed to be breaking. I was miserable at my job. Vocationally, I felt lost. \nI knew the gospel was true. Objectively true. But the application was getting obscured by a cloudy dark night of the soul. There were few stars shining to steer by. No sermon seemed to help, though we faithfully attended church. I even taught Sunday School every now and again. Nothing I read gave any relief either.\nOne Sunday I was not very happy about going to church. So I prayed and asked God to give me something to hang some hope on, some word that would encourage me. What I was really after was a word of hope. Something I could hold on to. \nThat Sunday we had communion. I can remember looking down at the bread and the cup as I held them, one in each hand. Something I could hold on to. And then the pastor spoke Jesus’ words: “This is my body which is for you… This cup is the new covenant in my blood” (vv. 24-25). For the first time in a long time, I felt like I could hold on to something. When I drank from the cup, I was drinking in a promise of grace, mercy, and love made by the resurrected King. Since that Sunday, I have enjoyed the Lord’s Supper as a physical sermon of God’s covenant love for His people. \nJesus commanded us to eat the bread and drink the cup “in remembrance” of Him—to remind us of who He is, and who we are to Him. He wanted us to hang our hope on to something true, as represented by the broken bread and the poured-out cup. It’s not our faith we are hanging on to, but Jesus.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day15.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 6:19-20",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a reminder that Christ’s sacrifice for us includes the entire self—body as well as soul. \n Don’t you know that your body is a temple of the Holy Spirit who is in you, whom you have from God? You are not your own,  for you were bought at a price. So glorify God with your body.\n—1 Corinthians 6:19-20\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/4-12Corinthians-2.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "2 Timothy 2:19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nNevertheless, God’s solid foundation stands firm, bearing this inscription: The Lord knows those who are his, and let everyone who calls on the name of the Lord turn away from wickedness.\n—2 Timothy 2:19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day13.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 10:1-33, 1 Corinthians 11:1, Exodus 13:17-22, Philippians 2:1-2",
        "devo_title": "Warnings from Israel’s Past",
        "devo_summary": "\n                    \n                    In our culture, it is not uncommon to hear someone say, “I have the right to do what I want to do for my own good,” especially in areas of personal choice and life decisions. At the heart of this statement is a belief that our identity is founded on and formed by these expressions of personal freedom.\nThis pursuit of “doing what’s best for me” is as old as the garden of Eden. We are all lovers of self by nature. In fact, the Bible presupposes self-love. This is why the command to “love [others] as yourself” is so deeply unsettling (Matthew 22:39). It means that we have to love others with the same amount of energy, force, and sacrifice that we do for ourselves. It should be no surprise then that in our culture, people’s consciousness is so bound by self-love.\nHowever, in matters of the Christian’s personal conscience, the Bible is clear: “No one is to seek his own good, but the good of the other person” (1 Corinthians 10:24). The pursuit of good toward others is the ultimate expression of love. We do to others what we would have them do for us, even when it curtails our own desires and freedoms. \nJesus Christ provided the ultimate expression of this command in His loving pursuit of good for the sake of others. Christ gave up many freedoms to secure our salvation. Now as ambassadors for Christ, we are called to give up many personal rights and preferences, so that others may receive and enjoy His salvation too. This is not always easy, since our sinful hearts often tempt us to insist on our own rights at the expense of others. \nTo make matters even more complex, there are also times when we must pursue our freedoms in order to confront the legalism of others. Regardless, the heart of the issue here can be stated in a simple but heart-searching question, namely, “How does this choice or decision honor God, love others, and promote the gospel?” \nAs Christians, our identity is found in Christ, and our identity is formed as we imitate Christ. In Him we see the greatest form of love the world has ever known. He died for our good and our gain. Now, we are called to die to self for the good of others. \nIn a culture fully drunk on self-love, it’s easy for people to reason, “I have the right to do what I want to do for my own good.” Yet, we as Christians are called to live out the biblical law of love which says, “I will lay down my rights for the good of others.”\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day12.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 9:1-27, Matthew 15:11, Romans 15:17-19",
        "devo_title": "Paul’s Example",
        "devo_summary": "\n                    \n                    Anyone who’s been in leadership—whether in the business world, the church, the home, or school—knows there is almost always someone who will disagree with you. Sometimes it’s disagreement over certain policies or ideas or practices. Sometimes it’s disagreement with your entire philosophy.\nPaul felt this opposition regularly. He was often criticized for his theological views, the practices of his ministry, and the people he associated with. In fact, he was critical of other leaders at times too (Galatians 2:11-13). At some level, leaders are always out front, which means the crosshairs find them quite easily. And frankly, folks are often quick to point a finger when something goes wrong.\nWhile Paul is explaining, and even defending, his leadership here, it is riddled with principles we all can learn from. In short, every Christian is called to make disciples, and so every Christian is a leader. So what does Paul say about his own ministry?\nFirst, he explains that he has a right to be in leadership. He tells the Corinthians that he was called by Jesus, and therefore, should be able to minister to them and should be supported by them. The Corinthian church’s faith is proof of that. They were “the seal of [his] apostleship in the Lord” (1 Corinthians 9:2).\nSecond, he roots his leadership in Scripture. He defends his teaching and philosophy not on worldly wisdom or cultural customs, but on what he believes God’s Word says. He is not a false teacher. The Bible can back him up on that.\nFinally, he tells them that his ministry is not selfish. He wants them to know that all he does is for the good of others. He humbles himself in every situation in order to serve, and he is not a compromiser. The fact that he has rooted his ministry in God’s call and biblical truth validates that.\nAll of us can learn from Paul here. As ministers of reconciliation (2 Corinthians 5:16-21), we are called by God to lead others in biblical truth and servant-hearted humility. Regardless of opposition, if we are grounded in this, God can use us just as He used Paul.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day11.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 8:1-13, John 10:14, 2 Timothy 2:14-19",
        "devo_title": "Food Offered to Idols",
        "devo_summary": "\n                    \n                    Christian liberty is easy to abuse. The truth that we’ve been freed from bondage to the law can quickly turn into the notion that we are free to be a law unto ourselves. We are naturally bent selfward, and so we are inclined to bend grace selfward as well. \nBut the heart of the gospel of grace is not that we are beholden to no one, but that we belong wholly to Someone. We are Christ’s. Because we are His, we are free from the bondage of the law, but we are also free from the bondage to self and all the idols our hearts will invent.\nFor this reason, Paul can say to the Corinthians, “Food will not bring us close to God. We are not worse off if we don’t eat, and we are not better if we do eat” (1 Corinthians 8:8). Our liberty in Christ is not bound by idols or enslavement to them (1 John 5:21), nor by slavish asceticism from God’s good gifts, for all things are from Him. At the same time, our liberty is not for self-serving. Indeed, true liberty is not chiefly about the self, but about what is good. For this reason, we can see several principles quite clearly:\nFirst, our liberty in Christ is for freedom. “For freedom Christ has set us free,” Paul writes in Galatians 5:1. To use freedom to return to sin is to use freedom to return to bondage.\nSecond, our liberty in Christ is for service, and this service is defined by love. “Love builds up,” says Paul, and this is the object of Christian liberty (1 Corinthians 8:1). It is for seeking the kingdom, for the building up of the body, for loving our neighbors.\nThird, our liberty in Christ is for His glory alone. Christ has set us free that we might be His. He knows His own, and His own know His voice (John 10:14). Any exercise of liberty that does not honor Christ is no liberty at all.\nIndeed, “all things are from him, and we exist for him” (1 Corinthians 8:6). Christ has set us free. Thanks be to God! Let us therefore walk in that freedom, in love, in service, in honoring Christ, by the power of His Spirit, who has sealed us for His kingdom.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day10.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 7:1-40, Genesis 2:24",
        "devo_title": "Principles of Marriage",
        "devo_summary": "\n                    \n                    He wouldn’t leave her side. \nWhen I asked David to consider a significant leadership role within our church, he politely declined. I felt I had all the right reasons for needing him to step into this role, but his perspective on what was urgent and most important was quite different from my own. His concern was for his wife, whose life was on a countdown clock—one cancer had created and hadn’t given a definitive answer of when time would be up. For him, knowing that her time was short, he wouldn’t find himself in any leadership or ministry capacity apart from her. The urgency of time shaped the way he stewarded his marriage. It should shape ours as well. \nThe Corinthians had inquired of Paul regarding some issues they were trying to sort out. Namely, questions about marriage, singleness, and divorce, and the timing of all those things, rang in their minds. The church wondered if the return of Christ was at hand and the end of the age was near. It was enough for them to wonder what they should do with their relationships.\nThe instruction Paul gives them in 1 Corinthians 7 is just as relevant for us today as it was then. Married believers should love and serve each other in the way marriage is intended to be demonstrated (vv.1-7). Marriage is indeed good, and married believers should not divorce or abandon their spouses (vv.10-11). If you are married to an unbeliever and they want to stay married, then do so (vv.12-16). Single people can pursue marriage, although it may be wise to remain unmarried if you possess the gift of singleness (vv.8-9, 25-35). And in whatever station in life you find yourself at this present time, choose to “remain with God” (v.24). \nThe point is that, given the brevity of life and the serious nature of the times, Scripture calls us not to squander our current relationships, but instead to be better managers of them all the more. “God has called [us] to live in peace” with one another (v.15). And though “time is limited” and “this world in its current form is passing away” (vv.29, 31), Paul says these things serve to give us a right perspective on our lives and relationships.\nThe brevity of our lives should motivate us to walk with one another in dignity, love, and integrity. In light of the passing times, we are called to steward our singleness or marriages well. Whatever the case may be, we are to devote our relationships to the Lord.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day9.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 6:1-20, Matthew 18:15–20, Titus 3:4–7",
        "devo_title": "Glorifying God in Body and Spirit",
        "devo_summary": "\n                    \n                    Every man knows the experience of guilt and shame from sexual sin. Whether it’s the frustration of continued thoughts you think you can’t control, falling victim to the lure of pornography, committing acts of sexual immorality, or dealing with urges that feel unnatural—no man is exempt from the lusts of the flesh and the damage they do.\nWe sin, and then we are convicted of that sin in our hearts, as we should be. In 1 Corinthians 6, the apostle Paul reminds us, “You are not your own, for you were bought at a price” (vv.19-20). But when we forget who we are in Christ Jesus, we turn away from Him because we feel guilt and shame, rather than turning toward Him in repentance. Then, because we don’t know how to handle our guilt and shame, we feel powerless, plunging deeper and deeper into the pit. \nThe cycle is vicious, relentless. We don’t know where to turn. Telling friends doesn’t seem like an option because the shame is too much to bear. Talking to a pastor feels ridiculous because we imagine he surely doesn’t know what it’s like to deal with these sins, let alone the guilt and shame that seem to render prayer impossible.\nBut men, there is good news for you today. Jesus died for you. He didn’t just give Himself up for your “respectable” sins. He died, bearing the guilt and shame for the things you don’t want anyone else to know about. Cleansing, healing, forgiveness, and restoration are all possible for you because of your Savior who loves you.\nIn addition, this good news has the resources to help you experience real change and victory over your sin. Again, in 1 Corinthians 6, Paul walks through a laundry list of sins that make one unfit for the kingdom, and it includes many of our pet sins and temptations. We read this list and surely hear that we will not inherit the kingdom. But Paul’s next sentences should make our hearts sing: “And some of you used to be like this. But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God” (v.11).\nDid you catch the past tense in those verses? Christian, you are no longer defined by your struggles, failures, and shame. You are defined by the new identity you have in Christ. You have been declared righteous before God, you have been cleansed by God, and you have been set apart from your sins by God the Father, in the name of His Son, by the power of the Spirit. You are new.\nStop that.\nWork harder.\nBe better. \nThese commands never changed one heart, and they won’t give you victory over your hidden sins—but the gospel will. In Christ, you are clean. In Christ, you are new. In Christ, you are empowered by the Spirit. In Christ, you have brothers who will help you in your faith journey. These are the words you need. They are true and they bring real life, real change, and real joy.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day8.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 1:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 1 Corinthians.  \nGod is faithful; you were called by him into fellowship with his Son, Jesus Christ our Lord.\n—1 Corinthians 1:9\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/4-12Corinthians-1.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "Romans 5:1",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nTherefore, since we have been declared righteous by faith, we have peace  with God through our Lord Jesus Christ.\n—Romans 5:1\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day6.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 5:1-13, Leviticus 18:8, Galatians 6:1-10",
        "devo_title": "Church Discipline",
        "devo_summary": "\n                    \n                    Mothers of a generation or so ago called it “the fear of God.” Those mothers wanted to ensure you had it in you, and hopefully in spades, so that you’d hit the brakes, reconsider, and turn around, should something wicked this way come (a.k.a. temptation). They’d say, “Would you do this (or say that) if you knew Jesus were right there beside you? Because He is, you know. He is.” \nThe author Brennan Manning referred to this as “the present risenness of Christ.” Manning’s emphasis was similar in kind to those mothers, but minus the fear factor. The ragamuffin writer prayed you and I would be constantly aware of and in awe of Christ’s living presence with us, and that it might embolden us to do the next thing in love, whatever that may be. Manning might say, “Wouldn’t you do that if you knew Jesus were right there with you? Because He is, you know. He is.”\nOf course, the common ground between mothers and Manning is that even though Christ’s body is not here, His Spirit is. He is, you know. And as such, this has implications for our lives. The apostle Paul tried to communicate the same thing to the believers in Corinth concerning their trouble-ridden church, as well as some much needed discipline: “Even though I am absent in the body, I am present in spirit” (1 Corinthians 5:3).\nAnd leave it to the apostle Paul to embody the best of both the mothers and Manning. It’s as if he were saying to the Corinthians, “I may not be there in the flesh, but I’m still there. I love you, but there’s something going on that’s not right. And since I love you, let’s do the right thing in response to it.” It takes both of those aspects for anything even remotely related to true church discipline, as Paul envisioned it, to work.  \nUnfortunately, we too often see it played out one-sided. To err on one side is to slide toward “an angry God,” who is just waiting in the wings for us to mess up. And to err on the other side is to ease into the arms of “a permissive God,” who wants us to be all we can be, which God truly does, but not at the expense of His holiness. Call it what you will—tough and tender, truth and grace—but that Christlike combination is absolutely necessary if our desire is to not grow weary, to not lose heart in doing good. \nAnd is such discipline and goodness achievable in this life? A chorus of witnesses, including our mothers and Manning and Paul, would say, “Yes.” Because God is right here with us. He is, you know. He is.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day5.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 4:1-21, Zephaniah 2:3, 1 Peter 5:5",
        "devo_title": "The Faithful Manager",
        "devo_summary": "\n                    \n                    On numerous occasions, people have told me that they reject the idea of an infinite God who does what He wants for His own glory. In response to such assertions, I sometimes say, “Well, we’re finite, and by nature, we want to do whatever we want for our own glory! Why would it be wrong for God—that being of which there is none greater—to seek His own glory?” \nThe sad reality of life in this fallen world is that we are all hungry for the applause of others. Scripture teaches us that we are either seeking the praise of men or the praise of God. This is an important recurrent theme in the letters from the apostle Paul, whose reputation was constantly demeaned by men who presented themselves to the members of the church as being “super apostles.” They sought to convince the Corinthian church that they were superior to Paul because of their credentials, gifts, and accomplishments, and they boasted in them constantly. In order to help the members of the church learn to think properly about who is truly approved by God, Paul taught a valuable lesson on stewardship.  \nThe apostle constantly viewed himself as a steward in the house of God. He considered the ministry to which Christ had called him as something precious and entrusted to him. He wanted to be found faithful to carrying out the work of the gospel in the church and in the world. Paul was motivated by a desire to bring glory to God—not for himself to be praised by other men. \nIt is far too easy to start wanting to serve in the church or in ministry for the applause of men. We can do this very subtly. Many of us are skilled at what is known as the “humble-brag.” We may not appear to be overtly seeking the praise of men, but our desire to number the size and scope of our service shows that we are seeking it in more covert ways. \nAt the end of our lives, the only praise that will matter is that which comes from the only true and living God. “And then praise will come to each one” from Him (1 Corinthians 4:5). Everything about our lives right now is just scaffolding. Once the scaffolding is taken down at judgment day, God will reveal who He has approved as being a faithful steward, and who He has not. \nAs we look to the Lord Jesus, and labor to bring Him glory, we find we care less and less about the praise of men, and more and more about the praise that will come from our living God. May God give us grace to seek that praise continually. And may we seek to bring Him the glory for His mercy, grace, and goodness to us in Christ.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day4.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 3:1-23, John 5:24, Romans 5:1",
        "devo_title": "The Role of God’s Servants",
        "devo_summary": "\n                    \n                    When Paul proclaims, “God’s temple is holy, and that is what you are” (1 Corinthians 3:17), he is offering a profound encouragement and a heartfelt challenge. Both this encouragement and challenge were initially meant to stir the Corinthian believers from a lackadaisical approach to their spiritual walk, but it also applies to our everyday circumstances even now. \nWithin that powerful declaration there are two clear messages from Paul. The first is a celebration of your deepest reality: In Christ you are holy. You are seen by God as such, and you have the glorious spiritual benefit of not only walking with Him now, but also walking into the fullness of eternity with Him. \nHowever, the second message is a word of caution: a clear marker of participation in the temple is that you are intentionally pursuing holiness. When Paul says, “Don’t you yourselves know that you are God’s temple and that the Spirit of God lives in you?” (v.16), he is issuing a subtle challenge. Much like when a loving parent asks their child, “Are you supposed to be doing that?” Or, if Paul were to say, “Have you forgotten that you are God’s temple? Because sometimes it’s a little hard to tell by how you’re acting.”\nWe need only look back to earlier in the chapter to see that Paul is concerned about the spiritual progress of the believers at Corinth: “For my part, brothers and sisters, I was not able to speak to you as spiritual people but as people of the flesh, as babies in Christ” (v.1). Paul seems both frustrated and genuinely concerned. The Corinthians were crawling when they should have been running.\nI wonder how this passage first struck you in your reading today. Were you encouraged by being able to participate in the temple, encouraged that you are intimately connected to God and His people? Or were you challenged by Paul’s stern cautioning? Was there something in your spirit that quickly identified areas of your life where you need to pursue holiness and growth? Maybe it was a both/and situation for you. Paul certainly wanted both for his readers, and I’ve come to believe that God wants both for us today. \nWhen you feel those waves of attack, telling you that you’ve lost your worth, lean into the reality of the temple. You are God’s servants: holy, redeemed, forgiven, and sent with a purpose. When you know you’re not investing what you should into your growth and relationship with God, heed the challenge and respond to the call. You’ve been set on a journey toward wholeness and holiness. Keep your eyes fixed on Jesus and refuse to falter! This is the way of a temple people.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day3.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 2:1-16, Romans 8:26-30, Ephesians 1:13-14",
        "devo_title": "Spiritual Wisdom",
        "devo_summary": "\n                    \n                    God the Father, God the Son, and that other guy who does some stuff… If we’re honest, that’s often how we think of the Holy Spirit. We don’t understand the Spirit’s work, so we don’t consider His work often enough. Oh, how misguided we are in this. Consider first what we see of the Spirit in these verses, keeping in mind that this is but a fragment of who He is and what He does.\nThe Spirit searches the depths of God and knows the thoughts of God—the same God of whom the Bible says His knowledge is too wonderful for us and no one can be His counselor. But the Spirit knows the wisdom and complexity and infinity of God’s mind, motives, movements. \nNow God has revealed these things to us by the Spirit, since the Spirit searches everything,\neven the depths of God (1 Corinthians 2:10).\nThis same Spirit is the power and clarity of God’s Word. The reason Scripture is living and active is because the Spirit communicates it to a believer’s soul. The spiritual person, the one who is in Christ and in whom the Spirit dwells, can “evaluate everything” (v.15). That means, in part, that we have eyes to see and ears to hear what Scripture says, and also a mind to understand it. Through this knowledge we can evaluate everything else we see and hear according to what the Spirit has spoken to us.\nLest you think the Spirit offers only distant knowledge or impersonal communication, consider what Romans tells us: He helps us in our weakness and intercedes for us with groanings too deep for words (8:26). This means when we are unable to pray, lacking words to communicate with God, the Spirit who knows the mind of God takes our yearnings and carries them to God on our behalf. \nThe Spirit is more, even, than what we have seen in these verses. Ephesians 1 tells us that we are “sealed by the Holy Spirit” in Christ, and that the Spirit is a “down payment of our inheritance” (vv.13-14). This is what every believer in Christ Jesus is because we have the Spirit dwelling within us: We are sealed and guaranteed. Our place as firstborn in God’s family is guaranteed. The promise of glory is locked in because we carry the Spirit within us.\nIn these four truths (and there are so many more throughout God’s Word) we see the Spirit woven into every aspect of our faith and Christian life, imparting to us the wisdom of God, and interceding on our behalf before the Father. He is God indwelling us, sealing our faith, and guaranteeing the promise of eternal life with Jesus. No longer can we overlook or underplay the Holy Spirit.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day2.jpg"
    },
    {
        "book_title": " 1 & 2 Corinthians",
        "devo_passages": "1 Corinthians 1:1-31, Exodus 19:5–6, James 1:18",
        "devo_title": "Christ the Power and Wisdom of God",
        "devo_summary": "\n                    \n                    As you read Paul’s letters to the Corinthian church, you might notice from time to time that his tone sounds angry. That’s because he is fighting for them, which sometimes looks like fighting with them. What is Paul fighting for? \nUnity. \nPaul wants the church in Corinth to embrace its identity in Christ. He wants them to know “we were all baptized by one Spirit into one body—whether Jews or Greeks, whether slaves or free—and we were all given one Spirit to drink” (1 Corinthians 12:13). He wants them to realize that we were called by God into fellowship with His Son (1 Corinthians 1:9). This is the basis for our call to unity. \nPaul uses this image of being one body in a variety of ways throughout these letters. He writes about how our bodies are temples of the Holy Spirit, meant for holy purposes (1 Corinthians 6). He writes about the Lord’s Supper, when believers gather together to partake of the body of our Lord (1 Corinthians 11). He talks about how the Church is one body, made up of many parts (1 Corinthians 12). He writes about the resurrection of Jesus’ body, and how believers will experience that same resurrection (1 Corinthians 15). He encourages the Corinthian Christians to give to others in need because they are one (2 Corinthians 8). \nThe image of a body is a great picture of the Church. Just as we want each part of our physical bodies to function in unified and healthy ways, this should be our vision for the Church. Believers in Jesus are not merely a collection of individuals who share a Savior. We are one, united in Christ. This unity lies at the heart of these letters.\nSo here at the beginning of this reading plan, maybe a good place to start is by asking: where do you need to pursue unity? Is there anyone with whom you need to seek peace? If you aren’t sure how to answer those questions, ask the Lord to show you if there are any relationships in your life that need mending. Ask God to fight for your heart.\nAs you read through 1 and 2 Corinthians, think about what it means that the Church is one body made up of many parts. Think about what it means to live in that unity. Consider what it means to be part of the body of Christ.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/05/HRT-Corinthians-Shareimage-Day1.jpg"
    }
]