[
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 1:1-14, John 1:12-13, Colossians 1:16",
        "devo_title": "Every Spiritual Blessing",
        "devo_summary": "\nBY Amanda Bible Williams\n\nI have a dear friend who wants to be a foster mom so badly, she can hardly speak of it without tears pooling in her pretty eyes. She longs to be a safe place for children without a home, to give graciously to those whose lives are marked by need, to be a friend to the teenager who is convinced she’ll always be alone.\n\nThinking about this, of course, makes me cry. Because I know my friend, I know the weight of these gifts she’s giving. And I know they aren’t simply gifts to one person or a few, but they are gifts to us all. So, all I can say is YES. Thank you for giving what you are not obligated to give to those who cannot repay you for your gifts. Thank you, thank you, thank you.\nThis kind of overwhelming gratitude is Paul’s tone as he begins his letter to the Ephesians. Well, this times infinity. Paul isn’t giving thanks for a gift given only to himself, or only to a few. He is praising the Lord for the gifts given to all believers— indeed, to ANYONE who would believe in Jesus as Messiah.\nPraise the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavens.\n– Ephesians 1:3 HCSB\nWhat are these blessings that have Paul borderline giddy, with his praise hands held high? In verses 3-14— which were a actually one, long sentence in the Greek— Paul declares three gifts, or blessings, that are irrevocably theirs (and ours!) in Christ. Let’s see if we can identify them together.\nBlessing #1: God the Father elects. (Ephesians 1:3-6)\nI know, words like “chosen” and “elect” and “predestine” make me squirmy, too. But they’re there, in black and white (and not just there, but throughout Scripture. Use John 6:44, Romans 8:29, Ephesians 1:5 as starting points for further reading). But before we get put our defenses up, consider this with me: What if we focused less on the selectivity we perceive in these words and more on the surety they present?\nWe know God saves us according to His love and mercy, not in response to any works of our own. (This is what Paul spent an entire letter scream-talking to the Galatians about in our last study! See Galatians 3:11.) Because our salvation is by Him alone, it must be intended and carried out by Him alone. He is the only one able to do it! Now, couple that with this glorious passage in John 1:12: “But to all who did receive Him, He gave them the right to be children of God.” God gives guilty sinners undeserved gifts and makes them our right.\nElection is not a hoop to jump through. Election means there is no hoop! God chose us. All the hoops are null because Christ jumped through them all for all.\nBlessing #2: the Son redeems. (Ephesians 1:7-12)\nThe first blessing is eternal—God chose us before He poured the world’s foundation, and we reap the benefit yesterday, today, tomorrow, forever. Likewise, our redemption in Christ is a present and eternal promise. We are forgiven now, and we will be forgiven still. The redemption gained by Christ’s blood will never expire.\nNot only that, but Christ’s sacrifice unifies all believers. Paul’s letter was written to the earliest Christians, who knew people as belonging to one of two categories—Jews and Gentiles. That God’s plan of redemption included any and all who would believe, regardless of their ethnicity, was radically good news.\nBlessing #3: the Spirit seals. (Ephesians 1:13-14)\nThe Holy Spirit is the fulfillment of Christ’s promise to send a Counselor (John 14:26). But the Spirit is also Himself a promise, a down payment of our full redemption and future glory. God is the only One who can give eternally, not bound by time and space or any other limitation. His promises are as good as fulfilled the moment He makes them! God gives us the Holy Spirit to be with us now as we await Glory, but also as our Glory guarantee (Romans 8:30).\nWhew. That’s a lot of blessing, you guys.\nIt’s no wonder Paul rattled all this off in one, long, Greek sentence—this is incredible and incredibly life-changing good news! Salvation is a gift sovereignly and freely given by God, redemption is fully accomplished by the Son, and our future glory is safely sealed by the Spirit. \nFriends, this message was not just for the churches in and around Ephesus. This message is for you and me. We have been given a wealth of gifts we can never earn, a heap of blessings we can never repay, only because our good God desires to give them.\nYES. Thank you, Lord, for giving what You are not obligated to give to we who are only made worthy by the sacrifice of your Son. Thank you, thank you, thank you.\n\n \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram1.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 1:15-23, Philemon 1:4-7, 2 Corinthians 4:3-6, Psalm 8:1-9",
        "devo_title": "Immeasurable Greatness",
        "devo_summary": "\nBY Annie Downs\n\nIt’s not unusual for me to be in a room full of people who are smarter than I am. It’s partly because that’s a goal of mine: to surround myself with people who are significantly better at life than me. But it’s also because I’m just not Harvard material. I may have an above average funny bone, but my brain is pretty average.\nA few years ago, I was selected to be in a month-long class full of people who are massively impacting the world and doing it with their impressive brains and contributions to society, through technology and non-profit work. I kind of snuck in—it was the favor of God for sure. For an entire month, I sat around a table with ten people of different religious and regional backgrounds from me, and certainly a much higher pedigree. My average brain and I were one of a kind.\nEarly on in that first week, I realized I didn’t have what it took to hang with that crowd; and the worst part was, they knew it, too. It wasn’t long before I was being overlooked in conversations and ignored by my peers when group work was being done. They had weighed my brain and found it wanting.\nEach day, I took the train from one side of town to the other in order to attend this symposium, and the commute gave me time to read my Bible and journal a bit. I was desperate for God’s help every day, nervous to go in and sit with that group of rockstars, wishing to avoid the embarrassment of not being smart enough for them.\nBut God steered me toward Scripture about what our minds can really do—what MY mind can do. We can pray for our brains to be enlightened because we’ve been given the mind of Christ (1 Corinthians 2:16). Our actual thinking and ideas are sharpened by the indwelling of our all-knowing and all-powerful God! Even better, we can present those ideas with full integrity and honesty, because we have the mind of our perfect Savior.\nI began to pray earnestly that God would increase what my brain could do—not because I wanted to be the brainiest person in the group for that month, but because I realized I was the only representative of Christ in that room. How my brain showed up reflected Him. If Jesus really fills all things in all ways like Ephesians 1:23 says, couldn’t He do that with my mind? I wanted a transformation, a new wineskin (Matthew 9:17), a better mind. I wanted the mind of Christ.\nAnd as I prayed each morning, it happened. I don’t consider it an exaggeration to tell you it felt like a miracle to me. My capacity to remember increased, ideas came to me more quickly, and it felt like my brain muscle was getting stronger. As the month rolled on, my relationships around that table changed as they started hearing me, trusting me, and allowing me to equally contribute to the conversations. \nMaybe I’d become way smarter. But maybe, above all else, my confidence was through the roof. I HAD THE MIND OF CHRIST. I could share any idea, and whether it was loved or not, I believed it was a good one. Jesus had changed me; the power of prayer had worked for my good and for His glory.\nYears later, I am changed by that month, but not just by what happened in the classroom. I am far more changed by my time on the train and what God taught me there. The power of Jesus changes our lives, but it changes our minds, too. \nThese days, I run my own business. I write books for a living. I have to have a mind that is focused and increasing in knowledge constantly. I read books, I listen to podcasts and lectures. But the honest truth about any smarts I have is because of exactly what Ephesians says: I pray for spiritual insight. I pray for wisdom beyond my years and in spite of my tendency towards foolishness. I ask Jesus to do in my mind the miracles only He can do—fill me with the immeasurable greatness of His power. Everything good in me is for the glory of Christ (Philemon 1:6).\nOur strength is limited, but His strength is vast. Our hope wanes, but His hope is eternal. His Word says His riches and power are now ours (Ephesians 1:18-19). Let’s believe Him.\n \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram2.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 2:1-10, Ezekiel 36:26-27, John 3:16-21, 1 John 5:1-5",
        "devo_title": "From Death to Life",
        "devo_summary": "\nBY Sarah Matheny\n\nThe best day in all of social media, I would argue, is Thursday. On Thursdays we are treated to a little something the kids are calling “Throwback Thursday,” or #tbt. I don’t pretend to be able to keep up with social media trends, so I hope you’ll forgive me if I’m #doingitwrong.\nRegardless, Throwback Thursday is, in a word, awesome. After all, everyone loves a good makeover. Whether it’s simply to ridicule the past or embrace the present, I think we can all agree that witnessing a transformation is tremendously satisfying. That is, unless you are the casualty of someone else’s #tbt, and are left having to untag a very public photo of yourself sporting a spiral perm, Aqua-Net-frozen bangs, acid-washed jeans, bright yellow slouchy socks, and knock-off Keds. (That description alone confirms that I am indeed too old to be talking about any kind of current trend whatsoever.)\nWhen reading Paul’s words in the opening of Ephesians 2, we’d be remiss to equate his description of transformation with some sort of cute, little makeover. Not only would it minimize the transforming power of the love of Christ, which we’ll get to shortly, but it would also gloss over the depravity of sin.  \nPaul writes that when “we followed the ways of this world” we were dead (Ephesians 2:1-2).  He’s obviously not speaking of adhering to sad fashion trends here, or any other poor choices we’ve made, really. He’s talking about who we are in ourselves, about the nature of our flesh, and about the Enemy at work in our disobedience of God. He’s talking about death.\nWhen I think of the horror of sin in light of who Christ is and has created us to be, I remember those PSA-style posters they showed us in high school, the ones depicting the decline of a methamphetamine user. Each picture shows the individual falling further into their addiction, gratifying their flesh despite the severe cost to their wellbeing. The physical deterioration is alarming. Even more horrifying, though, is that you can almost see the life leaving their eyes. How can death be what God intended for His workmanship? It isn’t!\nSisters, this is what it looks like for any of us— or our neighbors, friends, and family— to live a life apart from Christ. Paul adds that we, left to our nature, are deserving of this dark fate and, even worse, the wrath of our our Creator (Ephesians 2:3). I’m so grateful there is a “but” in these verses!\nBut God.\nBut God, who is rich in mercy, because of His great love that He had for us, made us alive with the Messiah even though we were dead in trespasses. You are saved by grace!\n– Ephesians 2:4-5 HCSB\nGod is the Author of our lives and of the change in our lives—not because we deserve it, but only because of His goodness, His mercy, and His love. There is no behind-the-scenes footage to be shown of the good works that earned us such a gift. No, this soul-deep change is made in spite of our behind-the-scenes footage! We are saved by grace. \nWe can marvel at the transforming power of His love. It’s a love that raises us up with Him on the resurrection side of the grave and makes us truly alive. It’s a love that makes us new. This is what we were made for! Not the death, depravity, and suffering we experience while trying to live life apart from Him.\nWe are His masterpiece. “He has created us anew in Christ Jesus, so we can do the good things He planned for us long ago” (Ephesians 2:10, NLT). Obedience, service, Kingdom-building—these are no longer duties and burdens to be carried but blessings to be fulfilled. They are byproducts of being made new in Christ!\nThough God gently reminds us— by His Word and in His love— of who we once were, He will never leave us or abandon us. He will never throw us back, not even on a Thursday.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram3.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 2:11-22, Galatians 3:23-29, 6:15, Psalm 118:22, 1 Corinthians 3:16",
        "devo_title": "He Is Our Cornerstone",
        "devo_summary": "\nBY Rebecca Faires\n\nIt’s so tough that we have to live with people.\nI mean, we would be so lonely without them, but it’s hard to get along, you know? My family is seven people. Seven mouths to feed, fourteen feet to shoe, one-hundred-forty fingernails and toenails to trim, and a million ideas about the purpose of a Saturday. It’s complicated. Even if you don’t have that many folks under your roof, it’s hard to keep the peace anytime we’re forced to rub shoulders with other imperfect humans.\nEven when times are so good, unity can be so hard. I always expected family life, or roommate life, to just feel like a basket of kittens. So why aren’t we all adorably snuggling and saying meow, meow already?\nThe early church had the same problems with unity that we have today. Paul tries to halt their squabbling by reminding them of this key truth: Christ is the cornerstone. Obviously your house is going to fall down if it’s not built on the cornerstone. Unity is enormously difficult, and the only way to have unity with each other is through Christ.\nBecause the folks in Ephesus were so busy slapping and kicking each other in the shins over whether or not circumcision is the one true way to salvation, Paul uses metaphors to get their attention and gives them a veritable technicolor slideshow of unity.\nPaul actually uses illustrations like this a lot in his letters, to deepen our understanding of our relationship to each other in Christ. Look how many I found with only a quick, cursory search:\nTogether, in Christ, we are:\n\na holy sanctuary (Ephesians 2:21, 1 Corinthians 3:16) \na body (Ephesians 2:15)\na city (Ephesians 2:19)\na family (Ephesians 2:19, Galatians 3:26, 29)\ncovered (Galatians 3:27)\nsons, not slaves (Galatians 3:23-26)\na creation (Galatians 6:15)\n\nWhew! As I noticed that Paul really rolled out the whole barrel of metaphors, I realized this concept of unity in Christ must require more than just passing consideration. It demands real attention to the texture of this truth, like we could comprehend more if we examine it from different angles. Let’s look at three of these pictures of unity together today.\nI am most intrigued by the picture of us as family in Christ (Ephesians 2:19). The issue of seamless family connection has always plagued me because I, like many of you, come from a home of divorce. So my family isn’t tidy or shiny; it’s funny and sometimes awkward. But Paul is saying we are “members of the household of God.” We have a rightful place, together, in Him.\nI’m also fascinated to think of us as a holy sanctuary (Ephesians 2:21). We are joined together to make a holy temple for the Lord. Together we are a place that is set apart, a place that God loves. It’s amazing.\nFinally, we can see our unity in the image of the city (Ephesians 2:19). I really like this one. In a city, everyone does different jobs, but it works because we are pulling together, just like we learned on Sesame Street. Except this unity works because we are in Christ—not because we are motivated by civic duty.\nGod brought the Jews and the Gentiles together. He’s still doing it today. He’s bringing the Hatfields and the McCoys together. He’s bringing me and my crazy family together. It’s super messy and complicated. Honestly, it’s horribly messy.\nHere we are, and God wants us all to be His people. Me, you, and your lunatic uncle. How can we all come together? In Christ. Christ is our cornerstone. We build on Him. He is the only source of unity.\nBefore you get out your mortar and trowel to start building, remember that unity comes from the Lord, and it is begun and completed by Him. We can’t achieve unity by our good work or our hard work—but He achieves it by His grace!\nLord, bring unity to our families and our communities. Give us the humility to see that our hands aren’t enough to build the Kingdom, but that your hands have already built it. You are our cornerstone, and “in you we are made one” (John 17:22).\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram4.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 3:1-13, Romans 11:1-36, Revelation 7:9-12",
        "devo_title": "Incalculable Riches",
        "devo_summary": "\nBY Rebecca Faires\n\nSo say there’s this girl. Let’s call her Izzy. And there was a bully who taunted Izzy and beat her up, starting in kindergarten by calling her teeth yellow, and continuing to senior year by calling her heart yellow.\nWhat a relief to graduate and move on! But then, on her wedding day, her tormenter showed up at the reception, uninvited, eager to share champagne, strawberries, and first dances with Izzy and her new husband. Izzy tried to ignore it. But when she and her beloved reached to cut the cake that symbolized their new life together, a third hand tenderly joined theirs on the knife. Izzy couldn’t take it any longer. She shouted:\nGET OUT OF MY SPECIAL MOMENT! This is our special covenant together, and you are not included!\nThis awkward narrative makes us so mad and squirmy, but this is how the people of Israel felt when the Gentiles came out of the woodwork to join the church. This is our wedding feast. Go find your own.\nThe term “Gentiles” pretty much means everybody who’s not Jewish. It meant the Egyptians, Medes, Persians, and Babylonians— all those guys who tossed Israel around like game of keep-away. These are the nations who bullied and slaughtered Israel on and off for half of the Old Testament. \nIsrael did not want anything to do with these bad guys. And they had always seen the promise of the covenant as specific and exclusive to Abraham and his descendants (Romans 11:1-2). When they sang “Father Abraham…had many sons…” they meant it literally and ethnically.\nThe idea of including the enemy in their special family covenant was radical and unwelcome. Why would Israel want all the mean and dirty Gentiles involved in their intimate covenant with God? Wasn’t He their God?\nPaul lovingly tries to bring them around to the idea. He argues that this was actually God’s plan from the beginning (Ephesians 3:11). And not only was it God’s plan, but it’s God’s great grace to the Jews to allow them to minister to the Gentiles. God gave them the opportunity to become more like Christ—to show grace (Ephesians 3:7-9). The Gentiles became fellow heirs in Christ. And I am so grateful, because any of us who don’t literally come from the “many sons” of Abraham are technically Gentiles too.\nThankfully, my husband and I didn’t have to share our special nuptial moments with an intruder, but ours is a small picture of a greater marriage. At the marriage supper of Lamb, we will sit side by side with people who wouldn’t have chosen us to attend their special moments on earth. At the moment the Jews start feeling possessive about the covenant as their own, Paul admonishes them that it’s only due to God’s great grace and kindness that they are at the marriage supper at all.\nThe same is true for you and me. Yes, the covenant is ours, but we are that creepy third-wheel bully that doesn’t deserve to be there. We all picture ourselves as the bride, but the big news of the gospel is this: I’m actually the problem in the story. We are the ones who have been undeservedly invited in.\nOh, the depth of the riches of both the wisdom and the knowledge of God (Romans 11:33)!  We receive the goodness of God’s truth, His grace, and His salvation, and we get to share it. We may be natural born enemies, but we are equal heirs to the inheritance of the gospel.\nAfter this I looked, and there was a vast multitude from every nation, tribe, people, and language, which no one could number, standing before the throne and before the Lamb. They were robed in white with palm branches in their hands.\n– Revelation 7:9\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram5.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 1:17-19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nWe can all use a grace day, can’t we? Take this day as an opportunity to catch up, pray, and just rest in the presence of the Lord. Pray the scripture below for a specific woman in your life and for yourself.\nI pray that the God of our Lord Jesus Christ, the glorious Father, would give you a spirit of wisdom and revelation in the knowledge of Him. I pray that the perception of your mind may be enlightened so you may know what is the hope of His calling, what are the glorious riches of His inheritance among the saints, and what is the immeasurable greatness of His power to us who believe, according to the working of His vast strength.\n-Ephesians 1:17-19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram6.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 2:10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a powerful reminder of our purpose as His creation.\nFor we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand, that we should walk in them.\n– Ephesians 2:10 ESV\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/4-ephesians-2-10-2.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 3:14-21, Philippians 4:12-13, 1 Corinthians 13:1-7, 13, 2 Corinthians 9:8",
        "devo_title": "Established In Love",
        "devo_summary": "\nBY Kaitlin Wernet\n\nA word to the wise: do not prank call my parents today to ask if their refrigerator is running.\nThat is, of course, unless you’d like to trigger their post-traumatic stress involving a certain recent refrigerator leak… turned flood… turned home renovation. It was a rough time, you guys.        \nIn all seriousness, this Whirlpool really lived up to its name, creating a lagoon of lettuce water beneath the wooden floorboards, which curled up like soggy noodles. After clearing out all of the furniture and listening for weeks to the hum of many vacuums, my parents were relieved to make it to the simplest part of the process: choosing a replacement refrigerator. They ordered the model closest in appearance to its predecessor, measuring the length and width of the cabinet opening, checking and rechecking its size.\nIf you know anything about my dad, it’s that his yellow measuring tape is a force to be reckoned with. It’s always precise, down to the milli-est of meters. So it was with utmost confidence that my parents declared the dimensions of the new fridge’s home.\nBut when the delivery man placed the refrigerator in its compartment, there was a slight problem. Now, if you’re afraid I’m going to tell you the precious, yellow measuring tape was wrong, do not fear! Oh, it was correct. The length and width of the new Whirlpool slid snugly into the pocket where the former fridge once stood, but… it stuck out about 6 inches too far. While the length and width had been calculated to the exact millimeter, no one had considered the depth.\nEach time my parents step foot in the kitchen, they are stonewalled by the refrigerator’s annoying edge, an ever-present reminder of their miscalculation.\nWhen I read Paul’s words in Ephesians 3, I imagine they are the kind he’d like us to place in a conspicuous spot in our homes, maybe with magnets on the refrigerator:\n“I pray that you, being rooted and firmly established in love, may be able to comprehend with all the saints what is the length and width, height and depth of God’s love…”\n– Ephesians 3:17-18\nWe can guess that Paul, being the energetic guy we all know and love, didn’t intend these words to be admired only during our late-night cookie-dough raids. No, I think he was calling us out on our own miscalculations about God’s love.\nIf we, as Christ’s followers, understand and proclaim one thing about God, shouldn’t it be His love?\nSince love is the currency and cornerstone of our faith, and others will know we are Christians by that love (John 13:35), we’d like to think we have that part all figured out. But what if we don’t? Are we doing love wrong?\nPaul gives us this assurance: God’s love cannot be constrained by our own lack of understanding. God guarantees that His love will always obnoxiously stick out further than we think, bumping into our warm, fuzzy expectations with a reminder of Himself.\nIts length embraces us in a wingspan of Alpha to Omega.\nIts width includes us in the family tree of all believers.\nIts depth reaches us buried beneath the wages of sin.\nIts height draws us to eternal heavenly glory.\nLove establishes and anchors us in the gospel. It is longer, wider, deeper and higher than any dimensions we can muster. We can spend our days settling for a comfortable, comprehendible love, or we can seek to be stretched by the true fullness of His love.\nToday, may we make a space for Him to surprise us without limitation, so that we may see the true length, width, depth and height of the Father’s love. Amen.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram8.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 4:1-16, Philippians 1:27, Romans 12:1-2, 1 Corinthians 12:4-13",
        "devo_title": "Unity and Diversity",
        "devo_summary": "\nBY Missy Fuller\n\nI’m a beach girl. I love the sun, the sand, the surf—everything. I can’t get enough. Recently, my brother moved to Jacksonville, Florida, and I’ve had the privilege of free beach vacations the last few years. Yes, please!\nWhile visiting my brother this past summer there was a tropical storm about 200 miles off the coast. Those were some of the biggest and most consistent waves I’ve ever seen.\nMy brother ran through the water and easily made it out to a calm sandbar. As I tried get out past the breaking point, the waves continually knocked me backwards, sideways, and underwater. Just when I made a little progress, an enormous swell came into view. In an effort to hit it head-on, I started running toward it, jumping forward and diving into the wave.\nAs the wave rolled over, it rolled me right along with it. Suddenly, I was somersaulting underneath the wave, no control over my body and no idea which way was up. I finally found my footing and came up from under the water. But as soon as I took a breath, another wave knocked me off my feet and pushed me even closer to shore.\nNeedless to say, I waved to my brother and went back to our towels. This was definitely a tanning day.\nThat feeling of no control, of not knowing if you’ll ever surface, doesn’t just happen in the water and the waves. It’s one we can experience spiritually, too. If we remain immature in our faith, we can easily be tossed back and forth by the craftiness, manipulation, and deceit of false teachers.\nSo how do we guard against this? According to Paul, our spiritual gifts play a huge role.\nChrist grants each believer unique gifts in order to serve the body of Christ. We are all created differently and given different gifts by our Creator, so that together we can work to reach unity in the faith and in our knowledge and understanding of Jesus Christ. In Christ, our diversity is an asset and, ultimately, a peace-maker.\nChrist’s design for spiritual gifts is to build up His Bride, the Church. The goal is for the body of Christ—the whole body— to reach maturity. Using our gifts in the right context, with a humble and willing heart, builds us up individually and collectively. It builds up the whole body of believers.\nThis is what Paul urges of the Ephesians: in order for the body to reach maturity, we must fully embrace the unity to which Christ has called us. His desire is for us to function as one, not function alone.\nI love Paul’s words in Philippians 1:27 which echo this calling, charging us to live in “a manner worthy of the gospel of Christ.” We are to stand firm with one mind and spirit, guarding each other, using our unique gifts, and working side by side as we advance the gospel.\nIn this way, Christ’s Bride will be presented, fully mature and unified, on the day of glory.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram9.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 4:17-5:21, Romans 1:19-21, 2 Corinthians 5:17, 1 John 1:5-10",
        "devo_title": "Children of Light",
        "devo_summary": "\nBY Vivian Mabuni\n\nI picked up a crumpled foil gum wrapper by the staircase. Three steps up I found another one. And then another. At the top of the stairs I found a few more. Curiosity piqued, I turned the corner to peer into my son’s room. Under a maroon-colored blanket I saw the shape of a preschooler. In front of the mound of blanket-covered-preschooler, I found a pile of gum wrappers. I walked up to the mound.\n“Michael? Are you under the blanket?”\nThe shape shook his head.\n“Michael? Are you chewing gum?”\nAgain, the shape shook his head.\nI lifted the blanket to find my son, cheeks stuffed like a chipmunk. His mouth was so full, he couldn’t bring his lips to close. Barely able to chew, Michael had managed to stuff an entire pack of chewing gum in his mouth.\nWhen it comes to sin, I’m not so different from my preschool-aged son. Like Adam and Eve in the garden, my first response to sin is to hide and cover (Genesis 3:7-10). Instead of an actual blanket, I often hide under a cloak of defensiveness or rationalization when I sin. You know what happens in the place of hiding and covering? Rotting, stinky, cold, isolated living—that’s what happens in the darkness.\nPaul brilliantly establishes in the first half of Ephesians our position in Christ and then spends the remainder of the letter addressing the practice of the Christian life. Our position should inform our practice, but often we confuse the order and attempt Christian conduct apart from understanding our standing before God. When we flip practice and position, we may seek to adhere to stringent dos and don’ts out of fear, or to earn brownie points. But living the Christian life through self-effort is unsustainable.\nGod did not abandon us to live the Christian life in our own strength. He is our Source and Provider. We invest time studying God’s Word in order to know Him, not just know about Him. As we know Him, we will love, trust, and obey Him, and our conduct flows out of this love relationship. We know Him by walking in the light, and we walk in the light by knowing Him.\nWhat’s more, God provides His Spirit to empower us to walk in the Light. The secret of the Christian life is being filled by and walking in the Spirit (Ephesians 5:18, Galatians 5:16), which comes through confessing our sin and yielding our lives to God in response to His goodness and mercy (Psalm 145:9). The word “confess” comes from a word meaning “to speak the same.” Speaking the same about our sin is to admit we blew it. No rationalization, no excuses, no hiding, no hiding under the blanket of our shame— only recognizing the beautiful truth that our forgiveness is complete because of Christ’s finished work on the cross.\nWhen we know our position— children of God who are forgiven, renewed, and provided for in Christ Jesus — then we can practice walking in the light, being imitators of the God who created us and saves us (Ephesians 5:1).\nLike lifting the blanket to expose my gum-chewing son, the gospel of Christ gives us the freedom to throw off our old sinful nature and be renewed by the Spirit (Ephesians 4:22-23). The darkness may feel deceivingly comfortable to us for a time, but true healing, freedom, warmth, connection, and community only happen in the light of Christ.\nFather, we want to know you and walk in the light. Show us through your Spirit the places in our heart where we hide and cover. Give us courage to yield our whole lives to you. Thank you for your perfect timing and perfect provision. We love you. Amen.\n \nVivian Mabuni is an author and speaker, and a sushi, white Christmas lights, coffee-with-friends-lover. She has been on staff with Cru (formerly Campus Crusade for Christ) for 26 years and serves with Epic Movement, the Asian-American ministry of Cru. Vivian is the author of Warrior In Pink: A Story of Cancer, Community and the God Who Comforts.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram10.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 5:22-6:9, Genesis 2:4-25, Matthew 19:13-15, Colossians 3:23-24",
        "devo_title": "Christ and His Church",
        "devo_summary": "\nBY Rebecca Faires\n\nShe was five and I was seven. The sun had just set, but there was light enough for our tasks. We had rhubarb leaves to gather, Rose of Sharon flowers to collect, and lightning bugs to catch. She ran back and forth with a run as cute as it was enthusiastic. I sat enthroned on an industrial wood spool and shouted orders: “Not those flowers, those are Queen Anne’s Lace!” We were storing up treasures and there was a lot of work for us to do. Well, work for her to do. Someone had to manage the operation, and if seven years had taught me nothing else, they had taught me that I loved to be the boss.\nMy little sister has always been game to help me achieve my goals. Whether I’m filling baskets with pink flowers or purchasing a new sofa, she’s got my back. But it’s taken me a long time to learn how to fully appreciate our relationship and not turn it into a power play.\nWe all have a little megalomania in us, whether we are the big sister or not. We all have an impulse to control. Henry Cloud points out that “all people were designed by God to be control freaks. But because we shy away from controlling what we are supposed to control (ourselves), we resort to controlling what we are not supposed to control (others).”\nOuch.\nWhen Paul addressed the Ephesians, he wasn’t just delivering a few tips for getting along with friends and coworkers; he was revealing how the gospel transforms all of our relationships. The gospel takes the power struggle out of the equation.\nOur sinful hearts are naturally inclined to rebel against authority. It’s (profoundly) hard for wives to submit to husbands, children want to rebel against parents, and who hasn’t had a hard time respecting a boss? (Ok, I know this passage also talks about slaves and masters, but I just can’t even right now with the complex issue of Old Testament slavery.) We squirm and wiggle to get out from under authority.\nOn the other side, our sinful hearts are inclined to control those under us. Husbands control and hurt wives, and wives undermine and control husbands. Parents try to control and micromanage their children, and employers steamroll workers all the time. We don’t want to submit, and we don’t want to lead with mercy.\nHere’s the good news: the gospel actually does change our relationships. It changes the nature of both our intimate and professional bonds. Yes, our sinful hearts want to control others and rebel against authority, but God only calls us to control ourselves (Galatians 5:23).\nHow can we control ourselves and understand this mystery of love, submission, and authority? Two ideas from scripture: Do a good job with a good heart.\nPaul encourages us to do a good job by enjoining us, “Don’t work only while being watched, in order to please men, but as slaves of Christ, do God’s will from your heart” (Ephesians 6:6).\nAnd Paul invites us to have a good heart: “Whatever you do, do it enthusiastically, as something done for the Lord and not for men, knowing that you will receive the reward of an inheritance from the Lord” (Colossians 3:23-24).\nBut our hearts are precisely the problem! How can I do a good job with a good heart when my  heart so bent on controlling others? The gospel never sets works before the transformed heart. It begins with Christ’s transforming work in my heart. Christ is the one who does all this.\nWhy does Paul go to all this trouble? To help us sort out little peccadillos with coworkers? To keep kids from getting out of hand in the grocery store? To help me not be grouchy to my husband?\nYeah, actually. Yes. All our relationships are about Christ. They mirror different facets of our connection to Him, so these interactions with other folks are like a training ground. We are learning to love Christ better through our relationships on earth. This mystery is profound (Ephesians 5:32).\nHelp your little sister when she’s gathering rhubarb, and listen to your mom if she calls you inside. God gave these people to you. When that old impulse to control strikes, use it to control yourself by submitting your heart to Christ.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/SRT-Ephesians-instagram11.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 6:10-24, Romans 13:8-14, 2 Corinthians 10:3-4, 1 Timothy 6:11-12",
        "devo_title": "Ready For Battle",
        "devo_summary": "\nBY Amanda Bible Williams\n\nYou and I could gather around our screens and Bibles today like we were kids in Sunday school, felt board placed front and center. We’d label the felt man with his felt armor, giving each other a pep talk about putting on the full armor of God— not that shoddy, DIY armor we tend to wear. Then we’d retire to the Fellowship Hall for breakfast casserole while the choir practiced in the next room.\nThe conversation (and the casserole) would be worthwhile, but I’m wondering if today we might dig a little deeper into the text together.\nWhat is this spiritual battle Paul has us suiting up for in the first place? To find the answer, let’s hop over to Revelation 12.\nThe text describes a dramatic event where “the ancient serpent, who is called the Devil and Satan, the one who deceives the whole world” is thrown out of heaven with all his angels (Revelation 12:12). We know how the story ends: death and Satan are conquered by perfect sacrifice of Jesus, the Lamb, on the cross (Amen!). But where is the Defeated One now? Look at Revelation 12:11-12:\nThey conquered him\nby the blood of the Lamb…\nTherefore rejoice, you heavens,\nand you who dwell in them!\nWoe to the earth and the sea,\nfor the Devil has come down to you\nwith great fury,\nbecause he knows he has a short time.\n\nPaul entreated the Ephesians to dress for battle because the battle is real and ongoing. The evil one has been defeated, but he is not going down without a fight. He lives to destroy goodness and steal the true life that only the Christ can bring (John 10:10).\nThis is no ordinary battle, and it calls for extraordinary armor.\nBut wait! Before we suit up and give it the ole college try, putting forth our very best efforts (ahem) to fight for victory, let’s remind each other of a few, very important things.\nFirst, the victory has already been won by Jesus. We know the outcome of this battle. Our efforts do not win the victory. Christ’s life, death, and resurrection won the victory (1 Corinthians 15:15).\nSecondly, you and I are not average soldiers. We are co-heirs with the Great High Priest, children of the undefeated King! The armor described by Paul in Ephesians 6:14-17 bears striking resemblance to the high priestly garb described in Exodus 28. What’s more, check out how the prophet Isaiah described the coming Messiah, our Jesus:\nRighteousness will be a belt around His loins;\nfaithfulness will be a belt around His waist.\n– Isaiah 11:5\nHe put on righteousness like a breastplate,\nand a helmet of salvation on His head;\nHe put on garments of vengeance for clothing,\nand He wrapped Himself in zeal as in a cloak.\n– Isaiah 59:17\nSound familiar? And, the Old Testament often describes God as a shield:\nAfter these events, the word of the Lord came to Abram in a vision:\nDo not be afraid, Abram.\nI am your shield…\n– Genesis 15:1a\nHow happy you are, Israel!\nWho is like you,\na people saved by the Lord?\nHe is the shield that protects you,\nthe sword you boast in.\nYour enemies will cringe before you,\nand you will tread on their backs.\n– Deuteronomy 33:29\nAs for the feet? The high priests donned bare feet because they stood on holy ground. And, of course, bare feet were Jesus’ jam (John 13:4-5).\nNow, back to Paul’s letter: he already reminded the believers of their new spiritual clothing two chapters earlier. “You took off the old self,” he said, and “you put on the new self” in Christ (Ephesians 4:22-24). He wrote it in his letter to the Romans, too: “Put on the Lord Jesus Christ” (Romans 13:14).\nDo you see it? This armor is all His— His truth, His righteousness, His salvation, His Word. He fought the battle and won, and He laid the armor of victory on us.\nSo, yes— suit up today. Put that felt helmet, shield, and belt on your little felt figure. Pray earnestly at all times and “with every prayer and request,” just like Paul describes (Ephesians 6:18). Pray for boldness—not to proclaim all the answers, but to proclaim the mysterious gospel (Ephesians 6:19). \nIt is indeed a battle—a battle both won and ongoing—but you and I were made to fight it. Not by armor of our own making, but by the already tried and true armor of the Mighty One, our High Priest, our Messiah and King.\nMay our feet spread His gospel as long as we have breath.\n\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Ephesians-instagram12.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 6:14-18",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nWe can all use a grace day, can’t we? Take this day as an opportunity to catch up, pray, and just rest in the presence of the Lord. Pray the scripture below for a specific woman in your life and for yourself.\nStand, therefore,\nwith truth like a belt around your waist,\nrighteousness like armor on your chest,\nand your feet sandaled with readiness\nfor the gospel of peace.\nIn every situation take the shield of faith,\nand with it you will be able to extinguish\nall the flaming arrows of the evil one.\nTake the helmet of salvation,\nand the sword of the Spirit,\nwhich is God’s word.\nPray at all times in the Spirit with every prayer and request, and stay alert in this with all perseverance and intercession for all the saints.\n-Ephesians 6:14-18\n\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Ephesians-instagram13.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 6:14-18",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen Paul’s reminder to us as brothers and sisters in Christ.\nBe kind to one another, tenderhearted, forgiving one another, as God in Christ forgave you.\n– Ephesians 4:32\nWrite this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/4-ephesians-4-32.jpg"
    }
]