[
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 1:1-5, Psalm 16:1-11, 1 Corinthians 15:1-11, Colossians 1:9-14",
        "devo_title": "Greeting",
        "devo_summary": "\nBY Melanie Rainer\n\nYesterday I went to visit my husband at his office–a newly constructed, all-glass-exterior building with marble floors and a sense of importance that seemed to demand awkward elevator silence, especially as I stood there with my out-of-place bag of ice cream from the shop across the street. \nI stepped out of the elevator and onto his floor, greeted by a kind receptionist who asked me to fill out a form on the tablet on her desk. It asked my name and then for my “host.” I typed in my husband’s name, and out popped a nametag: my name, followed by my host’s. My entrance into the building was guaranteed by his name.\nWhen Paul opens his letter to the Galatians, he goes through the same practice: “Paul, an apostle—not from men or by man, but by Jesus Christ and God the Father who raised him from the dead” (Galatians 1:1). Paul gains entrance into the church by his apostleship, dependent wholly on the person and work of Christ. He establishes his authority not by his own work or identity, but that of Jesus and His resurrection from the dead. \nPaul’s identity is the righteousness of Christ, and he repeats it throughout his letters. In his first letter to the Corinthians, he writes, “By the grace of God I am what I am” (1 Corinthians 15:10). In other letters, he introduces himself as “Paul, an apostle of Christ Jesus by the will of God” (2 Corinthians 1:1; Ephesians 1:1). And in Philippians chapter 1, the apostle refers to himself (as well as Timothy) as a servant of Christ Jesus. Paul fully embraces his new identity because it was given to him through faith in Christ, summing it up in this way: \n“Therefore, if anyone is in Christ, he is a new creation;  the old has passed away, and see, the new has come!  Everything is from God, who has reconciled us to himself through Christ and has given us the ministry of reconciliation…  Therefore, we are ambassadors for Christ…” — 2 Corinthians 5:17–18, 20\nWhen Paul introduces himself, it is as though he is writing on one of those “Hello! My Name Is” stickers, one that says: “Hello! My name is Paul, and I belong to Christ. Everything I am is because of everything He did.” \nGalatians opens with a precious reminder and a challenge to remember: If we are in Christ, then we belong to God, and our identity is now bound up in Christ’s death and resurrection. We are sealed by His Spirit, waiting for the day Jesus returns. And we can trust Him, as the psalmist says, because He is our portion and our cup of blessing (Psalm 16:5). He holds my future in my hands, and the boundaries He has drawn around my life are good for me (v.6). \nThere are so many days I feel like a hundred pieces of a puzzle, strewn about on the floor just waiting to be put together. I am a wife, mother, employee, friend, volunteer coordinator, chef, sister, daughter, and also somehow sometimes my own person. It is deeply refreshing to remember the truth today—that I am Melanie, through Christ and by the Spirit, a servant of God. From that one identity, everything else should flow, all for His glory. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day1-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 1:6-10, Isaiah 52:1-10, 2 Corinthians 11:1-4, 2 Corinthians 11:12-15",
        "devo_title": "No Other Gospel",
        "devo_summary": "\nBY Melanie Rainer\n\nMy daughter is in a truly delightful developmental stage that is characterized primarily by make-believe. She spins magical tales and recites them with flourish, keeping us entertained and amazed at her creativity and sense of humor. Some of her stories are easy to identify as play—I know empirically that, no matter how awesome it sounds, a seagull did, in fact, not land on her head and take a seashell that she had balanced there. \nBut some of her stories are harder to sift out truth from make-believe. Did she really swim without a life jacket at camp? Despite all the assurances that she would always have a Personal Flotation Device, it’s possible the counselor forgot. Maybe? Sussing out fact from fiction in these scenarios is hard, a delicate balance of demanding honesty and encouraging her storytelling, creativity, and play. \nWhen fiction is easy to identity, we delight in the power of story. When the line between truth and embellishment blurs, it is easy to believe first and question later. This is exactly Paul’s point in today’s part of the letter to Galatians. “I am amazed,” he writes, “that you are so quickly turning away from him who called you by the grace of Christ and are turning to a different gospel—not that there is another gospel” (Galatians 1:6–7). Paul pulls no punches, telling them, “If anyone is preaching to you a gospel contrary to what you received, a curse be on him!” (v.9). \nFurthermore, in 2 Corinthians, Paul admonishes, “For if a person comes and preaches another Jesus… you put up with it splendidly!” (2 Corinthians 11:4). The warning is two-fold: Stay true to the one true gospel and to Christ, and do not follow or teach a false gospel. \nMore often than not, the false gospels I am drawn to are not patently false at first glance. They dance on the line of biblical orthodoxy, skirting around it and often adding to it. A real Christian should live this way! they say, along with a pseudo-salvific claim to living out some expectation of modern life. Today’s false gospels bend Scripture, asking it to do or be something it’s not— adding to it to say something it does not say, or twisting what it actually does say. Which is exactly what the false teachers in Galatia were doing: adding a requirement of circumcision and following other Jewish laws to become a Christian.\nI actively fight against the temptation of false gospels every day by engaging in Scripture, the north star that always points us exclusively to Christ. Filtering out falsehoods and embellishments is the work of the Holy Spirit in my heart through the means of grace that is the Word of God. I am so thankful for it. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day2-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 1:11-24, Joel 2:12-14, Acts 9:1-22",
        "devo_title": "Paul Defends His Apostleship",
        "devo_summary": "\nBY Melanie Rainer\n\n“The gospel is about transformation,” a friend of mine said while standing in my kitchen a few days ago. We were talking about a series of current events in the Church, sad and hard and deeply personal stories that call us to question our place in the current manifestation of God’s kingdom on earth, as all such stories tend to do. His statement hardly revolutionary, nor was it original, but I’ve found it’s been rolling around in my head ever since.\nWithout total transformation, a turning-inside-out by grace, it can be hard to stand firm in the faith. Every day it feels like I see another domino fall, the ripple effect of false gospels and faulty foundations. I say this full-well knowing that I could be next. Every day I pray for a deeper and greater transformation of my heart. Prayer, Scripture, Spirit—these are my lifelines to a new heart and a closer communion with God. Without them, I’m weak and tired. With them, I am transformed. \nAs we’ve read through Galatians 1 this week, Paul has been building a case for the rest of his letter using his own story of transformation. First, he identifies himself and his motivation: an apostle through Jesus. Second, he introduces his critique: the church in Galatia has fallen under the spell of a false gospel. Third, he qualifies his critique and message because of his own past and the total transformation he experienced through Jesus. \nPaul uses his story, constructing it carefully, to set the stage for the rest of the letter, in which he will challenge false teachers who argued that new Christians had to submit to Jewish law. Paul had been a pharisee, self-described as “extremely zealous for the traditions of my ancestors” (Galatians 1:14). He knew the law. He lived by it and for it. \nThen Paul explains his own total transformation as “when God, who from my mother’s womb set me apart and called me by his grace, was pleased to reveal his Son in me” (vv.15–16). Paul became an apostle of Jesus; he knew his Savior, and lived by Him and for Him. God called Paul to Himself, and through the work of Christ and the indwelling of the Spirit, Paul was totally transformed. The same transformation is offered to us by God’s grace. \nI love how God calls them to Himself in Joel 2 (harkening back to Exodus 34) where God reveals His character to Moses: \nEven now—\nthis is the LORD’s declaration—\nturn to me with all your heart,\nwith fasting, weeping, and mourning.\nTear your hearts,\nnot just your clothes,\nand return to the LORD your God.\nFor he is gracious and compassionate,\nslow to anger, abounding in faithful love,\nand he relents from sending disaster (vv.12–13).\nThis is the invitation before me this morning: to turn to God, to anchor myself in prayer, Scripture, and the Spirit. Because I can trust God and His character, I can trust His process of transformation—His grace, compassion, patience, and steadfast love.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day3-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 2:1-10, Isaiah 19:21-25, Acts 15:1-29",
        "devo_title": "Paul Defends His Gospel at Jerusalem",
        "devo_summary": "\nBY Melanie Rainer\n\nWe named our cat “Maple” after a Robert Frost poem of the same name, about a girl named Maple who lives her whole life beholden to a name that almost everyone gets wrong. Everyone thinks her name is “Mabel,” because that’s a real name, and it is much more comfortable to call someone a real, normal name than a strange name. \nHer teacher’s certainty it must be MabelMade Maple first take notice of her name.She asked her father and he told her, “Maple—Maple is right.”“But teacher told the schoolThere’s no such name.”\nA name with no eponymous history made a girl feel strange and unseen, as if because her name wasn’t real or familiar, she wasn’t either, and thus goes the poem and her life story. \nWhen Paul writes the letter to the Galatians, he calls out the false teachers who cried, “you can’t be Christian without being Jewish,” and asked Gentile (non-Jewish) Christians to follow Jewish laws, particularly those regarding circumcision and food. Their ideas were rooted in ethnic and cultural expectations that Paul was unafraid to challenge. \nSimilar to the teacher in “Maple” who wanted her name to be “Mabel,” the Judaizers assumed that Christians should look and eat like Jews (see Acts 15:5), because that made sense to them. The message of “be like us to be a Christian” is deeply wounding, rooted in racial superiority and cultural authority. It is not unfamiliar to any era in Church history, from the first to the present.\nThe radical transformation of faith in Christ, Paul claims, equalizes everyone. Sin flattens us, all unworthy. But Christ redeems us, and presents us beautifully clean, whole, and unified before God. Christianity is open and welcoming to all, and in it “there is no Jew or Greek, slave or free, male and female; since you are all one in Christ Jesus,” Paul writes in the next chapter (Galatians 3:28).\nPaul talks often of the body of Christ (Romans 12:3–8), and the rubber of ethnic differences meets the road of his ministry in Galatians. And in chapter 2, he specifically explains that the apostles to the Jews (James, Peter, and John) agreed with him that there was no need for Titus or other Gentile Christians to submit to Jewish ritual law. \nIt feels so personal to wade into this water: the rolling waves of our differences as humans. I feel Galatians reading me as much as I am reading it. What expectations do I have for other believers, and for myself? What do I think Christians should look like, act like? How should they think and feel? What do I add to the truth, or what do I believe that others have added? \nIn his commentary on Galatians, Martin Luther wrote, “The world bears the Gospel a grudge because the Gospel condemns the religious wisdom of the world.” The gospel calls us into deep and equal fellowship with all other believers. Anything less is hypocrisy. \nOver and over, Jesus confronted the religious wisdom of the world. Paul shows us how true discipleship and evangelism should be shaped by Christ, not the world. It is as simple, and as profoundly complicated, as “God does not show favoritism” (Galatians 2:6). We can substitute categories from centuries of Church history into the slots of “Jew” and “Gentile,” but the truth does not change. The gospel is just as true for you as it is for me or anyone else. Our salvation is based only on the finished work of Christ—nothing we do or don’t do can change it. We are secure in our Savior. Thanks be to God. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day4-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 2:11-21, Deuteronomy 10:12-17, Acts 10:9-48, 1 Corinthians 7:17-19",
        "devo_title": "Freedom from the Law",
        "devo_summary": "\nBY Melanie Rainer\n\nI once took a conflict assessment (like a personality test, but for workplace conflict styles) that revealed to me that I have a “collaborative” conflict style. This means when conflict arises, I try to identify solutions that work for everyone. This is often a recipe for disaster. \nI like to present a lot of options and then back slowly out of the room (metaphorically) and not make any decision that will make other people upset. I am a problem solver, but in the “here are a bunch of ways to solve it, you decide!” kind of way. \nPaul is not like that, and especially not in his conflict with Peter. \nThe latter half of Galatians 2 is one of the strongest rebukes of an apostle in the Bible. Paul calls Peter a hypocrite who deviated from the true gospel. Peter had been eating non-Jewish-law-approved meals with Gentile Christians. But when a group of radical Jewish leaders called the circumcision party disapproved, Peter stopped eating with Gentiles. The Judaizers believed that to be a true Christian, a Gentile had to become Jewish first and follow Jewish law. \nIn his book, Galatians for You, Tim Keller writes, “Paul did not simply say: You’re breaking the rules (even though Peter was), but: You’ve forgotten the gospel: your own gracious welcome in Christ. Paul did not focus so much on the sinful behavior as on the sinful attitude of self-righteousness that lay beneath it.”\nLiving out the gospel often rubs against cultural best practices, be they ancient or modern. More often than I wish, I capitulate like Peter. I wonder, how can I live out my faith but in a way that doesn’t make other people angry or uncomfortable? I live in the irreconcilable tension of seeking the approval of both God and man (directly antithetical to what we read a few days ago in Galatians 1:10). \nAfter rebuking Peter, Paul goes on to make one of the most impassioned, beautiful expositions of the true gospel. He says, “a person is not justified by the works of the law but by faith in Jesus Christ… I do not set aside the grace of God, for if righteousness comes through the law, then Christ died for nothing” (vv.16,21). \nPaul spends the rest of Galatians building on this truth: the traditional Jewish law does not save or purify people, only faith in Christ who died and rose again. The approval of other people doesn’t save you either, and you only need acceptance by God the Father, gained by the righteousness of Christ given to us when we believe. All we need is in Christ. All we have is Christ. Christ did not die for nothing; He died for you and me.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day5-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Colossians 1:13-14",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe has rescued us from the domain of darkness and transferred us into the kingdom of the Son he loves. In him we have redemption, the forgiveness of sins. —Colossians 1:13–14\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day6-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 2:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Galatians.\nI do not set aside the grace of God; for if righteousness comes through the law, then Christ died for nothing. —Galatians 2:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/4-Galatians-1-576x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 3:1-9, Genesis 15:1-6, Matthew 3:1-12, Romans 4:13-25",
        "devo_title": "Justification through Faith",
        "devo_summary": "\nBY Bailey Gillespie\n\nAs an early twenty-something, I loved crafting handwritten letters. Throw in some turquoise calligraphy ink and a wax seal, and you had an elegant artifact from the past. Letters have a level of intimacy and importance that texts simply can’t convey, and each one is a labor of love. \nDuring this letter-writing phase, I also had what you might call a spiritual crush on the Apostle Paul. (C. S. Lewis was a close second, but, you know, he can’t compete with an actual apostle.) Paul’s legendary passion for truth was compelling, and as a twenty-something weaving together a worldview, his letters served as models for discipleship in my life. One evening at Starbucks, I handed out “epistles” to my friends—handwritten notes of encouragement that challenged them to persevere with hope. \nThe book of Galatians is considered one of Paul’s most intense epistles. Although his language was strong and corrective, it was also a labor of love. His intent wasn’t to admonish the Galatians just to cool his head; it was to expose a false gospel that had begun seeping into the community. This false gospel was reverting back to justification through law. When Paul calls these people “foolish” and like those with “a spell” cast over them (Gl 3:1), it’s because their version of the gospel had them in bondage. With a sharp prod, he pushed back against their habits. “Did you receive the Spirit by the works of the law,” asked Paul, “or by believing what you heard?” (Gl 3:2). \nThough they had first believed the Spirit through hearing, they soon sought salvation through human performance again. I admit, I understand the temptation. Following a law is so much easier because it’s a visible, measurable act. But the realm of belief? Well, that can feel far more terrifying—a mere “whistling in the dark,” as Frederick Buechner puts it. But Abraham’s promise of faith is more than just a haunted optimism. It’s the very foundation of his covenant with God (Gl 3:7–9).\nAs an apostle of Christ, Paul’s role spurred him to awaken people out of disobedience by calling out ungodly behavior. Yet, as an apostle of Christ, he wasn’t calling them out from a place of anger or indifference. He was moved with compassion over how their efforts were sabotaging their own freedom. \n\nBecause it was for our freedom that Christ came.\nIt’s hard to trust God if we distrust his method of salvation. The promise of faith is a gift, but goodness gracious is it hard to accept sometimes. I’m thankful for figures like Paul or Martin Luther or, most importantly, the Spirit on this faith journey. When we surrender our own strength or desires to control the outcome and give ourselves over to the work of the Spirit, true freedom awaits. Let’s keep walking that long obedience in the same direction, together. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day8-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 3:10-18, Genesis 12:1-7, Isaiah 53:1-12, 1 Peter 2:24-25",
        "devo_title": "Law and Promise",
        "devo_summary": "\nBY Bailey Gillespie\n\nLight wanes\nOn Wednesday evening of this last Holy Week, I attended the Tenebrae service through a local Anglican church. Held at the Belcourt Theater, this service draws its name from the latin word for “darkness” and is intended to capture the depth of sin and brokenness—without resolution. \nOn the stage, there was a tier with twelve candles. Traditionally, one candle at a time is snuffed out until the room is completely dark, encouraging people to leave the room in silence. The purpose is to sit with the sorrow of Christ’s death longer than we feel comfortable with so that the triumph of Resurrection Sunday is all the more joyous. \nI was nervous to attend. Friends described it as being a pretty visceral experience, and since I already have a personality that’s sharply attuned to darkness and suffering, I wasn’t sure it was the best idea. But the event was meant to commemorate the fact that Christ had been crucified to break the curse of sin and death. The very least I could do was sit in an old theater seat.\nDarkness grows\nIn the dark rows, candlelight flickering, we watched the opening piece: the music video to Johnny Cash’s song, “Hurt.” I couldn’t help but see the connection between that haunting lyric and Christ’s agony in the garden of Gethsemane:\n“What have I become, my sweetest friend? Everyone I know goes away in the end”\nIn Galatians, Paul says that “Christ redeemed us from the curse of the law by becoming a curse for us” (3:13). Although God set the law in motion, it could never save us. It always pointed to the cross. Because the law leads to death, only death could satisfy sin and lead to eternal life. \nThe heaviness of what I felt during this Tenebrae service was just a sliver of what Christ felt on the cross. He carried the weight of the whole world’s suffering on his shoulders. Can you imagine? Yet, somehow, “for the joy that lay before Him, He endured the cross” (Heb 12:2). \nDarkness overcomes\nOver the course of the evening, I could feel my breaths grow shallow and staccato-like. My friends were right. It was hard to sit through. More than once, I closed my eyes and breathed deeply, hoping to ground my body, while at the same time hold close the story of my Lord’s suffering. Thinking about Christ being made a curse for our sake makes me shudder because there was such a cost to fulfill the demands of the law—a cost so great that the earth grew dark from the sixth to the ninth hour (Mt 27:45). \nLight reemerges\nBut the shocking beauty of the gospel is that this “great reversal” transforms Christ’s persecution into our blessing. The law is fulfilled and replaced with a promise, and we never need to fear the darkness again. The curse has been lifted. It is finished. \nLight endures\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day9-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 3:19-26, Jeremiah 31:31-34, Hebrews 10:1-10, Romans 3:21-26",
        "devo_title": "The Purpose of the Law",
        "devo_summary": "\nBY Bailey Gillespie\n\nWhile reading the Bible, I’m often struck by what it must have been like living under the law—especially after Christ’s ministry on earth. For so long, the world followed an established, works-based system. How could people not be skeptical or disoriented by this new way of thinking? Even if it led to freedom, human nature often returns to what’s familiar if the cost outweighs our own good.\nThe gospel made it so that salvation was no longer dependent on perfect execution of the law. With Christ, it was all about receiving, not doing. Belief, not effort. Grace. \nTalk about feeling your way around in the dark! When you’re used to managing your own righteousness, trading in the safe familiarity of rules for the wild realm of belief sounds foolish at first. I totally understand why they were wary of this “good news.” But the law was never the whole story. The law’s purpose was only ever to serve as a placeholder “until the coming faith was revealed” (Gl 3:23). \nIn Galatians, Paul describes the law as being our guardian until Christ came. Maybe I just haven’t read that passage in the Christian Standard Bible translation before, but until now I’ve never, ever thought about the law in this way. Truly, how beautiful this is! In our cultural moment, I think it’s easy to condemn ancient God followers (especially the Pharisees) as being resistant to relinquishing their system. But the reason they held the law so close to their hearts was because, at the time, that was the direct path to righteousness. As it turns out, it wasn’t the ultimate path to life, but it had its own purpose to accomplish. \nI don’t know about you, but I’ve never loved the darkness. Whether it was navigating a dark night of the soul or waking up in the middle of the night to eerie tree silhouettes dancing on the walls, I usually regard darkness as the enemy. However, I recently encountered a new idea: darkness also nourishes, holds, and prepares. I just love this. You can see it in the creation story. Darkness always comes before light, but that doesn’t mean that light renders it irrelevant. It just fills and overwhelms it by its very nature.\nI think the law was God’s severe mercy. We couldn’t justify ourselves, and neither could religion, but God didn’t leave us to our own ends. He provided this strange guardian—holding, preparing us until Christ’s death and resurrection fulfilled the law and the prophets. \nNow, we have the sweet, sweet privilege of releasing our anxious work and resting in the knowledge that “through faith you are all sons of God in Christ Jesus” (Gl 3:26).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day10-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 3:27-29, Galatians 4:1-7, John 14:1-11, John 14:18-21, Romans 8:1-17",
        "devo_title": "Sons and Heirs",
        "devo_summary": "\nBY Bailey Gillespie\n\nOne of my closest friends, Rory, has a fierce loyalty to both Jesus and quality coffee beans. Lately, while coffeeshop crawling around town, we seem to keep coming back to the same topics: G. K. Chesterton, the Enneagram, men, and what she likes to call “ecumenical dialogue.” \nAlthough we don’t share a love for coffee, we do share a passion for the Church in all its broken, messy complexity. Having had exposure to a wide range of church traditions, these conversations always remind us that we long for deeper unity—remembering that God doesn’t align more with one end of the faith spectrum than the other: He is the spectrum. \nWhen Paul calls for unity in his Galatians epistle, he declares, “There is no Jew or Greek, slave or free, male and female since you are all one in Christ Jesus” (Gl 4:28). Human nature just wants to divide. It doesn’t seem to matter if it’s denominational or sociopolitical or any other categorization: it wants to raise and lower inherent value to seek and further its own good. But the gospel is a hospitable, open table where everyone is honored. \nDuring Paul’s missionary journeys, he needed to clarify the heartbeat of the gospel to an ancient world that devalued Jews, slaves, and females. Religion was just one more system that marginalized them. The temptation to reserve the gospel for those who didn’t seem to need it as much began to quelch what should have been “good news.” Good news for all—not just those who already had all the freedom they needed. \nPaul urges us to remember that the kingdom of God isn’t discriminatory. It’s heaven extending its hand and inviting us to a feast as brothers and sisters. We are, communally, made in the complex image of God. No individual, no matter how impoverished in mind, body, or resources is exempt from His lavish hospitality. Although we’re born into this world enslaved, He adopts us and makes us not “a slave, but a son” and an “heir” (Gl 4:7). We are now all heirs to this grace.\nNo community is perfect, but my home church back in California does a beautiful job at pursuing unity. It’s quirky and hard to pin down theologically. The air circulation isn’t great, and the worship flows in and out of syncopation. But, boy, does that church know how to love. On any given Sunday, on your way to the Eucharist table, you may meet those who are wealthy or who ride a bicycle to work. Who have a PhD in early church history or who have never taken a college class. This church doesn’t quite fit or belong to any one denominational stream. And maybe the reason why I gravitate to churches like this is because I, too, never quite feel like I fit or belong. It’s churches like these that remind me why the gospel is good news. \nMay we always have a spirit of hospitality toward our brothers and sisters. After all, we’re all just looking for a family in which to belong, and Jesus has made us this hopeful promise: “I will not leave you as orphans; I am coming to you” (Jn 14:18).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day11-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 4:8-20, Deuteronomy 32:1-9, Acts 17:24-31, Romans 1:18-25",
        "devo_title": "Paul’s Concern for the Galatians",
        "devo_summary": "\nBY Bailey Gillespie\n\nLast year, I told a good friend that my life felt characterized by loss. We were sitting in a two-story coffee shop, iced chai in hand, and I felt guilty as soon as I said it. After all, this wasn’t entirely true. Loss didn’t always steal my joy in those times of tasting God’s goodness and His many good gifts, but it always overshadowed it once my attention drifted to what had been taken away. My friend then did what he does best: challenge that belief. This didn’t need to be the story, or lens, through which I interpreted my life. We could learn to look for what was there, rather than what was missing. \nThe truth was I was enslaved to this false narrative, just like the Galatians were enslaved to former ways of living. It’s easy to read the New Testament and wonder why it was so hard for people to stay faithful to God after an encounter. These people had known God and been known by Him, yet they turned away. Why? How do people who were living so close to the time of Christ—and the formation of the early church—turn away from it? This was the question also burning inside of the apostle Paul. “But now,” he said, “since you know God, or rather have become known by God, how can you turn back again to the weak and worthless elements? Do you want to be enslaved to them all over again?” (Gl 4:9). \nPaul is implying that real relationship should inspire loyalty and freedom. Instead, the Galatians had become enslaved to “weak and worthless elements” by reverting back to worshipping false gods. You see, human nature is human nature. Even after encountering God today, like the Galatians encountered Him back then, we still allow ourselves to be enslaved by untrue stories or objects of false hope. \n“Where, then, is your blessing?” Paul asks (Gl 4:15). We can’t receive the blessing of being sons and daughters if we are enslaved to the law, or false gods, or any other object outside of Christ. That is, in fact, the very curse of sin that Christ came to break. \nPaul so deeply desired that these people find freedom and a genuine commitment to God that He said He was “suffering labor pains” until Christ was formed in them (4:19). This type of personal interest only comes from someone who encounters Jesus, finds transformation, and seeks the eternal well-being of others. \nStaying close to Jesus is the only way to release the things we’re enslaved to. Whether it’s the narratives in our heads, or other tangible idols, we will never be able to fight hard enough against the inclinations of our own flesh. Victory comes through Christ alone. Victory and blessing. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day12-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "1 Peter 2:24",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe himself bore our sins in his body on the tree; so that, having died to sins, we might live for righteousness. By his wounds you have been healed. —1 Peter 2:24\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day13-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 3:27",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse from our reading on day 11. Throughout the book of Galatians, Paul teaches that nothing gives us an advantage over others in approaching God. Believers have equal access to God because we are clothed with Christ. \nFor those of you who were baptized into Christ have been clothed with Christ. —Galatians 3:27\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/4-Galatians-2-576x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 4:21-31, Genesis 16:1-16, Romans 9:6-8, Hebrews 12:18-24",
        "devo_title": "Sarah and Hagar: Two Covenants",
        "devo_summary": "\nBY Rebecca Faires\n\nI think a lot about how the circumstances of our birth affect our futures. I bet Isaac and Ishmael did too. Their mothers, Sarah and Hagar, represent the old and new covenants. Sarah was Abraham’s wife, and when she didn’t conceive, she impatiently sent her servant to conceive in her place. Her servant Hagar bore Ishmael. Sarah later bore Isaac. God established the old covenant to teach us our need for a Savior. When Christ came, He fulfilled the law and the covenant. And he ushered in the new covenant of grace.\nThis was an abstract and new concept for the Galatians, and the Judaizers were all over them—trying to draw them back into confusion and slavery to the law. Paul is trying to help us understand by putting it in terms we are familiar with: human efforts to solve divine problems. It’s in our nature to try to settle things on our own terms. And the ancient Mediterraneans of Galatia couldn’t fulfill the law any more than we can. Paul demonstrated that the Judaizers, in deceptively drawing the Galatians to rely upon the law of Moses for their justification, are not acting in accord with the promise given to Abraham, but are turning from that promise. \nSalvation does not come to us by the works of the law, even the law of Moses, which was literally given by God at Sinai. The pursuit of salvation by works of the law is not sufficient. The end result, as it was for Ishmael and Hagar, is to be driven out. Why? Because the only means of attaining the inheritance promised to Abraham, of true fellowship with God, is by faith. To rely on deceit, or only on the law, is to reject true salvation and freedom, which comes only by faith in Christ. \nNeither Isaac nor Ishmael could control the circumstances of their birth. Paul is reminding us that our identity is not established by what we have done or will do. It is not something we can earn. Rather, our identity is fixed with Christ. This should have a radical impact on how we live and think. We are simultaneously set free from the exhaustion and impossibility of earning God’s favor, and filled with gratitude for the inheritance we have so freely received. This gratitude, not the threat of the law, is the motive for Christian living.\nSarah represents the covenant of faith and grace, but Hagar represents the covenant of failed human effort. Ishmael was Abrahams and Sarah’s plan, but Isaac was God’s plan. The law is not a means to leverage salvation. Isaac received the inheritance of the promise. “Now you too, brothers and sisters, like Isaac, are children of promise.” (Galatians 4:28)\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day15-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 5:1-15, Numbers 11:1-20, Romans 2:25-29, 1 John 3:19-24",
        "devo_title": "Freedom of the Christian",
        "devo_summary": "\nBY Rebecca Faires\n\nGive us an inch, and we’ll take a mile. Christians can fall prey to the same temptations as everyone else. It can be hard to know where to draw the line in our Christian freedom. We’re “called to be free,” but how free? (Galatians 5:13). What movies should we really allow ourselves to watch? How much time can we spend on our phones every day? How often do we actually need to be in church on Sunday morning? We are not bound by the ten thousand commandments, and we instead enjoy the freedom and grace of two: \n“‘Love the Lord your God with all your heart, with all your soul, and with all your mind.’  This is the greatest and most important command. The second is like it: ‘Love your neighbor as yourself.’  All the Law and the Prophets depend on these two commands” (Matthew 22:37–40). \nReally, in just these two commands, all are fulfilled. In this we see what Paul means when he calls the Galatians to “faith working through love” (Galatians 5:6). With this in mind, suddenly, it seems we actually have a lot of freedom.\nThe law of the Spirit is not rooted in a slavish obedience to the law of Moses, but in a loving obedience to the God of grace. The law itself was never designed to save us, as the Judaizers were teaching; it only signifies our guilt and condemns us, because we are unable to keep it (Matthew 5:17–20). But the gospel of grace delivers us from bondage to the law and its condemnation. We are indeed free! For in Christ, there is now no condemnation (Romans 8:1).\nThe Ten Commandments allow for freedom in Christ, but that freedom is not for us to see how much we can get away with; rather, it is freedom to bear the fruit of love for one another, as brothers and sisters. It is not to be used as an opportunity to return to the flesh. So how do we use our freedom rightly?\nThe Holy Spirit must quicken us inwardly. Our hearts must be circumcised, not our bodies. “Circumcision benefits you if you observe the law, but if you are a lawbreaker, your circumcision has become uncircumcision” (Romans 2:25). Outward acts of faith are not a measure of our identity in Christ. It is the inward washing of the Spirit alone that sets us free.\nIn fact, a faith that looks amazing from the outside can be deceptive. Man judges by the outside, but God judges the heart (1 Samuel 16:7). Our hunger for outward approval and reputation often ensnares us, and distracts us from our need for the inward work of the Spirit. The end result is a shallow and fruitless faith, which actually makes us “alienated from Christ” (Galatians 5:4). Furthermore, the pride of self-reliance also produced discord in the church at Galatia, prompting Paul’s warning: “If you bite and devour one another, watch out, or you will be consumed by one another” (v.15).\nTrue freedom is found in the love and Lordship of Christ, which “compels us” to love others as He has loved us (2 Corinthians 5:14–15). In Christ Jesus, we are free from bondage to the law, and free to serve Christ instead. He has called us to walk in the liberty of love. May we use our freedom to show our gratitude to Christ.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day16-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 5:16-26, Ezekiel 37:1-14, Ephesians 2:1-10, Revelation 21:1-8",
        "devo_title": "The Spirit Versus the Flesh",
        "devo_summary": "\nBY Rebecca Faires\n\nI’m a list maker. I need them to clarify my thoughts, and my brain works best when I put pen to paper. There are the staples—Christmas lists, to-do lists, and grocery lists—but I also keep lists of the national parks we’ve visited (Glacier really is the crown of the continent), my favorite things about my good dog (that nuzzly pink nose), and foods I never, ever want to eat again. (I’m looking at you, Hot Pockets.)\nLists are a helpful way to show us all the angles of an idea. One word says a lot, but seven pointing to the same big idea really leave no room for confusion. In this passage, Paul gives us two lists: a list of death and a list of life—the works of the flesh and the fruit of the Spirit (Galatians 5:19–23). And boy, do I love the look of that “fruit of the spirit” list. I want that list to be the accounting of my days—not the nonsense in other list.\nBut life is busy and complicated, and we often find ourselves shifting back and forth between these two lists. How do we find victory over sin that ultimately only leads to death? Paul very succinctly declares that the only means by which we may find victory over sin is to “walk by the Spirit and [we] will certainly not carry out the desire of the flesh” (v.16). Notice Paul doesn’t say we might not succumb to our flesh; he says we will certainly not—what a declaration!\nOur flesh wars with the Spirit (James 1:14–15), but Paul encourages us in this manner: “If we live by the Spirit, let us also keep in step with the Spirit” (Galatians 5:25). This is a powerful image! We’re not expected to walk out our faith journey alone; instead, we must learn to yield to the Holy Spirit. In daily life, our heart’s proclivities lead us away from the Word and drown out the voice of the Spirit; it’s easier to listen to our senses, our circumstances, and our vain desires. Our inattention to the Spirit causes us to fall out of step with Him. Theologian John Owen put it this way: “Be killing sin, or it will be killing you.” \nDaily, hourly, we are to fix our attention on the Word, hide it in our hearts, and yield our desires to Christ— not by our own strength, but by yielding to the Spirit within us. We must bring our bone-dry souls to the Fountain of Life. As God promised to Ezekiel: “You will know that I am the LORD, my people, when I open your graves and bring you up from them. I will put my Spirit in you, and you will live” (Ezekiel 37:13–14).\nHere’s the good news: this is all God’s work; a life in step with the Spirit grows out of the Spirit of adoption that we have already received by grace. God calls us to live in the Spirit that He has already given, “for [we] are saved by grace through faith, and this is not from [ourselves]; it is God’s gift” (Ephesians 2:8). Though the world, the flesh, and the devil continually vie for our attention, God has extended to our very lips “the spring of the water of life” (Revelation 21:6). Drink freely. Drink deeply. Drink continually. Walk in step with His Spirit.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day17-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 6:1-10, Hosea 10:12, John 15:9-17, James 2:14-26",
        "devo_title": "Carry One Another’s Burdens",
        "devo_summary": "\nBY Rebecca Faires\n\nSeptember is a busy month for all of us. In my neck of the woods we’re packing, renovating, homeschooling, working—and I’m still nursing a baby. You may also be experiencing a season like this right now. When I’m busy, it’s harder for me to deal tenderly with everyone else’s particular struggles. It feels like quite enough to manage my own burdens without even entering into the burdens of someone else.\nBut God has entrusted us with precious souls. Our friends, our parents, our children, our spouses—anyone the Lord brings before us—we are called to deal tenderly with each other. There is a huge cultural impulse toward “self-care,” but this is not what we as Christians are called to focus on. We are called to bear one another’s burdens, to walk alongside each other on this faith journey. We are called to focus on the Lord and care for others. Even when we’re busy. Even when the burdens of others seem inconvenient. Even when we really, really just want to push them away.\nFortunately, Paul delivers some practical direction for us. He shows what walking by the Spirit looks like in some very common and practical circumstances. His first instruction: deal tenderly with those overtaken in wrongdoing (v.1). To be overtaken in wrongdoing is to be caught by temptation and then falter. This is very different from someone who has chosen to deliberately walk in sin, willfully pursuing it. In order to love others well, we need to remember our own sinfulness and God’s grace to us. Yes, sin must be treated as sin, but always in the spirit of love, and in light of God’s forgiveness and constant love for us.\nAnd then we must make the way home easy, restoring them with a gentle spirit, responding in love rather than in wrath and fury. Remember the parable of the Prodigal Son? (Luke 15:11–32). We ought to make the way home easy, welcoming them, celebrating and rejoicing because what once “was lost [has been] found” (v.32).\nIt’s far too easy to deal with other people’s sins, well… sinfully. Ironic, huh? But knowing full well the battle between flesh and Spirit that actively wars within each one of us (Galatians 5:17), we ought to show mercy and tenderness toward those who stumble, because we, too, live only by the tender mercy of God. Apart from His grace, none of us could stand before Him.\nPaul’s second instruction is to carry one another’s burdens, both the circumstantial burdens of this life, like finances, food, and shelter, and also the burdens of sin and temptation. We are to be a strengthening influence for our fellow sojourners in the faith—succor in time of need, encouragement in time of weakness, support in times of faltering. “In this way,” Paul declares, “[we] will fulfill the law of Christ” (v.2). \nWow. What a statement. We like to make sure our neighbors are dotting their I’s and crossing their T’s, instead of seeking ways to love and serve them as Christ has loved and served us—as a humble servant, laying down His life in love for us. May we learn to follow the pattern of Christ, not in duty, but in love. In this way, we will not tire of doing good, but will reap the fruit of faithful love in the communion of the saints (Hosea 10:12).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day18-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 6:11-18, Jeremiah 9:23-24, Matthew 23:1-36, 2 Corinthians 5:17-21",
        "devo_title": "Concluding Exhortation",
        "devo_summary": "\nBY Rebecca Faires\n\nAt summer camp, I won an award for having curly hair. The curliest, naturally curly hair. I felt pretty proud of myself that night. The next morning at breakfast I assumed everyone was whispering, “Is that the curly hair queen?” Yes, yes, it is I!\nSigh.\nAnd goodness, isn’t this about the level of all the things we boast about? Things we truly have no control over? We can certainly work hard and make good choices. But our eye color and our physical achievements, our successes and our relationships—aren’t all these things really just gifts from God? \nInstead of boasting in what amounts to little more than circumstances from our birth, we are called to boast in the Lord (Galatians 6:14). And “the one who boasts should boast in this: that he understands and knows me—that I am the LORD, showing faithful love, justice, and righteousness on the earth, for I delight in these things. This is the LORD’s declaration” (Jeremiah 9:24).\nThe Hebrew word for God’s “enduring, covenantal love” is hesed. In his book Inexpressible, Michael Card defines hesed beautifully as, “When the person from whom I have a right to expect nothing gives me everything.” Our boasting then, is to be in the undeserved and overwhelming love of Christ, who—while we were His enemies, helpless in our sin—gave His life for us, so that we could be children of God (Romans 5:6–11).\nPaul’s benediction appeals to this same hesed, as he speaks to the Galatian church that had foolishly followed after the false teachings of the Judaizers, and wandered from the life of the Spirit. As he had earlier called on them to deal gently with those who are overtaken by sin, so also Paul deals gently with the Galatians. Why? Because Christ has dealt gently with Paul. And so Paul can boast in one thing only: the hesed of God, seen most clearly in the cross of Christ. He exhorts the Galatians to do the same.\nThe apostle then blesses the Galatians with a benediction that can only result from the steadfast love of God. Because of God’s undeserved and faithful love, we have fellowship with one another. We have restoration when we are overtaken in sin, and reconciliation with those we have offended, including Christ our Lord. Because of His love for us, we are part of the family of God, brothers and sisters, and co-heirs with Christ to the inheritance of God’s eternal kingdom.\nPaul goes on to bless the Galatians with the grace of Christ, for it is His grace alone which saves, restores, sustains, secures, and transforms us into His own likeness. This He does by the work of His Spirit in our spirits, in our hearts, and in our minds. In Him, we are a new creation (2 Corinthians 5:17).\nThe final note of Paul’s epistle to the Galatians is a resounding praise of Christ, in whom alone we boast. Next time you get ready to toot your own horn over your own achievements, remember that there’s no need to rejoice over ourselves, because our Creator already rejoices over us with singing (Zephaniah 3:17). Let His rejoicing over us be enough, and may we instead glory in Christ alone.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day19-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Hosea 10:12",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nSow righteousness for yourselves and reap faithful love; break up your unplowed ground. It is time to seek the LORD until he comes and sends righteousness on you like the rain. —Hosea 10:12\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/SRT-Galatians-Instagram-Day20-1024x1024.jpg"
    },
    {
        "book_title": "Galatians",
        "devo_passages": "Galatians 5:22–23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThroughout Paul’s letter to the Galatians, he encourages believers to walk in the Spirit. This week, we’ll memorize Galatians 5:22–23, a non-exhaustive list of qualities cultivated in believers as we follow Him. \nBut the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control.  —Galatians 5:22–23\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/09/4-Galatians-3-576x1024.jpg"
    }
]