[
    {
        "book_title": "James",
        "devo_passages": "James 1:1-18, Jeremiah 31:7-14, Matthew 4:1-11, 1 Peter 1:6-7",
        "devo_title": "How Can We Rejoice in Suffering?",
        "devo_summary": "\nBY Raechel Myers\n\nScripture Reading: James 1:1-18, Jeremiah 31:7-14, Matthew 4:1-11, 1 Peter 1:6-7\nHave you ever noticed how in times of pain or trial, we comfort our friends, loved ones, and even ourselves, with words like:\n“You’re going to make it through this.”\n“Tomorrow will be better.”\n“What can I do to ease your pain?”\nOur endgame is an end to suffering. We pray for the bad times to go away. We beg that they would never come at all. A whole industry of mylar balloons and teddy bears exists bearing the sentiment, “Get Well Soon!” We ask the Lord to remove our thorns, to help us endure our hardships, and to bring us through suffering as unscathed as possible. \nBut Jesus’ brother James, the author of this short letter, has an entirely different take on trials.\n“Consider it a great joy, my brothers and sisters, whenever you experience various trials.”\n– James 1:2\nDon’t get over them. Don’t rush through them or past them. Rejoice in them.\nJames tells us not to be so hasty to escape the faith-testing valleys because those valleys contain the fertile soil needed to produce steadfastness. And steadfastness—being immovable, unable to be shaken, deeply rooted—is perhaps the true “wellness” we should be seeking. \nAs Christians, we eagerly say we want to be like Christ. But many of us are really only asking for the good stuff. “Lord, make us loving and patient and joyful!” we sing in chorus and with enthusiasm. \nJesus was indeed all of those things, but He was also described by the prophet Isaiah as “a man of suffering who knew what sickness was” (Isaiah 53:3). Christ Himself learned obedience through His suffering (Hebrews 5:8). And so it is for us. It is from those dark yet fertile valleys that steadfastness begins to spring forth—first sprouting from faith, then budding into love, and flowering into patience and joy.\nToday, or tomorrow, or whenever you find yourself in a place of trial—do not minimize it or rush through it. Instead, give thanks to the Lord. Pray for endurance and steadfastness from the One who has already endured and proven Himself steadfast. \nAs backwards as it may feel, this difficult trial or painful suffering is a time to thank the Lord. This is the time to rejoice.\nWe do not rejoice because bad things happen, or because this poor, fallen world is full of death, injustice, and sorrow. No. We rejoice because the sovereign Lord calls us His own. He loves us enough to descend with us into the dark yet mysteriously fertile valleys, to produce in us a steadfastness which cannot be shaken.\nThanks be to God.\n“Blessed is the one who endures trials, because when he has stood the test he will receive the crown of life that God has promised to those who love him.”\n– James 1:12\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram1.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 1:19-27, Proverbs 10:19, Ephesians 4:26-27, Romans 5:20",
        "devo_title": "Both Hearing and Doing",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: James 1:19-27, Proverbs 10:19, Ephesians 4:26-27, Romans 5:20\nI’ve always been a little uncomfortable while getting my hair cut. Perhaps it’s my nervousness that I’ve directed my stylist the wrong way, or that the color we picked won’t work at all with my skin tone. But beyond the anxiety that comes from letting someone else take control for a few hours, there’s a measured amount of discomfort that comes from looking at myself in the mirror for that long. \nEvery blemish seems to glow under the lights of my local salon. My eyebrows seem significantly more unruly than I thought they had become, and the makeup I had so carefully applied hours ago has mostly melted away, revealing the oh-so-telling dark circles under my very tired eyes. \nAnd yet when I leave, somehow I always feel so much better. I’ve been transformed—or at least my hair has. \nIt is transformation and the confidence that comes with it that James is urging us to seek through the reading of the Word. Of course, it’s much less superficial and quite a bit harder than sitting in a salon chair. James tells us that when we hear the Word of God and don’t act, then we are just like a man sitting in front of a mirror, seeing all his blemishes and yet walking away without caring, without doing anything. \nIf looking in the mirror is hard, looking deep into the Word of God is harder— especially when reading James’s words. They reflect back to me my own anger, my quickness to speak, my moral failures, my pride. \nBut being transformed by the Word means becoming a doer, not just a hearer. It means inviting the Holy Spirit to carve out those ugly places and fill them with the righteousness that Jesus gives, so that I might live out what James calls a “pure and undefiled religion” (1:27). The Word becomes more than a book to me; it is a means of grace, a tool of the Spirit’s sanctifying work in my heart. \nJesus said it this way: \n“Everyone then who hears these words of mine and does them will be like a wise man who built his house on the rock.  And the rain fell, and the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on the rock.  And everyone who hears these words of mine and does not do them will be like a foolish man who built his house on the sand.  And the rain fell, and the floods came, and the winds blew and beat against that house, and it fell, and great was the fall of it.”\n– Matthew 7:24-27\nJesus is the Word made flesh, sent to dwell among us. We are called to look daily not into a mirror, but into the Word—into the very face of Jesus. \nThe gospel-filled life Christ calls us to is not one full of quick and angry words, self-serving pride, or self-sufficiency, but of sacrificial love and humility. We are called to let the Word do its work inside us—to read it daily with fresh eyes as it, by the Holy Spirit, reads our hearts and transforms us, making us more and more like Jesus.\n\nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram2.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 2:1-13, Zechariah 7:9-10, Matthew 7:1-5, Romans 13:8-10",
        "devo_title": "Mercy Triumphs Over Judgment",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: James 2:1-13, Zechariah 7:9-10, Matthew 7:1-5, Romans 13:8-10\nWith the precision of a surgeon’s knife, the Holy Spirit sliced into my heart, convicting me. It caught me off guard—my sin of favoritism.\nHours before, I’d watched a video on discrimination alongside my ministry team. The clip highlighted how easily we can fall into judging and favoring others. To further illustrate the point, we were divided into two different groups based on one aspect of our lives, something we had no control over: our eye color. People with blue eyes were to be treated differently than those with brown eyes.  \nSoon comments and accusations were flying back and forth. The responses of those discriminated against felt strangely satisfying to me. One woman in particular spoke with such disdain; her condescending attitude only proved her lack of awareness of those who live in the margins every day. I confess I was happy to have her sit in the back of the room as a member of the “discriminated” group, so she could experience a lack of equity. \nThe next day, our group entered into a time of prayer, confession, and lament. That’s when God opened my eyes in a new way to Galatians chapter five, where Paul lists the works of the flesh: enmity, strife, jealousy, fits of anger, rivalries, dissensions, divisions, envy. The very things our team had sought to address and combat head-on were now being revealed in my own heart. I had judged that woman, and in thinking less of her, I showed partiality toward others who appeared more self-aware and further along in their faith journey. \n“My brothers and sisters, do not show favoritism as you hold on to the faith in our glorious Lord Jesus Christ… haven’t you made distinctions among yourselves and become judges with evil thoughts?”\n– James 2:1,4\nThis sin—my sin of judging some and favoring others—is cautioned against throughout Scripture. In His Sermon on the Mount, Jesus couldn’t be more clear when He says, “Do not judge, so that you won’t be judged. For you will be judged by the same standard with which you judge others, and you will be measured by the same measure you use” (Matthew 7:1-2).\nThe Lord is the only one worthy of being the Judge. He’s the only one capable of judging fairly. “For the Lord sees not as man sees: man looks on the outward appearance, but the LORD looks on the heart” (1 Samuel 16:7). It’s not our job to do the work of the Holy Spirit in convicting others of their sin, but we are called to respond to the Spirit’s conviction in our own hearts.\nWhen we try to take God’s place as judge and jury, perhaps it’s because we’ve lost sight of just how great a debt Jesus died to pay on our behalf. Now, God’s “mercy triumphs over judgment” (James 2:13); His justice has been satisfied once and for all who love Jesus (Romans 3:25-26). \nWe’re all on a journey, learning to honor the Lord through loving one another well. Daily, as we walk in step with the Spirit, may we speak the gospel into our waking moments. As sin is exposed, let us draw near to our Savior. Mercy triumphed over judgment when Christ died for us, sinners, and rescued us from deserved condemnation. And mercy triumphs still, as a holy God looks at us and sees the spotless image of His Son.\n\nVivian Mabuni is a speaker and author, and a sushi, white Christmas lights, post-its, and coffee-with-friends lover. She has been on staff with Cru (formerly Campus Crusade for Christ) for 28 years and serves with Epic Movement, the Asian American ministry of Cru. Connect with Vivian on Twitter and Instagram at @vivmabuni.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram3.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 2:14-26, Deuteronomy 6:4-5, Romans 3:23-26, Ephesians 2:8-10",
        "devo_title": "Faith Made Complete",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: James 2:14-26, Deuteronomy 6:4-5, Romans 3:23-26, Ephesians 2:8-10\nFor it is by grace you have been saved, through faith—and this is not from yourselves, it is the gift of God—not by works, so that no one can boast (Ephesians 2:8-9).\nI love that Christian freedom is based on this principle: free, radical grace exists for the undeserving through Jesus. There’s nothing we can do to receive it; there’s nothing we can do to reverse it. Incredible, wonderful, scandalous grace.\nThat’s why reading James’ words can feel confusing. Is he contradicting grace, saying we’re justified by our works—that without those good works, our faith is as good as dead?\nI’ve spent a lot of time grappling with these passages, asking God to open my eyes to what He was saying through these two disciples. On the surface, it seems like they are contradicting one another. Then He reminded me of a breakfast I shared with a friend recently. \nI’ve known this friend since I was ten years old. She’s gorgeous, extremely athletic, and was always popular in school. Over the twenty years we’ve known each other, we’ve stayed loosely in touch. Over coffee and eggs, she shared the circumstances of her life—mostly that it hadn’t turned out like she’d planned. \nAs we talked, I felt God pressing me to speak. It felt strange, so I hesitated, afraid of sounding cheesy or trite. I knew things between us could get awkward. But then I didn’t really feel like I had a choice. So I said it: \n“I don’t know why, but I really feel like God wants me to tell you that He loves you.” \nI cringed after saying it, wondering if I’d gone too far. But in that moment, something softened. Tears fell down her cheeks. Rather than turning awkward, the entire moment felt sacred. \nHebrews chapter 11 recounts the spiritual giants whose faith in God was counted as righteousness. But that faith wasn’t void of action. A quick perusal of the list and you’ll see it over and over again: verbs.\nBy faith Abel offered.\nBy faith Noah built.\nBy faith Abraham obeyed.\nOur God is a God of action. So if you have faith in Him, get ready to move. \nThis is the beauty of Christianity: our faith in Jesus saves us, and it also frees us from striving to be enough, trying to earn approval, stature, or recognition through what we do. I can do good works without having to worry about measuring the outcome. Faith in Jesus’ final, finished work gives me the security to do good without worrying that I’m doing enough.\nThis is where it gets crazy. My friend called me a few weeks later to tell me something had radically changed in her heart. From that moment we shared at the breakfast table, she’d felt God in hot pursuit of her. Since then, she’s been spending every morning in His Word, falling in love with Him again. \nIs it possible God can use us like that? Is it possible that I’d just experienced a good work He’d prepared for me in advance, one He’d planned for me to do all along? After all, the work isn’t really mine. I’m just His workmanship (Ephesians 2:10). I’m an instrument in His hands, playing an essential part in His eternal symphony. \nWhat a gift. \nTo be saved by grace.\nTo be invited into God’s work.\nTo see that, in the end, it’s all His.\n \nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram4.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 3:1-12, Genesis 1:26-27, Psalm 12, Matthew 12:36-37",
        "devo_title": "Controlling the Tongue",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: James 3:1-12, Genesis 1:26-27, Psalm 12, Matthew 12:36-37\nThe idea of “controlling the tongue” is not just religious-speak to me. It is not just a heading in my Bible or a topic that generates good, honest conversation at a Bible study. It is one of the most sincere prayers of my heart and one of the darkest manifestations of my sin.\nEspecially since becoming a mother, I’ve realized my words have the power to give life and hope or to steal them away. I’ll never forget the look in my young daughter’s eyes the first time I tossed sharp, careless words at her like a grenade and saw her wince at the explosion. I surrendered my tongue and its words to the Lord that day, and I’ve surrendered them countless times since.\nIn chapter 3, James describes the tongue as the epitome of hypocrisy. “With the tongue we bless our Lord and Father, and with it we curse people who are made in God’s likeness” (James 3:9). And here’s the kicker: We are all guilty of this—every one of us, in every phase of life.\nJames does not give us a tidy “how-to” at the end of this passage, no foolproof answer for ending this struggle which takes place in each of us. Instead, he provides one analogy after the other, illustrating the way our words can bring life and direction, or death and destruction.\n“So too, though the tongue is a small part of the body, it boasts great things. Consider how a small fire sets ablaze a large forest” (v. 5).\nOur words have more power than we usually care to acknowledge. If we knew—really knew—the weight our words carry in each person who receives them, how would that change what we say? Would the flames of hypocrisy overcome us if we could see the fires we spark?\nThis forthright passage from James should bring us to our knees. Our struggle to control our tongues and rein in our thoughts should cause us to plead to the Father for wisdom in how to honor Him and build up others with our words. This is just what James encourages us to do in the first chapter of his letter: \n“Now if any of you lacks wisdom, he should ask God—who gives to all generously and ungrudgingly—and it will be given to him” (James 1:5).\nPraise God that He hears us! \nJust as grace pours into the darkest parts of our hearts, igniting the hope of the gospel, so does His grace pour over the fires we start with our words. The hope of Jesus and the forgiveness of the Father extend to this place, too. As a woman who’s flung more sparks than I care to admit, I am so incredibly thankful.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram5.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "Jeremiah 31:13",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nI will turn their mourning into joy,\ngive them consolation,\nand bring happiness out of grief.\n– Jeremiah 31:13\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram6.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 1:2-3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we study James, we will memorize the book’s key verses together, James 1:2-4. This week, we’ll begin with the first part of the passage, which teaches us the paradoxical truth of rejoicing in suffering.\nConsider it a great joy, my brothers and sisters, whenever you experience various trials,\nbecause you know that the testing of your faith produces endurance.\n– James 1:2-3\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/4-James-1.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 3:13-18, Proverbs 11:18, Romans 12:9-21, Galatians 5:22-23, Hebrews 12:11",
        "devo_title": "Wisdom from Above",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: James 3:13-18, Proverbs 11:18, Romans 12:9-21, Galatians 5:22-23, Hebrews 12:11\nYou could fill an entire library with all the bad dating advice heard around the world. As early as elementary school, girls are told to change their style or personality to woo a crush. In high school, magazines tell girls to pretend to laugh at his jokes or play hard to get. Even in our twenties, thirties, and beyond, the barrage of bad dating advice from media, friends, and professionals is inescapable. Advice rooted in jealousy, insecurity, and selfishness has engulfed our culture.\nWe’ve all sought advice from the world, whether on dating or some other aspect of life. We all face experiences that challenge and confuse us—they’re often the moments that grow us the most. As James says from the very beginning of his book, the trials of life produce maturity (1:2-4). But where we choose to turn with our questions when we’ve lost our way can dramatically change the course of our journey.\nAs a counselor, people often turn to me for advice and wisdom while in the throes of crisis. And the truth is, I don’t have all the answers or the perfect advice for every person. Thankfully, my work is more about supporting people along their journey, rather than telling them which steps to take. The desire for clarity isn’t wrong, but there is only one all-knowing and perfect Counselor—and it sure isn’t me.  \nWe need to be careful whom we trust to speak into our lives. Hear me on this: it is immeasurably valuable to open your life up to guidance from your trusted church community. But we need to remember that all of us are broken vessels, imperfectly reflecting the image of God. The Lord speaks through people (Matthew 10:20), but we must weigh the words of others with the help of the Holy Spirit to discern what God Himself is saying.\nJames does not take the matter of bad advice lightly, going as far as to call it demonic (James 3:15). Why is it such a big deal? Because bad advice can wound people and even destroy lives. There is a sharp distinction between wisdom from above, and wisdom from below. Knowing how serious the consequences can be, we need to be careful with both the counsel we take and the counsel we give. \nThankfully, James describes what godly “wisdom from above” looks like. Wisdom from God is “pure, then peace-loving, gentle, compliant, full of mercy and good fruits, unwavering without pretense” (3:17). \nInterestingly, those descriptions don’t sound anything like the most “influential” voices in our culture. But is there anyone that does come to mind when you read James’s description of wisdom? Those are the people we ought to turn to for advice, the people we should hope to grow more like over time. \nOf course, the life of Christ is the ultimate example of godly wisdom in action. If anyone knows what it is like to face trials, it’s Jesus before the cross. And ultimately who does He seek for comfort and wisdom but His Father? (Luke 22:39-43). This is God’s best for us too.\nIn times of crisis and pain, when we’re looking for direction, may our hearts learn to hear the instruction of the Holy Spirit. May we seek first the wisdom of our Heavenly Father. Even now, He longs to be gracious to us, to generously give us wisdom when we ask Him for it (Isaiah 30:18; James 1:5). We’ll know it’s from Him because true wisdom from above carries with it the sweet aroma of gentleness and peace.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram8.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 4:1-12, Psalm 9:19, John 4:23-24, Galatians 1:10, 1 John 5:13-15",
        "devo_title": "Grace for the Humble",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: James 4:1-12, Psalm 9:19, John 4:23-24, Galatians 1:10, 1 John 5:13-15\nI remember the last time that I humbled myself before the Lord. I didn’t really have a choice. I woke up before the sun, an hour from home, stared at the ceiling, and writhed in the sheets, trying to get out of my own skin. I didn’t want to be me anymore. “Me” had screwed everything up. I wanted to be someone else, or find a way to go back in time and undo all the wrong I had done.\nI wanted to start over.\nIf I could just go back to the beginning of the year. Or, no, the beginning of last year. Really, if I could go back to before college, that would be best. Or, possibly back to childhood. I was happy then, right? Maybe back then I was okay. I turned to punch my pillow. I know I can never go back far enough. I am who I am. Because of sin, there wasn’t a specific moment in time when things started to wrong. And that is humbling.\nI eventually got out of bed and got in my car to drive home. There was an accident on the highway—the kind that makes you put your car in park. I screamed and slammed the steering wheel and didn’t care who saw me in the next lane. The car was pointed home, but I didn’t know where I was going. I just needed to be alone with God and scream at Him and apologize to Him and beg for His forgiveness. Every twenty minutes or so, my mom called to check in on me. She knew I was in a dark night of the soul. “Keep screaming,” she said. “All God requires of us is to acknowledge we have done wrong and turn around.”\nThose words had never touched my soul so deeply. \nThis is the truth: The world seduces us with its material goods, its experiences, its flushes of beauty and its moments of lust. When we’re proud, we walk along that destructive path, trying to feign confidence. We fill our hands with the world’s pleasures, but like sand, it falls through our fingers. We dig and dig, but in the end, we’re left dirty and empty-handed. All the castles we build are eventually swept away.\nHumility is admitting the truth: I have nothing. That’s what I screamed to God in the car. That’s what James wants us to shout to the Lord, too. And thankfully, beautifully, God stands arms open wide, ready for us to turn to Him. He holds our hand when we let go of everything else.\nDo you know what’s amazing about this kind of humility? Letting go of the world actually gives us the power—God’s power—and strength to live in this world. It’s a paradox. When we put our entire identity in God, we are no longer slaves to the world’s trends or its approval. We can stand up for justice, at the risk of looking foolish. We can endure ridicule, rather than fight for our reputation. When we have humbled ourselves before God, we don’t need the world’s applause, because our treasure is in heaven.\nThank God for humility. And thank God that when we finally, finally, fall to our knees, screaming and ugly-crying before Him, He comes to lift us up.\nPunch a pillow today, friend. Tell God the truth about who you are. He already knows. Still He waits for you. He longs to hold you, even though you have nothing but yourself to give.\n\nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram9.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 4:13-17, Proverbs 27:1, Acts 18:19-21, 1 Corinthians 5:6-8",
        "devo_title": "Boasting About Tomorrow",
        "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: James 4:13-17, Proverbs 27:1, Acts 18:19-21, 1 Corinthians 5:6-8\nThe other morning I sat down and thumbed through some old journals from earlier in my 20s. (Incidentally, if you want a good laugh, go back to another season in life and read about what was important to you then.) Sometimes I mentioned an upcoming event or trip or a boy or some kind of debacle that I’d found myself in. But I always had some kind of a plan in motion.\nThe trend started early. I once found a to-do list from when I was about eight years old that included “play outside for 1.5 hours.” Because childhood is way more fun when you plan it.\nTo this day, my tendency to plan is in full effect. Each and every day starts off with a to-do list of what I want to accomplish. I even add the tasks I’ve already finished, just for the satisfaction of checking them off ‘the list.’ Anyone else?\nMy junior year of college, some of my dearest and I planned a retreat to the suburbs of Chicago. As we pulled onto the freeway, I was in the passenger seat in charge of navigation, giving me the much-appreciated perception of control. So you can imagine my surprise when I looked up from my map to see the car in front of us at a full stop—while we cruised along in pace with the rest of the highway. \n\nWhat happened next felt so slow that I can remember every moment, but it was, in reality, mere seconds. Everything became eerily silent. My last thought before impact was, You’re about to be in a car accident. \nCome now, you who say, “Today or tomorrow we will travel to such and such a city and spend a year there and do business and make a profit.” Yet you do not know what tomorrow will bring—what your life will be! For you are like vapor that appears for a little while, then vanishes.\n– James 4:13-14\n Nothing prepares you for a crash. For the smell of exhaust. The sound of bending metal and shattering glass. The taste of airbag dust. The shock.\nAs things settled, I leaned my shoulder into the car door and stepped out of the wreckage into the stopped, shocked traffic, the Chicago skyline rising up around me. I brushed the airbag dust off of my shirt and cheeks and took a few shaky steps. For months, I would wrestle with the crash in my dreams as I waded through the feeling of helplessness.\nIt’s inevitable. We get phone calls or texts or emails that stop us dead in our tracks. The devastating news comes—on-screen, in a letter, or across someone else’s lips. Or maybe, like me, you’ve witnessed or experienced something horrific, something tragic or traumatic. Suddenly, your plans get pushed aside and those to-do lists get burned. You’re left raw and broken, trying to catch your breath.\nThat’s the moment when you remember the truth: you’re not the one upholding anything. You remember not to “boast about tomorrow, for you don’t know what a day might bring” (Proverbs 27:1). Christ alone holds all things together (Colossians 1:17).\nTomorrow could bring beauty; it could bring heartache. But as I’ve been reminded, even in my darkest moments, Christ holds me fast. Each moment is laced with His grace.\n\nMelissa Zaldivar is a social in the world of academics and an academic in the world of socials. Ever the Enneagram Six, she likes to dream big, talk herself out of it, and then just do the thing already. She holds a Bachelor’s degree in Communications and Bible/Theology as well as a Master’s in Theology. Her passions include eating Jimmy John’s sandwiches, showing people pictures of her nieces, and nerding out over biblical languages. If you ever need to know anything about obscure Puritanical American history or NASA, she’s your girl.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram10.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 5:1-6, Matthew 5:38-42, Hebrews 10:35-39, Revelation 20:11-15",
        "devo_title": "Warnings to the Rich",
        "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: James 5:1-6, Matthew 5:38-42, Hebrews 10:35-39, Revelation 20:11-15\nMy husband and I were on our way to a dinner party, when we cut through a neighborhood on the nice side of town. As we drove the luxurious streets, we stared out our windows at the soaring homes with custom architecture and perfectly manicured lawns. Each house looked like the perfect place to live, its own little heaven on earth. We drove in silence, until my husband turned to me and laughingly apologized, “I’m sorry I’m a pastor.”\nThis is a running joke between us, though I can’t help but detect a hint of truth in his voice. We have every single thing we need, and more, but that doesn’t stop comparison from knocking on our door. On more days than I care to admit, I peek over the fence into my neighbor’s greener pasture, and I yearn for it. \nDeep down, my husband and I both know that “more” will never scratch the itch of envy. More money, more house, more things will not relieve the pain—and the lie—of comparison. It’s a bottomless pit of need, with endless demands which are never satisfied. We know this, but we also need reminding. \nThis is the gift of James 5, which reminds us what is true about all our pretty possessions. Preached with the same fire-bellied conviction as the Old Testament prophets, James has harsh words for wealthy people who misuse their riches. According to New Testament scholar Douglas Moo, James is not targeting all wealthy people, but those who put their wealth to unrighteous ends. Or, those who are simply stingy with it. For those believers, James reserves his harshest judgments.\nHowever, James has a more universal message too. Whether we have wealth or we don’t, whether we misuse our money or we don’t, our possessions amount to very little. Drawing on earlier biblical imagery of moth and rust (Matthew 6:19), James reminds us that even our finest earthly possessions will one day be gone. Their Kingdom weight is slight. Their investment yields even less. Money and possessions cannot, and will not, give us what we want. \nSo, how do we escape the wretched emptiness this passage describes? \nFirst, feed on God, not things. Our pursuit of possessions is a lot like trying to satisfy deep hunger by eating a single lettuce leaf. It will not fill us. Our appetites can only be satisfied by the “bread of life,” Jesus Christ, who promises, “No one who comes to me will ever be hungry, and no one who believes in me will ever be thirsty again” (John 6:35).\nSecond, be generous. Too often, we resolve not to love our possessions too much, a mindset that is well-intentioned but without accountability or discernibility. The world will only know we hold our possessions loosely if we actually hold them loosely. This is why Jesus exhorts us to radical acts of generosity (Matthew 5:40-42). Jesus commands this, not simply because it’s a “nice thing to do,” but because it sets our hearts—and, therefore, our feet—on a different path, away from the destruction James describes. \nThese are truths we must speak over ourselves again and again. The sparkle and shine of worldly goods are a powerful illusion, but the more we return to these biblical truths, the more they will start to sink in. \nNow, whenever my husband apologizes for what we cannot afford, I turn to him and smile to say, “You know what, they don’t have anything we don’t already have in Christ.” \n \nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She is a regular contributor to Propel, blogs at SheWorships.com, and her first book releases in October 2017.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram111.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 5:7-20, Joel 2:23, Matthew 5:33-37, Hebrews 11:32-40, 1 Peter 4:7-11",
        "devo_title": "Patience for the Long Haul",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: James 5:7-20, Joel 2:23, Matthew 5:33-37, Hebrews 11:32-40, 1 Peter 4:7-11\nWhen I see the word “patience” listed in Galatians 5, along with the other fruit of the Spirit, I groan. I’m reading happily along with love, joy, and peace, and then… patience. Ugh.\nI know I’m not patient. Watch me try to fold a fitted sheet. But patience, as talked about in the Bible, is much more than remaining calm in the midst of fitted-sheet frustration.\nTake the new believers in the book of James as an example. These people were Jews recently converted to Christianity. Because of their new beliefs, they were rejected by their own people. They were persecuted by everyone around them, and James tells them to do what? \n“You also must be patient.”\n– James 5:8\nThe Greek word often used for patience in Scripture is makrothumeo, which means… well, it means words that make me uncomfortable, such as:\nLongsuffering\nSlowness in avenging wrongs\nSteadfastness\nForbearance.\nPatience is much deeper than something you practice when someone is hogging the bathroom. Patience—the longsuffering kind of patience—is something that arises when real trial strikes.\nA few months ago, my own longsuffering was tested. I wish I could tell you I turned to God, fully trusting Him during this dark time, but no. Instead, I shook my fist, and I shook it hard. I was angry at God, and I tried desperately to escape the anxiety and darkness by my own means.\nYou could say I was the opposite of longsuffering. I was short-suffering, tiny-suffering, microscopic-suffering. I realized in those few months that my pain threshold is nearly nonexistent and, even still, I know most of you reading this have weathered much worse. My life was not bearing the fruit of patience because somewhere deep down inside of me I didn’t trust my God. And somewhere even deeper inside of me, I had lost hope and convinced myself I was alone.\nBut there’s an amazing thing about the word longsuffering in the New Testament: it is almost always an instruction given in the context of hope.\nRomans 8 says, “For we know that the whole creation has been groaning together with labor pains until now. . . We ourselves who have the Spirit as the firstfruits—we also groan within ourselves, eagerly waiting for adoption, the redemption of our bodies” (vv. 22-23).\nAnd in Galatians 6:9, we’re told, “So we must not get tired of doing good, for we will reap at the proper time if we don’t give up.”\nWe groan. But we don’t give up. Better still, we do not wait without hope! \nWe do not wait in vain. We wait for our God—the God who has promised and secured our full redemption through Jesus Christ.\nMay we do the same for each other in the face of our trials. Let’s practice longsuffering together. Let’s look at our lives with an eye to that glorious day in the future when suffering is but a long, forgotten memory of this earth.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram12.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "Galatians 5:22-23",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness,  gentleness, and self-control. The law is not against such things.\n– Galatians 5:22-23\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/SRT-James-instagram13.jpg"
    },
    {
        "book_title": "James",
        "devo_passages": "James 1:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we study James, we are memorizing the book’s key verses together, James 1:2-4. This week, we’ll memorize verse 4, which focuses on the effect of enduring in Christ.\nAnd let endurance have its full effect, so that you may be mature and complete, lacking nothing.\n– James 1:4\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/4-James-2.jpg"
    }
]