[
    {
        "book_title": " John",
        "devo_passages": "John 1:5",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nOver the four weeks of this study, we have been memorizing the first five verses in John’s Gospel, pivotal words on the person and calling of Christ. This week we will memorize the final verse, a verse of great hope.\nThat light shines in the darkness,\nyet the darkness did not overcome it.\n—John 1:5\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/4-HRTJohn-4.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": " Isaiah 32:17",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nThe result of righteousness will be peace;\nthe effect of righteousness\nwill be quiet confidence forever.\n— Isaiah 32:17\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram27-2.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 21:1-25, Hebrews 2:17-18, 1 Peter 5:1-4",
        "devo_title": "The Ascended Lord",
        "devo_summary": "\n                    \n                    In his wonderful cookbook, The Supper of the Lamb, R.F. Capon observes, “It is in the ordinary that groans with the weight of glory.”\nOf course, we are naturally inclined to think the opposite—to expect that prominence, pomp, and power are the end goal, or even that they are the best evidences of spiritual achievement. But places of prominence are never for us. We are raised only that we may bow and serve. And service is seldom made of grand and recognizable gestures.\nChrist, newly risen from the dead, might have summoned angels to attend Him. He might have visited kings instead of fishermen. He might have ordered a spectacular banquet, rather than serve simple bread and cooked fish on the shore.\nThe Christ who ascended in glory was the same Christ who served breakfast on the beach, who stooped to serve. His glory was revealed perhaps most profoundly in the ordinariness of His ministry. I wonder, when we pray for God’s blessing, how many of us ask, “Lord, use me in ordinary ways.”\nYet that is what Jesus asks of Peter. “Do you love me? Then feed my lambs, tend my sheep, feed my sheep.” This was not a call to fame, but to lowliness.\nIf you’re like me, you may be saying, “Yes! Amen! That is precisely how I try to live! I try to serve God in the everyday things, in the little stuff.” \nIs that the truth? Or, do we like Peter, the moment after declaring our love for Christ, turn and wonder what God is doing in someone else and say, “Lord, what about this man?” How quickly our hearts run to competition and the desire for a place of special prominence. How often we use our oversight for shameful gain, rather than eagerly serving. \nHave we truly grasped the vision of the Kingdom of heaven? Capon further observes, “A man can do worse than to be poor. He can miss altogether the sight of the greatness of small things.”\nHow greatly we are indebted to Christ’s condescension, to the authority of His humility, to the glory of His servanthood! Lord, open our eyes to see the Kingdom. Cause our hearts to long for the blessedness of humility.\nJohn concludes his Gospel account with these words: “Now there are also many other things that Jesus did” (John 21:25). I tend to think of those “many other things” as grand displays of power, staggering miracles, and earth-shaking utterances. But I’m beginning to wonder if John is speaking of something else. How many words of love and kindness did Christ utter? How many meals humbly prepared? How many quiet stoopings? How many washings of feet? How many wiping of tears from the eyes? How many ordinary, plain, and small glories did He display? \n“Were every one of them to be written, I suppose that the world itself could not contain the books that would be written” (John 21:25). And a lot of them would probably appear very ordinary.\nWritten By Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram26.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 19:1-42, John 20:1-31, 1 Peter 2:22-25, Psalm 22:1-8",
        "devo_title": "The Son of God",
        "devo_summary": "\n                    \n                    We should not be too hard on Thomas. Believing in the resurrection of Jesus without seeing the proof was a tall order since, in his world, one hundred out of one hundred people died, and when they did, they tended to stay dead.\nBetween His resurrection and ascension, Jesus appeared in the flesh to over 500 of His followers (1 Corinthians 15:6). He appeared to Mary Magdalene and a few other women on Easter morning, and He appeared to Peter and John later that day (Luke 24:34; 1 Corinthians 15:5). That afternoon, Jesus appeared to two others walking to Emmaus (Luke 24:13-32). Then later that night, the other disciples, except Thomas, were in a room talking about what had happened to Jesus, and as they were talking, Jesus came and stood among them and bid them peace (Luke 24:36). Jesus showed them His scars and invited them to touch them to see He was real.\nThomas wasn’t there for any of that. Later, when he heard about it, he said that unless he could see the marks of the nails in Jesus’ hands and place his hand into Jesus’ side, he would never believe (John 20:25). It seemed unwise to go down such an impossible road. But eight days later Jesus appeared again to the disciples when Thomas was there, and said, “Put your hand in my side, Thomas. Don’t doubt, but believe” (John 20:27, paraphrased). Then Thomas saw Him and said, “My Lord and my God!” (John 20:28).\nIf you were in Thomas’ shoes, would you have believed the disciples’ story without seeing the proof? Even though I might have wanted to, I don’t know that I could have.\nJohn’s Gospel was written with a purpose—to exist as proof of the resurrection of Jesus. He said, “These things are written so that you might believe that Jesus is the Christ, the son of God, and that by believing you may have life in His name” (John 20:31).\nWe’re given a different kind of proof, but proof nonetheless. In John’s Gospel, he shows us the risen Christ—but not simply with words alone. He gives us a testimony to a resurrection that has not been disproven, but rather has come to be embraced and celebrated by millions of people around the globe and down through time. It is such an incredible claim that it should have been easy to disprove if it were false. But that is not what has happened.\nInstead, the story of Jesus’ resurrection has led to the transformation of countless lives. Why? Because the evidences and eye-witnesses surrounding His resurrection were so numerous and consistent that people who came looking to find the whole thing to be a sham often ended up believing. And with believing comes life in Christ’s name. People are changed by the life and ministry of Jesus, not just intellectually but in every way imaginable.\nThe simple fact that Christianity—a faith built upon the resurrection of its founder—still exists, is a testament to its authenticity. \nWhat about you? Do you believe this?\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram25.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 18:1-40, Daniel 7:14",
        "devo_title": "Not of This World",
        "devo_summary": "\n                    \n                    To us it makes perfect sense that Jesus’ Kingdom would be “not of this world.” That’s how we’ve always understood and encountered the Kingdom of God. Not so for Pilate and all the Jewish leaders gathered at Jesus’ midnight interrogation.\nJesus was crucified under a sign that mockingly read “King of the Jews.” To many who were present on that day, that sign was an indictment of Jesus’ failed earthly political revolution. Based upon their best understanding of Old Testament prophecy and the teachings that had been handed down to them, the Jews were expecting a political military revolutionary who would overthrow the oppressive Roman governance of Israel. They were hoping for a new King David; a heroic, military, warrior king.\nIt’s easier for us now to think of Jesus’ Kingdom in spiritual and future terms, but on the day of His arrest, we can see even by Peter’s behavior that many were expecting to take up arms to bring the Kingdom of God to earth. This of course was not Jesus’ way. It was such an unexpected moment when Jesus announced that His Kingdom was not of this world.\nWhat does this mean for us? It means that we, as Kingdom people, are experiencing portions of the Kingdom now, but that we also await its future and full arrival. Jesus’ death and resurrection inaugurated the Kingdom of God. Because of this we now live “in the world, but not of it.” It’s an odd ache, a disquieting tension that I’m willing to wager most of us have felt from time to time. We are “not of this world” people, living, working, and dwelling on this earth.\nC. S. Lewis described this sort of longing best in his book Till We Have Faces:\n“The sweetest thing in all my life has been the longing — to reach the Mountain, to find the place where all the beauty came from — my country, the place where I ought to have been born. Do you think it all meant nothing, all the longing? The longing for home? For indeed it now feels not like going, but like going back.”\nThat longing we possess is a sign that we are in the midst of a massive redemptive mystery. We stand in a moment between the resurrection of the Lord and His much anticipated final return. This moment is full of hardship, but also characterized by an immense sense of hope. To be “not of this world” means that you’re going to feel like a square peg in a round hole some days. Other times, it may just feel like an unquenchable wanderlust, or itchy feet. \nTravel is a wonderful thing, but our hunger for the right place—the most beautiful place, the place where we feel home and whole—is ever elusive. That’s because our King and His Kingdom are not of this world’s making. This can be hard to wrap our heads and hearts around, but we know it will be satisfying in an eternal and everlasting way when the Kingdom of God is fully realized. From then on, it will be all we ever know. But for now, because the coming Kingdom is real, we ache. May the longing be sweet.\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram24.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 17:1-26, Isaiah 42:8, 1 John 5:20",
        "devo_title": "Glorify Your Son",
        "devo_summary": "\n                    \n                    Back when I was doing youth ministry, there was this one night I was teaching in Romans. There were many nights when I would teach and I would know I had their attention. They were with me and the Holy Spirit was moving among them. Something was happening and I knew it. Those were special nights.\nThis was not one of those nights. \nI knew I was not getting through, no matter how hard I tried. The metaphors fell flat and the examples were not connecting. I could hear their souls longing to reach for their phones. I was frustrated.\nWhat was I trying to get them to see? We were discussing the glory of God. And I was struggling to get them to understand what God’s glory was and why it was so important. And then something happened that I will never forget. This young girl leaning back in her chair spoke up and made it clear.\n“Do you mean His wonderfulness?”\nIn that one word she had made clear what I, the seminary-trained pastor, could not. And ever since, I have used her definition and that story when communicating what the glory of God means. Her definition holds up, even when I set it against those of the theologians throughout history.\nSo when I see Jesus in His “High Priestly Prayer” (which He prayed right before His arrest, death, and resurrection) say, “glorify Your Son, that the Son may glorify You,” I read Jesus’ words through the lens of that girl’s definition of glory.\nWhen Jesus prays that He would be glorified, He is praying that we would see His wonderfulness and that He would then, in turn, show off the wonderfulness of the Father to us. Now, if I were to pray this, that would be awful. My wonderfulness—if there is any—would not do you any good. It would be an arrogant prayer for me or any of us to pray. So why is it not arrogant for Jesus to pray this?\nBecause apart from us seeing Christ’s wonderfulness, we have no hope. We must see the wonderfulness of His perfect life. There are many wonderful things in His life to see, not the least of which is His perfect obedience to the Father and His ability to never sin. We must see the glory of His death. It is gruesome and tragic, but we must see the wonderfulness of how loved we are in His giving His life so that we could be saved from our biggest problem, our sin. And we must see the wonderfulness of the resurrection. Even though He was as dead as dead can be, He rose from the grave; and we are given the wonderful promise that because He rose, we will, too, if our faith is in Him.\nSee this in full wonder: when Jesus prays that we would see His wonderfulness, it is the most loving prayer He could have prayed. Wonder of wonders. May the Lord give us eyes to see the wonder of who He is.\nWritten By Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram23-2.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 16:1-33, Isaiah 32:14-18, Romans 8:12-17",
        "devo_title": "Jesus the Conqueror",
        "devo_summary": "\n                    \n                    Did you ever play King of the Mountain as a kid? The whole point is to stand in one spot, on “the mountain,” while opponents try to take it. They push, tackle, and bombard you, but if you stand your ground, you stay King of the Mountain—or usually a sewer manhole, a patch of dirt, or a couch. No alliances are allowed. No sharing of the hill. Only one king and only one mountain. Whoever is strong enough to endure reigns as king. It’s a cruel and crushing monarchy.\nDo you see how different the King of Mount Zion is? Jesus is the King of kings, and He doesn’t discourage anyone from standing with Him. He invites us. Christ welcomes poor sinners into His kingdom and into His majesty to share His reward.\nJesus came down from Heaven—chucking the King of the Mountain playbook—and died on a Roman torture device for sins He didn’t commit. But He didn’t lose His spot on the mountain. He rose from the dead and has been given a name above every name and a throne over the universe.\nJesus overcame. The devil couldn’t stop him. Even death’s grip wasn’t strong enough to keep Jesus from being the resurrected King of kings. Jesus outperformed and outlasted the greatest threats in the world, with sin and death being the loudest of them all. And He did this for you.\nIn Christ, you are with Him on the Mountain. “Who shall separate us from the love of Christ? Shall tribulation, or distress, or persecution, or famine, or nakedness, or danger, or sword? … No, in all these things we are more than conquerors through Him who loved us. For I am sure that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord” (Romans 8:35, 37–39).\nIf your faith is in Christ, you have overcome the world because He overcame the world. Nothing shall separate you from Him—from His love or His power.\nWritten By J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram22.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 1:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nOver the four weeks of this study, we are memorizing the first five verses in John’s Gospel, pivotal words on the person and calling of Christ. This week we will memorize verse 4.\nLife was in Him,\nand that life was the light of men.\n—John 1:4\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/4-HRTJohn-3.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "Zephaniah 3:17",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHe will rejoice over you with gladness.\nHe will bring you quietness with His love.\nHe will delight in you with shouts of joy.\n—Zephaniah 3:17\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram20.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 15:1-27, Zephaniah 3:14-17",
        "devo_title": "The True Vine",
        "devo_summary": "\n                    \n                    In John 15, Jesus unfolds a familiar metaphor—He is the vine, we are the branches. What does this mean? People have taken this image to mean a lot of things. Some focus on how it highlights the nearness of Christ. Others may focus on how it promises that we will do amazing things for God as fruit-bearing branches. But Jesus’ focus of the metaphor is obedience. The Son cooperates with the Father, and then calls us to cooperate with Him.\nJohn 15:9 reads a little like a math story-problem. Solve for why we should obey: “As the Father has loved Me, I have also loved you. Remain in My love.” The sequence of our connection to Christ in this verse is important to see. As the Father has loved Christ, so Christ has loved us. For this reason we are called to remain in His love—because He has loved us as the Father has loved Him. Think about that. There is not a single degree of difference between the strength of God’s love for Christ and Christ’s love for us. Not even a hint.\nHow do we remain in a love like this? Jesus answered plainly in the chapter before: “If you love Me, you will keep My commands” (John 14:15). We remain in the love of Christ by obeying. Here is where we can go off the rails, though. Love precedes obedience. If you reverse that order, you lose the gospel. Obedience is not how we obtain Christ’s love. It is a response to it. \nTrue Christian obedience is always a response to the already-existing love of Christ, not an attempt to earn it. We love because He loved us.\nIf we love Jesus, the only response that makes any sense at all is to obey what He commands. If Jesus, the Son of God, came in the flesh for the purpose of living and dying in our place, then what command could He give us that would not be for our good? What bit of guidance could He issue that wouldn’t exist to strengthen the bond of our love for Him? Why would Christ call us to anything if it didn’t serve to strengthen our comprehension of the depth of His love for us?\nIt is God’s design that our lives would resemble Christ’s—that we bear fruit that shows Christ to others. This, Jesus tells us, brings glory to God—when our lives bear fruit that reveals Christ (John 15:8). What an amazing thought, that the commands of Christ are not given to be a burden (Matthew 11:30), but a path to freedom, peace, and an always deepening understanding of His love for us—which, in turn, reveals His love to others.\nBecause of all this, Jesus says, “Remain in me.” \nMay our obedience to Christ always be a response to His already-existing, never-failing love for us. And may our obedience—flawed and incomplete as it is—bring glory to Christ, to the delight of the Father.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram19.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 14:1-31, Isaiah 28:16, Ezekiel 1:26-28",
        "devo_title": "The Only Way",
        "devo_summary": "\n                    \n                    We love expectations. Sometimes we love them more than reality. We can fantasize about what something might be like—that dream job, the relationship we have longed for, winning a big game, or simply a delicious meal. But our expectations also have the power to destroy, especially when they go unmet. \nWhen Jesus said, “I am the way, and the truth, and the life. No one comes to the Father except through me” (John 14:6), His disciples were confused. Maybe they were expecting someone more religious-looking, or more physically respectable, or more professional. Philip replied, “Show us the Father, and that will be enough for us to believe” (v. 8). Jesus didn’t meet even His own disciples’ expectations. Even though they had the Son of God standing in front of them, there was a part of them that wanted more.\nWhen our expectations are not met, we begin to question whether something or someone is worth the effort. We call this doubt—a struggle to imagine a way, or a truth, or a life when things don’t go the way we expected.\nWhen Jesus says He is the way, He is calling us to a life we are not creative enough to expect. We are called, like His disciples, to allow the Author of life to rewrite our expectations. This rewriting is hard. It often involves pain, and it can seem like a never-ending process (which it is).\nWhen Jesus says He is the truth, He is calling us to lives we are not always honest enough to receive—the truth about God and about ourselves, the truth of grace and repentance, the truth about what is valuable and lovely. \nWhen Jesus says He is the life, He is calling us to embrace a reality of that cannot exist apart from Him.  \nJesus calls us to Himself. He is the way and the truth and the life. And as we read in John 14:2, He goes before us to prepare a place for us. Jesus loves His children enough to redeem us here and to lead us home. \nChild of God, whatever your broken expectations are, you are called by the One who lacks nothing. In Christ, you are redeemed. \nWritten By Jason Tippetts \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram18.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 13:1-38, Mark 9:35, Romans 3:21-26, Psalm 31:9-10",
        "devo_title": "Servant of All",
        "devo_summary": "\n                    \n                    In biblical times when you came into someone’s house, you would need to wash your feet. This task was typically performed by a servant who would stand at the door, washing the feet of his master’s guests as a gesture of hospitality. \nWhy is that information relevant? Because in John 13, Jesus does something radical. The Son of God in the flesh takes off His outer garments and kneels at the feet of His disciples so that He can wash their feet.\nJesus was showing the disciples that He is the servant of all. No matter the dirt and possible excrement on the feet of His disciples, Jesus washed them. Likewise, there is no sin so dirty in us that God cannot wash it away. \nIf Jesus is more than willing to stoop low to cleanse us, why do so many of us reject His humility and service on our behalf? John 13:8 gives us the answer to that question: “Peter said to Him, ‘You shall never wash my feet.’ Jesus answered him, ‘If I do not wash you, you have no share with me.’” Peter could not imagine Jesus stooping so low.\nLike Peter, we struggle to believe that we need Jesus to cleanse us. We think our cleansing is not the responsibility of the Son of God. Many of us accept the lie that our sin is too great for God to tolerate, so the cleansing of that sin becomes our responsibility. But that is not the gospel.\nThe good news of the gospel is that the nail-pierced hands of Jesus cleanse any and all sin away. This washing happens as a gift of grace to all who need to be made clean. In order for us to enter God the Father’s house after this long journey we call life, Jesus, the servant of all, comes to earth to wash the feet of His Father’s guests so that we might dine at His table. \nIt’s an open invitation. Are you coming? \nWritten By Jevon Washington\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram17.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": " John 12:1-50, Psalm 118:25-26, Isaiah 6:10, Isaiah 53:1",
        "devo_title": "The Father’s Son",
        "devo_summary": "\n                    \n                    John’s Gospel is full of rich truths. In particular, John highlights Jesus’ divinity more than the other Gospels. From John 1:1 to the end, it’s obvious not only that Jesus is God, but that Jesus knows He is God.\nAt the same time, we see over and over again Jesus pointing to His Father, reminding people that the Father sent Him, that He speaks on behalf of the Father, that He’s an exact representation of the Father, and that He seeks only to glorify His Father. In short, the Father and His Son are both God, but there seem to be some similarities and differences between them. Both are said to have created the world, but we also know the Father didn’t die on the cross. As theologian Fred Sanders has said, “They are equal, but they are not each other.”\nWhy does this matter? John’s Gospel in general and John 12 in particular give us a peek into the life of our Trinitarian God. God is Father, Son, and Holy Spirit—one God in three persons. This is important to affirm because it’s important to know and understand God rightly (at least, as best we can with our limited humanity).\nJohn 3:16 tells us that God (the Father) sent His only Son (Jesus) to give us eternal life—the eternal life they share as God. As we will see in John 14, we also know that Jesus will send the Holy Spirit to remind us of Jesus’ words and to empower us to live Christlike lives. In other words, we see clearly that God loves us, and that He’s provided everything we need to be saved.\nIf a person believes in Jesus, he believes in the Father who sent Him (John 12:44). If a person believes in the Father and Son, he must believe in the Holy Spirit who will be sent to him. God the Father sent God the Son into the world, and God the Son sends God the Spirit into our hearts. And we know that through this faith, we have eternal life (John 12:50).\nGod has come into the world. He has come to save sinners. And He has come to live within us. May we say with the psalmist in Psalm 118:25, “Lord, save us!” We know that He wants to save us and that in Himself, He has given us all we need for salvation. Have you called out to Him?\nWritten By Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram16.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 11:1-57, Daniel 12:2-3, 1 Thessalonians 4:13-14",
        "devo_title": "When Jesus Wept",
        "devo_summary": "\n                    \n                    So. So is a word that indicates purpose. I am tired, so I take a nap. I am hungry, so I get a snack. My daughter is talking, so I listen (sometimes—she talks a lot).\nJohn 11 turns on the word so. People brought Jesus word that His close friend Lazarus was deathly ill. You’d expect Him to drop everything and rush to Lazarus’s home, especially because Jesus could heal any illness. But He didn’t. The passage says, “so when He heard Lazarus was sick He stayed two more days.” What? Why? That seems insane or negligent or insanely negligent—even more so when Jesus said that the sickness would not lead to death. Of course it would if nobody healed him. But Jesus waited on purpose.\n“This sickness will not end in death but is for the glory of God that the Son of God may be glorified through it” (John 11:4). Those are Jesus’ words. Except Lazarus did die. And dead is dead, final, life over. Jesus could have stopped it, and Lazarus’s sisters knew it. Yet He intentionally waited to show up and then had the audacity to say Lazarus had “fallen asleep.”\nWhat was Jesus getting at? What did all this add up to? A display of both His full humanity and full deity, His deep connection to His friends and His power over all.\nWhen Jesus arrived in the town where Lazarus had lived, He walked into the pain of loss. Martha and Mary, Lazarus’s sisters, met Him and—as people do when they are overcome with pain and are grasping for answers—asked why Jesus hadn’t been there to heal their brother. “If you had been here,” they said. If. Jesus had stayed away on purpose. He had let Lazarus die.\nBut Jesus wept. How could He weep when He had allowed the pain to happen? Jesus wept over the loss of a friend and over the pain of death. He wept over the pervasive evil that steals life from everyone and the devastating effects of sin on the world. He wept for the pain of Martha and Mary. He wept because He was a man who deeply hurt.\nThen He showed why He’d waited, what that so was all about. “Lazarus, come forth,” He commanded. (John 11:43). Jesus gave death an order to depart, and it did. For a moment He pulled back the curtain and gave a glimpse into the resurrection to come, the impending death of death He would bring about by laying down His own life. \nIn that moment, in the midst of mourning, Jesus proved the hope that all His followers have, a hope greater than death.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram15.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 1:3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nOver the four weeks of this study, we are memorizing the first five verses in John’s Gospel, pivotal words on the person and calling of Christ. This week we will memorize verse 3.\nAll things were created through Him,\nand apart from Him not one thing was created\nthat has been created.\n—John 1:3\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/4-HRTJohn-2.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "Psalm 29:11",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nThe Lord gives His people strength;\nthe Lord blesses His people with peace.\n—Psalm 29:11\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram13.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 10:1-42, Micah 2:12-13, Numbers 27:16-17",
        "devo_title": "The Good Shepherd",
        "devo_summary": "\n                    \n                    I don’t know any shepherds. And if I were a betting man, I’d bet you don’t either. Shepherds are long gone. Sure, we hear about them at Christmastime, or we might catch a late-night PBS special on their pastoral ways, but other than that shepherds have no hold in our 2017 lives.\nSo when Jesus says, “I am the good shepherd” (John 10:11), that phrase poses a challenge for men today. We either tap the brakes and go back to a bygone era in our minds and see Jesus in that same vein (somewhat removed from today), or we hit the gas and speed up to hopefully imagine something more relevant for right now. But what if we focused on the adjective in that statement instead of the noun? Not that the noun isn’t important, because it is. But today’s text doesn’t compare a shepherd to a government official, but rather a good shepherd to a poor excuse for one.\n“I am the good shepherd.” Whether you lived in ancient Palestine or you currently reside in Austin, Texas, that word good rings a bell.\nJust so there’s no confusion, Jesus does us a favor and clarifies things. The shepherd who is good is the one willing to lay down his life for the sheep. The good shepherd puts the sheep before himself. He is ready to sacrifice his own life for those in his care.\nMen, in a world that wants and rewards awesome and epic and great men, I challenge you to live and one day die a good man. And to do so by taking your cues from the one and only Good Shepherd who calls and knows His sheep by name, and was willing to lay down His one and only life for them. Whatever vocation you find yourself in day by day, you have the privilege of living your life in the footsteps of Jesus, the Good Shepherd.\nAnd just so there’s no confusion, let me clarify: the name of the game here is nothing less than sacrifice. It’s not that you and I are trying to be Christ, but that we’re trying to be Christlike. Live that way and you’ll no doubt be accused from time to time of having a messiah complex. That’s fine, whatever. The reality is that you’re simply a man trying to do the right thing, the good thing, the thing that Jesus would do if He were in your boots or your cap-toe oxfords or your Converse.\nWritten By John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram12-2.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 9:1-41, Genesis 2:7, Romans 1:18-20",
        "devo_title": "He Heals the Blind",
        "devo_summary": "\n                    \n                    There is a lot of drama in John surrounding the man born blind, not the least which is his being healed of his blindness, a condition he’d had since birth.\nWhy did God allow his blindness? Jesus’ disciples figured this man was blind for one of two reasons: either it was because he had sinned or because his parents had. Had they known he was born this way, they would have been certain his parents’ sin was behind his inability to see. Regardless, they were confident someone’s sin had caused it.\nNow, we shouldn’t be too rough on these guys. It sounds superstitious and hackneyed for them to say such a thing so bluntly, but if we are honest, they’re only saying out loud what we often think and feel.\nWhen our middle child was born, everything seemed fine. But when we got home we realized something was wrong. He would stop breathing whenever he would fall asleep. His lips would turn blue. We were honestly freaking out. Within a couple days, we were two hours from home at the Children’s Hospital in Jackson, Mississippi. No one was sure what was going on. We had not slept in days. We were tired, scared, and confused.\nBeing on staff at a great church meant that people cared for our family in ways we will never forget. But being on staff at a great church did not stop me from asking if I had done something that had caused this. I wondered which sin of mine my son was now paying for.\nThanks be to God, he has been our healthiest child ever since. Still, I couldn’t help but wonder what caused his trouble. I could attribute my questioning to sleep deprivation or the pressure of having a newborn son who couldn’t breathe correctly, but the truth is, I question God like this all the time. Flat tire? I wonder why I’m being punished. Kid has stomach bug at 2am? What sin did I commit to deserve this? And on and on and on.\nI think we are all spring-loaded to blame someone. We Christians tend to turn the blame around on ourselves. And because many of us have such a low view of God’s love for us and a high view of His disappointment with our behavior, we are tempted to believe suffering equals punishment for sin.\nBut Jesus turns all that on its head and makes it clear that the blind man’s sin is not the reason he was blind. And my sin is not the reason Knox had trouble breathing at two days old. The whole point of the blind man’s affliction was so the “works of God might be displayed in him” (John 9:3). Jesus used the healing of the blind man to attest to the truthfulness of His claims.\nFor me and my wife, the “works of God” were trusting Him in emergency rooms and NICUs. It was trusting that the One who gave His only Son was letting us go through this so we would see His glory. We did, and we thank Him for it still.\nWhat are you walking through? Where are you wondering if God is punishing someone else for your sin? The gospel tells us this in an impossibility. God will never lay the penalty of your sin or mine upon one of our sons, because He already laid it upon His own.\nWritten By Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram11.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 8:1-59, 1 John 1:5-7, Romans 2:25-29",
        "devo_title": "The Light of the World",
        "devo_summary": "\n                    \n                    For the Christian, Jesus is the light we see by.\nTwo-year-old boys have a knack for running towards danger. Add a dash of thick darkness, and you should get the band-aids ready. While playing on a sketchy outdoor playground at a greasy hamburger joint, my son wanted to see what was behind the playground’s main attraction—an abandoned school bus. I tagged along with him to see what was behind the bus. It was so dark I could barely see him. I turned on the flashlight on my phone, and when the light hit the ground in front him, we both saw he was seconds away from falling onto a jagged pile of concrete chunks. I snatched him as he stumbled forward, milliseconds from getting the worst cuts and scrapes of his life.\nIn a way, the light saved him. The light showed us reality. Light is essential to seeing what’s out there, what’s coming at us, where to go, and what to do.\nWhen Jesus says He is the light of the world, He’s telling us reality is found with Him. Jesus shines His light, and as we look at the world through His high-beams, we see we are sinners—people who have fallen short of God’s law. We see that we can’t save ourselves. And then we see He is the Savior we need, crucified for our sins, risen from the dead, reigning in the heavens, and returning soon. Jesus’ light helps us see the universe as He sees it—existing for Him and His glory. This light, Christ alone, gives us life.\nWe now see by faith all we couldn’t accurately see before. “In your light do we see light” (Psalm 36:9). In Christ, we now see hope for eternity and peace for today. In the Light of the World, we also see one another clearly as our racism, selfishness, and pride are exposed and we are empowered to love another better.\nAs we walk through the valley of the shadow of death, the Light of the World shines on us, and shines for us. Because of Jesus, we see the potholes and pitfalls of this world, the temptations and thorns, and the way to life everlasting. The light of Christ shows us how to live with him. “Your word is a lamp to my feet and a light to my path” (Psalm 119:105).\nBy faith in Christ, Who is light, we see the glory of God (2 Corinthians 3:18)—and one day we will see His face (Revelation 22:4). Christ is our vision, our Lord, our light, our all. He is the light we see by, and we can see clearly now.\nWritten By J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram10.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 7:1-53, Leviticus 23:39-41, Joel 2:28-29",
        "devo_title": "A Prophet from Galilee",
        "devo_summary": "\n                    \n                    When your neighbor asks, “How are you?”, do you answer truthfully? Do you want to? When you ask the same of your neighbor, do you really want to know? For many of us, we only want to know when things are going well.\nI recently shared with a friend some our family’s struggles. With one of our sons, we’ve wrestled through ongoing difficulties, trauma, and dangerous behaviors. I trust that God is doing a work in our son’s life, and in our own hearts as well; but for the present, things are still rough. When I share this story, I find people desperately want to hear that everything’s getting better. It’s hard to hear “things are worse” or “nothing has changed.” These are uncomfortable truths, and when we hear them, we want to modify them. \nIs it surprising that when Christ came declaring the truth, even His own people resisted what He had to say?\nWhen Jesus, our perfect Prophet, speaks, do we listen? When He testifies that our works are evil, will we believe? Like the Pharisees, we tend to respond negatively to criticism.\nChrist declares truth, and the world hates Him for it (John 7:7). Christ comes from the Father, and the world seeks to reason away this truth (vv. 27-30). Christ speaks authoritatively, and the world rages at His authority (vv. 47-49). Christ dwells among us, and the world seeks to cast Him out, or kill Him (vv. 1, 41-43).\nOur fear of the truth is often rooted in the notion that truth is usually bad news. In a fallen world, the first part is indeed bad news. We’ve sinned, and the curse is real. But like the Pharisees, fear of facing the bad news often keeps us from seeing beyond it to the great news. \nOn the first days of the feast, Jesus reasoned with the crowd, but on the last day of the feast, He stood up and cried out. The bad news had to be faced, but the good news merited a resounding shout: To all who thirst, Christ offers living water!\nThe wasteland of the fall, the weight of the curse, and the truth of our own guilt are uncomfortable realities to face. But if we receive Christ as He comes to us—and we judge, not by appearances or by our fearful human standards, but with right judgment—then we find every reason to celebrate (Leviticus 23:39,41).\nThis is Christ’s resounding declaration: I will pour out my Spirit on all flesh! If anyone thirsts, let him come to me and drink, and out of his heart will flow rivers of living water! (Joel 2:28; John 7:37-38).\nWritten By Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram9.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 6:1-71, Acts 3:22-23, Psalm 29:10-11",
        "devo_title": "The Bread of Life",
        "devo_summary": "\n                    \n                    I love bread. This is no writerly exaggeration. When I’m at a restaurant and the waiter asks if I’d like bread before my meal, I think to myself, “What planet are you from? Heavens yes, I want bread! Bring it hot, and bring it fast!” From cornbread to pumpernickel to brioche to tortillas—man, I love bread.\nI love Jesus. This, too, is no exaggeration. Jesus is, as Updike wrote, the “tall friend of my childhood.” I’ve loved him since I was a boy, wooed to His side by the King James Version of His love, faithfully proclaimed each Sunday by my father’s pastoral voice. And here, at almost fifty years of age, I love Jesus still.\nOne of the many things I adore about Jesus is the trick He often used when speaking. I do not use the word “trick” in a belittling sense at all. Jesus would fill the air with common words attached to a startling idea. He was, and is, a master of this. For example, “I am the Bread of Life.” To take this most common, and let’s face it, universally beloved thing—bread—and when the hungry people said, “Give us this bread,” to respond to them: “Its me!”? Genius. Absolutely genius.\nAnd while on that day such talk presented good news, full of ripe possibility, it also challenged the ears on which it fell. The text indicates that many disciples heard His words and found them tough, if not impossible, to swallow. Jesus was proclaiming bread with bones in it—His own. The people could understand the manna that Moses provided and how it sustained their ancestors in that wilderness time. But to make the jump from that to this son of Joseph, this son of Mary? Unbelievable. Absolutely unbelievable.\nNot much has changed. The Son of Man still stands before us, pointing to all the things we love, not to diminish those good gifts in any way, but to point to the better gift—Himself—and say, “All those things will leave you still hungry, still restless, still aching. But take Me and you will live forever, and never hunger or thirst again. I am the Bread of Life.” And while this message still strikes the mind as utterly unprovable, it endures a pleasure to the ear. An absolutely hopeful pleasure.\nI love bread. But I love Jesus more.\nWritten By John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram8.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 1:1-2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nOver the four weeks of this study, we will memorize the first five verses in John’s Gospel, pivotal words on the person and calling of Christ. This week we’ll get a head start and memorize verses 1-2.\nIn the beginning was the Word,\nand the Word was with God,\nand the Word was God.\nHe was with God in the beginning.\n—John 1:1-2\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these verses throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/4-HRTJohn-1.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "Ezekiel 36:25-27",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nI will also sprinkle clean water on you, and you will be clean. I will cleanse you from all your impurities and all your idols. I will give you a new heart and put a new spirit within you; I will remove your heart of stone and give you a heart of flesh. I will place My Spirit within you and cause you to follow My statutes and carefully observe My ordinances.\n– Ezekiel 36:25-27\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram6.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 5:1-47, Exodus 20:8-11, Luke 6:5, 1 Thessalonians 4:13-18",
        "devo_title": "Lord of the Sabbath",
        "devo_summary": "\n                    \n                    It seems as though the religious elite in Jesus’ day had really come to misunderstand the meaning of “rest.” Somewhere between Exodus 20 and John 5, Israel’s leaders and scholars had begun to interpret the Sabbath so strictly that they’d lost their bearings on the matter altogether. In an effort to protect the Sabbath and keep it holy, they turned God’s day of worship into the worship of God’s day. \nInstead of being a day of growing in wholeness and closeness to God, rest-oration, it had become an undue burden on God’s people—a day full or rules, codes, and classifications. This was never God’s intent, but as is often the case, humanity took God’s careful and loving Law and distorted it into something it was never meant to be.\nSabbath is not merely a state of passivity. It is the state of settling deeper into wholeness through God’s divinely bestowed love.\nWe can see this so clearly in John 5. Jesus, the Lord of the Sabbath, does not seem to worry about the established customs of the day. Rather, He goes directly to a man who needs rest the most. Jesus honors the Sabbath that He created by bringing physical and spiritual healing to a lame man in great need. In so doing, Jesus not only restored the man’s physicality, but also his spirituality. An unclean person, like the crippled man, would’ve never been welcomed to the temple in Jesus’ day. By healing this man, Jesus restored a sense of wholeness and closeness to God in a matter of moments.\nRest, true rest, comes with healing. It may not be experienced right away, but we all know that it’s difficult to enter a true and complete rest when you’re in a state of suffering and pain. Our Sabbath days are markers and mileposts along this life journey. They are moments to stop, reflect, worship, receive new strength, become intimately closer with God, and regain the energy we need to persevere a little further.\nWe are meant to cease our work, not out of rule or obligation, but rather out of opportunity to create space in our lives for God to move. Much like the still, small voice who spoke to the prophet, God’s restoration in our lives comes frequently in an unobtrusive and undemanding manner. He shows up when we make room in the quiet.\nGod does not call us to seek passivity on the Sabbath, but wholeness—the type of wholeness that can only be found in Him. From that place and from that posture we go out into the world, bringing a healing and comfort that naturally emanates from our rested and spiritually reinvigorated souls.\nJesus didn’t heal on the Sabbath purely to make a statement (though He certainly did drive a pretty significant stake pertaining to His divinity that day). Rather, He did it to offer a glimpse of the wholeness and rest that His coming has inaugurated. It is not complete yet. His Kingdom has not completely come, but we’ve been given a foretaste. And we get a new foretaste each week when we lean into our God, Lord of the Sabbath. \nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram5.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 4:1-54, Isaiah 55:1-3",
        "devo_title": "The Living Water",
        "devo_summary": "\n                    \n                    “Sir, you have nothing to draw water with.”\nThe Samaritan woman is telling Jesus what we all fear hearing: You are not capable. You don’t have what it takes. She was essentially saying, “You are delusional to think you can give me water without a bucket to collect it. You clearly don’t understand what gathering water takes, unless your water is something I don’t understand—something that fills a thirst I can’t even explain.”\nThe grace that sustains us—Jesus’ living water—is something we struggle to understand. We continually try to fit this grace into our economy of works, and it just will not fit. But we still try. I try because sometimes believing in my own snake-oil righteousness is easier. If I ignore my wrongs, this snake oil is all I need. So I work and judge and criticize and long to be better in order to make my snake oil good enough.\nWe understand the snake oil scam of the Old West, but do we see our desire for a modern day concoction?\n“If you knew the gift of God and who it is that is saying to you…” \nThis is the hard edge of faith: do you believe this gift and do you believe the Giver? Do you believe that the living water of Jesus will sustain you? Do you believe that your snake-oil righteousness is a charade? Are you saying, “Sir, give me this water”?\nWhat a story the Samaritan woman can tell. She moves from the place of saying, “You have nothing,” to imploring, “Give me what you have.” This is a glorious story of the chaos the gift of God brings. It is the story of being so dug into our own economy of righteousness that we can’t see what real grace and righteousness look like. But Jesus sees it. And He knows that she, like us, needs what He alone can give.\nFaith in this gift and the Giver is a daily battle of giving up the snake oil, of letting go of an economy of performance that feels comfortable but ultimately destroys. The God of peace wants your soul to rest satisfied with the living water, the gift that is yours to receive by grace through faith in Jesus. \nMay we become the ones calling, “Sir, give me this water.”\nWritten By Jason Tippetts\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram4.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 3:1-36, Ezekiel 36:25-27, 1 Timothy 2:5-6",
        "devo_title": "For God so Loved",
        "devo_summary": "\n                    \n                    When someone gives me a gift, it makes me stop and ponder the reality that they were thinking of me enough to let their day, emotions, and wallet be interrupted on my account. A thoughtful gift makes me realize that I matter. \nWhen God sent Jesus, it was because sinners—like you and me—matter to Him. Love without action is not real love. True love demands action, and there has been no greater act of love by anyone in the cosmos than God the Father giving His only Son to die for sinners like us. In this gift we see the character and nature of God on display. \nGod is the best gift giver. We hear many promises from lying lips that whisper, “I love you. I will give you everything,” only to then steal from us the attention and worship meant for the One who truly loves us. We must resist the temptation that plagues all men, which is to worship the gifts God gives instead of the Giver Himself. \nThe joy of receiving a gift increases with the quality of the gift. No man, when proposing to the woman he loves, comes to her with a ring pop or a cracker jack prize. He proposes with a ring of value, made with glimmering jewels and precious metals like gold, silver, or platinum. The quality of gift given by God is of infinite and priceless worth because the Son of God is perfect and matchless. Jesus, in His incarnation, has displayed the love of God. Those who place their trust in the One who gives a gift like this will never be put to shame.\nLove is costly. For the joy that was set before Jesus, He endured the cross and was put to shame (Hebrews 12:2). God spared no expense. No, He gave very best. The love of God the Father cost Him temporary separation from His Son so that sinners could eternally be joined to Him. \nFriend, you matter to God. Your pain and circumstances—He cares about them all. He does not just talk about His love for you; He shows you.\nWritten By Jevon Washington\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram3.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 2:1-25, Psalm 104:14-15, 1 Peter 4:11",
        "devo_title": "Glory on Display",
        "devo_summary": "\n                    \n                    I’m thankful for many things about my mother. One of those things is that, despite myriad opportunities, she has resisted the urge to put me on the spot in public and embarrass me. Jesus didn’t have such a luxury. Mary put Him in quite a spot—and at a wedding, no less.\nWeddings in that culture were multiple-day celebrations with much feasting and drinking. For the wine to run out early was a real downer. It would shame the hosts and be terribly embarrassing, so when it happened at this wedding in Cana, Mary declared that her son could fix it. She knew something of His capabilities and that He was no mere man. Jesus gently reprimanded her because His time for this sort of thing had not yet come, the time in which He wanted to reveal His power and glory to people. But He helped nonetheless.\nBy turning water into wine, Jesus did more than save a host from embarrassment or add to the enjoyment of the guests. He revealed, ever so slightly, His power over the natural world. He wasn’t a magician. He was a creator. The Creator. The laws of nature did not apply to Him because He had written them.\nThe chapter takes an interesting turn here. It shifts from joy and celebration and partying and a miracle, to a more serious, intense, even angry tone. Jesus reveals another side of His glory and identity. At the wedding He revealed His generosity, His creative ability, His power over nature, and His desire for people’s joy and happiness. But in the temple He reveals His zeal for holiness and the perfect glory of His Father. \nUpon arriving at the temple during the Passover, a time when Jerusalem was overflowing with pilgrims who had come to worship as the law required, Jesus saw that this holy day of remembrance had been turned into an opportunity for commerce. Merchants lined the temple courtyard, selling animals for sacrifice (likely at a huge markup, as you would find in any tourist trap) and changing currency at a profit. This place was meant to be devoted to God during this celebration of how the Lord rescued His people. But now it was a mercenary’s heaven.\nJesus would have none of it. He drove the sellers out. He declared the temple to be His Father’s house. And, when challenged as to His authority, He prophesied His own death and resurrection by metaphorically calling Himself the temple, the gateway to God’s presence. Jesus declared Himself to be the Son of God, the sacrifice, and the means by which any who believed could enter God’s glory.\nWith subtlety, generosity, and flare, Jesus showed Himself to be Creator of the universe. With passion, fierceness, and strong (though veiled) language, Jesus declared Himself the Son of God. In both cases people were intrigued, though most found an explanation other than the truth. \nYet those with eyes to see and ears to hear believed and followed.  \nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/01/HRT-John-instagram2.jpg"
    },
    {
        "book_title": " John",
        "devo_passages": "John 1:1-50, Genesis 1:1-5, Isaiah 55:10-11, Hebrews 1:1-4",
        "devo_title": "The Word Was God",
        "devo_summary": "\n                    \n                    Imagine for a moment that you have the family of your dreams, the house of your dreams, the car of your dreams, the career of your dreams—the life of your dreams. Everything is perfect. There’s no strife, no stress, and no strain. Things are exactly as they should be, and as you hoped they would be. Now, snap out of that insane daydream.\nImagine that’s all gone. Imagine that, in an instant, you stepped out of that place into the nightmare of a life that’s exactly the opposite. Every day is a struggle. Everything around you has broken, is broken, or is breaking. If you look around, that’s probably a little closer to the reality you face every day.\nJesus did just this—He stepped out of the riches of heaven and into the poverty of earth. We can probably imagine the stark difference in the picture I painted above. But what we can’t imagine is wanting to step out of heaven and into earth. The scenario above sounds like a nightmare. If anything, we’re dying to get from earth to heaven!\nPraise God for Jesus, the Word become flesh. God Himself took on flesh, coming to us on an über-mission trip from heaven to earth. He did so not out of frustration or with hesitancy, but with joy, even as He faced the torture of the cross (Hebrews 12:2).\nThe same Word who spoke the world into existence and set the lights in the sky (Genesis 1) is the same Word that brought His own light into our darkness (John 1:1-14). It’s nearly impossible to wrap our minds around someone wanting to step into our darkness, but that’s exactly what Jesus did. In love, the eternal Son of God, by whom all things were made and through whom all things hold together, took His first breath in Bethlehem and His last in Jerusalem (John 3:16; Colossians 1:15-17).\nAs we reflect on the recent Christmas season, may we not forget the simple but extravagant love of God displayed in the incarnation of His Son. May we never move on from the profound truth that God became a man, living the life we should have lived and dying the death we deserve. The Word became flesh and dwelled among us, dying a gruesome death and rising again to defeat it. Because of this, one day our flesh will rise again so we can dwell with Him forever.\nWritten By Brandon D. Smith \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/12/HRT-John-instagram1.jpg"
    }
]