[
    {
        "book_title": " Luke",
        "devo_passages": "Luke 23:42",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the thief’s confession to Jesus on the cross.\nThen he said, “Jesus, remember me when you come into your kingdom.”\nLuke 23:42\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT_4-LUKE-5.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Isaiah 26:19 ",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nYour dead will live; their bodies will rise.\nAwake and sing, you who dwell in the dust!\nFor you will be covered with the morning dew,\nand the earth will bring out the departed spirits.\nIsaiah 26:19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram34.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 24:1-53, Philippians 2:7-11, 1 John 1:1-3",
        "devo_title": "The Reality of the Risen Jesus",
        "devo_summary": "\n                    \n                    Just when it seemed that their chapter in the great story was coming to a close, Frodo and Samwise are rescued from Mount Doom by the eagles and taken to the safety of Ithilien. Waking up days later in what must have seemed like heaven compared to the vile and jagged landscape of Mordor, Sam says, “Gandalf! I thought you were dead! But then I thought I was dead myself. Is everything sad going to come untrue? What’s happened to the world?”\nI may lose some fantasy-geek credibility with this confession, but I must admit I read The Lord of the Rings only after seeing the films. So, years ago, when I first watched The Return of the King, the third installment in the trilogy, I actually didn’t know if Frodo and Sam were going to make it out of Mordor alive. They could die, I thought. And if they had given their lives to rescue the world from evil, it would have been a picture of the gospel. On Good Friday, Jesus willingly laid down His life to save the world from the curse of sin.\nBut the gospel story doesn’t end in death. On the other side of the cross, there is an empty tomb. As Mary and the other women puzzled about the missing body of Jesus, Luke tells us two angels—men in dazzling clothes—appeared and asked, “Why are you looking for the living among the dead?… He is not here, but he has risen!” (Luke 24:5–6). Of course, these female disciples of Jesus were shocked by this declaration, but the news was even better than they could have imagined: the empty tomb was still only the beginning of the end of the gospel story.\nThe apostle Paul tells us that the garden tomb will not be the only empty one. Jesus is the firstfruits of the resurrection of the dead that will take place at the end of history (1 Corinthians 15:20–23). And in the book of Revelation, John tells us that on that day, “Death will be no more; grief, crying, and pain will be no more, because the previous things have passed away” (21:4). Swords will be turned into plows, wolves and lambs will live together, and the knowledge of the Lord will fill the earth (Isaiah 2:4; 11:6; Habakkuk 2:14). Indeed, all things will be made new (Matthew 19:28; Revelation 21:5). Just as Samwise guessed, everything sad is now coming untrue.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram33.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 23:1-56, Psalm 38:20-21, Acts 4:23-31 ",
        "devo_title": "The Death of Jesus",
        "devo_summary": "\n                    \n                    With the exception of a handful of people, Luke 23 finds Jesus surrounded by some pretty terrible folks. There’s Pilate, the Roman governor with a history of cruelty and a penchant for expediency. There’s Herod Antipas, the tetrarch of Galilee, who had Jesus’s cousin John beheaded to save face with his party guests. There’s also Barabbas, the murderer who’s freed so that Jesus would die. And of course, there are the Jewish leaders who arrested Jesus and brought Him to trial in the first place. To paraphrase Obi-Wan Kenobi of Star Wars, we may never find a more wretched hive of scum and villainy than the one found in this chapter.\nBut in Luke chapter 23, we find these famous words from Jesus: “Father, forgive them, because they do not know what they are doing” (v.34). He’s been falsely accused, spat upon, beaten, tortured, condemned, mocked, and nailed to a cross, yet Jesus uses His hard-fought breath to ask His Father to forgive the people responsible for His pain. Of course, the cross had first been God’s plan (Acts 2:23), and Jesus laid down His life willingly (John 10:18), but none of that cancels out the wickedness on display in these scenes.\nA few verses after Jesus uttered this prayer, we read that one of the criminals being crucified next to Jesus used his waning strength to mock the Son of God. He shouted to Jesus, “Aren’t you the Messiah? Save yourself and us!” (v.39). Oh, the irony. If only this thief had known that it was precisely because Jesus wanted to save people like him that He would not step down from that cross, even though He could have at any time.\nOn the other side of Jesus was another man being crucified for his crimes, but this one struck a different tone. “Jesus, remember me when you come into your kingdom,” he said (v.42). None of the Gospel writers tells us how this thief knew who Jesus was or that He was bringing a kingdom, but however he knew, his encounter with Jesus sparked faith. Jesus replied, “Truly I tell you, today you will be with me in paradise” (v.43).\nOn the surface, this man should have been no different than his counterpart on the far side of Jesus. Both were criminals, rightly convicted for crimes against the state. Both were sentenced to die, with just hours left till their muscles gave out and they suffocated under their own weight. But one taunted Jesus, while the other reached out in faith. The gospel has the power to transform the hearts of even the vilest of sinners. This side of the grave, no one is too far gone to turn, repent, and receive the grace of God.\nThat’s how good Jesus is. He endured everything this world could throw at Him, only to die and make a way of salvation for the very people doing the throwing. In the cosmic scheme of things, there’s not much separating you and me from the two criminals who died next to Jesus. We, too, are guilty. We, too, deserve death. And we, too, must decide what we will do when confronted with Jesus.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram32.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 22:1-71, Deuteronomy 16:1-8, Galatians 1:3-5",
        "devo_title": "The Plot to Kill Jesus",
        "devo_summary": "\n                    \n                    I love to date my wife. Our first date is one I’ll never forget, but it wasn’t nearly as special as the one we had just a couple weeks ago. That’s because when we were first starting out, we didn’t have a shared history to talk about yet. We also didn’t have much of a present life together either. And while most of our relationship was still in the future, we would have freaked each other out on that first date to talk about the kids we might have or the places we might live.\nBut now we have it all: the past, present, and future, and they collide whenever we get to spend time together. We talk about what it was like when we first fell in love. We talk about our wedding, and our first house together. We talk about our kids—what they were like as newborns and that cute thing they did this morning. We talk about our current challenges and what God is teaching us. And we talk about the future: our hopes and dreams, that beat up, old Jeep I’m going to buy someday, and the sewing room Laurin would like to have. On these dates, the past, present, and future come crashing together, and it’s beautiful.\nSomething like this was at work when Jesus sat down with His disciples for the meal we now know as the Last Supper. The meal was a Passover celebration, a time for the people of God to look back and remember how He delivered their ancestors from Egypt and made them into a nation, and how a spotless lamb took the place of every firstborn son of Israel the night the Lord visited Egypt in judgment.\nBut the Last Supper was also a time to think about the future. Before the meal, Jesus told His friends how much He was looking forward to sharing Passover with them. “For I tell you, I will not eat it again until it is fulfilled in the kingdom of God” (Luke 22:16). One day there will be another supper, one to which every Passover meal and Lord’s Supper commemoration look forward: the marriage feast of the Lamb (Revelation 19:9). That meal will be a celebration of God’s ultimate deliverance of His people, from sin and death and this present evil age. It will be the party that puts all other parties to shame, because, at last, Jesus and His bride, the Church, will be together forever.\nLooming over these echoes of the past and nods to the future was a very real and very difficult present. Judas, one of the Twelve, was about to betray Jesus. The disciples would abandon their Master. Jesus would be arrested and put on trial. Peter would deny Him three times. The Son of God would be mocked, spat upon, tortured, and crucified. He would die like the lowest of criminals. With all this weighing on His mind, Jesus looked at His disciples around the table and then “took bread, gave thanks, broke it, gave it to them, and said, ‘This is my body, which is given for you. Do this in remembrance of me’” (Luke 22:19).\nIn that moment, the past, the present, and the future collided. The Passover was always about so much more than an escape from Egypt; it was about the spotless Lamb of God who would be broken to take away the sins of the world. And the marriage feast of the Lamb could never happen if Jesus’s bride were left in her filthy rags. She needed to be cleansed, purified, and dressed in fine linen, “bright and pure” (Revelation 19:8).\nShe is made pure—we are made pure—because Jesus took her sins upon Himself. Thanks be to God for what He has done in the past, for His Spirit’s power at work in the present, and for the future He has secured through the faithful obedience of His Son.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram31.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 21:1-38, 1 Thessalonians 5:2-4, Hebrews 12:25-29",
        "devo_title": "The Coming of the Son of Man",
        "devo_summary": "\n                    \n                    Recently, I’ve been trying to teach my son Jonah to discern the difference between what matters and what doesn’t. For example, there’s no sense getting worked up when his younger brother Jude “steals” his favorite toy truck, because we have lots of trucks (and Jude tends to move on to a new toy every five minutes or so). Or, when we’re working on his reading skills, if he doesn’t know a word, that’s okay; we can sound it out together and keep trying till he figures it out.\nMore importantly, I have also been trying to instill in Jonah the unbreakable fact that no matter what happens in his four-year-old world, his mother and I love him to the moon and back. Nothing he can do has the power to change that. In the long run, that truth matters, while so many others do not.\nThere is a marked difference between what matters for today and what matters for eternity, and one day, the two will be sorted out. Jesus made this point as He and His disciples were observing the temple. As large and beautiful as the complex was, Jesus told His friends, “not one stone will be left on another” (Luke 21:6).\nThis statement got the attention of the disciples, and they asked Jesus when this stone-toppling destruction day would be and what signs would mark its coming. In true prophetic fashion, Jesus’s response is both specific (“Those in Judea must flee to the mountains” [v.21]), and somewhat vague (“When you hear of wars and rebellions, don’t be alarmed” [v.9]). There’s also a sense in which His words apply to the destruction of Jerusalem, which happened in the year AD 70 (see vv.20–24,32 especially), and another sense in which they apply to the end of history as we know it (see vv.25–28,34–36).\nWriting about this discourse and its parallel passages in Matthew and Mark, Bible scholars and theologians have emptied countless fountain pens in their attempts to unpack the myriad opinions on how we should understand Jesus’s words. And while the discussion is a fascinating one, in my opinion the most important principle to be found in this chapter is among the most straightforward of Jesus’s statements: “Heaven and earth will pass away, but my words will never pass away” (v.33).\nWhat matters most—and what will last for eternity—are those things we do in response to the words spoken by God, whether they came from the lips of Jesus or were inspired by the Holy Spirit and recorded for us in Scripture. Jesus said, “Heaven and earth will pass away.” That means we won’t be able to hold onto anything we’ve built for ourselves. However, the author of Hebrews tells us, “we are receiving a kingdom that cannot be shaken” (Hebrews 12:28). Our task until that kingdom comes in its fullness is to be obedient to His Word.\nGod speaks because He loves us. We can trust His Word, no matter what comes.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram30.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 20:1-47, Isaiah 26:19, 1 Peter 1:3-4",
        "devo_title": "The Authority of Jesus Challenged",
        "devo_summary": "\n                    \n                    During presidential election seasons, I love tuning in to watch candidates on the debate stage, especially if it’s a town-hall-style forum with questions from the audience. At rallies and in speeches, would-be presidents can deliver canned remarks and offer vague promises, but in an open forum, the voters are free to ask almost anything. At these events, the novices are easily separated from the seasoned politicians. The professionals know how to turn the answer to a difficult question into a great television moment.\nIn politics, this can be a terrible thing, as style can overtake substance pretty quickly. But the art of answering tough questions well doesn’t need to be an effort in deception. In fact, there has never been anyone better at answering tough questions than Jesus. Whatever trap the Pharisees, Sadducees, Herodians, or scribes tried to set for Him, Jesus avoided the snare and turned their own words against them.\nTake, for example, the scene in Luke 20. Jesus was in Jerusalem, knowing He had come to town to die. His enemies among the religious elite were eager to oblige, looking for a way to turn the crowds against Him or get Him to incriminate Himself. As part of this effort, a group of Sadducees approached Jesus with a ridiculous, almost comical, scenario based on a minor point of the Mosaic Law.\nThe particular law concerned a man who dies without having children. In order for his widow be cared for and his line perpetuated, the dead man’s brother was to marry his wife and produce a child to be the man’s heir (see Deuteronomy 25:5). But in the minds of the Sadducees, this passage poked a gaping hole in the doctrine of the future resurrection. Their question was: If seven brothers, in keeping this law, all married the same woman, whose wife would she be at the resurrection?\nJesus’s response came in two parts. First, He said that marriage is only needed for this age, for in the age to come, people will no longer die, so they won’t need children to keep their legacy alive (v.36). The whole premise of the Sadducees’ question was faulty. Then, Jesus gets to the heart of the matter: the resurrection.\nThe Sadducees had hoped to stump Jesus, so that it might appear to the watching crowds that Jesus was at odds with the universally revered Law of Moses. But Jesus used Moses to show the Pharisees that it was they—and not Him—who were out of step with the Law.\nGenerations after Abraham, Isaac, and Jacob died and were buried, God was still speaking about His friends in the present tense. That’s because they were—and are—alive and present with the Lord, awaiting the final resurrection when they will be forever united with their transformed bodies on a renewed earth. This is our “living hope,” as Peter put it (1 Peter 1:3), and it is secure because Jesus defeated the power of sin and death on the cross.\nAs Jesus illustrated in His answer to the Sadducees’ question, this hope was never a “plan B,” an afterthought from God. It was woven into the story of redemption from the beginning. And with each passing day, this hope we share with Abraham, Isaac, and Jacob draws nearer and nearer. Thanks be to God!\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram29.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 19:10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Luke.\n“For the Son of Man has come to seek and to save the lost.”\nLuke 19:10\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT_4-LUKE-4.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Ezekiel 34:11-12",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n11 “‘For this is what the Lord God says: See, I myself will search for my flock and look for them. 12 As a shepherd looks for his sheep on the day he is among his scattered flock, so I will look for my flock. I will rescue them from all the places where they have been scattered on a day of clouds and total darkness.\nEzekiel 34:11–12\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram27.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 19:1-48, 2 Chronicles 16:9, James 4:13-17",
        "devo_title": "The Triumphal Entry",
        "devo_summary": "\n                    \n                    “Jesus wept” (John 11:35). This is the shortest verse in the Bible, and it occurs in the context of death—the death of an individual named Lazarus, a brother to Mary and Martha, and a friend dear to Jesus. While there have been attempts over the years to read something more into the verse, it’s best to let it mean what it means: Jesus broke down and cried.\nBut there’s another passage in Scripture where Jesus cried. It’s tucked away in Luke 19, as Jesus enters the city of Jerusalem on the back of a borrowed donkey. The whole crowd following Him began to shout, “Blessed is the King who comes in the name of the Lord” (Luke 19:38). But as usual, a number of Pharisees were there and told Jesus to silence His supporters. “He answered, ‘I tell you, if they were to keep silent, the stones would cry out’” (v.40).\nAnd as He inched closer and closer to Jerusalem, Luke tells us that Jesus wept (v.41). Again, it’s best if we understand this literally; Jesus broke down and cried. But this time, His tears were not for a friend, but for a city that God had set apart from all others. And instead of crying over something that had already happened, this time Jesus’s tears flowed for future days when the beautiful city would be crushed by its enemies. Jesus said these enemies would not “leave one stone on another in your midst, because you did not recognize the time when God visited you” (v.44).\nEarlier in the chapter, Zacchaeus went to great lengths to see Jesus, knowing He was more than just another teacher. Now, Jesus sheds tears because Jerusalem did not see Him for who He was, God in the flesh, the Savior of the world, the King of kings and Lord of lords, come to deliver people from their sins. Yes, there were some disciples who knew who He was, and creation itself (the stones) knew too. But most people missed the One whose love drove Him to tears, and in the days to follow, to a cross.\nThe Son of God’s love for sinners is this way. He left the glories of heaven to enter the stage of history, only to die so that those who rejected Him as King might one day turn, repent, and be saved. If there had been no crowds that Sunday when Jesus entered Jerusalem, the rocks would have shouted “Hosanna!” Even so, He would have entered the city all the same, because Jesus’s love for His people is greater than any force that would try to stop Him.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram26.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 18:1-43, Genesis 18:13-15, Jeremiah 32:17",
        "devo_title": "Entering the Kingdom",
        "devo_summary": "\n                    \n                    It’s been a while now since I was knee-deep in parenting little people. Our children are older now, high school and college-aged. But I can still remember the lessons we tried to teach their malleable minds. One of them (and it actually still continues to this day) is summed up in a familiar phrase: “Use your words. What do you want?” As toddlers and young children, they would often point, or cry, or utilize any number of other non-verbal behaviors to communicate to us what they wanted or needed. And while we could sometimes interpret, our goal was to get them to speak their desires clearly, to use their words. The crying and tantrums have since stopped, but in some ways, it’s a lesson we continue to emphasize now that they’re older. Truth be told, it’s still a lesson I’m learning in my fifties.\nLuke 18 tells us that as Jesus made His way toward Jericho, He told parables. He also met an interesting cast of characters, one being a blind man. It wasn’t the first blind man Jesus had come across, but this man’s story is rather illuminating. There’s a lesson to be learned.\nAfter hearing that Jesus the Nazarene was passing by, the blind man—named Bartimaeus according to the parallel account in Mark’s Gospel (see Mark 10:46)—began crying out for mercy. Much to the frustration of those around him, Bartimaeus persisted, not unlike a child who desperately wants something. The people tried to shush him, but he was having none of that. He kept on crying out.\nJesus heard the ruckus and commanded the man be brought to Him. Everyone reads Scripture’s tone just a little differently, but I read this interaction as that of a loving father to a son, essentially saying, “Use your words. What do you want?” To which the man answered, “‘Lord… I want to see’” (Luke 18:41).\nFunny, isn’t it? Wasn’t it obvious what Bartimaeus wanted? Jesus could clearly see the situation for what it was. But He also knew that to give this man his sight back was also to give him a world of new responsibilities. No longer could Bartimaeus beg to get by. He’d have to work. A blind man is no one’s apprentice, and therefore has no skills. A blind man owns no property, no land to till. In the ancient world, a blind man got by on the compassion of others. Jesus wanted to know: “Is being made whole what you really want? Use your words.” Gracious as Jesus is, He gave this man a choice.\nIt’s a lesson we continue to learn over the course of our lives. The consistently loving voice of our Father saying, “Use your words. Tell me what you want.”\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram25.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 17:1-37, Deuteronomy 10:12-13, Hebrews 3:7-11",
        "devo_title": "Faith and Duty",
        "devo_summary": "\n                    \n                    It’s cool to be grateful. At least that’s one way to put it. Everyone from celebrities to professional athletes to cultural gurus are praising the benefits of being thankful. Gratitude is showing up these days in long-form essays, evening news reports, popular podcasts, and conferences as a positive factor for everything from the quality of our hearts to the clarity of our minds to getting a good night’s sleep.\nThe medical and psychological community has been studying gratitude and its effects for well over a decade now. Studies have shown that gratitude can improve blood-vessel function, lower the risk of heart failure, take the edge off chronic pain, and lessen the effects of depression. The emphasis there is on the word can. As usual, there are always other factors involved (environment, heredity, physical activity), and so it’s difficult to prove conclusively the positive side effects of gratitude. But there are definitely enough testimonies to help us think it’s cool to be grateful.\nOne specific area researchers are now studying is the significance of our gratitude’s focus. In other words, the importance of who or what we are thanking.\nAs Jesus made His way to Jerusalem, He encountered ten lepers. Their cry was common to Jesus’s ears: “Jesus, Master, have mercy on us” (Luke 17:13). Jesus did, and as they went on their way, they were healed. One out of the ten turned back to focus on the target of his gratitude: Jesus, the Master. Luke tells us this Samaritan man, a foreigner, “fell facedown at his feet, thanking him.” Jesus told him, “Get up and go on your way. Your faith has saved you” (vv.16,19).\nDid the Samaritan experience physical healing from his leprosy? Scripture says he did. From that moment on, did he also experience improved blood circulation, more meaningful personal relationships, and a better night’s sleep? Well, Scripture doesn’t say. But what Jesus does tell us is that the Samaritan received salvation, possibly the greatest health benefit one could hope or ask for in this life.\nWhy didn’t the other nine men go back and thank Jesus? We don’t know. We only know they didn’t. But one, a Samaritan, turned back and said, “Thank you.” His gratitude earned him a place in the biblical record, and we’re still talking about him to this day. Whether or not it’s cool to be grateful shouldn’t really be our focus, for what’s cool changes with the weather. What we know for certain is that it’s good to be grateful, very good indeed.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram24.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 16:1-31, Proverbs 15:16, 1 Corinthians 4:7-13 ",
        "devo_title": "Kingdom Values",
        "devo_summary": "\n                    \n                    Question: What metrics are you using to measure your quality of life? Most of us have some pictures of success we measure ourselves against. And unless you’ve been living under the proverbial rock or off the literal grid, at least one of those pictures probably looks like money. Sure, there are obviously other metrics, such as health, the presence of family and friends, and job satisfaction, but it seems none of us can shake the one known as wealth. We look around at those who seem to have it together financially and conclude they’ve got it made.\nThere’s nothing new under the sun, including this particular notion. This approach to life has been around about as long as this world has, and it’s not going away anytime soon. Wealth is a common measuring stick for the kingdoms of this world. However, that is not so in the kingdom of God.\nJesus tells two parables in Luke 16, both beginning with a common line: “There was a rich man…” (vv.1,19). But the two parables take different tracks from there. The first appears to praise a shrewd steward who uses money to gain favor, though it’s not the man’s questionable ethics Jesus wants us to emulate; it’s his attitude toward money. The man in the parable sees wealth as a means to an end. He uses it to secure his future. In the same way, you and I are to use everything at our disposal with an eye to our future—eternity with the Lord. In telling this parable, Jesus raises a caution: “So if you have not been faithful with worldly wealth, who will trust you with what is genuine?” (Luke 16:11). True riches. Genuine wealth. The kind that ultimately matters.\nThe second parable presents a radical reversal of the way things are: it’s the poor and forgotten who end up with a place at the table in God’s kingdom. The rich, who enjoyed luxury in this world (wearing purple and fine linen, and living in splendor every day), are left out in the world to come. They used money to benefit themselves instead of using it to serve God.\nAlthough Jesus’s parables initially diverge somewhat, they both arrive back at the same conclusion: “You cannot serve both God and money.” His point is that money is not necessarily a bad thing, but we must remember where our hope lies. Jesus said, “No one can serve two masters, since either he will hate one and love the other, or he will be devoted to one and despise the other. ” (Matthew 6:24).\nIt is interesting to note who was listening to Jesus tell these parables on that day. Luke tells us it was the Pharisees, who were “lovers of money” (Luke 16:14), men who believed they could pledge their allegiance to both money and God.\nTrue riches. Genuine wealth. The kind that ultimately matters and is really the only metric for our lives is trust in the King of the coming kingdom. That’s how we have it made.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram23.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 15:1-32, Ezekiel 34:11–12, Romans 3:10-20 ",
        "devo_title": "Lost and Found",
        "devo_summary": "\n                    \n                    The riff-raff. What comes to mind when you hear that phrase? True, you don’t hear it that often these days. It’s somewhat old-fashioned. However, chances are good you’ve got an idea what it means. You might even hear a particular voice in your head when you read it. I know I do.\nThe voice comes from a character in a certain black-and-white movie that plays every December, often multiple times throughout the season: It’s A Wonderful Life. He’s Mr. Potter, the bitter, old banker and the foil for the younger, idealistic George Bailey played by Jimmy Stewart. After George comes up short in a bank deposit, Mr. Potter tells him in quite the self-righteous voice, “Why don’t you go to the riff-raff you love so much and ask them to let you have $8,000?” The riff-raff, the lower classes, those of questionable reputation, the good-for-nothings. Or to use another word, sinners.\nAnd the Pharisees and scribes were complaining, \n“This man welcomes sinners and eats with them” (Luke 15:2).\nLuke 15 is usually recognized as the chapter that includes Jesus’s parable of the prodigal son. In actuality, that is just one of three parables in the chapter, each having to do with someone or something lost—a sheep, a coin, and a son. The lost sheep and lost coin are fairly neutral examples, but that last parable gets specific for those listening. The younger son who took his inheritance and ran off to spend it foolishly in a distant land is clearly the one who is lost. He is a prime example of the riff-raff, a sinner.\nBut the genius of Jesus comes into play as He introduces a third character in that familiar parable: the older brother, the brother who had done everything right, the one who always played by all the rules. That description in many ways fits the Pharisees and scribes listening to Jesus. They would never have considered themselves a part of the riff-raff they so despised, sinners like those Jesus welcomed and ate with. But Jesus’s parable reveals both brothers were lost. The younger knew his lostness, while the older did not. His self-righteousness left him blind to his own need of rescue. That same self-righteousness blinded the Pharisees and scribes. They were lost and didn’t know it.\nJesus’s parable tells us we’re all riff-raff, every one of us. Make no mistake—God loves us and is running toward us to wrap us in his love and forgiveness. But we’re all sinners who have fallen short of his glory. Any righteousness (right-ness) we have doesn’t come from us, but from our Lord and Savior, Jesus Christ.\nStaying lost in self-righteousness leads to bitterness, but recognizing our lostness is an important step to being found and welcomed home.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram22.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 12:32",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse about the relationship between God and believers.\n“Don’t be afraid, little flock, because your Father delights to give you the kingdom.” \nLuke 12:32\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT_4-LUKE-3.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Romans 10:14-17",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n14 How, then, can they call on him they have not believed in? And how can they believe without hearing about him? And how can they hear without a preacher? 15 And how can they preach unless they are sent? As it is written: How beautiful are the feet of those who bring good news. 16 But not all obeyed the gospel. For Isaiah says, Lord, who has believed our message? 17 So faith comes from what is heard, and what is heard comes through the message about Christ.\nRomans 10:14–17\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram20.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 14:1-35, Proverbs 25:6-7, Romans 12:16",
        "devo_title": "Teachings on Humility",
        "devo_summary": "\n                    \n                    For many years, I drove past a massive, half-finished resort and hotel on my way to work. Situated in a nice, up-and-coming part of town, this structure was always a bit of a mystery to me. I wondered, How did they start this thing, get so far, and then just leave it here?\nAs it stood, it was more than a bit of an eyesore, a noticeable mar on an otherwise beautiful skyline. Even though it had great potential and was located in a great spot, it was left vacant, dilapidated, and unused. I heard that the developer and builder had dramatically underestimated the financial burden and had been forced to abandon the project during a tough economic season. They had failed to properly weigh the cost.\nLuke 14:27 is a sobering challenge from Jesus to correctly weigh the cost of following Him. Like the builders who abandoned that building before they’d finished, those who set out to follow Jesus without really understanding the all-encompassing nature of their commitment are in trouble.\nThe teachings of Jesus in Luke 14:25–33 can sound a bit gruff or perhaps even harsh. However, they served as a compassionate wake-up call to some of His followers, those anticipating a cushy role in Jesus’s kingdom. It was the common expectation of many first-century Jews that the Messiah would overthrow Rome and restore the self-rule and peace of Israel, bringing prosperity and comfort back to the land. For someone in the crowds with that expectation, the idea of dying to self would’ve made little sense.\nWe don’t have the same messianic expectations of Jesus that His first listeners did, but we sometimes expect that following Jesus will open doors to comfort, prosperity, and easy living. While following Jesus is certainly the most purposeful pursuit, and while there are certainly seasons of joy and celebration along the way, we need to be prepared to daily hoist our own crosses.\nMy prayer today is that the Spirit of God would give us the wisdom to accurately assess the cost of following Jesus, and then that we would wholeheartedly commit to the journey before us, regardless of personal sacrifice. Let us have the foresight to finish the building God has called us to build, not for our glory, but for the sake of His kingdom and life the of world to come.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram19.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 13:1-35, Deuteronomy 32:10-14, Psalm 137:1-9",
        "devo_title": "The Narrow Way",
        "devo_summary": "\n                    \n                    If your elementary school experience was anything like mine, moving about anywhere in the school meant forming a long line. In reality there were probably only twenty to thirty students in that line, but at seven years old, the back of that line felt miles away from your destination—especially if that destination was recess. Oh, the coveted position of “line leader.” Whether chosen for this spot based on some merit or because you happened to be the first to rush to the door, it was the position to have.\nYou might think we grow out of this way of thinking, but have you ever seen people line up to board a plane? How about for a sporting event or a concert, or even worse, a Black Friday sale? As Ricky Bobby’s father famously quipped, “If you ain’t first, you’re last!” I would humbly suggest that the desire to be first, to be at the front, to be at the top, really never goes away. Sure, it looks differently today than it did in grade school, but it can still be a driving force in our lives.\nLuke 13:30 is perhaps one of the most famous teachings of Jesus: “Note this: Some who are last will be first, and some who are first will be last.” Most people are aware of it in some form or another, even if they’re not active readers of Scripture. It’s one of those sticky, memorable sayings.\nBut our key verse for today is more than a nice slogan for a bumper sticker. You see, Luke 13 is all about the kingdom of God. Each of Jesus’s teachings, interactions, and healings in this chapter tells us something unique about what the kingdom is like.\nJesus isn’t merely teaching us to be nice to one another. He’s revealing a key component of the kingdom; elbowing for a prime spot at the table won’t get you where you think it will. This teaching of Jesus was designed to challenge the expectations of His hearers, and it should have the same effect on us today.\nWe live in a day and age that loves a good underdog story: Rudy, Rocky, the Karate Kid, etc. Not so in the honor-and-shame-driven world of the ancient world. Honor for leaders came from being at the front of the line and staying there. Jesus flips this way of thinking on its head. Instead of reinforcing a front-of-the-line approach to the kingdom, He suggests that the humility and charity of the “line-lagger” would actually generate more influence and eternal impact. The kingdom is built on humility and selflessness, knowing that God is the one to lift people up.\nEven if you’ve given yourself over to a life of following Jesus, the temptation will be to jockey for power, measure yourself against your neighbor, and race to the front of the line. Jesus’s teaching for today encourages you to work hard and intentionally, but also to work humbly and charitably. My friends, this is tough, but let’s link arms in prayer and in encouragement as we embark on a journey to the back of the line.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram18.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 12:1-59, 1 Kings 10:4-10, Psalm 88:1-7",
        "devo_title": "Acknowledging Christ",
        "devo_summary": "\n                    \n                    Corrie Ten Boom was a courageous Dutch Christian who harbored Jews in her home to hide them from the Nazis during World War II. She was eventually caught and sent to a concentration camp. Perhaps you’ve read some of her story in her most well-known book, The Hiding Place.\nIf anyone had cause to suffer recurring worry and fear, it was Corrie. Before her arrest, every moment of every day was precarious. Would her neighbors figure out what was going on? Would they rat her out to the authorities? Would the police show up at her door? What if she couldn’t get enough food to care for everyone in her home? After her capture, her world was wrought with pain and suffering. She was left wondering if each day might be her last. Would she be further tortured? Would she be executed? What special horrors awaited her tomorrow?\nWhat’s amazing, though, is that while she endured some incredibly difficult days, she held onto hope and trusted in God’s provision. On worry and fear, she famously said: “Worry does not empty tomorrow of its sorrow. It empties today of its strength.”\nFor most of us, our current level of stress is nowhere near what Corrie’s should have been. But, if I’m honest, I must admit there have been times in my life when I’ve been so consumed by my preparations for tomorrow that I’ve completely missed the joy of today. I’m willing to wager I’m not alone in that.\nWhat’s interesting about Luke 12 is that Jesus’s audience was facing many of the same issues we face today: civil and social unrest, economic uncertainty, extreme political divisiveness, and the whole gamut of personal traumas and tragedies. Jewish life under Roman rule was incredibly difficult and could be unpredictable. Still, Jesus invited His hearers to “consider the ravens” and “consider the wildflowers”(vv.24,27)—to trust God with the future.\nPerhaps we should consider taking Jesus up on His invitation today. No matter how disorienting our world might be, let us seek first the kingdom of God, not because all our problems will magically disappear, but because we have every reason to trust God. The burden of trying to control tomorrow is too great to bear, and any sense of real control over the future is an illusion. Let’s release that false sense of control to the Lord today, and regardless of our circumstances, let’s embrace peace that is beyond all understanding (Philippians 4:7).\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram17.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 11:1-54, Isaiah 55:6-7, Romans 8:14-17",
        "devo_title": "True Blessedness",
        "devo_summary": "\n                    \n                    “Easier said than done.” It’s a common enough expression these days, perhaps one that you’ve found yourself mumbling a few times as recently as just this week, whether at you’re at home, at work, or even at your gym. Regardless of the location, we’re all familiar with the sentiment; giving lip service to something is always easier than actually giving it life service.\nWhen reading Luke chapter 11, I’ve always found Jesus’s response to the woman in the crowd a bit curious. She gives a shout-out to His mother, Mary, and in turn, Jesus seems to give her a hard time. Instead of offering agreement, Jesus seems to toss out a bit of a zinger: “Do you even know how to follow the Word of God?” (v.28, my paraphrase).\nHonestly, I began to think that Jesus’s response was bit of a non-sequitur. The woman points out something over here, and He speaks to something over there—almost as if He’s speaking an aside, talking beyond their encounter. But Jesus was not ignoring the woman or teaching above her understanding. Rather, He was using her declaration as a teachable moment, giving the perfectly tailored, most loving response to her statement. She declares, “Blessed is the womb that bore you,” and essentially, He counters with, “Blessing doesn’t come from being my mom. Instead, it comes from following the Word of God” (again, my paraphrase).\nIn other words, yes, Mary preformed a special role as the mother of Jesus. But we, too, can all walk in blessed intimacy and relationship with God because of the life, death, and resurrection of Jesus. He invites and enables us to not only be hearers of the Word, but doers (James 1:22).\nCertainly, there is an emphasis on faithfulness in the doing. If God has placed something on your heart, and the Scriptures confirm it, make sure you do it! But there is also an emphasis on the blessedness; it is possible for each of us to experience a blessed life in God this side of eternity.\nThe Word of God is easier read than done. But our job is to commit ourselves wholeheartedly to the doing, as an outpouring of our belief and trust in Jesus Christ. If you’ve come to trust and know Him, your eternity lies in His hands, but He still invites you to participate in His blessing now. Relationship with Jesus does not guarantee a safe, easy life—quite the opposite, really (John 16:33)—but it does mean that we get to participate in the kingdom as it invades this world here and now.\nHopefully, Jesus’ declaration feels like more of an invitation to you than an obligation. If the Word requires something of you that you’re not doing, pray for the courage to do it! If the Word requires you to leave something behind, pray for the perseverance to leave it! That is the intersection of obedience and blessing.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram16.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 10:1-42, Psalm 16:1-11, Romans 10:14-17",
        "devo_title": "The Son Reveals the Father",
        "devo_summary": "\n                    \n                    Imagine the busiest intersection you pass through each day on your morning commute. Now, imagine one day you show up at about 7:30 a.m., park your car on the side of road, and start directing traffic—though, the traffic light is in perfect working order, mind you. With no prior training or experience, you just walk out into the middle of the road and begin pointing and waving and motioning like crazy.\nIt wouldn’t take long for drivers to begin to realize that you have no idea what you are doing. Who does this guy think he is? Though your impact on traffic patterns and the safety of countless individuals would be immediate, without any real authority, the chances of you affecting any positive influence are approximately zero.\nThe situation would have an entirely different outcome if you were to roll in during rush hour to find the traffic light down, but a trained officer there to carefully and meticulously bring order to an otherwise dangerously chaotic situation. In that situation, you and everyone else on the road would be thankful for their expertise.\nJesus’s teachings in Luke 10 would’ve presented a series of radical paradigm shifts for His initial listeners. Between commissioning the seventy-two, describing unrepentant cities, and offering up a shocking definition of the term “neighbor” in His parable of the good Samaritan— Jesus was really rocking the boat big time.\nI imagine some of His Jewish listeners were left wondering, Who does this guy think He is? How dare He diminish our cities in comparison to the unrighteous and licentious Gentile cities! How dare He diminish the Levites and priests in favor of a foreign and unclean Samaritan!\nAt first glance, Jesus’s declaration of oneness with the Father in verses 21–24 might come across as informative, sure, but perhaps unrelated to what comes before and what follows after. But this passage’s placement could not be more intentional.\nUnlike you or I trying to direct traffic with no authority, no training, and no positive impact, Jesus enters the intersection of human history to bring order to the chaos. When He says, “All things have been entrusted to me by my Father” (v.21), He’s not just making a profound theological statement; He’s declaring His authority.\nJesus rejoiced in the Holy Spirit and shared openly about His unique relationship with the Father as a statement of divinity and invitation. He was quick to unequivocally answer the question, Who does this guy think he is? He’s the Son of God, and no one can know the Father except through His Son.\nIt may not be hard for us to accept some of the difficult teachings of Jesus in Luke 10. That’s largely because we don’t have the same social or cultural background as His initial audience. These days, those instructions can be challenging to enact, but we don’t typically reject them at face value.\nThat said, I’d be willing to wager that the teachings of Jesus challenge each of us in other ways. We might not be prone to wonder, Who does this guy think he is? Rather, perhaps we’re quick to assume some of His teachings no longer apply to us these days. My prayer for each of us in those moments is that we’d remember Jesus is directing traffic for a reason. If we want to know the Father, we have to put our lives under Jesus’s loving course correction.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/01/HRT-LUKE-instagram15.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 8:25",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse captures the disciples’ response to Jesus when He calmed the storm.\nThey were fearful and amazed, asking one another, “Who then is this? He commands even the winds and the waves, and they obey him!”\n– Luke 8:25b\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT_4-LUKE-2.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Psalm 107:28–32",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n28 Then they cried out to the LORD in their trouble,\nand he brought them out of their distress.\n29 He stilled the storm to a whisper,\nand the waves of the sea[a] were hushed.\n30 They rejoiced when the waves[b] grew quiet.\nThen he guided them to the harbor they longed for.\n31 Let them give thanks to the LORD\nfor his faithful love\nand his wondrous works for all humanity.\n32 Let them exalt him in the assembly of the people\nand praise him in the council of the elders.\nPsalm 107:28–32\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram13.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 9:28-62, Exodus 34:29-35, 2 Corinthians 3:18",
        "devo_title": "In His Name",
        "devo_summary": "\n                    \n                    Once an acquaintance of mine described how he viewed going to church throughout the week and the role it played in his Christian life. Throughout the discussion, he talked about how various worship services, camps, small groups, and prayer meetings provided “jolts,” “pick-me-ups,” and “shots in the arm” for him. His basic view of the Christian life, and one that many Christians share, is that of traveling from mountain top to mountain top, constantly in search of the next exhilarating spiritual experience to keep him going.\nFor those of us reared in evangelical youth groups and college ministries, we are familiar with this exhausting rollercoaster of soaring heights and crushing lows. Thankfully, today’s readings point us to a better and more realistic way of growing and living in Christ.\nThe Gospels of Matthew, Mark, and Luke all follow Peter’s confession of Jesus as the Messiah with the transfiguration. In this famous episode, Jesus took Peter, James, and John with Him up to the top of a mountain. Then, He shone brilliant white before them. Moses and Elijah, the two great Old Testament prophets, appeared, and the disciples heard the Father say, “This is my Son, the Chosen One, listen to him!” (Luke 9:35). If there was any doubt left for these men about Jesus’s identity, this surely cleared up the confusion.\nJesus’s face shone brightly, and Peter, James, and John saw its brilliance without any covering, filter, or shade. They beheld Him as He truly was. Contrast this with the experience of the Israelites. Moses’s face would shine so brightly whenever He met with the Lord that he found it necessary to wear a veil for the sake of the people. The brightness was just too much for them (Exodus 34:33–34).\nIn 2 Corinthians chapter 3, Paul wrote, “We all with unveiled faces, are looking as in a mirror at the glory of the Lord and are being transformed into the same image from glory to glory; this is from the Lord who is the Spirit” (v.18). We, like Jesus, and like Moses before Him, have met with the Lord. As a result, we shine brightly with unveiled faces. Our hearts are new, and now we behold Christ in all His glory. We see Him in both His majestic power and His unparalleled compassion. And as we behold who Christ is, marveling at His greatness, God works in us to transform us, little by little, into the image of glory that belongs to Christ.\nThis process does not often take place in giant leaps and bounds, but incrementally. Little by little, as we repent of sin, hear God’s words, and obey them, the Spirit trims off the rough edges of our old lives and shapes us into molds of Christ’s character. We don’t need another mountaintop, because we get to experience the glory of Christ every day through the presence of His Spirit within us, making us more like Him. Thanks be to God.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram12.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 9:1-27, Acts 13:44-52, Romans 10:1-15",
        "devo_title": "Take Up Your Cross",
        "devo_summary": "\n                    \n                    From time to time, a current event will reignite a cultural debate about the ethics of missionary activity. Many argue that any attempt to convince a person to change their religion constitutes the most egregious of social errors. They find it to be cruel, condescending, and arrogant. However, Christians usually have a simple response to these criticisms: Every person needs to hear about Jesus.\nIn Luke chapter 9, there is a key turning point in Jesus’s ministry (vv.18–20). After feeding the five thousand, Jesus asked His disciples what the crowds were saying about Him. The disciples responded by cycling through some of the more popular answers regarding His identity. This wasn’t hard for them to do, as rumors were no doubt circling among the crowds.\nThen Jesus did something remarkable; He turned the casual conversation about what the crowds were saying into one that was intensely personal. “‘But you,’ he asked them, ‘who do you say that I am?’” Jesus took the conversation to an uncomfortable and awkward place, but it led to an important moment. “Peter answered, ‘God’s Messiah’” (v.20).\nUltimately, every person must wrestle with the same question Jesus asked His disciples. The gospel makes a universal demand: to be saved, we must believe. Yet, it also makes a universally gracious offer: any person, regardless of background, race, gender, or socio-economic status, may be saved.\nIn Romans 10, Paul reminded the Roman church of the simplicity of the gospel; a person has only to believe (v.9). We do not have to untangle difficult creedal formulas or perform a series of progressively more difficult good works. Rather, God saves through simple faith in His Son, Jesus Christ. “Everyone who calls on the name of the Lord will be saved” (Acts 2:21).\nEvery person who believes in Jesus has the incredible privilege of knowing Him, of taking up the daily cross, of following Him into kingdom work God has established for us to do. We join in the task of ensuring that everyone has heard the message of the gospel. Jesus sends some around the world to share this message. He sends countless others into their neighborhoods, ball fields, gyms, schools, and grocery stores to love, befriend, serve, and share in Jesus’s name.\nToday, let us join in this mission by praying that God would give us opportunities to share the good news. Let us live our lives with gospel intentionality, looking for ways to speak about the graciousness of our God and the gift of His Son.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram11.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 8:1-56, Psalm 107:28-32, Acts 28:25-28",
        "devo_title": "Parables and Miracles",
        "devo_summary": "\n                    \n                    This past Sunday I heard a sermon that was based on a text, one I myself had read many times before and had even preached on once. During the sermon, my pastor said nothing all that new to me, but throughout the sermon, I kept thinking, I needed to be reminded of that. For some of us, it may be rare to hear something truly new in a sermon or a Bible study, but we still need frequent reminders of what we already know because we are prone to forget.\nYou don’t have to read biblical history long to realize that God’s people were forgetful. They often forgot about His provision, His promises, and His power. Think of the Israelites during their wilderness wanderings. They grumbled about not having enough food or water not long after He had delivered them from Egypt and led them across the Red Sea on dry land. How could they think the Father would bring them out of bondage only to abandon them in the desert?\nJesus’s disciples evidenced this same forgetfulness in Luke 8. On a boat trip across the Sea of Galilee, a great storm came upon their small ship. Several experienced fishermen were aboard; the fact they, with all their experience, were fearful, proves the powerful nature of the storm. Despite the storm, Jesus was asleep in the boat. The disciples rushed to wake Him, telling Him they were going to die.\nThink about the miracles the disciples had witnessed in the previous chapter. Jesus healed the centurion’s servant, not by placing His hands on the man but by speaking a word from miles away. In the next narrative, Jesus raised a widow’s son from death. So with those miracles in their very recent memories, why would the disciples think a storm was beyond Jesus’s control?\nIt’s easy for those of us who know the end of the story to find fault with the disciples’ fear. When you know how the exodus ends, it’s easy to shake our heads in disbelief at whiny Israelites. However, at some point, we need to stop, think, and realize we are just like those Israelites and Jesus’s disciples. We complain when God doesn’t run the world according to our dictates, and we shake in fear with uncertainty about the future. The Israelites complained with hunger after the Red Sea parting, and the disciples were filled with terror over a storm even though they’d witnessed miracle after miracle—but really, we are no different. We grumble and shake after knowing Jesus died and rose again.\nJesus could just as easily ask us the same question He asked of His disciples: “Where is your faith?” (Luke 8:25). When tempted to grouse about our circumstances or fear for the future, our first responsibility is to remember what we already know. We must look to the cross of the Lord Jesus and His resurrection from the dead. We must look to what we know of biblical history. There we will find God working for the good of His people. Having remembered who He is and what He has done, we can take heart and face the future with forward-looking joy.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram10.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 7:1-50, 1 Kings 17:17-24, Psalm 23:1-6",
        "devo_title": "Much Forgiveness, Much Love",
        "devo_summary": "\n                    \n                    In 1901, President Theodore Roosevelt had a meeting scheduled with the well-known African-American academic, Booker T. Washington. On a whim, Roosevelt decided to make the meeting a dinner and quickly rushed an invitation over to Washington. Washington accepted, and the two men dined at the White House. When news of the dinner became public, a furor erupted. Many in southern America fumed at the news of the president inviting a black man to dine at his table. One news editor even quipped that by issuing the invitation, President Roosevelt insinuated that black men were equal to white men.\nWhen you welcome a person to your table, you invite them into the life of your family. It is an invitation to relationship. Meals in Jesus’s day were intimate affairs. People often reclined at the table, resting on one arm while eating with the other. In Luke 7, we read about a meal Jesus and His disciples had with Simon the Pharisee. While they were gathered together at Simon’s house, a woman with a notorious reputation came in and made a beeline for Jesus. Would He welcome her or would He do what any self-respecting man in His day would have done and send her back out of the door?\nHer appearance caused quite a scene, not only because of her reputation, but also because of her actions. She brought an alabaster jar of perfume with her, which she used to anoint Jesus’s feet. Then she kissed those feet and wiped them with her hair. Her actions were extraordinary acts of worship and hospitality. Jesus’s host offered Him none of the customary acts of hospitality, yet this woman, out of her great love for Jesus, offered them to Him at great expense and without regard to the awkward scene it created.\nJesus explained her actions and those of the Pharisee. She had been forgiven much, so she loved much. He had been forgiven little, so he loved little. Then Jesus looked at the woman and told her, “Your sins are forgiven” (Luke 7:48). Jesus’s boldness caused His dinner companions to wonder, “Who is this man who even forgives sins?” (v.49).\nWith four little words, Jesus taught His dinner companions an important truth about Himself; He has the power to forgive sins. In one simple statement, Jesus affirmed His divinity, but also offered good news: forgiveness is available for even the “worst” of sinners. No matter how far we’ve stumbled. No matter how far we’ve wandered from the Father’s heart, forgiveness is available through Jesus.\nForgiveness breeds change. It beckons us to treat people the same way we have been treated by the Father because of the gospel. We forgive the wrongs we experience at the hands of others, because we know the joy of being freely forgiven. Since we know what it is to be welcomed into the family of God, we spread a table, warmly welcoming others into our lives that they might know life in the Father’s family too.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram9b.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 6:1-49, 1 Samuel 21:1-6, James 2:1-7",
        "devo_title": "Lord of the Sabbath",
        "devo_summary": "\n                    \n                    “These people approach me with their speeches \nto honor me with lip-service—\nyet their hearts are far from me, \nand human rules direct their worship of me.”\n– Isaiah 29:13\nWhen the Lord spoke these words through the prophet Isaiah, He was not confronting a new problem or speaking about a phenomena that would magically disappear when Jesus came into the world. As a species plagued with sin and living in a fallen world, human beings tend to value the form of religion rather than the heart behind it.\nJesus came face to face with this tendency from the early days of His ministry. He challenged it, and in doing, so inflamed some of His opponents who wanted to put Him to death. In one incident, recorded in Luke 6, the Pharisees criticized Jesus because His disciples were picking heads of grain to eat on the Sabbath (vv.1–5). In the same chapter, but on another Sabbath, the Pharisees became “filled with rage” because Jesus healed a man with a withered hand (vv.6–11).\nIn the controversy over the heads of grain, Jesus pointed the Pharisees to the actions of David in 1 Samuel chapter 21. While on the run from Saul, David went into the house of God where he and his men ate the consecrated bread. David’s actions showed that human need trumps strangling legalism. If David’s men could eat the consecrated bread on the Sabbath, then how much more could the Son of David’s disciples fill their bellies with unconsecrated heads of grain on the Sabbath?\nJesus made another startling claim in this discussion about the Sabbath, saying that He, the Son of Man, is “Lord of the Sabbath” (v.5). Think about this statement for a second. In Genesis 2, we read that God created the seventh day as a day of rest, the Sabbath day (v.2). In claiming to be “Lord of the Sabbath,” Jesus announced to His enemies that, at the very least, He had authority over that which the Father created and ordained.\nJesus further exposed the Pharisees’ glaring hypocrisy when He healed a`man with a withered hand on the Sabbath. Instead of rejoicing that this poor man had regained the use of his hand, the Pharisees became filled with righteous fury. Then, in their indignation over Jesus’s supposed violation of the fourth commandment, they began plotting in their hearts to break the sixth (Luke 6:6–11).\nLest we think we are wholly unlike the Pharisees, James, the brother of our Lord, painted a picture in his letter that could be a scene in one of our own churches (see James 2:1–4). Whenever we discount the poor and the vulnerable while celebrating the rich, the powerful, and the well-connected, we are honoring the Father with our lips while our hearts are far from Him.\nThe Lord of the Sabbath showed unparalleled compassion in each of His Sabbath healings. Shouldn’t those of us who gather in His name welcome the weak, the powerless, the broken, and the poor in His name? He is present through the Holy Spirit, who enters into the hearts of His people, and He is present with us when we gather together. Since we are His, we ought to welcome those He would welcome.\nWritten by Scott Slayton\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram8b.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 1:46-47",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize part of Mary’s song of praise in expectation of giving birth to Jesus.\nMy soul praises the greatness of the Lord,\nand my spirit rejoices in God my Savior…\nLuke 1:46–47\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT_4-LUKE-1.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Psalm 91:2–4",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nI will say concerning the Lord, who is my refuge and my fortress,\nmy God in whom I trust:\nHe himself will rescue you from the bird trap,\nfrom the destructive plague.\nHe will cover you with his feathers;\nyou will take refuge under his wings.\nHis faithfulness will be a protective shield.\n—Psalm 91:2–4\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram6.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 5:1-39, Isaiah 58:6-12, Joel 2:12-17",
        "devo_title": "The First Disciples",
        "devo_summary": "\n                    \n                    There was a time when Jesus was famous. Rock-star famous. Everyone wanted a piece of Him, but few truly knew Him.\nIn the early stretch of Jesus’s earthly ministry, He couldn’t walk into the towns around Galilee without crowds gathering and pressing in around Him (Luke 5:15). They wanted to hear Him teach. They wanted to touch Him. They wanted to see Him perform miracles, maybe even one for them. It was everyone too—men and women, young and old, religious leaders, government officials, tax collectors, and sinners.\nLuke chapters 5 through 9 focus on this period of time when Jesus was famous. After this He became persona non grata among the religious establishment. But chapters 5 through 9 cover the days of the Sermon on the Mount, the feeding of the 5,000, and fascinating little vignettes like the one we find in today’s reading about a paralytic who was lowered down through a roof by his friends in the hope that Jesus might heal him.\nThese men really did believe Jesus could heal their paralyzed friend, though it is likely they had limited insight into who Jesus truly was. His fame had reached them. They’d heard stories of His supernatural abilities. But they couldn’t have known they were seeking the Son of God.\nIn our culture today, we often treat Jesus in this way. We focus on what He might be able to do for us without considering who He is to us. For the paralytic’s friends, Jesus saw their act of determination as a genuine expression of faith. He healed the man and commended their faith, even forgiving the man’s sins (Luke 5:20). They had so little to go on, and yet they acted.\nI always wonder what came of people like this—people who went to Jesus with a measure of faith and then saw Him command the laws of nature: blind Bartimaeus (Mark 10:46); the woman with the issue of blood (Luke 8); the paralytic by the pool of Bethesda (John 5). I wonder how many of these people who came to Jesus with embryonic faith in God but were delivered as true, eternal believers.\nWhen we come to Jesus in faith, we always come with a short-sighted grasp of who He truly is. We can’t help that entirely, since we remain earthbound creatures contemplating the divine. But we have much more insight into who Jesus is than this paralytic and his friends because we have the remaining sixteen chapters of Luke’s Gospel to inform us.\nIt would be a shame if the best thought we ever had about Jesus was that He could help us out from time to time. It would be a tragedy of misplaced affection if the only time we ever went to Him was when we wanted a miracle. It is good for us to come to Jesus in faith like the paralytic and his friends, but as we read on, I pray the Holy Spirit would give us eyes to see who Jesus truly is—the Savior who is Christ the Lord. May this be what truly amazes us.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram5.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 4:1-44, Deuteronomy 9:6-11, Psalm 91:1-16",
        "devo_title": "Jesus’s Early Ministry",
        "devo_summary": "\n                    \n                    The gospel is an “accept or reject” proposition. It’s either completely true or categorically false. Jesus makes sure of this.\nAfter Jesus’s temptation in the wilderness, He began ministering in and around Galilee. People did not realize it, but the Messiah was in their midst. They caught glimpses of it through events like those we see here in Luke 4. He spoke like a man with an uncommon grasp of God’s law. He cast out demons with authority. He cared for the indigent and afflicted, miraculously healing them.\nThough those in positions of religious authority could not explain where Jesus got the power and wisdom to do and teach as He does, they were very reluctant to accept what He says so plainly in this chapter—that He is the fulfillment of Isaiah’s prophecy:\nThe Spirit of the Lord is on me,\nbecause he has anointed me\nto preach good news to the poor.\nHe has sent me\nto proclaim release to the captives\nand recovery of sight to the blind,\nto set free the oppressed,\nto proclaim the year of the Lord’s favor (Luke 4:18–19).\nCan you picture the scene—Jesus reading these words, carefully rolling up the scroll, allowing for a nice dramatic pause, and then saying in reference to Himself, “Today as you listen, this Scripture has been fulfilled” (Luke 4:21). Why do you think people had such a difficult time believing Him? Clearly He wasn’t simply talking big. People were beginning to observe His wisdom and power. And the miracles too.\nI see two kinds of people in this chapter: people who are trying to hold things together, and people who are so desperate for help they’re willing to risk having their assumptions challenged. What was happening then continues today. Jesus makes claims, does things, and has events attributed to Him—most notably, His own resurrection from the dead—that require us to either dismiss Him or become open to the possibility that He is who the angel told the shepherds He would be in chapter 2: the Savior who is Christ the Lord.\nThe message of the angels is coming into sharper focus here in chapter 4. Captives are being set free. The blind are recovering their sight. And the good news of the possibility of this sort of restoration is spreading.\nThroughout the rest of Luke’s Gospel, people will struggle to believe in Jesus. The struggle continues to this day for many. Perhaps it does for you. If so, ask the Lord to open your heart to the possibility of believing what you never imagined possible—that Jesus Christ heals the blind, frees the captives and oppressed, and ushers in a new kingdom, over which He will rule forever, world without end. He either will or He won’t.\nHe says He will.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram4b.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 3:1-38, Genesis 3:15, Acts 1:6-8",
        "devo_title": "The Messiah’s Herald",
        "devo_summary": "\n                    \n                    How real is your faith? Is it anchored in reality? Were you made for a relationship with God? Do you need forgiveness? Is there hope for sinners? Does any of this matter? These are some of the questions Luke wants us to tangle with.\nThe third chapter of Luke’s Gospel really drives home his earlier statement that this book would be an “orderly account” of the life of Jesus. The chapter opens with an historical point of reference—the 15th year of the reign of Caesar Tiberius, when Pilate, Philip, and Lysanias were all tetrarchs, and Annas and Caiaphas were the high priests—and it ends with a genealogy that reaches all the way back to the first man, Adam.\nThis stuff really happened. That’s something Luke wants us to know. He is not telling fables, parables, or fantasy. He is writing truth. We are reading truth. This chapter marks the beginning of Jesus’s earthly ministry. No one knows who He is yet. There are rumors floating around that some believe the Messiah has been born, but few have zeroed in on Jesus as the Christ. \nLuke sets us up for this chapter by telling us in the chapters before about the miraculous nature of John the Baptist’s birth—coming from old, barren parents and leaping in Elizabeth’s womb in the presence of the pregnant Mary. Now, John emerges as a man stepping out of the wilderness to do what he was born to do: proclaim the Messiah’s coming and call all people to repent. \nIt can be so easy to regard our spiritual ideas and habits as some sort of mystical soul-care that has little to do with our present reality. We can take on devotional practices because they make us feel better, or ease our consciences, or make us feel enlightened. And we can just as easily begin to treat our spirituality as something that belongs to another realm, serving as some kind of escape from the here and now.\nBut the Gospels don’t treat faith in this way. Rather than being some ethereal concept floating in spiritual energy, Luke nails faith in Christ to the floor. He anchors it in real time, and sets it in real geography. Jesus did not come to inspire us. He came to live a life of perfect righteousness in our place, die the sinner’s death we deserve, and give us life in His name through His real cross and real resurrection. \nWhen John the Baptist came on the scene, he did not call us to positive thinking, or quiet times, or joining up with a social cause. He called us to repent and to believe in true forgiveness, made possible by the One more powerful than him (Luke 3:16). Forgiveness would come through the real, historical, atoning work of Jesus—which, again, really did take place during the reign of Tiberius, when Pilate, Philip, and Lysanias were all tetrarchs, and Annas and Caiaphas were the high priests. \nReally. Do you believe it?\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram3b.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 2:1-52, Isaiah 9:2-7, Galatians 4:4-5",
        "devo_title": "The Birth of Jesus",
        "devo_summary": "\n                    \n                    For you. Focus on these two words as you read: “A Savior was born for you” (Luke 2:11, emphasis mine). \nAn ordinary shepherd’s life was rich in irony. His job was to tend the animals that would be sacrificed to atone for the sins of the people. Yet because of his work, a shepherd was often ceremonially unclean. And because he was routinely unclean, he was sometimes seen by others as untrustworthy and irreligious. \nJesus said a good shepherd would lay down his life for his sheep (John 10:11)—sheep that would be sacrificed for the sins of the same people who regarded the shepherd as unclean. This reality made shepherds’ very lives a kind of sacrifice. They were outsiders.\nWhen the angel appeared outside of Bethlehem to these marginalized men keeping watch over their flocks, what did he say? In effect, he said, “Go behold the end of your life as an outsider.” Let’s unpack that.\nThe angel uses three names for Jesus—names that speak to His purpose. Savior means He will atone for the sins of the people. Christ identifies Him as their deliverer and Messiah. And Lord recognizes His divinity.  \nBut then the angel uses one more expression, which would have brought overwhelming clarity to the moment. The angel tells the shepherds that the Savior, Christ the Lord, has been born for them (Luke 2:11). The divine, atoning Messiah has been born for shepherds. They are not outsiders to this gift. They are recipients!  \nImagine it. An angel appears to some of the most disregarded people in the land to deliver the greatest announcement ever given. The glory of all glories appears to the lowest of the low, and he gives them a sign to prove Christ was born for them, a sign that would have left them speechless. The baby King would be lying in a manger. \nThe shepherds saw not only that He had come; they got a hint as to why. When they found Jesus there in a manger, just as the angel had said, the very location of His birth was drenched in meaning. The Savior was born into their unclean world and placed in a manger, a feeding trough for sheep. As the Good Shepherd, the Savior would lay down His life, and His body would be broken to feed His sheep.\nLike those shepherds, we are not outsiders to this gift either. We are called to receive Him who came into our unclean world, the Savior who is Christ the Lord. May we leave this text in the same way the shepherds left the manger—glorifying and praising God for these things we have seen.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram2.jpg"
    },
    {
        "book_title": " Luke",
        "devo_passages": "Luke 1:1-80, 1 Samuel 2:1-10, Jeremiah 23:5-6",
        "devo_title": "The Coming Savior",
        "devo_summary": "\n                    \n                    Think of how many ideologies have come and gone, collapsing under their own weight and weakness. Think of the cultural moments that have risen and subsided, where the voices with the megaphones have demanded that we all believe this or reject that. It can be dizzying.\nIn Malcolm Muggeridge’s essay from 1980 entitled, “But Not of Christ,” the British journalist reflects on all that had happened in his own lifetime. England and America saw their economies flourish, then tank, and then flourish again. Hitler came along declaring the establishment of a German Reich that would last for 1,000 years. He died less than ten years later in infamy. Stalin’s countrymen hailed him as wiser than Solomon and more humane than Marcus Aurelius. Then his name became forbidden in the regime he helped found. Mussolini announced that he would restart the calendar to coincide with his reign. That didn’t work out so well either.\nMuggeridge ends his essay by saying, “Behind the debris of these self-styled, sullen supermen and imperial diplomatists, there stands the gigantic figure of one person, because of whom, by whom, in whom, and through whom alone mankind might still have hope. The person of Jesus Christ.”\nThe gospel of Luke begins with a strong assertion. Luke opens this book by telling the honorable Theophilus that he is writing an orderly account of the life of Jesus Christ. When he recounts the story of Jesus’s birth, he tells us, “his kingdom will have no end” (Luke 1:33). That is a bold statement.\nThese words were written 2,000 years ago, and they come to us in the context of Luke quoting an angel who was referencing the time of Jacob, which was several thousand years prior. These are impressive words to read. Why? Because in all this time, Luke’s Gospel has not collapsed in on itself. In fact, the message has spread around the world, and millions of people from hundreds of cultures have not only heard this gospel, they have surrendered their lives to the One it’s about: Jesus Christ.\nAs you read Luke’s Gospel, keep in mind that this is no ordinary book. Anyone can say their ideology, regime, or religion will last forever, but no one can actually make that happen. No one except for the King of the Universe. The gospel is about the King of the Universe—Jesus Christ, the Son of God and heir to the throne of David (v.32).\nThis is His story, and the very fact that you are reading Luke’s words is evidence that the story is ongoing. And that you are part of it. So read on.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2018/12/HRT-LUKE-instagram1.jpg"
    }
]