[
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 4:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize this verse from Philippians 4, which reminds us to dwell on things of the Spirit.\nFinally brothers and sisters, whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is lovely, whatever is commendable—if there is any moral excellence and if there is anything praiseworthy—dwell on these things. \n—Philippians 4:8\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Lockscreen-Day14-NEW2.25.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "John 15:9 ",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“As the Father has loved me, I have also loved you. Remain in my love.”\n—John 15:9\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-ForAppOnly-Day13.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 4:10-23, Proverbs 11:24-25, Acts 20:32-35, 2 Corinthians 9:6-9",
        "devo_title": "Encouragement and Prayer",
        "devo_summary": "\n                    \n                    When I was a freshman in college, the Lord used a series of events to bring me to my knees before Him. I had been a Christian for a few years at that point, but it’s fair to say I hadn’t truly made God the true “Lord of my life.” What I mean is, I believed in my heart and my head that the work of Christ saved me from my sin into eternal life with God, but this belief hadn’t yet changed my affections and motivations.\nIn short, I was pursuing a relationship with a girl, and through one of my attempts to communicate my commitment to that girl, I lost her trust and the relationship of a dear friend in the process. I was not content with the love of Christ; I needed the love and attention of someone else. The Lord showed me my sin. I was searching for contentment in others, but true contentment can only be found in Him. When I came to understand this—really understand it in my heart—I found myself being drawn closer to God.\nThroughout his ministry, Paul found himself in much more dire circumstances than losing the attention of a girl he liked. He faced countless acts of persecution and attempted execution. He was shipwrecked. He was bitten by a snake. He was imprisoned. Despite all of that, Paul is able to write: “I have learned to be content in whatever circumstances I find myself” (Philippians 4:11).\nNow, it’s important to remember that Paul was not given some sort of enhanced version of the Holy Spirit in order to face all the difficult situations he faced in his life. Paul received the same Holy Spirit Christians receive today when they repent and believe that Christ has saved them from their sins. Paul is not some sort of super-Christian, allowing him to be content amidst trials in a way that we cannot match. But Paul does say something curious in verse 12: “In any and all circumstances I have learned the secret of being content​—whether well fed or hungry, whether in abundance or in need.”\nWe may be tempted to think, Uh-huh. See! God has given Paul something “extra.” He’s told him some “secret” that He hasn’t shared with us—that’s the real reason he’s able to be content in all things. We may be tempted to believe true contentment is impossible, that there’s a “secret something” we need to get or earn or do to be at peace. But that’s just not the case. In verse 13, Paul lays it out plainly: “I am able to do all things through him who strengthens me.”\nThat’s. It. That’s the secret.\nThe secret to living with true contentment is that we are given the ability to do so by His Spirit. Verse 13 is not a promise from God that we will somehow be able to conquer any mountain or accomplish any task we want just because we are Christians. When we read within the context of the rest of Paul’s letter to the Philippians, we see that verse 13 reveals the secret to living a life of contentment no matter what our circumstances are. God wants us to find our contentment in Him because He knows we cannot find true contentment anywhere else.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Day12.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 4:2-9, Matthew 6:25-34, John 15:7-11, Romans 8:5-6",
        "devo_title": "Practical Counsel",
        "devo_summary": "\n                    \n                    Depression and anxiety have never been as prevalent in the United States as they are today. These twin burdens often afflict the same people, and they are afflicting more Americans than they ever have before. This is especially true among young people. From the 1990s to the early 2000s, rates of depression and anxiety were pretty stable. That isn’t the case anymore.\nAccording to the National Survey on Drug Use and Health, in 2012, about 5% of boys and about 12% of girls ages twelve to seventeen had a “major depressive episode” in the preceding year. In 2016, about 7% of boys and about 20% of girls had a major depressive episode—that is one in five American teenage girls having a major depressive episode. We are amidst an epidemic, and there are plenty of purported reasons why, but that’s for another place and another time. The point is this: As a culture, we are more anxious and depressed than we have ever been.\nI have battled with serious feelings of anxiety myself. It can feel like a hole out of which it is impossible to climb. And while I don’t imagine the apostle Paul knew about the depression epidemic Americans would face in the 21st century, his words to us in Philippians 4 may serve us well as we fight the realities of our mental health struggles.\nRejoice in the Lord always. I will say it again: \nRejoice! Let your graciousness be known to everyone. \nThe Lord is near. Don’t worry about anything, but in everything, \nthrough prayer and petition with thanksgiving, \npresent your requests to God (Philippians 4:4–6).\nLet me be clear in saying this: the depression and anxiety we feel may not be simply solved by reading our Bibles and being encouraged to throw off anxiety and “rejoice!” It can be hard to find joy when the world feels like it’s closing in, and in a moment of distress, a few Bible verses may not immediately quell our feelings of helplessness. However, I do think it is important to read Paul’s words closely and examine our lives in light of them. I actually find it helpful to read these particular verses in reverse order. For our purposes today, consider this slight rearrangement:\nThe Lord is near. Don’t worry about anything, \nbut in everything, through prayer and petition with thanksgiving, \npresent your requests to God…\nRejoice in the Lord always. I will say it again: \nRejoice! Let your graciousness be known to everyone.\nI must confess, there have been times when I’ve found myself rolling my eyes after reading Paul’s instruction to not worry. It feels as though there is no way Paul could understand what is causing my distress, so his charge to not worry feels invalid (though he was well acquainted with having to live life from a cell). But the reasoning he gives for why we should not worry is there alongside his charge to not do so. Why should we not worry? Because the Lord is near! This is a tremendous truth, a more than adequate remedy for whatever worry we may be facing.\nWhen we are fighting any variety of anxiety and worry in our lives, we ought to ask ourselves: Do I truly believe Jesus is near? Or do I feel like I’m in a forever-deep hole by myself? Might we find peace even in our anxiety if we realized our Lord is truly by our side at all times and in all places? May He help us to believe what is always true: the Lord is near.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-ForAppOnly-Day11.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 3:17-21, Philippians 4:1, Romans 16:17-20, 2 Thessalonians 1:5-12, Titus 2:11–14",
        "devo_title": "Stand Firm in the Lord",
        "devo_summary": "\n                    \n                    Prior to 1929, there was no standard oath to recite when someone became a citizen of the United States. As you might imagine, this reality allowed for the naturalization process to vary from state to state. But in 1929, that reality changed when the U.S. Citizenship Oath took on standardized language. About twenty years later (1952), amendments were made to emphasize service to the country. Those changes included adding language around bearing arms on behalf of the United States when required, and performing noncombatant services in the armed forces when deemed necessary. The time frame (1950s) for all this is of importance. Think about it: this was the onset of the Cold War, and the stakes—both real and perceived—were at a tension-filled high.\nThe amended form of the Citizenship Oath still stands today, and it begins: “I hereby declare, on oath, that I absolutely and entirely renounce and abjure all allegiance and fidelity to any foreign prince, potentate, state, or sovereignty, of whom or which I have heretofore been a subject or citizen…” Words matter. And if you’re going to be a citizen of the United States, it seems your allegiance does as well. You’ve got to be all in. You’ve got to stand firm. Of course, the “foreign” powers being referenced in the oath are earthly kingdoms and countries. But what if, for example, your truest citizenship is in heaven? (Philippians 3:20).\nThe New Testament is abundantly clear on this matter. If I have chosen allegiance to the cross of Christ, then my citizenship lies with His kingdom. While I may still be a citizen of this or that country, nation, or even of this world, things have changed. I live for and serve only One, even as I live as a citizen of my earthly country. To be a follower of Jesus means being all in. Sure, I am to render to Caesar what is Caesar’s (Mark 12:17), but I am also to render to God what is God’s—and God demands all of me.\nThe language the apostle Paul uses indicates that waffling in my allegiance to Christ equates to being a “enemy of the cross.” That’s rather harsh, isn’t it? But you see, far from some war between rival countries, you and I live in enemy territory, in a daily struggle for our hearts and minds. This calls for standing firm in the Lord each day, living acutely aware of “those who cause dissensions, for such people do not serve our Lord Christ but their own appetites. They deceive the hearts of the unsuspecting with smooth talk and flattering words.”\nWords matter. And if we claim to be Christians, those whose citizenship is in heaven, then that should be abundantly clear to anyone paying attention. Everything has changed, and we now live in such a way “that the name of our Lord Jesus will be glorified.” Our allegiance is to One, and to Him only.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Day10.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 3:12-16, Romans 8:28-30, 1 Corinthians 9:19-27, Colossians 3:1-4",
        "devo_title": "Reaching Forward to God’s Goal",
        "devo_summary": "\n                    \n                    Marie Kondo. I’ll bet you’ve heard her name, and there’s a chance you’ve read her best-selling book, The Life-Changing Magic of Tidying Up. Maybe you’ve even seen her Netflix series, Tidying Up with Marie Kondo. In both, Kondo preaches the gospel of “KonMari”—a system of simplifying and organizing your home by getting rid of physical items that do not “bring joy” into your life. If you’ve no clue about her name, her book, her TV show, or her system, here’s my simplified overview: You stand in front of the clothes in your closet, go hanger by hanger, and ask if that garment brings you joy. If the garment or item does not, then discard it, but only after you’ve thanked those bell bottoms, for example, for their service.\nCall me cynical, but I find that to be a bit extreme. I’m also envious that Kondo has, at last count, four bestselling books on organizing your life her way. Some ideas come along at the right time, and hers have definitely struck a chord with millions of people, helping them to get their ducks, or closets, in a row. But Kondo’s idea is not original. See Paul’s words to the Philippians:\nForgetting what is behind and reaching forward to what is ahead, \nI pursue as my goal the prize promised by \nGod’s heavenly call in Christ Jesus (Philippians 3:13–14).\nThe apostle Paul’s approach to spiritual life is by no means the same as Marie Kondo’s approach to your closet. But in some ways, they share the same ballpark, for Paul also advocates for a ruthless elimination of anything in our lives, especially anything in our past, that hinders us from true joy—otherwise known as “knowing Christ Jesus.” Discipline and self-control are non-negotiables in this way of living. In fact, Paul invokes imagery of elite athletes such as boxers and runners in training who strive for nothing less than a win. And Paul’s training advice to us? “Run in such a way to win the prize” (1 Corinthians 9:24).\nLike Kondo, Paul has his critics, those who insist such an approach is too extreme. But Paul remains adamant, stressing that those who practice such devotion and commitment experience nothing short of life-changing transformation, an experience that leads to a crown that will never fade away (1 Corinthians 9:25). If there’s anything “behind” us in our lives that does not orient us to the joy of knowing Jesus Christ, then those things are to be forgotten, done away with. This “tidying up,” so to speak, allows us to then be free to reach for and live for God’s goal that lies ahead. No, this has nothing to do with closets and hangers and bell bottoms, but everything to do with our hearts and minds and souls and strength.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-ForAppOnly-Day9.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 3:1-11, Jeremiah 9:23-24, 1 Peter 2:1-10",
        "devo_title": "Knowing Christ",
        "devo_summary": "\n                    \n                    A dear friend recently suffered an enormous loss. His home and all of his family’s belongings were lost in a devastating home fire. In just a few hours, the historic home in which his family had invested years of renovation ended up as a pile of cinders and ash. This included all their clothes and family photos—virtually all of their earthly possessions. In the midst of this tragedy, one of the first things I wondered about was the quality of my friend’s homeowner’s insurance policy. It’s not that I was unconcerned about his family’s safety and their emotional loss, but as one who is predisposed to finding hope and safety in financial stability, the first thought that jumped to my mind was, Are they completely protected from all this suffering and loss?\nI am convinced that many of us wonder about God’s faithfulness, goodness, and love toward us, not because He has been unfaithful, but rather because we believe He has not lived up to providing the safe and prosperous outcomes we’ve imagined for our lives, such as our individual and cultural notions of safety, predictability and peace, pleasure and affluence. I wonder if our forebears from past generations bought into this idea, if they believed that those who follow Christ should expect a life free from insecurity, suffering, and loss.\nIn Philippians, Paul explains his reorientation from the false securities of his previous life to a new understanding in which he rejects those former notions in order that he “may gain Christ and be found in him” (Philippians 3:8–9). Now, because of Christ, he has suffered the loss of these accomplishments, and he even considers them “as dung” (v.8). This is one of many passages in the Bible that reminds us that God is not necessarily working to bring about our own individual dreams of the good life. If we don’t recognize this, we are likely to find ourselves primed for disappointment with God. He is concerned with something of much greater value than helping us achieve everything we want. His desire is for all of creation to experience the redemption and restoration we need.\nPaul knows that his former aspirations are nothing compared to gaining a relationship with Christ and being found in Him. As we consider our own privileges and accomplishments in comparison to the incomparable gift of knowing Jesus Christ, we will see the former things as far less important. We can appreciate them even as we count them as loss in comparison to the value of knowing Christ. Is the loss of these identity markers a true loss of identity? No. Our truest identity and a fuller comprehension of His redemptive love are found in our union with Christ. Only through Him are we truly secure.\nWritten by Rob Wheeler\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Day8.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 1:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Philippians, Paul’s declaration of complete devotion to the gospel of Jesus Christ.\nFor me, to live is Christ and to die is gain.\n—Philippians 1:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Lockscreens-Day7.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Psalm 133:1",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHow good and pleasant it is\nwhen brothers live together in harmony!\n—Psalm 133:1\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Day6.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 2:19-30, Acts 19:21-22, 1 Corinthians 16:10, 1 Thessalonians 5:12-13",
        "devo_title": "Timothy and Epaphroditus",
        "devo_summary": "\n                    \n                    I recently heard a ministry leader share this idea: The first thing pastors lose after entering into the ministry is someone who will pastor them. In other words, you become the shoulder for other people to lean on, while missing out on having someone to lean on yourself. He then went on to mention the spiritual attacks pastors and their families often endure—the enemy’s attempts to knock them down and prevent the gospel message from spreading.\nAs Christians, we all face spiritual struggles, and sometimes isolation, because of our faith. Even Jesus said that we would be hated by the world because we are not of it (John 17:14–16). Our shared calling as believers is one of consistently serving others and sharing their burdens—a burden all its own that is not to be taken lightly, especially for those who are called to teach (James 3:1).\nDuring Paul’s ministry, he traveled across the Mediterranean preaching and then being thrown in prison. But he rarely endured this alone; Paul was constantly in the company of fellow believers who were also doing God’s work, working alongside him to spread the good news about Jesus.\nTwo of these assistants were Timothy and Epaphroditus. Paul mentions these men in a few of his letters, especially when he was sending one or both on a mission to a local church. He likens Epaphroditus to “his brother,” and urges the Philippian church to “welcome him in the Lord with great joy and hold people like him in honor” (Philippians 2:25, 29). He extols Timothy’s likemindedness and his “proven character” as he carries out his mission (Philippians 2:20, 22; 1 Corinthians 16:10). Clearly, Paul wanted those who would receive his brothers in the faith to treat Timothy and Epaphroditus with care and respect.\nIn Paul’s day, the missionaries spreading the gospel of Jesus Christ depended upon local churches for a lot. As they traveled, Paul, Timothy, and Epaphroditus relied on other believers to provide them food and shelter. They existed on God’s charity and the goodwill administered to them through the kindness of other believers. And although Paul could not always be with his brothers on mission, he wanted them to be held in high regard “because of their work” for the kingdom (1 Thessalonians 5:12–13).\nThis missional work was difficult, but men like Paul, Timothy, and Epaphroditus persevered because they were serving a God who loved them and a community of people who supported them. Likewise, each of us needs the Church, the body of Christ and all its parts working together, to carry out the call God has placed on our lives (1 Corinthians 12:12–14). The world has changed a lot since the first century, but the Great Commission hasn’t. So, while our challenges are different than those faced by Paul and his friends, we still need the grace of God—and one another.\nWritten by Robert Carnes\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Day5.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 1:27-30, Philippians 2:1-18, Psalm 133:1-3, 1 Corinthians 1:10",
        "devo_title": "Christian Humility",
        "devo_summary": "\n                    \n                    A few years ago, when I was working for a different organization, a colleague asked me for the email of a vendor we’d been working with. At the time, I’d been having difficulty getting said vendor to respond to my own messages, so in my return message to my colleague, I said something to effect of: “Good luck with getting in touch with him. He takes forever to respond.” I hit send and went about my business.\nA few minutes later, the color drained from my face when I got a response to my email—not from my colleague but from the vendor I’d been talking about. It seems that in my search for the vendor’s email address, I’d inadvertently sent my message to him instead of the colleague I’d meant to share it with. Of course, I profusely apologized to the vendor for my mistake, and thankfully, he was understanding, perhaps because what I’d said about his response time wasn’t untrue. Needless to say, this was a humbling moment for me professionally; I’d made a mistake which could have cost me a relationship. I also learned a valuable lesson about patience and proofreading emails before sending.\nIt’s no surprise that the word humble comes from the same Latin root, humilitas, which means “to be brought to a low place.” This can be done one of two ways: either voluntarily through our own actions and disposition, or through circumstances we experience. Humility is mentioned repeatedly throughout Scripture. The apostle Paul reminds us to be “humble and gentle” (Ephesians 4:2), while James says, “Humble yourselves before the Lord, and he will exalt you” (James 4:10). And when Jesus visits a Pharisee’s house, He tells those proud men a parable about choosing seats at a wedding feast. The moral of the story is this: “Everyone who exalts himself will be humbled, and the one who humbles himself will be exalted” (Luke 14:11).\nWhy is it so important for us to be humble? What’s the benefit of lowering ourselves? Christ was the greatest among us, yet He was also the most humble of all (Philippians 2:8). Why is humility the model Jesus set for us to follow? Because when you love others more than yourself, it makes for a better community. Acting selfishly benefits only yourself, but acting selflessly benefits everyone around you (v.3). When you lower yourself, you lift up everyone around you.\nWhen we focus more on other people, we also gain a perspective of empathy. Being humble opens our eyes to the needs and cares of those around us. God calls us to live in community with one another and support our fellow man. That’s much easier to do when we’re not distracted by our own ego.\nIt’s been said that “humility is not thinking less of yourself; it’s thinking of yourself less.” That statement has been attributed to several different Christian thinkers, including C.S. Lewis. Regardless, I imagine that whoever first said those words wouldn’t mind sharing credit—they no doubt understand the point of being humble.\nWritten by Robert Carnes\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-ForAppOnly-Day4.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 1:12-26, 1 Corinthians 2:1-5, James 3:13-18",
        "devo_title": "To Live Is Christ",
        "devo_summary": "\n                    \n                    In the book of Ecclesiastes, the Teacher (most likely King Solomon) wrote, “It is better to go to a house of mourning than to go to a house of feasting, since that is the end of all mankind, and the living should take it to heart” (Ecclesiastes 7:2). Except for the generation still alive when Christ returns, every person’s journey will end at the same place: death. The color will pass from our cheeks, and our limbs will make their final movements. The synapses that fire in our brains will ignite no longer, and our hearts will cease their steady rhythm. This life will be over.\nSince the moment when our first parents sinned in the garden, death has been our common enemy. He stalks each of us, no matter where we go. He’s unrelenting, never growing tired, never losing his pace. He is coming, and we cannot escape him. But in the book of Philippians, death is no longer fearsome. He doesn’t even look scary. Paul talks about dying as if it were just a change of location, no different than moving across town: “Now if I live on in the flesh, this means fruitful work for me; and I don’t know which one I should choose. I am torn between the two. I long to depart and be with Christ—which is far better—but to remain in the flesh is more necessary for your sake” (Philippians 1:22–24). You can almost hear him weighing the difference between life and death the way one considers items on a dinner menu.\nThe gospel has freed Paul from the tyranny of death’s pursuit. The apostle is no longer running. Death has lost its power over him. He knows where he will go when his heart stops beating. He will find himself in the presence of the Lord, where there is abundant joy (2 Corinthians 5:8; Psalm 16:11). In the same way that the gospel has transformed the meaning of death, it has also transformed the meaning of life. Our time in this world can no longer be about mere pleasure or self-preservation. Against the backdrop of eternity, it is instead an opportunity to allow Christ to live in and through us, to worship Him and to serve others in His name.\nDeath is still our great enemy. It’s still appropriate to mourn when a loved one dies. We should still fight for life in every arena. And it is still a tragedy when an innocent life is cut short. Nothing in the gospel would deny any of that. But death is coming undone, and we who know Christ have no need to fear it.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-ForAppOnly-Day3.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 1:3-11, Acts 16:16-40, Philemon 1:4-7",
        "devo_title": "Thanksgiving and Prayer",
        "devo_summary": "\n                    \n                    In my life there have been people who have loved me, and there have been people who have loved me so well that they actually changed my life. I think of my sister, who gave me a place to stay when I had nowhere else to go. I think of a certain college professor whose teaching made the scriptures come alive for me in a way they simply hadn’t before. I think of friends who have given words to feelings for which I lacked the vocabulary. And I think of my wife, Laurin, whose tenderness in the midst of my sometimes misguided determination keeps me sane and holds our family together.\nSo, I have a sense of what Paul meant when he wrote, “I give thanks to my God for every remembrance of you” (Philippians 1:3). The Philippians had loved Paul well. They had shared their lives with him and given him a base of operations in Macedonia for his evangelistic work (Acts 16:15). They had supported him financially in good times and in bad (Philippians 4:14–16). And they had been partners in his mission to preach the gospel near and far (Philippians 1:5). Even in his imprisonment, their friendship had been an encouragement, bringing him joy in what was surely a time of suffering and loss.\nPaul’s gratitude is directed toward the Philippians, but it is also pointed at heaven, to the “God from whom all blessings flow,” as the Doxology says, echoing Jesus’s half-brother James: “Every good and perfect gift is from above, coming down from the Father of lights” (James 1:17). And Paul acknowledges this truth in his thanksgiving. He knows that the gifts he has received from his friends in Philippi—as well as the Philippians themselves—have been given to him from the hand of the Father.\nI thank God for bringing certain people into my life. Their impact has been so great that my mind can’t bear the thought that we crossed paths by accident. My story is being written by the Author of life itself, and these chapters were meant to be written. I didn’t see them coming. I didn’t plan them. In many cases, I didn’t even know I needed them. But God did. So I am thankful, each and every time I remember one of these who has loved me so well.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Day2.jpg"
    },
    {
        "book_title": " Philippians",
        "devo_passages": "Philippians 1:1-2, Acts 16:6-15, 1 Peter 5:1-5",
        "devo_title": "Paul’s Opening Words",
        "devo_summary": "\n                    \n                    As I write this, the current price of a U.S. postage stamp is fifty-five cents. That means, essentially, if I give my mail carrier two quarters and a nickel, he’ll make sure a letter I’ve written gets to my friend on the other side of the country. Even to Alaska. Even to a house in a remote part of the state. Even if the house is on the tippy-top of a very tall mountain. Even during a snowstorm. That makes sending a letter one of the greatest bargains going today.\nIt’s not just the small cost that makes sending or receiving a letter wonderful. A handwritten letter communicates something that an email or an Instagram DM or a phone call cannot. (Remember phone calls?) A letter is personal, not just because of the words written, but because of how they’re written: in the sender’s unique handwriting. A letter also takes time and more effort than other, more modern forms of sending a message, and that says something in and of itself.\nJust think about the last time you received an honest-to-goodness letter in the mail—not a bill or a package from Amazon or an account statement, but an actual letter from a friend. Didn’t it feel, well, special? Much more valuable than two quarters and a nickel, anyway.\nPaul’s letter to the Christians at Philippi was special, the nearest thing to being there in person. He couldn’t be there, of course, because he was in prison. But he wanted to impart something to his faithful friends, those who had become partners in the gospel (Philippians 1:5). Philippians is essentially a thank-you note for financial support. The theme is joy, and the tone is one of gratitude—to the recipients but also to God. In fact, if Paul had decided not to mention his current imprisonment in the letter itself, it would be hard for us as modern readers to deduce that reality on our own. This is simply not the sort of letter one would think emanated from the heart of an innocent man living under the weight of suffering.\nBut here it is, all the same.\nPhilippians is powerful, because it is an artifact of something nearly too good to be true. In the kingdom of God, the meek inherit the earth, the poor are blessed beyond measure, and those in prison find reason to sing. So, when Paul writes “Grace to you and peace from God our Father and the Lord Jesus Christ” (Philippians 1:2), it’s not merely a formality. He knows the reality of God’s amazing grace, and he knows it’s available to his friends in Philippi. And he also knows what it’s like to experience the peace that “surpasses all understanding” (Philippians 4:7); it is his heartfelt desire that his brothers and sisters in Christ be wrapped up in it too.\nThis simple verse is a beautiful picture of the kingdom. In earthly terms, Paul is the one in need. He’s in prison. He should be asking for help. But he sees the world through the lens of heaven, so he is content, and his desire is for his friends to receive the gifts—namely the grace and peace of God.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/02/HRT-Instagram-Day1.jpg"
    }
]