[
    {
        "book_title": "Romans",
        "devo_passages": "Romans 1:1-17, 2 Samuel 7:12-16, 2 Corinthians 5:17",
        "devo_title": "Set Apart for the Gospel",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Romans 1:1-17, 2 Samuel 7:12-16, 2 Corinthians 5:17\nIf you could have access to only one book for the rest of your life, which would you choose? \nJudging from their devoted habits and bold commentary, it seems a great many theological giants in Church history would have made Romans their go-to text for a lifetime. Early church father John Chrysostom had the book read aloud to him once a week. Poet and preacher Samuel Taylor Coleridge called it “the profoundest piece of writing in existence.” The famous sixteenth-century Bible translator William Tyndale wrote of Romans, “It is the principal and most excellent part of the New Testament… No man can read it too oft.” Martin Luther, St. Augustine, and John Wesley all came to assured faith through the impact of Romans.\nWhat is it about this book that has captivated the attention of believers across the ages? What makes Romans so unique? \nAll Scripture is God-breathed and equally valuable—God’s special revelation given to us that we might know Him. But Romans is distinct in that it provides the most comprehensive expression of the gospel found in the Bible. This book reaches back deep into the Old Testament to walk us through the origin and problem of sin, the reality of guilt, and the impossibility of saving ourselves. And it presents, systematically yet succinctly, the ultimate rescue we’re given in the life, death, and resurrection of Jesus Christ.\nIn short, Romans contains the essential gospel.\nFrom the opening statements of his letter, Paul makes clear his purpose for writing: to present and promote the gospel of Jesus Christ. He introduces himself as Christ’s servant, “set apart for the gospel of God” (Romans 1:1). He addresses the letter to “all who are in Rome, loved by God,” expressing his commitment to telling them “the good news about [God’s] Son” (vv.7-9). And he conveys how desperately he has desired to visit the city personally: “I am eager to preach the gospel to you also who are in Rome” (v.15).\nPaul then turns from his brief introduction to make a stunningly clear pronouncement on where he stands when it comes to the message of Christ:\nFor I am not ashamed of the gospel, because it is the power of God for salvation to everyone who believes, first to the Jew, and also to the Greek.\n– Romans 1:16\nPaul was confident in his calling to preach the gospel because he was certain of the saving power of his God. I am a servant of Christ… I am an apostle… I am set apart for the gospel… I am eager to preach the good news… I am not ashamed. \nIt is with this unshakeable confidence that Paul, the self-proclaimed “worst of sinners” (1 Timothy 1:15), wrote to the believers at Rome—to explain to Jewish and Gentile converts alike what it means to believe in and be redeemed by Jesus Christ. For this is no metaphorical salvation; it is the real-life rescue of broken and complicated people by the all-powerful hand of a merciful God.\nLean in close as Paul presents his longest letter in Scripture, a sermon on what it means to be a Christ follower in this life. Listen as he tells of God’s holiness, justice, and compassion. Read this book as though it is telling a single story—the story of how God rescues us through the sacrifice of Christ.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram1.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 1:18-32, Proverbs 1:7, 2 Timothy 3:1-9",
        "devo_title": "The Righteousness and Wrath of God",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 1:18-32, Proverbs 1:7, 2 Timothy 3:1-9\nIn all of Paul’s letters, there are few bleaker passages than the one we encounter in Romans 1:18-32. Here Paul paints a picture of total depravity, gleeful rebellion, and blind rejection of God—all of which incur the deserved wrath of God. It’s dark and it’s grim, but there is one thing you especially need to know about it:\nIt’s your story.\nIf you’re like me, that might sound strange. Like many lifelong Christians, I was raised in the church, a rule-following “good girl” who never colored outside the lines. My life looks nothing like Paul’s portrait of self-destruction. And yet, his language is intentionally vague. He never specifies who this passage is about. Scholars have speculated—perhaps it’s about Adam and Eve, or perhaps he is describing non-Christians. But most scholars, like Dr. Douglas Moo, a professor at Wheaton College, interpret his words more broadly: “[Paul] has in view human beings generally, prone to turn away from God because of the original fall into sin.” \nIn other words, this passage is about us. \nPaul speaks of the “godlessness and unrighteousness of people who by their unrighteousness suppress the truth”—the people who struggle with “envy, murder, quarrels, deceit, and malice” (vv.18, 29). And those people he’s describing? Well, they’re us—all of us. Paul isn’t singling out a particular group of people; he’s diagnosing the human condition. \nLeft to our own devices, sin distorts our souls like water-warped wood. For every human ever born, that is our story. At least, it would have been our story had God not intervened.\nWhat we see in Romans 1:18-32 is a vision of our fate, had God not planned our rescue. Without God’s grace we were all “by nature deserving of wrath” (Ephesians 2:3). To understand exactly what these harsh words mean, we must be careful not to confuse God’s “wrath” with human forms of anger. Theologian John Stott describes human anger as “irrational and uncontrollable emotion, containing much vanity, animosity, malice, and the desire for revenge.” God’s wrath, on the other hand, “is absolutely free of all such poisonous ingredients.” \nBy comparison, God’s wrath is His “holy hostility to evil.” This hostility is not arbitrary. God does not pick rules out of a hat, and smite those who fail to conform. No, God directs His hostility squarely at the destructive effects of sin. Sin steals, kills, and destroys everything it touches, including the crown jewel of His creation: humankind. It degrades and dismantles us, and God’s response to this cosmic terrorism is total opposition. God opposes sin because He is good and righteous and just. \nHe also opposes it because of His love. Like a father’s white-knuckle rage at his son’s addiction, or a mother’s howling grief at her daughter’s eating disorder, God’s wrath is an expression of His love. It is hostility towards that which devours His children whole.\nThis side of eternity, we may never understand the mysterious balance between God’s active condemnation and the natural consequences of human sin. But together, these two elements constitute God’s righteous wrath against all human sin. That is our story—every one of us. Apart from the grace of God, we would only choose death. \nWhenever we read these words, we must ask the Spirit to reveal ourselves within them, because we cannot have the good news without the bad news. We cannot call it “salvation” if we are not being saved from something—namely, ourselves. Self-ruin is the only place our sin will ever take us. But, thanks to Jesus, it doesn’t have to.\n\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She is a regular contributor to Propel, blogs at SheWorships.com, and her first book releases in October 2017. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram2.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 2:1-16, Deuteronomy 16:18-20, Titus 1:15",
        "devo_title": "Who Can Judge?",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 2:1-16, Deuteronomy 16:18-20, Titus 1:15\nHead shaking, brow furrowed, she looked perplexed. Confusion filled her dark brown eyes. “I don’t understand,” she said.\nI explained further. “The Chinese and Japanese character used to translate ‘sin’ is the word zui, which means ‘crime.’”\nShe nodded and motioned for me to continue.\n“I think that translation can be somewhat limiting. I imagine you haven’t really spent time in jail or committed a crime like robbing a bank. I imagine you consider yourself a pretty good person.”\nShe nodded again. \n“I used to think of myself as a pretty good person, too” I said. “But then someone asked, if a movie were made of my life, if there were certain scenes I’d want deleted. I knew exactly which scenes I didn’t want anyone to see. And these scenes were not just of the times I did things I knew I shouldn’t, but also when I didn’t do things I knew I should. Our sin problem shows itself in both ways—in the things we do and the things we don’t do. We all sin. No one lives a life free of scenes they wouldn’t want others to see.”\nPaul goes to great lengths in the first three chapters of Romans to help us understand the totality and consequences of our sin. He lists the manifestations of sin at the end of chapter one, then goes on to explain how his readers not only judge others, but also practice the very things for which they pass judgment. \nAnd it’s true: most of us consider ourselves “good” people, qualified to judge others for their many shortcomings—that is, until we place our own sin-plagued lives next to Christ’s righteousness. Jesus is the only one who lived a perfect, God-honoring, shame-free life. \nBoth Jews and Gentiles—and both you and I—fall short under God’s holy judgment. We are all guilty, often of the very same things for which we condemn others. But there is good news: \nFor God loved the world in this way. He gave his one and only Son, so that everyone who believes in him will not perish but have eternal life.\n– John 3:16\nWe are born spiritually dead, our sin separating us from a life with God. But God, in the person of Jesus Christ, has made a way for us to know Him, both in this earthly life and for all eternity (John 17:3). \nJust as God Himself provides the way for us to be reconciled to Him, He also does the work of revealing to us our sin—of showing us how our “goodness” falls short of His righteousness. The Holy Spirit does the convicting (John 16:8), which frees us to love and to speak the truth in love (Ephesians 4:15).\nIn Romans, Paul writes systematically to knock away our sense of ever being righteous in and of ourselves. God’s invitation is not to mere ethics or manufactured goodness, but to the utter, complete transformation that takes place when we are made new in Jesus Christ (2 Corinthians 5:17).\nMay God melt away our pride that keeps us from total dependence on Him. By His grace, may we love others, even as they fall short like we also do. And may we recognize and receive God’s kindness that leads us to repentance. Amen.\n\nVivian Mabuni is a speaker and author, and a sushi, white Christmas lights, post-its, and coffee-with-friends lover. She has been on staff with Cru (formerly Campus Crusade for Christ) for 28 years and serves with Epic Movement, the Asian American ministry of Cru. Connect with Vivian on Twitter and Instagram at @vivmabuni.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram3.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 2:17-29, Deuteronomy 7:25-26, Psalm 51:1-12",
        "devo_title": "The Spirit of the Law",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 2:17-29, Deuteronomy 7:25-26, Psalm 51:1-12\nIn one of my seminary classes, we were to read Athanasius’ On the Incarnation, as well as— according to the syllabus—the book’s preface written by C.S. Lewis. Paying close attention to the syllabus (thought not that close), I read both the preface and the introduction.\nA few weeks later, during his lecture, the professor pointed out that we technically didn’t have to read the book’s introduction, but he said if we’d been smart, we would have. He explained this had been his intention—even if the syllabus hadn’t spelled it out explicitly.\nWas he assuming we were mind readers? Not really. He just had expectations. \nAt some point, we all give instructions—to colleagues, to children, to friends, to husbands—that may not be perfect or exact, but we hope the recipient will pick up on our intent, on the spirit of what we’re asking them to do. Sometimes it works, and sometimes it doesn’t. \nPaul is giving a similar instruction here to the Jewish Christians in Rome. He is echoing Jesus’ Sermon on the Mount, asking Jesus’ followers to read deeper into the Law. Paul tells them it’s not about following the letter of the law. It’s about following the heart of the One who wrote it. \nPaul’s laundry list of law-breaking activities in verses 21-23, reads similarly to what Jesus said in Matthew 5:\nYou have heard that it was said to those of old, “You shall not murder; and whoever murders will be liable to judgment.” But I say to you that everyone who is angry with his brother will be liable to judgment.\n– Matthew 5:21-22\nJesus preached these words to some who knew the Law backwards and forwards, but He was holding up a magnifying glass to their hearts. They weren’t out murdering people—they were law-following Jews, after all—but what was going on in their hearts? Were they angry with their brother? Jesus said then they, too, are deserving of punishment. The spirit of the Law was broken, even if the exact rule was not. \nPaul does the same for his readers. He questions their obedience to the Law, but then he reminds them it’s the posture of their hearts that matters most. These proud Jewish Christians came from a long heritage of trying to earn righteousness by following the Law. They too easily forgot that Jesus came to fulfill the Law for them, to make them righteous by simply believing in Him. \nIt’s not hard to see myself in the Jewish Christians of Rome, slipping back into trying to follow the rules rather than the One who wrote them. It’s easy to think my righteousness comes from  acting the right way, rather than from “the Way” Himself (John 14:6). But as the psalmist tells us, “would God not discover this? For he knows the secrets of the heart” (Psalm 44:21).\nIf I’m honest, what’s going on inside my heart is usually much uglier than how I act on the outside. Thankfully, Jesus came to wash me clean from the inside out. This is the beauty of the cross and the gift of the Holy Spirit: to compel me to seek God’s heart first, and obey His law by the help of His Spirit.\n \nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram4.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 3:1-20, Psalm 14:1-7, Ecclesiastes 7:20",
        "devo_title": "Guilty as Charged",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 3:1-20, Psalm 14:1-7, Ecclesiastes 7:20\n“For all have sinned and fall short of the glory of God.”\nIf you read Paul’s letters enough, you’re bound to catch this recurring theme.\nWhy did he find it so important for believers in the first century (and us!) to understand they were sinners?\nBecause God loves sinners.\n“But God proves his own love for us in that while we were still sinners, Christ died for us!” (Rm 5:8).\nJesus came to earth for sinners. He lived, died, and rose again for sinners. He forgives sinners. And sinners who place their faith in Him are welcomed into His family.\nThat’s really good news for sinners, right? And Scripture leaves no doubt. You, me, and every person on earth… we’re all sinners. That’s the bottom line Paul lays out in Romans 3:23.\nWe’re all broken, needy, and messed-up in a way that simply being “good” can never fix.  \nSince the Garden of Eden, our identity as humans has been marked by our tendency to rebel against God. That’s why we can never behave our way into a right relationship with Him. The most well-behaved, law-abiding, church-attending, choir-singing, modest-dressing, moralistic person alive, apart from Jesus Christ, is still dead in her trespasses and sins (Eph 2:1).\nThe heartbeat of the gospel is not, “Clean up your act, obey the rules, and God will forgive you.” That’s moralism, not Christianity. Any one of us who has ever tried to be a perfect person, even for a day, knows that approach simply doesn’t work. That false gospel stands in direct contradiction to the true one: Christ died for sinners. Because He loves us, remember?\nDo we encourage each other—and ourselves—to obedience? Absolutely! But let’s also remember that righteousness does not come through our obedience. Right standing with God comes only through faith in Jesus—His works and not our own. As Paul says in verse 24, “They are justified freely by his grace through the redemption that is in Christ Jesus.”\nThrough Jesus, grace flows freely to sinners. Through Jesus, those guilty and condemned are declared righteous—justified by His sacrifice, by grace through faith. And through Jesus, polluted sinners exchange filthy rags for robes of righteousness.\n“I greatly rejoice in the Lord,\nI exult in my God;\nfor has clothed me with the garments of salvation\nand wrapped me in a robe of righteousness… ” (Isaiah 61:10).\n\nCarrie Gaul is a biblical correspondent for Revive Our Hearts. She and her husband Dennis have two married children and are enjoying grandchildren. Carrie has a deep love for God’s Word and a passion to see women grow in ever-increasing intimacy with Jesus through the study and application of His Word.\nEditor’s Note: In Romans, Paul is building a case for the good news that is ours in Christ by faith. He uses these early chapters to establish our guilt before God—which he does to establish our need for a Savior. One of the most challenging aspects of the gospel is that it is based on the death and resurrection of Christ, necessitated by our own sin. We cannot understand the depth of God’s love for us in Christ without understanding the depth of our need for that sacrifice and the sin it covers. Because of Jesus, our sin is not counted against us, so we are never just “sinners.” We are redeemed sinners. A new creation (2 Corinthians 5:17). What an amazing gift it is to know that “God proves his own love for us in that while we were still sinners, Christ died for us” (Romans 5:8).\nThis essay was revised on August 28, 2017. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram5.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Psalm 51:1-3",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n \nBe gracious to me, God,\naccording  to your faithful  love;\naccording to your abundant compassion,\nblot out my  rebellion.\nCompletely wash away my  guilt\nand cleanse me from  my  sin.\nFor I am conscious of  my  rebellion,\nand my sin is always before  me.\n—Psalm 51:1-3\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram6.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 3:23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nAs we read through Romans together, we will memorize the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The first step acknowledges the problem: our own sin.\nFor all have sinned and fall short of the glory of God.\n—Romans 3:23\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Romans-1.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 3:21-31, Ephesians 1:7-10, Colossians 1:13-14",
        "devo_title": "Faith Upholds the Law",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Romans 3:21-31, Ephesians 1:7-10, Colossians 1:13-14\nI love a good “before and after.”\nWhether it’s watching the last ten minutes of an episode of HGTV’s Fixer Upper or following a designer’s Instagram feed, I just can’t get enough of those visual transformations. Give me all the before-and-after shots of your kitchen, bathroom, closet—even your hair!—magically morphed from cluttered to clean. I never, ever tire of them.\nReading Romans 3:21-31 reminds me of my makeover obsession. These verses are all about our “after”—who we are because of God’s grace “by the redemption that is in Christ Jesus” (v.24). The power of this passage lies in its contrast to the one before it. What would an “after” photo be if we never saw the “before”?\nA beautiful kitchen is a beautiful kitchen. But when we see that kitchen as it once was—dated tile, linoleum floors, and missing cabinet doors—compared to its transformed state of marble countertops and hardwood floors, we appreciate its newness and beauty that much more.\nSo let’s back up to Romans 3:20, our “before” shot that says, “For no one will be justified in his sight by the works of the law, because the knowledge of sin comes through the law.” That’s bad news for us. It means all the good stuff we did last week, all the good deeds and hard work—it’s all meaningless in itself.\nBut…\nBut now, apart from the law, the righteousness of God has been revealed, attested by the Law and the Prophets. The righteousness of God is through faith in Jesus Christ to all who believe.\n– Romans 3:21-22\nThis, friends, is the good news! No, we are not justified by the law, but we are justified in Christ.\nGod presented him as an atoning sacrifice in his blood, received through faith, to demonstrate his righteousness, because in his restraint God passed over the sins previously committed. God presented him to demonstrate his righteousness at the present time, so that he would be righteous and declare righteous the one who has faith in Jesus.\n– Romans 3:25-26\nNow, imagine knowing this good news with no understanding of the bad news that preceded it. Imagine seeing the “after” without seeing the “before.” It wouldn’t really be good news then, would it? In light of the bad news, the promise found in verses 25-26 is that much brighter, more hopeful. The contrast is everything.\nOur before is not a pretty picture. It is devoid of God and, therefore, full of despair. As Paul quoted the Hebrew scriptures, “all have turned away…ruin and wretchedness are in their paths” (Romans 3:12,16).\nBut…\nThis passage today is our after. The ones who have faith in Jesus are righteous. Not the ones who do the most, achieve the most, or follow the letter of the law the best. Unlike those HGTV makeovers, it’s not the amount of work we put in that brings us from before to after; it’s Christ’s work on the cross that transforms us. He, and He alone, declares us righteous before the one true God.\nPerhaps this is why I love seeing visual transformations so much. They help me to remember the gospel’s redemption in my own life. It’s a reminder I desperately need to hear, over and over again. It was not our blood, sweat, and tears that brought us back into relationship with God. It was His.\nWe are forever grateful, Jesus.\n\n\nAndrea Lucado is a freelance writer, Texas native, and the author of the memoir English Lessons: The Crooked Path of Growing Toward Faith. When she is not conducting interviews or writing stories, you can find Andrea laughing with friends at a coffee shop or creating yet another nearly edible baking creation in her kitchen. One of these days she’ll get the recipe right.  \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram8.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 4:1-25, Psalm 32:1-2, Ephesians 2:4-7",
        "devo_title": "The Promise Granted through Faith",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Romans 4:1-25, Psalm 32:1-2, Ephesians 2:4-7\nLet me tell you what everybody’s talking about these days: kale. I know, first telegrams were all the rage, later to be followed by fast food drive-thrus, “The Electric Slide,” and space travel. But now we’ve finally peaked with an affection for curly leaves that sprout from the ground.\nAt first, I really thought I was missing out. Kale seemed to be every celebrity’s best kept secret, every magazine’s healthy choice, and every grocery cart’s consistent companion. So, I tossed a bunch of kale into my produce bag and raced to the checkout line, anxious to taste this treat of the century. In the car, I tore the stem off like a cupcake wrapper, stuffing a handful of leaves into my mouth. I wanted to like it more than anything, but friends, gag reflexes don’t lie.\nIn contrast to the controversial kale, it would be difficult to find someone who didn’t like Abraham. His popularity was well-deserved, his reputation flawless, his character impeccable. The Jews looked up to him as a forefather paving the trail of faith, a man whose righteousness, they hoped, would inspire their own. If they were anything like me, they’d stuff themselves silly with anything that promised a chance at gaining his status.\nPerhaps some Jews tried to duplicate Abraham’s righteousness with their own try-hard attempts at earning favor with God. But no matter their determination, the results would remain bitter and unsavory. Exhausted, they might look to him and wonder, How does he do it?\nI asked the same of my friend Amanda, who eats a salad for lunch every single day and, consequently, is very well versed in the area of all-things-kale. She laughed, explaining that no one eats kale plain. Apparently (you probably already knew this), you drench it in dressing, blend it in a smoothie, or soften it with olive oil. By itself, kale isn’t the star ingredient, but when covered in other flavors, it gets all the credit for being delicious. Abraham’s secret had a similar flavor: “Abraham believed God, and it was credited to him for righteousness” (Romans 4:3).\nAt first glance, it’s easy to assume that if anyone could achieve righteousness, it would probably be a guy like Abraham. But like you and me, he had sin pumping through his veins. And so Abraham is not the achiever in this passage—God is. Abraham simply believed God and His promises.\nNow to the one who works, pay is not considered as a gift, but as something owed. But to the one who does not work, but believes on Him who declares the ungodly to be righteous, his faith is credited for righteousness.\n– Romans 4:4-5\nHear this good news, friends. Because Christ was righteousness in our place, we, too, are drenched in His goodness, credited with His coveted status—we’re the very fragrance of Christ before our Father (2 Corinthians 2:14). May we always believe with the faith of Abraham, receiving God’s promises with open hands and thankful hearts. Amen.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram9.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 5:1-11, Galatians 4:6-7, Ephesians 2:18-22",
        "devo_title": "A Hope That Will Not Disappoint",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 5:1-11, Galatians 4:6-7, Ephesians 2:18-22\nSeven years ago I found myself so emotionally, physically, and spiritually debilitated that just getting out of bed in the morning was difficult. I’d never struggled with acute depression before, but after soldiering through the deaths of several of my loved ones and a cancer scare of my own, my get-up-and-go was totally gone. All I wanted was to wave a white flag at life and crawl under the covers, venturing out just long enough to grab another pint of ice cream.\nIf someone had given me some perky acrostic or suggested I listen to a sermon entitled, “Ten Things Victorious Christians Do to Kick Disappointment and Despair to the Curb,” I’d have kicked them in the shins. Fortunately, Lynn, the Christian counselor I’ve gone to for years, doesn’t prescribe the dangerous meds of “minimizing grief” or “multiplying guilt.” Instead, she was silent as I sobbed, empathetic as I lamented.\nLynn gave me this advice: “Cling to Jesus and do the next right thing.” \nShe told me to stop trying to tackle the troubles of an entire day, much less a week, month, or year. I was simply to move forward one step at a time. Some days I’d wake to the alarm clock only to be hit with a shock of emotion as I remembered my circumstances. And other days, just whispering the name of our Savior gave me enough grit to pull back the covers and get out of bed.\nDay by day, inch by laborious inch, Jesus led me by the hand through that dark valley of life— one step at a time. \nI know far too many people who have lost their joy and all but lost their faith in Jesus because endurance was an overlooked muscle group in their Christian vocabulary. And so they’d stop attending Bible study, then church, fading away from their faith community in the midst of their malaise. Some have been wounded by that very same community of believers. Others have simply lost the energy and will to put on a happy face, to pretend their get-up-and-go hasn’t left them too.\nSurely our Creator-Redeemer weeps over the gaping holes in the fabric of His covenant family. We weren’t created to be wincing, jaded isolationists. We were created in God’s image, in the image of the triune God who exists in perfect relational harmony with Himself as Father, Son, and Spirit (Genesis 1:26). We’re hardwired for relationship, for communing with others of the faith.\nWhen life leaves us disappointed, disillusioned, and despairing, we need to resist the urge to withdraw from the body of Christ. Instead, we need to move toward other passionate—albeit flawed—Christ-followers to walk with us toward healing. We need to be honest with them, with God, and with ourselves about the true state of our hearts. We need them circling around us, crying out, “Abba Father!” on our behalf, reminding us of the Truth: we are no longer slaves, but daughters of the one true God (Galatians 4:6-7).\nTogether, we can persevere toward the living hope of the Lord Jesus Christ to whom we’ve been called. \nOnly God can love us unconditionally. Hoping in Him will never disappoint us the way the world does time and time again. Because “God’s love has been poured out in our hearts through the Holy Spirit” we can learn to rejoice and hope again, even in our pain (Romans 5:3,5). But it’s only in clinging to Him that we will find the strength to move forward in faith, one step at a time.\n\nLisa Harper is a master storyteller with a masters of Theological Studies from Covenant Seminary. She’s lauded as an engaging, hilarious communicator as well as an authentic and substantive Bible teacher. She’s been in vocational ministry for 30 years and has written 15 books (her latest being, The Sacrament of Happy: What a Smiling God Brings to a Wounded World) and Bible study curriculums but says her greatest accomplishment by far is that of becoming Missy’s (her adopted daughter from Haiti) mama! They live on a hilly farmette south of Nashville, Tennessee, where they enjoy eating copious amounts of chips, queso, and guacamole.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram10.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 5:12-21, Genesis 3:17-19, 1 Corinthians 15:21-22",
        "devo_title": "Death through Adam and Life through Christ",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 5:12-21, Genesis 3:17-19, 1 Corinthians 15:21-22\nSometimes, the weight of living this life just gets to us. It feels sticky and scratchy, less graceful and more gritty. We wander into and out of seasons that leave us asking where God is in the middle of grief or loss or emptiness. \nA few weeks ago, I lost my grandfather slowly and suddenly. He was tired one day and hospitalized the next. Not three weeks later, he was gone.\nIn those days between admitting him to the hospital and him meeting Jesus, I couldn’t seem to rectify the fact that what was happening felt so foreign and yet so expected. Death is a terrible reality that we live with, an awful and haunting sort of event that wrecks us. But, as we learn early on, it’s inevitable: death is a part of life.\nOne night, as I was adjusting his oxygen mask, my fingers combed through his hair, damp with sweat because his breathing was so labored. It reminded me of my nieces waking from a nap, their fine hair damp and sticking to their foreheads. And then I thought of my grandfather as a young boy, running around, playing and sweaty. His mother must have pushed his hair off his forehead, just as I was doing now.\nLater, after he was gone, a friend would remark to me, “You know, we labor into this world and we really labor out of it, too.”\nOne evening around dusk, I pulled him up to a sitting position, and together we shuffled over to a chair by the window. I sat in front of him, asking question after question about his life. The vesper light caught his eyes as he told me about a career of flying planes all around the world for the Navy. We both knew things were drawing to a close. Still, in that moment, I sensed a very real peace. We both did. It was as if we both understood that our bodies may break down, but Christ has given us life that will carry on for the rest of eternity.\nPart of me couldn’t believe his earthly life was coming to an end. But another part of me knew better: this is what happens. Sometimes, we live so deeply rooted in our fallen, fragile reality that we forget there is another, better, truer one.\nFor if by the one man’s trespass the many died, how much more have the grace of God and the gift which comes through the grace of the one man Jesus Christ overflowed to the many.\n– Romans 5:15\nWhen I’m in the throes of hospital visits and errands and trying to make the best of every moment, I can forget the truth. Because of Jesus, life is more than survival or death. It is eternal (Romans 5:20-21).\nThese days since my grandfather’s death, I’ve been thinking about how, as a Christian, I live a life marked by beautiful disagreement. Even when it seems death is the only option, the life and light of Christ finds a way to break through. Even when 21 shots are fired and a flag is folded graveside, there is still hope. Even as we watched the setting sun one last time together, we saw the beauty in the darkness.\nEven in death, grace reigns.\n\nMelissa Zaldivar is a social in the world of academics and an academic in the world of socials. Ever the Enneagram Six, she likes to dream big, talk herself out of it, and then just do the thing already. She holds a Bachelor’s degree in Communications and Bible/Theology as well as a Master’s in Theology. Her passions include eating Jimmy John’s sandwiches, showing people pictures of her nieces, and nerding out over biblical languages. If you ever need to know anything about obscure Puritanical American history or NASA, she’s your girl.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram11.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 6:1-14, 2 Corinthians 5:18-21, Colossians 3:1-11",
        "devo_title": "Our New Life in Christ",
        "devo_summary": "\nBY Rebekah Lyons\n\nScripture Reading: Romans 6:1-14, 2 Corinthians 5:18-21, Colossians 3:1-11\nMy daughter was baptized a few months ago.\nShe decided to follow Jesus in her elementary years, and considered baptism a long while until she entered middle school. The week prior, a pastor from our church sat down in our kitchen to talk to her about the weight of this decision. She was choosing to publicly testify Christ as her Lord to anyone who asked. This was a commitment to follow and serve Jesus no matter what, even when it was difficult.\nThe following Sunday she wrote a letter to Jesus, just between them, and pinned it to a wooden cross at the front of our sanctuary before taking her turn in the waters. As her daddy lowered her beneath the water he offered the words, “buried with Jesus in the likeness of His death, and raised to walk in newness of life” (Romans 6:4).\nScripture says we joined Jesus in His death when we were baptized. Death no longer rules over Christ Jesus, nor does it rule over those who believe in Him. What’s more, when we died with Christ, we were set free from the power of sin. “For the death he died, he died to sin once for all time.” As believers in Christ Jesus, we are to “consider [ourselves] dead to sin and alive to God” (vv. 9-11).\nBut if we’ve truly died to sin, why do we continue to live in it? The act of sharing in Christ’s death wouldn’t be a one-time thing any more than taking communion would be a one-time thing. In fact, we’re told to examine our hearts before we take the bread and the cup (1 Corinthians 11:27). We ought to examine our hearts in everything and invite God to search our hearts too (Psalm 139:23).\nWhen we take a lackadaisical approach to our sin, we give it room to rule over us, to distract us. As those who have been crucified with Christ, sin is no longer our ruler. We are not under the law but under grace (Galatians 2:20; Romans 6:14).\nThis begs the question: What in my life needs to die each day? What has become an idol, a security, a focus, or a prop that has pushed God aside? I never seem to see sin enter my heart until I hear it roll off my tongue—a little sarcasm here, a critique there. Then envy soon follows, before resentment settles in and camps out. \nFor starters, my pride needs to die. It needs to die a thousand deaths. It’s the temptation of the religious leader to get puffed up by our words, thinking the message is ours. But the truth is that God has planted His Word in our hearts (Hebrews 10:16). We are simply called to speak His Word when summoned.\nThere’s something else that needs to die for me in this season: production. It’s time for me to get quiet after a long season of pouring out. Making room for the death of an idol opens wide the gates for a new beginning, a new imagination for what God will bring about in the days ahead. I’m walking out these days with an expectant heart, putting my ear to the ground, and listening for a fresh refrain of reverence.\nI wonder, is there something that needs to die for you today? When you are joined in Christ’s death through faith, you are also raised with Him in newness of life. Laying down your idols will open the floodgates for freedom to reign once more, making room for new life to spring forth again.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram12.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Colossians 1:13-14",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHe has rescued us from the domain of darkness and transferred us into the kingdom of the Son he loves. In him we have redemption, the forgiveness of sins.\n– Colossians 1:13-14\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram13.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 6:23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The second step recognizes the consequence of our sin: death.\nFor the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\n– Romans 6:23\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Romans-2.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 6:15-23, Galatians 5:13-14, 1 Peter 2:11-17",
        "devo_title": "From Slaves of Sin to Slaves of God",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Romans 6:15-23, Galatians 5:13-14, 1 Peter 2:11-17\nWhen I was in elementary school, I decided I was going to grow an apple tree in our backyard. I didn’t tell my family about it. I wanted to do it secretly so that one day when there was a blossoming apple tree growing out of my mother’s flower bed, everyone would be amazed and I could reveal that I had grown it.\nI hoarded an apple seed from an apple I had eaten earlier in the day and smuggled it into the backyard when no one was looking. I dug a shallow hole in the flowerbed, placed the seed inside, and covered it with dirt. Then I hoped for the best.\nIn our last Romans passage we learned that Jesus’ death and resurrection does not mean life is a free-for-all, or that we can live however we like because of God’s grace. It means our motivation has changed. We don’t live under the yoke of the law any longer; we live under the covering of Christ, and that gift of grace motivates us to live by God’s Word.  \nIn Romans 6:15-23, Paul gives us another reason why Christians should not continue to sin simply because grace is now at play: fruit.\nBefore you knew Christ, Paul says, you were slaves of sin (Romans 6:17). And “…when you were slaves of sin, you were free from allegiance to righteousness. So what fruit was produced then from the things you are now ashamed of? For the end of those things is death. But now, since you have been liberated from sin and have become enslaved to God, you have your fruit, which results in sanctification—and the end is eternal life!” (Romans 6:22).\nWhen we interpret the message of grace as permission to continue sinning, we miss out on living a life that bears fruit, and instead, we live lives marked by death, for that is what sin is. This is not only harmful to our own souls; it is harmful to our witness. First Peter 2:12 says, “Conduct yourselves honorably among the Gentiles, so that when they slander you as evildoers, they will observe your good works and will glorify God on the day he visits.”\nOur lives do not bear fruit in order for us to look good to others. Our lives bear fruit so that others will see it and know its Source. A fruitless life does not point to our Creator. A fruit-filled one glorifies Him with each step we take (John 15:8).  \nYou can probably guess what happened with my apple seed in the backyard. Absolutely nothing. While I had the big idea right—apple seed leads to apple tree—I went about it all wrong. If you really want to grow an apple tree in your backyard, it’s much more complicated than burying a seed and hoping for the best. I looked it up. The real process involves things like “germinating” and “grafting” and transferring the plant from various-sized pots until it is ready for the ground. Then maybe, hopefully, your tree will grow and bear fruit.\nI eventually forgot all about my apple tree. Days, weeks, and months went by, and since nothing was growing, I forgot about the seed and my little secret plan. It had been a fruitless effort because I had not properly cared for its growth.\nOh, that my Christian life would be the opposite of that poor, non-existent apple tree, that I would live motivated by grace so that others would see a life in full bloom, and that its beauty would point them to its source.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram15.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 7:1-13, Proverbs 1:19, John 14:6-7",
        "devo_title": "How Can Death Bring Life?",
        "devo_summary": "\nBY Annie Downs\n\nScripture Reading: Romans 7:1-13, Proverbs 1:19, John 14:6-7\nMy buddy Andrea wrote yesterday’s post, and I loved it. But no offense to her, sometimes real, live fruit can show up without much planning. Here’s what I mean.\nI follow one of my favorite Instagram accounts specifically for the Insta-stories. One account I adore is of an incredibly fun mom living in Florida. Last week, she did three or four videos of the same tree: an avocado tree. Hanging from the branches were dozens of avocados.\n“Look at these beauties!” she yelled to the camera, “And my husband takes all the credit for this tree!”\nApparently, a few years before, he’d planted the pit of an avocado there in the backyard, just behind the pool, and voila! AVOCADOS! He didn’t plan it or even care for it. Just planted the pit once the original avocado was eaten and then didn’t think about it again.\nJust a dead pit. Buried in the ground.\nWhat viewers like me saw was the tree—the product, the fruit grown from the death. But the part we didn’t see were all those days in the middle. The dead days. The days where nothing grew and nothing changed on the outside, but everything was changing on the inside.\nI need to see the avocados. And I need to see the dead days too. Because I feel them. Don’t you? There are stories in my life that just plain feel dead. It feels like I did all the work I knew to do, and yet nothing seems to be growing or changing.\nBut death brings life. So it is with us because of Jesus.\nTherefore, my brothers and sisters, you also were put to death in relation to the law through the body of Christ so that you may belong to another… (Romans 7:4).\nTo be a Christian means that we belong to Jesus. And He belongs to us. Our sin was there on the cross. Our flesh was crucified with Him. And when He went to the grave to conquer death, He took our sin—our past, present, and still-to-come-future sin—with Him and buried it all there.\nAfter those three dead days had passed, Jesus came back, fully alive, and brought us, His made-new creation, with Him (2 Corinthians 5:17).\nI’m not a huge avocado fan, but I can see an object lesson when it’s before me. So I went to the grocery store, found two avocadoes that felt ripe-ish, and bought them. I didn’t have a plan—I just knew I needed them.\nI got home, sliced one open, and no kidding, the minute I saw the pit I started crying. Because I saw it, right there in the middle, the death that had grown life and sustenance. I pulled it out with a knife, washed it off in the sink, and just held it. And prayed.\nI asked God about all the avocado pits I see in my life, things that look dead. And I asked if they were ever going to grow into something that mattered. Did they matter? Did He even see them?\n…You belong to him who was raised from the dead in order that we may bear fruit for God (v.4, continued).\nWhile the Holy Spirit whispered truth to me, I already knew it; I saw it there in the avocado. Of course, He sees it all. He alone brings life from death, even when it feels like no new fruit will ever will grow in those dry, barren places.\nI breathed a prayer of thanks. And then I made guacamole.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram16.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 7:14-25, Galatians 5:16-26, 1 John 1:8-10",
        "devo_title": "The Good I Want to Do",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Romans 7:14-25, Galatians 5:16-26, 1 John 1:8-10\nSure, I was terrible. But it was the fruit flies’ fault.\nI’d been at war with them all week, using every trick Google assured me would work. Bowl of vinegar mixed with dish soap? Done. A trap made of fruit and plastic wrap? Yep. Pour diluted bleach down the drain and hope for the best? Affirmative.\nI’d done all the entire internet knew to do, to no avail. The fruit flies were multiplying, not disappearing, and I was over it.\nI was trying to cook dinner, plotting against the irritating insects in the interim as the pasta boiled and the sauce simmered. I was annoyed—and not just at the state of my kitchen, but at what seemed to be the state of my life. Why couldn’t I just get it all under control already?  \nThat’s when David walked in.\nI married a good man. He is kind and gracious and funny. And when he walked in the door during my fruit-fly and general-life crisis, I did what any human being would do: I let him have it.\nI was as passive-aggressive as I knew how to be and then some. I started slyly with some innocent questions, and then I went in for the kill, attacking his actions and decisions and, in the end, his character. It was awful. I was awful.\nHere is what I cannot for the life of me understand: I had no desire to treat my husband with such unkindness and disrespect. I did not stand there in my kitchen, stirring that spaghetti sauce and thinking, When he gets home, I’m going to give him a piece of my mind. Honestly, I don’t know that I’ve ever thought that about him.\nI love David. And I love how he loves me. I want nothing but the absolute best for him. But my best intentions were not calling the shots that night. My humanity was.\nI’m so grateful for this passage in Romans 7. I’m grateful that God not only knows us fully, but He reassures us of this in His Word. I’m grateful for Paul’s confession that so clearly articulates the struggle I feel in my own heart on a daily basis.\nI don’t want to sin. Really, I don’t. But I do it anyway.  \nI want to obey the Lord. Really, I do. But I disobey anyway.\nPaul’s description of his own sin struggle in Romans 7:14-25 can seem confusing at first read. But read it again, slowly this time. Read it aloud. Do you hear the desperation? Paul, like me (and like you?), does not want to sin. But in and of himself—in his “flesh”—he does not have the ability to be sinless. And he seems pretty frustrated about this. I am, too. Aren’t you?\nSin is a disease we are born with but cannot heal. Sin is a slavery we are born into but cannot escape (Romans 3:23; 1 Corinthians 15:22).\nSin is a condition we cannot fix. But Jesus can. He has.\nThe message of the gospel of Jesus—the gospel that causes Paul to cry, mid-frustration, “Thanks be to God through Jesus Christ our Lord!” (v.25)—is that Jesus has rescued us from “this body of death” (v.24). We are more than just our weak-willed bodies; we are souls who have been redeemed by the sinless life and sacrifice of Jesus Christ, the Son of God.\nYes, we struggle with sin. We struggle to “keep in step with the Spirit” (Galatians 5:25), to choose a moment-by-moment life guided by the Spirit of the Lord rather than our selfish desires. But we do not struggle in vain. Our struggle is a fight—a fight to live in the freedom that has already been secured by the Savior who defeated darkness once for all (1 Corinthians 15:55-57).\nThanks be to God, for He invites us into a life governed not by our wants or our whims, but by His truth and love.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram17.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 8:1-17, Isaiah 53:10, Mark 14:32-36",
        "devo_title": "Joint Heirs with Christ",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 8:1-17, Isaiah 53:10, Mark 14:32-36\nIndoor plumbing was a luxury in the Haitian village where my adopted daughter, Missy, grew up. And soft, two-ply toilet paper—that was even more rare. When I brought her home to Tennessee, flushing the toilet with copious amounts of Charmin quickly became one of her favorite pastimes.\nHow darling!\nThat was my thought in those early days as I observed her wide-eyed delight at watching massive plumes of paper spiral downward. But after a while, wading through ankle-deep wastewater in my bathroom and writing large checks to repairmen lost its allure.\nSo I was at my wit’s end a couple months ago when I walked into my bathroom—past my innocent-looking daughter splashing in a bubble bath—slipped on the wet tile, and quickly discovered water gushing out of the commode like Niagara Falls. After a heavy sigh, I morphed into the put-upon persona my mother used when I did something especially naughty as a child:\nDoggone it, Missy, HOW MANY TIMES DO I HAVE TO TELL YOU not to use giant gobs of toilet paper like this?!\nI angrily set about cleaning up the mess. The entire time I was plunging and fussing and mopping up that yucky pond with beach towels, I had my back turned to Missy.\nAs the water and my irritability subsided, I turned around to see my precious little girl staring at me mournfully, big tears streaming down her beautiful brown cheeks. I’d all but crushed her spirit over something innocent and insignificant. She wasn’t trying to cause a mess. She hadn’t been willfully disobedient or disrespectful. This was a plumbing issue—not a heart issue.\nI lifted her out of the tub, dried her off with our last dry towel, and rocked her back and forth until she stopped crying. I carefully explained that it was wrong for Mama to raise her voice, that I’d made a very bad choice, and that I was so sorry I’d hurt her feelings.\nThat night I called my contractor, who seemed perplexed when I asked, “Hey, Jack, you know those really powerful toilets on cruise ships that sound like they could suck your leg off when you flush them? Can you install one of those in my bathroom?”\nLess than forty-eight hours later, our brand-new supersonic vacuum version of a toilet was installed. I cheered so enthusiastically after Missy’s inaugural flush, you’d have thought she’d won an Olympic medal.\nOur recent toiletastrophes have reminded me just how much I love, value, and cherish my little girl. They’ve also reminded me of how God the Father loves, values, and cherishes me, His kid.\nI’m overwhelmed by the beautiful, redemptive ways He’s moved in my life. How He chose a former Haitian orphan, who lost her first mom to AIDS and never knew her biological father, to effectively rip out the last stubborn roots of the orphaned, fatherless spirit that have been growing in my own heart since long before I was Missy’s age.\nFor those who are led by the Spirit of God are the children of God. The Spirit you received does not make you slaves, so that you live in fear again; rather, the Spirit you received brought about your adoption to sonship. And by him we cry, “Abba, Father.” The Spirit himself testifies with our spirit that we are God’s children. Now if we are children, then we are heirs—heirs of God and co-heirs with Christ, if indeed we share in his sufferings in order that we may also share in his glory\n(Romans 8:14-17, NIV).\nChildren. Heirs. Coheirs with Christ.\nGod continues to employ my unlikely, only-by-grace, position of motherhood as a constant, colorful illustration of how He cheers Himself hoarse over every ungainly cartwheel we do (Zephaniah 3:17). How He leans down and hangs on every word of our mostly narcissistic prayers. How—despite our proclivity to make huge messes—He is so completely for us.\n\nLisa Harper is a master storyteller with a masters of Theological Studies from Covenant Seminary. She’s lauded as an engaging, hilarious communicator as well as an authentic and substantive Bible teacher. She’s been in vocational ministry for 30 years and has written 15 books (her latest being, The Sacrament of Happy: What a Smiling God Brings to a Wounded World) and Bible study curriculums but says her greatest accomplishment by far is that of becoming Missy’s (her adopted daughter from Haiti) mama! They live on a hilly farmette south of Nashville, Tennessee, where they enjoy eating copious amounts of chips, queso, and guacamole.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram181.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 8:18-25, Isaiah 65:17, 1 Thessalonians 4:13-18, Revelation 21:1-6",
        "devo_title": "From Groans to Glory",
        "devo_summary": "\nBY Rebekah Lyons\n\nScripture Reading: Romans 8:18-25, Isaiah 65:17, 1 Thessalonians 4:13-18, Revelation 21:1-6\nIt begins as far back as we can remember. Right before we run off to school, we smear on our mama’s lip gloss and clamp down as many hair clips as our endless bangs will allow. We hope for another attempt to fit in with the others, to measure up, to belong.\nGrowing up, I often found myself hanging in the balance between enjoying the moment and anticipating the next one. As a young child, my hopes centered around a 25-cent soft serve ice cream cone after church on Sunday nights. My hopes matured as I did—working to make the swim team, racing to the finish line at a track meet, striving to win an award. I hoped for slumber party invitations, a certain new sweater for Christmas and, of course, beating my brother at checkers.\nThose early years of putting my best foot forward, I hoped the appearance of having it all together would win me friends. But years down the line, the stakes of life loomed larger, and deep heartache entered in—nevermind the lip gloss or hair clips.\nIn truly tragic moments, our hope is put to the test. And if it’s misplaced, it will be found wanting. \nThe hope we read about in Romans offers us a greater understanding of the hope God offers. It takes us from tangible evidence we can see, and pushes us deeper into a faith that asks for what we cannot see. In fact, all of creation is wired for this. If something breaks, we are hardwired to figure out a solution. Most problems can’t be solved in a day, so we work and test and try until we receive the desired outcome. But there will always be a hope offered by God that requires all of Him, and no amount of our working and testing will bring it to pass. This is the hope of Christ, our Rescuer and Redeemer.\nBecause of Christ, we are free to hope in even the most difficult or uncertain circumstances. In the first chapter of his epistle, James tells us to “consider it a great joy” whenever we face trials because the testing of our faith produces spiritual endurance (vv. 2-3). Trials are accompanied by hope. Hope is a gift. Hope is critical, and the gospel gives it to us in unending supply.\nNow in this hope we were saved, but hope that is seen is not hope, because who hopes for what he sees? Now if we hope for what we do not see, we eagerly wait for it with patience (Romans 8:24-25).\nAny suffering we endure here and now is incomparable to God’s coming glory (Romans 8:18). The measure of trials we have endured directly relates to the measure of hope we offer the world. This is the beautiful gift of hope.\nOne day our groans will give way to glory. While we wait, we place our hope in Jesus.\nHe will wipe away every tear from their eyes. Death will be no more; grief, crying, and pain will be no more, because the previous things have passed away (Revelation 21:4).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram19.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Galatians 5:13",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n For you were called to be free, brothers and sisters; only don’t use this freedom as an opportunity for the flesh, but serve one another through love.\n—Galatians 5:13\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram20.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 5:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The third step presents the solution to our problem: Jesus.\nBut God proves his own love for us in that while we were still sinners, Christ died for us.\n—Romans 5:8\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Romans-3.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 8:26-39, Psalm 44:17-22, Philippians 1:6, 2 Thessalonians 2:14",
        "devo_title": "The Believer’s Triumph",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 8:26-39, Psalm 44:17-22, Philippians 1:6, 2 Thessalonians 2:14\nI hope your summer fun list includes a trip to an amusement park or two. Nothing gets the blood pumping quite like circling a track at 100 miles per hour while simultaneously crying, laughing, and screaming. That’s good stuff.\nBut before you fill the water bottles and load the kids into the minivan for a day of sweltering, screaming fun, I need to let you in on a secret your brain already knows.\nIt starts with a feeling sociologists call “museum feet.” It’s a phenomenon our brains experience when we’re in a big space like an amusement park or a museum. It’s a general sense of being lost or exhausted that comes from hanging out in such a large space.\n“Museum feet” could give park-goers a bad experience, causing them to leave the park and not return. But architects have learned that if they include a large visual landmark, we’re less likely to become overwhelmed. They’re looking out for us, and their bottom line, by ensuring we’re willing to stay on the grounds long enough to fork over the cash for overpriced lemonade and nachos.\nThink about it: Cinderella Castle at Walt Disney World. Spaceship Earth at Epcot Center. The 150-foot “Big Wheel” Ferris wheel at Six Flags. Each offers their own brand of fun, sure, but they also give a reference point to come back to, something to focus on when we feel overwhelmed, overtired, or just over it.\nPaul never made it to Disney World, but he must’ve known a thing or two about feeling anxious, overwhelmed, or disoriented. Here, in Romans chapter 8, he shoots up a flare of truth for the believer to come back to every time we feel the same.\nAnd we know that for those who love God all things work together for good, for those who are called according to his purpose (Romans 8:28).\nIf this is one of those feel-good verses that’s become so familiar you’re tempted to race past it—STOP. This is the mother lode, friends! If God can use all things for our good and His glory, nothing can knock us off kilter. He makes us sure-footed. It’s the kind of steady posture that caused Paul to restate the truth of Romans 8:28 for the church in Philippi.\nI am sure of this, that he who started a good work in you will carry it on to completion until the day of Christ Jesus (Philippians 1:6).\nPaul is describing the process of redemption—that supernatural metamorphosis whereby God makes all things new. Paul was so anchored in the gospel that no wind could capsize him. That’s not new news, but this may be: the steadiness of Paul is possible for us too.\nGod’s promise in Romans 8:28 means He’s already at work, reshaping everything for our good. Tribulation, persecution, famine—God can redeem all of these and more (v.35). Nothing can stop the redemption process (vv.38-39). Not death, not life, not angels or rulers. Not this moment or all the tomorrows to come. Nothing can stop God from working all things for good—not even you.\nLife is big. It’s easy to feel lost or overwhelmed or like we want off the ride, but God’s truth anchors us against museum feet. The story of redemption gives us a point to come back to when we feel alone or afraid. The next time you feel overwhelmed, overtired, or just plain over it, look up. The same cross that steadied Paul in the face of unthinkable trials will steady you.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram22.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 9:1-19, Exodus 32:30-32, Ephesians 1:3-6",
        "devo_title": "God’s Mercy and Compassion",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 9:1-19, Exodus 32:30-32, Ephesians 1:3-6\nYou’ve probably been there—that terrible moment when you feel like you’re watching a train about to wreck. Your roommate chooses to stay in a toxic relationship. Your child makes a series of self-destructive decisions. Your brother or sister persists in a state of total denial. Your friend walks away from God.\nHelplessness is a special kind of agony, especially when it comes to our loved ones. This is the agony Paul expresses in Romans 9 about the choices of Israel. Having had his eyes opened to the light of the gospel, Paul realizes with great anguish that many of his people—God’s people—have not awakened to the good news of Jesus Christ. Theologian N. T. Wright describes Paul’s reaction this way: “[Paul] was like someone driving in convoy who takes a particular turn in the road and then watches in horror as most of the other cars take the other fork.”\nPaul’s sorrow is so great that he would rather take their place: “I could wish that I myself were cursed and cut off from Christ for the benefit of my brothers and sisters” (v.3). This chapter, then, is not a cold, calculating explanation of Israel’s history and fate. Instead, Paul is wrestling with the mysterious ways of God, and he doesn’t arrive at many neat and tidy conclusions.\nIn Romans 9, Paul engages some complex theological questions, but if we zoom in a bit and look at his heart, we might recognize our own. Most of us have walked in Paul’s shoes—grieving the rebellion, blindness, or self-destruction of someone we love. From Paul’s own wrestling with heartache, we can discern two spiritual principles:\n1. None of us can boast. None of us stands on moral high ground. God’s grace was not extended to us on the basis of human merit, but divine mercy. That is the principle Paul points to throughout the history of Israel: Isaac, not Ishmael; Jacob, not Esau. These men, these chosen ones who constituted the line of Abraham, were not selected because of their outstanding moral character, but because of the free compassion of God. As Paul explains, “It does not, therefore, depend on human desire or effort, but on God’s mercy” (v.16). In other words, none of us can pat ourselves on the back for our good choices or our strong faith, while silently judging others. It is all a gift, so that none of us should boast.\n2. God is sovereign. The relationship between God’s power and our free will is a mysterious one, indeed. But when it comes to the decisions of a loved one, God’s sovereignty removes a great deal of weight from our shoulders. Namely, we cannot force someone to make the right choice. We cannot yell someone into wisdom. We cannot wrestle someone into agreeing with us. And we cannot compel transformation. There is only One who directs the streams of human hearts, and that is God alone.\nThe sovereignty of God does not permit us to become callous, nor does it permit complacency. Like Paul, we should mourn destruction whenever we encounter it. But it can relieve us of a burden we were never meant to bear.\nOnly God knows the whole picture and the entire story. Our task is to share the good news to the best of our ability, in humility, and then prayerfully leave the rest to Him.\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She is a regular contributor to Propel, blogs at SheWorships.com, and her first book releases in October 2017.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram23.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 9:20-33, Jeremiah 18:1-6, Ephesians 1:11-14",
        "devo_title": "Righteousness through Faith",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 9:20-33, Jeremiah 18:1-6, Ephesians 1:11-14\nI did an internship in Washington D.C. the summer before my junior year in college. The job was good enough; I coordinated summer camp logistics for kids interested in politics. Yes, it was as nerdy as you’re imagining, and yes, I was a former attendee. But the best thing about that summer wasn’t licking envelopes and herding hormones. It was meeting a new group of friends at church.\nI don’t know if you’re familiar with the town of Stars Hollow from the TV show Gilmore Girls, but those quirky, fictional characters had nothing on my new, real-life friends. Despite the fact that I was a stranger in town, and only planning to stay for eight weeks, they grafted me in, constantly hounding me to join them for weekend adventures of camping, floating down rivers, or taking long motorcycle rides through the Shenandoah Valley. It was as dreamy as it sounds, and healing for my soul in many, many ways.\nWe talked about the gospel, too, and one of those conversations led to the topic of the providence of God—what some call “predestination.” The candor of the conversation shocked me. Who talks about this stuff anyway? And what does the providence of God even mean?\nI was kindly pointed to today’s passage in Romans, and from there one friend explained the idea that God knows, plans, and orchestrates everything. All the days ordained for me (and you, for that matter) were written in His book before one of them came to be (Psalm 139:16). We are God’s workmanship created to do good works that He prepared in advance for us to do (Ephesians 2:10). Salvation itself is a righteousness that comes by faith, and even that comes from Him.\nAt face value, the concept that God is in control of everything might seem offensive. We humans have a cosmic authority problem. We don’t like to believe that Someone else has the final say in our lives. When Paul asks in Romans 9:20, “Will what is formed say to the one who formed it, ‘Why did you make me like this?’”, I want to scream, “Yes! That’s what my prayers to God sound like on a regular basis!” But if we are to take Romans 9 to heart, we have to concede that God is ultimately the one in control of His creation.\nIn the years since my dream summer in D.C., I’ve learned a lot about faith. I’ve read much more of the Bible. I’ve spent countless hours with Jesus. And despite all that, God’s providence is as mysterious to me now as it was then. But I do know this: I would rather believe in a loving God who is fulfilling His purpose for me, than a cosmic universe that is inflicting its chaos on me.\nI look at the seasons, coming and going in their time. I look at the ocean waves, which know their boundaries. I look at my face in the mirror—imperfect, yes, but a masterpiece in the Master’s hands. I look at the miracles of birth and life and death. None of it is a mistake. This beauty is His creation, and He is sovereign.\nIf we trust Him—if we believe His love—we can put away our questions of Why did you make me like this? and put on the posture of Thy will be done.\n\n Claire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram24.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 10:1-21, Isaiah 52:7, Joel 2:32, Galatians 3:7-14",
        "devo_title": "The Message of Christ",
        "devo_summary": "\nBY Missy Fuller\n\nScripture Reading: Romans 10:1-21, Isaiah 52:7, Joel 2:32, Galatians 3:7-14\nI sat on the plush, cream-colored sofa, helping my mentor fold laundry while her two-year-old played on the floor. I was a senior in college, involved in campus ministry and leading a Bible study, and I enthusiastically updated her on both endeavors. I’d begun telling yet another story when she calmly interrupted me with a simple, matter-of-fact statement: “You believe in a works-based gospel.” \nWe’d known each other a while, and her statement stunned me. Was she serious? \nI quickly brushed it off in the moment. But later that week, I found myself kneeling by the side of my bed, soaking my plaid, purple bedspread with tears. She was right. \nThere I was, wallowing in my sin, wanting desperately to be back in the loving arms of my Savior. I had asked for forgiveness, but the relief wasn’t coming. As I poured my guilty conscience onto the pages of my journal, I was struck by one word: time.\nThat’s what I thought I needed: time. I didn’t really want forgiveness. I wanted time—enough time to fill my life up with the right things, the good things, to settle the score. It was salvation by works at its worst. \nAll my striving, all my desire to put time between myself and my mistakes, it was another attempt to earn my salvation through my own effort. Rather than trusting the work of Christ on the cross for my righteousness, I had become dependent on my own actions to save me.\nI was living exactly like the Israelites Paul describes in Romans 10:\nSince they are ignorant of the righteousness of God and attempted to establish their own righteousness, they have not submitted to God’s righteousness (v. 3).\nAfter Christ’s death and resurrection, Israel was still working hard to keep the Law of Moses in order to gain righteousness. They were working to save themselves, forgetting that “Christ is the end of the law for righteousness to everyone who believes” (v. 4). \nThe law, our works, the right things—they were never supposed to save us. God had planned our salvation and redemption through Jesus Christ all along. Christ is the only perfect fulfillment, the only victory we have over sin and death. His perfect life allows us to be justified through our faith alone. Faith and nothing else, just Jesus—this is the message of Christ.\n“For everyone who calls on the name of the Lord will be saved” (v. 13). \nAs I knelt beside my bed that day, I realized Jesus truly was all I needed. His sacrifice covered me then, despite all my striving, and it covers me today. I need His righteousness, not my own. He is enough. \nFriends, no matter what our past, present, or future holds, the only work that can save us is the work Christ completed on the cross. May we call on His name.\nOne believes with the heart, resulting in righteousness, and one confesses with the mouth, resulting in salvation (v. 10).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram25.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 11:1-24, Hosea 14:4-7, Ephesians 2:8-9",
        "devo_title": "God’s Kindness and Severity",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Romans 11:1-24, Hosea 14:4-7, Ephesians 2:8-9\nThe first time I read Romans 11, I saw God as very kind. \nBut today, that kindness seems far away—30,000 miles below me, to be exact. This time, I’m reading Romans from seat 12B, squished between two strangers. And the pilot has just warned us that “significant turbulence” is ahead. \nA hush fell over the cabin in that awkward “I’m playing it cool” kind of way. Because it’s totally going to be fine. I mean, how likely is that whole “unlikely” in-case-of-an-emergency situation, anyway?\nWe’re all eyeing the flight attendants to gauge their uneasiness.\nJust when you’ve settled into your seat and become comfortable with God’s kindness, the winds shift. His tender mercies can also feel severe. Regardless of how much we show it, we’re all afraid of crashing.\nThe Romans were afraid of this too. After all, Israel had taken a hard fall following God’s rejection, so it only seemed natural for this band of new believers to begin bracing themselves for a similar emergency landing. They were afraid that if God didn’t turn out to be who He said He was, they’d have to take matters into their own hands. \nIt’s in moments like these that sweet songs about God’s kindness and goodness do not trump the truth about His severity. Just like we need the fullness of God’s character, we need to know the fullness of His Truth.\nAlthough the pilot reassures us that everything is under control, I’m tempted to entertain anxious questions. Did they check the plane to make sure it was safe before we boarded? Is the pilot keeping something from us? Is everything really just fine?\nWhen bad things happen that we don’t understand, are we just naïve to keep hoping? Will God reject us like He rejected Israel? It’s when we face the unknown that we find out how well we trust God’s character… which brings me to Jello.\nCreated by pilot and therapist Captain Tom Bunn to illustrate turbulence, the Jello Exercise compares a plane’s high-traveling, air-thickening speeds to being encased in Jello. While turbulent bumps may make you feel like you’re falling from the sky, it’s actually more like tapping the top of a Jello mold: the plane can bounce up and down, but it cannot fall. In fact, it barely moves at all. Regardless of the bumps, the plane is sustained, completely, by a force we can’t even see. \nSo are God’s people.\n“Now if some of the branches were broken off, and you, though a wild olive branch, were grafted in among them and have come to share in the rich root of the cultivated olive tree, do not boast that you are better than those branches. But if you do boast—you do not sustain the root, but the root sustains you” (Romans 11:17-18).\nIt is by grace that we cannot fully comprehend what it takes to sustain us. Not only does God know exactly what it takes, but in His kindness He sent Jesus to endure the severity for us. When love isn’t taken lightly, grace must also be severe.\nIt takes an intense, thickening wind to keep a plane steady in the clouds. It takes a kind, severe God to sustain us for His glory. Today, He is not only kind, but also severe, and exactly Who we need.\n“The people will return and live beneath his shade. They will grow grain and blossom like the vine. His renown will be like the wine of Lebanon” (Hosea 14:7).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram26.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Ephesians 2:8-9",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n For you are saved by grace through faith, and this is not from yourselves; it is God’s gift —not from works, so that no one can boast.\n—Ephesians 2:8-9\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram27.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 10:9-10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The fourth step shows our response to the solution God provides: confess and believe.\nIf you confess with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved.  One believes with the heart, resulting in righteousness, and one confesses with the mouth, resulting in salvation.\n—Romans 10:9-10\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Romans-4.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 11:25-36, Isaiah 40:13-15, 1 Corinthians 12:4-11",
        "devo_title": "The Depth of God’s Wisdom",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 11:25-36, Isaiah 40:13-15, 1 Corinthians 12:4-11\nPerhaps you’ve heard the not-so-fairy-tale-like stories of the children of Israel. Like the one where God rescued them from slavery, and they responded by grumbling about the flavors missing from their menu (Numbers 11). Or the one where they got impatient with Moses as he met with God on Mt. Sinai, so they decided to worship a golden calf (Exodus 32). Or the time when they came to the border of the promised land and listened to their knees knocking and hearts racing, instead of listening to the voice of God (Numbers 13).\nWhen we flip forward in our Bibles to the New Testament, we find God’s people still stuck in the ruts of rejection and rebellion. It was, after all, the Jewish leaders who led the charge to have Jesus arrested, tried, convicted, and crucified (Matthew 26:3-5). After the resurrection, they remained resolute in their opposition of Jesus, doing everything in their power to squelch the message of the Church. \nYet here in Romans 11, Paul reminds us that despite their chronic grumbling and wilderness wandering, despite their golden calf worshipping and Savior scourging, the Jewish people remain God’s “beloved” (v. 28). \nOur human logic may balk at this, but Paul warns against trusting only what makes sense to our brains (Romans 11:25). Try as we might, we cannot understand God’s love using our flawed standards for love and acceptance. Chapter after chapter, verse after verse, the story of God’s commitment to His chosen people doesn’t make sense. Human understanding leaves us wondering, Why did God choose them? But through the lens of the gospel, the story of the Jews suddenly makes sense. Look at Deuteronomy 7:6-8.\n“For you are a people holy to the LORD your God. The LORD your God has chosen you to be a people for his treasured possession, out of all the peoples who are on the face of the earth” (v. 6).  \nLean in. Listen closely to this next part. \n“It was not because you were more in number than any other people that the LORD set his love on you and chose you, for you were the fewest of all the peoples, but it is because the LORD loves you and is keeping the oath he swore to your fathers. . .” (vv. 7-8).\nGod knew His beloved were weak and frail—incapable of keeping their side of the covenant. Still He chose them, loves them, and keeps His promises to them. \nThe Bible is not the story of a wayward people but of a faithful God. \nIn the shadow of the cross, we are God’s chosen people. Because of the gospel, our identity has been changed from “not my people” to “my people” (Romans 9:25). Christ’s sacrifice made a way for us to be among the “beloved.” The gifts God has lavished upon us are so extravagant, and we are so undeserving, that we sometimes worry He’ll take them back. But “God’s gracious gifts and calling are irrevocable” (Romans 11:29). \nThe depth of God’s wisdom is matched only by the depth of His love. He has promised unfathomable gifts to us and He will never snatch them back. If every one of God’s acts of love and faithfulness toward the Jewish people could be contained, they’d overflow the seas. We, too, can stand on the shore and see the unmistakable faithfulness of God. \nWe are weak.\nWe are wayward. \nAnd yet, the Prince and the kingdom are irrevocably ours.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram29.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 12:1-8, Hebrews 13:15-16, Ephesians 4:1-16",
        "devo_title": "A Living Sacrifice",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 12:1-8, Hebrews 13:15-16, Ephesians 4:1-16\nPersonal discipline isn’t one of my stronger giftings. To put it another way, I stink at it.\nI’m the one in my family who excitedly asks, “Who wants to go get ice cream?” rather than stick to our sensible meal plan. I’m notorious for drafting a shiny new routine that lasts for three days before I’m ready for spontaneity again. Despite my best efforts to implement structure in my life, I’m all over the place. I’ve come to accept that flexibility is just part of who God made me to be.\nBut here’s the truth. For me, that acceptance spills over into a lack of spiritual discipline. The world tells us that fulfilling our every desire or whim in the moment is a sign of happiness, success, and freedom. But I can say from experience that ignoring spiritual disciplines only leads to chains, not freedom.\nPaul warns us, “Do not be conformed to this age, but be transformed by the renewing of your mind,” and I find myself staring longingly at his words (Romans 12:2). I want that. I want my body—my whole self—to be “a living sacrifice, holy and pleasing to God” (v. 1).\nI tried renewing my mind by attending church, but I didn’t make time to engage with God at home. I’d sit half-dazed in front of my computer, reading about fall fashion trends rather than reading my Bible. I’d watch one more episode of my favorite show and skip my prayer time. I wanted to read my Bible and pray and live out Romans 12:2, but my propensity for distraction and gluttony grew. I couldn’t control them on my own, no matter how guilty I felt or how many times I vowed to change.\nI’d forgotten that only God can transform my heart. And that transformation takes place in the context of the body of Christ, His Church—not just out here on my own, accompanied only by my best intentions.    \nMaybe your struggle is the opposite of mine, and routine and productivity are the desires that take the place of true renewal. Or perhaps your days are bound by a structure that you don’t want God to bend, a rigidity where spending time with Him in Scripture and in prayer are items on a checklist rather than intimate interaction with your heavenly Father. Whatever your personality, spiritual disciplines are tools that lift our eyes from our circumstances and desires and focus our hearts on God’s presence. Prayer, fasting, Bible study—they’re all disciplines that renew our minds and refresh our spirits. But unlike a resolution, a diet, or an exercise regimen, they aren’t sustained by our willpower.\nTrue spiritual growth is rooted in the Spirit’s work in us, not in our effort. God is the Giver. We are the recipient. He empowers. We surrender. We do this individually, as God’s daughters and sons, and we do this corporately, as His children and Church.\nMay we truly worship the Lord today by offering Him our whole selves, surrendering our desires to His will and our efforts to His strength, “according to the grace given to us” (Romans 12:6). Amen.\n\nJill McDaniel is a northern girl who married a southern gentleman and settled in the Midwest. With coffee in her hand, she coordinates her church’s Sunday preschool ministry, homeschools her two older kids, and plays babies with her youngest. You can find more of her writing at jillmcdaniel.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram30.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 12:9-21, Matthew 5:44-47, 1 Corinthians 4:6-13",
        "devo_title": "Christian Ethics",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 12:9-21, Matthew 5:44-47, 1 Corinthians 4:6-13\nReading Paul’s list of exhortations to the Romans makes me tired. Seriously. Rid your life of hypocrisy. Love deeply. Outdo one another in showing honor. Do not lack diligence in zeal. Share with the saints. Pursue hospitality. Live at peace with everyone…\nWith everyone? Really?\nDude. Paul. I need some coffee. And also, when am I supposed to binge-watch my TV shows?\nIn all honesty, when I compare my life to the lives of the disciples, I begin to see why Paul fills 1 Corinthians 4:6-13 with so much irony. I practically live like a queen compared to Christ’s beloved friends back in the day, and compared to much of the world today. Most of my time is spent concerned about how I’ll choose to spend my time.\nI catch myself daydreaming about the life the world tells me I should have: a life with a passionate (never rocky) marriage to my soulmate, a clean and immaculate house, a career that’s advancing, children that are thriving, and plenty of time at the gym maintaining the body of a teenager. To top it off, the world tells me I need to portray this “perfect” life to the world on social media, to attract more followers.\nWith this world as my guide, adding Paul’s list to the mix is absolutely impossible. There are not enough hours in the day to do both what the world demands of me and what God desires for me. And so I have to choose.\nEvery single day I have to choose whom I will serve: my flesh or my God. Some days I make the right choice. Some days I make the wrong one. This is the life of a work in progress, one that God promises to bring to completion in His time (Philippians 1:6).\nPerhaps that’s why Paul tells us to “cling to what is good” (Romans 12:9). If good was an easy, simple thing to hold onto, why would he tell us to cling to it? I know that in my own life, if I’m not clinging to God, the natural inclination of my heart is one of jealousy, coveting, and destructive daydreams. So while it seems like what Paul is cautioning us to do should be obvious, I know it to be oh-so difficult to put into practice. Detest what is evil; cling to what is good. I know that If I’m clinging to something, then I’m desperate, grasping. I’m holding on for dear life.\nThese passages remind me that my very life is at stake, and that evil really is evil. Paul pokes at my carefully built life, reminding me that Christ’s path of goodness and stillness and quietness is the only route to peace. I can rest knowing that the battle is the Lord’s. But I can’t assume that rest and peace will come without effort on my part, without my choosing God. I must cling to Him and let go of everything else.\nDear Lord, help me to hold on.\n\nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram31.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 13:1-14, Daniel 2:19-23, Hebrews 11:32-40",
        "devo_title": "Christian Duty",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 13:1-14, Daniel 2:19-23, Hebrews 11:32-40\nThe Bible is filled with the stories of people who have defied authority. Moses stood up to Pharaoh then led the Israelites out of Egypt. Daniel, Shadrach, Meshach, and Abednego all refused to worship any other god but Yahweh—and were then thrown into the lions’ den and fiery furnace, respectively. (Spoiler alert: God saved them all, and for His glory.)\nStephen defied the ruling Jewish Council, preached the gospel of Jesus, and was stoned to death for it. Paul and other apostles were martyred by the Roman government during the persecution of Christians.\nAnd yet this same Paul, who likely later died at the hands of his government, urges believers to honor and respect those in authority. Paul—who knew many examples throughout Jewish history of standing up to corrupt rulers—says to obey, seemingly without question. What are we to make of this?\nOf course, it’s natural to wonder, What if the government was urging murder, stealing, or some other form of not loving one’s neighbor? What if the ruling authorities were, as Nebuchadnezzar did, asking their people to bow down to another god? Or no god at all?\nScripture has given us plenty of evidence that Christ is the ultimate authority in heaven and on earth. Paul isn’t contradicting that here. What he is doing in Romans 13, is laying down a foundation for Christian living—reminding us that our ultimate authority is Jesus. Our first and truest loyalty is to Him.\nPeter gives a similar exhortation in 1 Peter 2. After telling the people, “you are a chosen race, a holy priesthood, a holy nation, a people for his own possession” (v. 9), he says:\nSubmit to every human authority because of the Lord, whether to the emperor as the supreme authority or to governors as those sent out by him to punish those who do what is evil and to praise those who do what is good… Honor everyone. Love the brothers and sisters. Fear God. Honor the emperor (vv. 13-14,17).\nPeter starts by reminding believers of who they are: the body of Christ, a holy nation of God that extends beyond borders. This is a beautiful truth for us to cling to as well, especially in times of deep confusion, national partisanship, and turmoil within our own institutions.\nBoth Peter and Paul tell early Christians to honor their government, but they do so in the context of the whole story of Scripture (and their own writings), affirming that Jesus is Lord over all. Therefore, we obey the government when it doesn’t contradict God’s commands—and we do it joyfully, as a way of honoring God.\nJohn Piper says it this way: “And it is very important to stress that, just as we may have to disobey the civil authorities for Christ’s sake, so all our obedience should be for His sake as well. We never have two masters … Every time we say yes to any law, it should be a yes to Jesus.”\nOur every action should be motivated by our identity as followers of Christ and citizens of God’s kingdom:\nThe night is nearly over, and the day is near; so let us discard the deeds of darkness and put on the armor of light. Let us walk with decency, as in the daytime: not in carousing and drunkenness; not in sexual impurity and promiscuity; not in quarreling and jealousy. But put on the Lord Jesus Christ, and don’t make plans to gratify the desires of the flesh (Romans 13:12-14).\nThe Bible offers many examples of what godly citizenship looks like in an earthly kingdom. Let us pray continually that we will seek first God’s Kingdom, listening to the promptings of the Holy Spirit as we engage thoughtfully with our own earthly governments. \n\nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram32.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 14:1-12, Colossians 2:16-17, Hebrews 10:19-25",
        "devo_title": "The Law of Liberty",
        "devo_summary": "\nBY Annie Downs\n\nScripture Reading: Romans 14:1-12, Colossians 2:16-17, Hebrews 10:19-25\nToday is my birthday. It’s a day I really love. Tonight my friends and I are headed to watch the Nashville Sounds play minor league baseball. There, I will hug everyone too many times, introduce friends who don’t already know one another, drink multiple Coke ICEEs, and maybe catch a foul ball. Then I will fall into bed tonight sure that I’m the luckiest woman alive.\nMy life is far from perfect. But the life I’ve spent 37 years putting together is turning out alright. Not perfect, not problem-free, but pretty awesome nonetheless.\nThe older I get, the more I draw boundaries in my life, making it the life I want to live. Some of my life rules wouldn’t work for you, and I’m okay with that. For starters, I’m dairy-free (it’s an allergy thing), but I wouldn’t ask you—or any of my friends at my birthday party—to live without milk, let alone eat cake WITHOUT ice cream. That beautiful stuff should never go to waste!\nThen there’s the matter of rest. My day off each week is almost always a Wednesday. That doesn’t mean it needs to be your weekly day to rest. It simply means Wednesdays work best for me.\nAnd then there’s the soccer. I watch it every chance I get. But you don’t have to do the same. Though, I’d highly recommend it because it’s just the best. Period.\n The beauty of maturing, and also growing up in my faith, is that I no longer want to look like you. In high school I wanted to look like you, sound like you, and like what you like. Not now. Now, I want to live MY life. I want to look like me—the best, healthiest, kindest, truest version of me. There’s this thing we get to do whenever we’re tired of comparing our lives to other people’s lives: we get to live our own.\n You know what it is? It’s the difference between bondage and freedom. Freedom is not a life without boundaries or borders or rule. It’s a life full of the good kind of boundaries, the kind that keep you healthy and strong, living the life God made you to live. It’s the life that is uniquely yours.\nFor none of us lives for himself, and no one dies for himself. If we live, we live for the Lord; and if we die, we die for the Lord. Therefore, whether we live or die, we belong to the Lord (Romans 14:7-8).\nWe often think freedom as just wide open space. But I’ve never found that to be true. Real freedom is found in knowing Jesus. It is giving yourself permission to live wide open in the spaces where God has placed you and in the ways He has made you. My fences around my spaces are going to look different from yours, but there is such safety and health and permission inside the boundaries built just for you.\nScripture tells us that if we’re Christ-followers, then the life we get to live belongs to Him  anyway. Galatians 2:20 says, “The life I now live in the body, I live by faith in the Son of God, who loved me and gave himself for me.”\nThat right there—living for Jesus—is living your best life.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram33.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Hebrews 13:16",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n Don’t neglect to do what is good and to share, for God is pleased with such sacrifices.\n—Hebrews 13:16\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram34.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 10:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The fifth and final step declares the assurance that we have in Christ Jesus.\nFor everyone who calls on the name of the Lord will be saved.\n—Romans 10:13\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Romans-5.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 14:13-23, 1 Corinthians 8:8-13, Ephesians 4:25-32, Ephesians 5:1-2",
        "devo_title": "The Law of Love",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 14:13-23, 1 Corinthians 8:8-13, Ephesians 4:25-32, Ephesians 5:1-2\nI’ve always heard this passage in Romans 14 interpreted according to clothing, music, alcohol, smoking, and more—all in terms of “not being a stumbling block for others.” I was tender to my power to be a stumbling block of every sort, both to the believing and the unbelieving, checking over my shoulder to see the carnage I’d left in my wake. Truth was, I left hardly any, but it didn’t stop me from metaphorically cutting off arms and legs, gouging out eyes and the like, in pursuit of protecting my brothers and sisters.\nThe Christian life, I thought, was more about what I couldn’t do than what I could.\nHow glorious, then, when the true gospel began to take root in my heart. I began to understand that freedom in Christ meant I was truly free to live. As it turns out, Christ had declared me more than clean. He’d declared me redeemed.\nFor all the ways I’d formerly applied this passage, though, the one I’d not considered was food. I knew all food had been declared clean, that we’re no longer under the law of Moses in our dietary restrictions. But what I didn’t understand was the law of our current world with regard to food: the diet and exercise industry. Everywhere I look, the acceptable Christian message of caring for the temple of the Holy Spirit turns into what I imagine Paul might’ve called the “god of the belly” (Philippians 3:19).\nIn Philippians 3, Paul warns of the dangers of gluttony. But today, in modern culture, the opposing god—though a no less despicable one—is the one who demands less food, more restrictions, better supplements, flatter stomachs, tighter abs, and the list goes on. In an attempt to care for the temples of the Holy Spirit with eating and exercising, we can destroy our bodies (which are wasting away, whether we like it or not) and cause harm to the impressionable hearts and minds of others who jump on every new regime or diet we offer.\nWe want to be well, to eat healthy, whole, good food. We love the rhythms of feasting and fasting we see in Scripture. We want to move our bodies, staying limber and active. But we don’t want to destroy our hearts by lusting after what we don’t have: slimmer physiques and sculpted thighs. We don’t want to destroy our bodies by rebounding from one quick-fix supplement to another. We don’t want to destroy our minds by believing our approval comes from certain lifestyles or appearances.\nThere are countless difficulties in life, opportunities to be divided over race, gender, theology, and history. And food, instead of becoming a means to crush those divides—to draw near to one another, armed with soups, fruits, breads, vegetables, and meats—has become one more line of division.\nChrist died for all; this is what the Bible says. I don’t want to be known by what I eat or don’t eat. I want to be known by how I love and Who I’m loved by.\nSo then, let us pursue what promotes peace and what builds up one another. Do not tear down God’s work because of food (Romans 14:19-20).\nWhatever struggle you’re caught in the throes of today, know that you are loved by Christ. He spread His own body, bleeding and broken, to fit a cross you could never bear on your own. Don’t destroy your own body by what you do or don’t eat. Christ died for all—every curve, every bulge, and every stretch-mark—all of it.\nFor “the kingdom of God is not eating and drinking, but righteousness, peace, and joy in the Holy Spirit” (Romans 14:17). God gives us food as a means of provision, not division. Instead of fostering false divisions today, let’s bake a cake, make a soup or a sandwich, and share it with someone in the pursuit of peace.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram36.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 15:1-21, 2 Samuel 22:50-51, Psalm 117:1-2",
        "devo_title": "Glorifying God Together",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 15:1-21, 2 Samuel 22:50-51, Psalm 117:1-2\nSome of my fondest memories as a kid include long summer days spent at the pool. These memories are filled with flipping off the diving board, shouting “Marco Polo,” and of course, playing King of the Mountain. The goal of King of the Mountain was to be the only one on top of the raft, ruling your kingdom by any means necessary. Growing up with brothers, I had to be scrappy and strategic to win at this brutal game. From a young age, I learned that only the strong survive.\nI’m told that as a grown-up, it’s not cool to push people off rafts at the pool. The thing is though, we still want to be on top. We just have different rafts now, and we’ve learned to defend our turf in more covert, “polite” ways. \nSo much of how we respond has to do with the season we’re in. When we’re treading water, we hope and pray for a gracious hand to help us onto the raft. But when we’re on top, it’s easy to become prideful in our position. It gets especially ugly when we believe there isn’t enough room on the raft for everyone. Even in the Church, we can foster the belief that the kingdom of God only has space for the “good” people, whether we’re conscious of it or not. \nIn our reading for today, Paul was writing to a Roman church comprised of two very different people groups: the Jews and the Gentiles. Even from its earliest days, it seems there were divisions amongst the believers in that region. Those who were “strong” didn’t want to help those they considered weak. But Paul challenged the Romans to accept one another, just as Christ had accepted them (Romans 15:7).\nPaul points out that even the strongest among us, Jesus Christ, did not use His power to please Himself. If anybody had a right to boast it was the Lord, yet He took our weakness upon Himself to the point of sacrificing His very life. \nWe are all in need of God’s grace. In that humility we can seek to be like Jesus, freely passing on the strength and encouragement that has been gifted to us. If the Lord of the universe humbled Himself and bore our weaknesses, how much more eager should we be to do the same for those whom He’s placed around us?\nIn addition to following the sacrificial example of Jesus, Paul also calls the Roman church to accept one another for the glory of God. When we’re competitive and exclusive in our churches, how do you suppose we’re seen from the outside? Our witness is compromised by our selfishness. But if we’re a countercultural people and can demonstrate with love and sincerity that there is room at the table of God, then we will have something divinely different to offer.\nIt’s tempting to believe the lie of this world, that we must fight to be on top. But in the kingdom of God there is always enough for everyone. As believers, we’re called to lay down our lives for others just as Christ did, to love both the strong and the weak. If we stop trying to protect our little rafts, together we will glorify and join in celebration with the one true King, who lives and reigns over all the mountains. \n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram37.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 15:22-33, Isaiah 52:14-15, Hebrews 2:2-4",
        "devo_title": "The Blessing of Christ",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Romans 15:22-33, Isaiah 52:14-15, Hebrews 2:2-4\nI like to know what’s coming—what could happen and what my options are. I think constantly about what works and what doesn’t. In short, plans are my jam.\nIn my final year of seminary, a job opportunity arose. It was one of those really great, safe jobs that worked in all the practical ways. I would have a plan—in case, you know, God didn’t come through. I walked through the interview process until the final meeting, when we were to discuss terms for my employment. That morning I confessed to God that I was more concerned about my five-year plan than His plans for me. Then I did what I knew I had to do: I walked into that last interview and said, “This is just not where I need to be.” \nAt first, I felt amazing, like that scene in The Devil Wears Prada where Anne Hathaway throws her cell phone into the fountain. Life felt extraordinary, like I was jumping off of the proverbial cliff of my ordinary, planned-out life into the unknown. Later, as I sat alone, it hit me: I had no backup plan and only a few months until graduation. Panic set in, and I did what most of us do in crisis. I told absolutely no one that I was struggling.\nOne Sunday, my friend Laura cornered me at church. She barely had to acknowledge the look on my face before I spilled my doubts and fears of being a failure and a fool. I felt shame. I didn’t know what to do. I didn’t even know how I was going to buy groceries that week.\nLaura didn’t miss a beat. She saw past the facade and grabbed my arm, looked me in the eye and said, “I don’t have an answer for you. But I can tell you that God is with you. Even when you can’t believe that, I’ll believe it for you.” Laura reminded me of the blessing that is mine as a follower of Jesus—a peace greater than my plans. \nPaul’s life was filled with adventure and excitement (think: shipwrecks and jail time) but he, too, was created for community. In Romans 15:23-24, he writes, “I have strongly desired for many years to come to you whenever I travel to Spain. For I hope to see you when I pass through and to be assisted by you for my journey there, once I have first enjoyed your company for a while.” In these moments we catch glimpses of Paul’s ordinary life, even in the midst of extraordinary journeys. \nI imagine he felt lonely at times. I wonder if part of him didn’t want to admit his own struggles. \nIn a moment of need, I didn’t even have the words to ask my friend to pray for me. But Paul’s letter reminds me that gospel community is the life we’re called to. Paul knew firsthand that when we experience fellowship within the body of Christ, we are experiencing the very kingdom of God. “I know that when I come to you,” he said to his fellow believers in Rome, “I will come in the fullness of the blessing of Christ” (Romans 15:29). Then he asked for their prayers. \nMay we be a people who confess aloud how much we need Jesus, and push one another back into His presence. We don’t simply write postcards from a distance and wish one another luck or prosperity. No, we have the honor of inviting each other to encounter the living God, the giver of salvation and peace.\n\nMelissa Zaldivar is a social in the world of academics and an academic in the world of socials. Ever the Enneagram Six, she likes to dream big, talk herself out of it, and then just do the thing already. She holds a Bachelor’s degree in Communications and Bible/Theology as well as a Master’s in Theology. Her passions include eating Jimmy John’s sandwiches, showing people pictures of her nieces, and nerding out over biblical languages. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram38.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 16:1-16, John 13:16, 1 Peter 5:14",
        "devo_title": "Greet One Another",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Romans 16:1-16, John 13:16, 1 Peter 5:14\nOf all of the roles I’ve had in my life, my least favorite, without a doubt, is “new girl.” \nShe’s clumsy and uncertain, always draining her phone battery with GPS directions to the grocery store and back home again. With brave intentions and shy tendencies, she’s perfected the art of introducing herself, yet allows her next-door neighbor to call her the wrong name yet again. She doesn’t know when trash pickup is or where to find the office break room. And her best friend, states away, knows she’s always on call for both late night and early morning pep talks.\nI’ve been the new girl enough times to know what makes her feel welcome. Paul has a pretty good idea, too. After all, he could have easily ended the book of Romans with chapter 15, one of the biggest mic-drop opportunities of all time. Instead, he reintroduces us to the gift God gave us in each other. \nAfter “amen,” Paul continues on with a crucial reminder: we are not alone. He introduces us to his friends by name, explaining their significance and telling us why we’ll love them. \nPhoebe, whom Paul reminds us is already our sister, is on her way to Rome (and may be the one carrying his letter!). He encourages us to befriend her and take care of her during her stay. Priscilla and Aquila, more dear friends, put themselves on the line for our buddy Paul. So, of course, we’re honored to greet them and their church. The list goes on and on, and as it grows, Paul continues to build up God’s people with encouragement, delivering each name as a lifeline to the full body.\nIn this intimate portrait of Paul and his fellow believers, we see a lasting truth: The body of Christ is a built-in reminder that redemption is an extraordinary reality for everyday people. \nIt’s easy to misread the Bible as “The Book of People Who Had It All Together,” when really, there’s only one Hero in this story. The simple truth is that we all need Jesus, and we all need each other. \nIn Romans, Paul emphasizes that God’s plan is good news. But his writing isn’t just for well-versed theologians—it’s for ordinary, faithful people living in small, unseen obedience. It’s for us. If you are in Christ, your name is written there among the greatness and glory of God’s plan.\nHere in our temporary home, we never stop being the new girl who needs to relearn grace and remember truth. But praise the Lord—we don’t have to do it alone. \nGreetings, friends. And peace be to all of you who are in Christ Jesus (1 Peter 5:14).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram39.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 16:17-27, Matthew 7:15-20, Jude 24-25",
        "devo_title": "Glory to God",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Romans 16:17-27, Matthew 7:15-20, Jude 24-25\nI took a personality test the other day, and I wasn’t thrilled with the results. It confirmed what I already knew: I avoid conflict like the plague. Put me in a tension-filled room and I’ll moonwalk away so fast, you’ll never even know I was there.\nI tell you this not to confirm that I was raised in the 80s (which I was), but so you’ll understand why I so desperately want to misinterpret today’s passage from Romans. I’ll show you what I mean.\nHere we’ve come to the close of the longest of Paul’s letters. We’ve heard him preach on sin and salvation, grace and faith, and now we’re leaning in to see how he’ll land the plane. What does one say to wrap up what would become known as the most comprehensive expression of the gospel in all of Scripture?\nHe begins his conclusion with a warning:\nNow I urge you, brothers and sisters, to watch out for those who create divisions and obstacles contrary to the teaching that you learned. Avoid them… (Romans 16:17).\nThis is where my comfort-loving ears perk up. Steer clear of those who cause problems? Avoid conflict at all costs? If that’s what our friend Paul is selling, I’m buying in bulk. But he continues:\n…because such people do not serve our Lord Christ but their own appetites. They deceive the hearts of the unsuspecting with smooth talk and flattering words (v. 18).\nNo smooth-talkers allowed? Yep, works for me.\nIn my humanity, I want Paul’s words to leave me right where I am: a well-intentioned gal who doesn’t like to rattle or be rattled. I want a divine endorsement for a head-down, hands-off way of living. I want to look to the folks on my right and my left and say, I’m fine. You’re fine. Everything’s fine. In short, I want to read Paul’s words as permission rather than admonition.\nHe keeps writing:\nThe report of your obedience has reached everyone. Therefore I rejoice over you, but I want you to be wise about what is good, and yet innocent about what is evil. The God of peace will soon crush Satan under your feet. The grace of our Lord Jesus be with you (vv.19-20).\nCrushing evil is not a passive activity. Our holy and sovereign God is currently and constantly at work, overcoming darkness with light (John 5:17). As Christ followers, our work is not passive either. We are called to right doctrine and right living—to cling to Christ and to His gospel, shunning all false gods and gospels that beg our worship. This is Paul’s parting reminder.\nIt’s true that I’m predisposed to being a coaster—a person who’d rather stay the course than question questionable coordinates. But the gospel Paul presents in this letter is not a matter of right or left. It’s a matter of life and death. The mystery of Jesus Christ has been “revealed and made known through the prophetic Scriptures, according to the command of the eternal God” (Romans 16:26). Our Savior has come. He has opened the way to God, the rescue and restoration of our wrecked, restless souls.\nThe truth is, you and I are not fine. We “all have sinned and fall short of the glory of God” (Romans 3:23). But in God’s great love and compassion, we have been “justified freely by his grace through the redemption that is in Christ Jesus” (Romans 3:24). What’s more, “since we have been declared righteous by faith, we have peace with God through our Lord Jesus Christ” (Romans 5:1). \nThis is the gospel. This is our hope. \nThis is what we cling to, what we live by, what we fight for—to the glory of the One who created us, saved us, and calls us His own.\nTo the only wise God, through Jesus Christ—to him be the glory forever! Amen (Romans 16:27).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram40.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Ephesians 5:1-2",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nTherefore, be imitators of God, as dearly loved children, and walk in love, as Christ also loved us and gave himself for us, a sacrificial and fragrant offering to God.\n—Ephesians 5:1-2\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-ROMANS-instagram41.jpg"
    },
    {
        "book_title": "Romans",
        "devo_passages": "Romans 15:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nNow that we’ve memorized the Romans Road for salvation, let’s commit to memory this benediction celebrating the completed work of Christ.\nNow may the God of hope fill you with all joy and peace as you believe so that you may overflow with hope by the power of the Holy Spirit.\n– Romans 15:13\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Romans-6.jpg"
    }
]