[
    {
        "book_title": " Romans",
        "devo_passages": "Romans 15:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nNow that we’ve memorized the Romans Road for salvation, let’s commit to memory this benediction celebrating the completed work of Christ.\nNow may the God of hope fill you with all joy and peace as you believe so that you may overflow with hope by the power of the Holy Spirit.\n— Romans 15:13\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/4-HRTRomans-6.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Ephesians 5:1-2",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nTherefore, be imitators of God, as dearly loved children, and walk in love, as Christ also loved us and gave himself for us, a sacrificial and fragrant offering to God.\n—Ephesians 5:1-2\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram41.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 16:17-27, Matthew 7:15-20, Jude 24-25",
        "devo_title": "Glory to God",
        "devo_summary": "\n                    \n                    It is time we outlaw cliffhangers. It’s fine when they happen between episodes in a series; it keeps us watching, engaged, eager for what’s next. But when we are left dangling at the end of a season, I want to call my congressman. And don’t even get me started on a resolution-less movie. \nWe need closure. We need the closing notes of “shave and a haircut.” We want to hear the “two bits.” Conclusions help us understand the point of it all. Today, at the end of Romans, Paul gives us the resounding note for the letter to the Romans—a doxology of praise: “To Him be glory forever!” (Romans 16:27).\nEverything and everyone exists for the glory of God. Our churches, our ministries, our jobs, our entire lives are given to us for the glory of the triune God. Do you live this way, submitted to His Word and eagerly living for the fame of His name? What does that even mean? What is God’s glory? God’s glory is the “Godness” of God going public—it is what we see of Him that moves us to worship.\nHow do the heavens declare the glory of God? They display things like wonder and majesty. By faith, we see the creative power and brilliance of God as clouds wisp across our patch of sky, gliding to other coordinates on this blue marble dangling in the cosmos. God displays His glory all around us. We are meant to look for it—to see it, to align with it, to spread it.\nThe gospel teaches us that we are not the point of our own lives—God is. He saved us for our good and His glory. Living for the glory of God means we agree with who God says He is, and we align our lives accordingly. We submit and serve. We enjoy and exalt. \nJesus’ death for our sins and His resurrection for our new life enables and empowers us to behold the glory and fame of God, and to worship Him for it. “Your sins are forgiven for his name’s sake” (1 John 2:12 ESV). We, the forgiven ones, rejoice at God’s glory because we reap the blessings of it.\nThe glory of God lasts forever. It isn’t trendy. Nothing will outdo the awesomeness of God. Don’t live in cliffhanger-mode, wondering what your life is all about. Jesus redirects our lives to His—one forever aligned to the glory of God. “Not to us, Lord, not to us, but to your name give glory because of your faithful love, because of your truth” (Psalm 115: CSB).\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram40.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 16:1-16, John 13:16, 1 Peter 5:14",
        "devo_title": "Greet One Another",
        "devo_summary": "\n                    \n                    The writer Mark Spragg grew up around horses. In fact, he called himself a “horseboy.” In his memoir, Where Rivers Change Direction, he tells of how he and his father trained their horses to “show them their heads”—in other words, to pay attention or be expectant when they were around. Spragg tells of how he could walk into another man’s corral and know the man—by the way his horses lounged—to be a horse’s, well, rear.\nI grew up around churches and the preachers who led those churches. I was a preacher’s boy. At the risk of oversimplification, I found two kinds of preachers: those who would greet all the people before a service began, and those who would be sequestered away somewhere in an office, putting the final touches on a sermon or praying or whatever. I could walk into other men’s churches and know the man—by the way the congregation didn’t expect to be greeted by him—to possibly be a fine speaker who could untie theological knots, but not much of a friend.\nThe primary text for today emphasizes how important valuing one another is. We make much about the “last things” Jesus said, and so give great importance to the Great Commission at the conclusion of Matthew’s Gospel. If we’re going to be consistent, we must give equal importance to how Paul concludes the weighty letter known as Romans: “Greet one another” (Romans 16:16). \nThis is not some drive-by where you wave at the crowd and use words like “Hey, everybody” or “Bye, y’all.” No, this is personal. People are known by name (Phoebe, Rufus) and also by some details about them—“who risked their own necks for my life” or “my dear friend in the Lord.”\nDo you greet people by their names instead of “Hey”? Do you know details about the people you come in contact with every day? Do you know anything about their story—not everything, but at least a few things? I realize some men are naturally outgoing while other men are quiet, even shy. I’ve found that has little to do with being a man who greets well.\nYou can tell a lot about a man by walking into his places of influence, and watching to see if the people raise their heads and eyes, expecting to receive the gift of a greeting. \nIn the name of Jesus and for the sake of His gospel, greet one another.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram39.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 15:22-33, Isaiah 52:14-15, Hebrews 2:2-4",
        "devo_title": "The Blessing of Christ",
        "devo_summary": "\n                    \n                    In any good story, the ending is the capstone. Sometimes it’s climactic. Other times, it’s the final sense of peace in a thrilling and uneasy storyline. In any case, the ending is most often the lasting impression of the work.\nPaul’s letter to the Romans is indeed a letter—it’s written as instruction and encouragement to its recipients. It has a greeting and a conclusion, and the meat of the letter is Paul’s teaching on various related subjects that the church in Rome was struggling with. Nonetheless, Paul is still telling a story with his letter.\nAs we have traced through this letter, we’ve seen the argument Paul has built: we’re all sinners deserving of death, but we are saved by grace through faith and God calls us to live in light of this fact. The death that sin brings is just as real as the life Jesus brings—but that life has swallowed up death. We can place our hope in this. This is our peace.\nAs Paul concludes the letter, he seems to tie a bow on the whole story. He’s not just saying goodbye to some friends; he’s leaving them with an ending to the story. He’s putting a final touch on the picture of God’s glory that he’s just painted.\nPaul thanks the church for their kindness, but he makes a greater point: the mission is bigger than just them (Romans 15:26-28). The blessings of Christ—this gospel Paul and all of us have been called to preach—is a worldwide mission. Paul needs to take the encouragement and support of the gospel to both the Jews and the Gentiles. The good news of the gospel, the blessing of Christ, is meant to reach every corner of the world (Matthew 28:18-20). So Paul concludes his letter by asking the Romans to pray for him, and to pray for the Spirit’s work in the world.\nDon’t overlook this conclusion. It is not an add-on to an otherwise majestic theological book. It is a theological statement about how the gospel is meant to move and work. The gospel is meant to come to us, and flow through us to others. This is what Paul wants for himself and for all believers. \nLet’s heed Paul’s request to the Romans and pray for the blessing of Christ to infiltrate the hearts of people all over the world.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram38.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 15:1-21, 2 Samuel 22:50-51, Psalm 117:1-2",
        "devo_title": "Glorifying God Together",
        "devo_summary": "\n                    \n                    We are prone to look at success, both worldly and spiritual, as merit, rather than grace. Whenever I think I have grown spiritually, I am tempted to pat myself on the back and feel smug. My heart can take a generous compliment and turn it into entitlement in no time at all. But genuine spiritual growth doesn’t turn our eyes self-ward, nor does it set us on a pedestal to receive honor. Instead, spiritual maturity is manifested in humility and service. This is so because all of life is doxological; it is aimed at one thing: the praise of God.\nPaul opens this passage with a clear instruction that grows directly out of this doxological aim: strength, authority, power, and influence are not for self-gain or personal honor. In a culture of self-worship, this is a radical notion. But this radical idea is a hallmark of Christianity, for Christ did not please Himself. He exchanged glory for lowliness, power for humility, and even life for death. This is not just about earthly gains, wealth, and blessing, but about spiritual strength. \nFor those who follow Christ, Paul says, the life of service to others is not an option but an obligation, for Christ became a servant. Closeness to Christ leads to the building up of the saints in harmony. It produces the fruit of love and service, not of self-serving pride.\nFor this reason, Paul declares, “I would not dare say anything except what Christ has accomplished through me” (Romans 15:18). How easy it might have been for Paul to claim honors for himself for the success of his ministry! But Paul’s great legacy as an apostle to the Gentiles came about because of the grace given him by God. The root and the fruit of the Christian life are all of grace, so that no man may boast except in the work of Christ. Therefore, where grace is at work, gratefulness, service, encouragement and harmony results. \nChrist’s glorious humility brought salvation to Jew and Gentile alike, that all nations might bring Him praise. For great is His steadfast love toward us, and the faithfulness of the Lord endures forever. \nWhen we see the glories of the gospel, delivered to an undeserving and needy people, our tongues are set free to echo God’s praises. May the God of hope fill us with all joy and peace in believing, so that by the power of the Holy Spirit we may abound in hope, to the praise of His glory.\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram37.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 14:13-23, 1 Corinthians 8:8-13, Ephesians 4:25-32, Ephesians 5:1-2",
        "devo_title": "The Law of Love",
        "devo_summary": "\n                    \n                    Remember when you first got your driver’s license? All that freedom, all that road, all that speed. You could go anywhere and do anything—except break curfew or give rides to other teens or to girls or speed or run red lights or take long road trips. Freedom has its limits, at least it ought to, especially to protect the less mature.\nIn Romans 14 we see a scenario in which freedom and limits are again in tension. Now that the Old Testament laws of cleanliness and purification were in the past, it meant that any food or drink was pure, so people were digging in. But this caused issues for other believers still more closely connected to the old ways. Their consciences were pricked by this new freedom—it felt wrong to eat or drink these new things, or even be in proximity to them.\nSo on one side we have people exercising their freedom in Christ. On the other side we have people abiding by their consciences. Both good things, but in tension.\nPaul brings the tension back to the heart. He points out that food and drink are not the issue. The issue is love. People on one side were prioritizing their freedom above the hearts of fellow believers and causing them to struggle. He points out that, clean or not, if food or drink is seen as questionable by someone, then for that person to consume it would be sin. The liberated person should set aside their freedom temporarily in order to show love.\nThe church is a body and a family. When one part works in conflict with another, it breaks down. One person’s freedom in Christ cannot be a license to push another person into conflict with their conscience. All actions, attitudes, and convictions in the church must be done and held in such a way as to build up and support. They must pursue love. \nThe self-sacrifice of setting aside liberties is an indication of spiritual maturity. It shows that love for brothers and sisters is of greater value than one’s own freedom or pleasure.\nBelievers are no longer under the old law, but neither can we grab our freedoms and revel in them for our own happiness at the expense of others. We are free because of God’s profound love and grace through Jesus, so love and grace and Christlikeness must be the marks of our freedom. \nSometimes we will revel and eat or drink to our great pleasure. Other times we will sacrifice our freedoms for the sake of our brothers and sisters who have yet to discover the guilt-free freedom of Jesus. This is true maturity proven by love.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram36.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 10:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The fifth and final step declares the assurance that we have in Christ Jesus. \nFor everyone who calls on the name of the Lord will be saved.\n—Romans 10:13\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/4-HRTRomans-5.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Hebrews 13:16",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nDon’t neglect to do what is good and to share, for God is pleased with such sacrifices.\n—Hebrews 13:16\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram34.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 14:1-12, Colossians 2:16-17, Hebrews 10:19-25",
        "devo_title": "The Law of Liberty",
        "devo_summary": "\n                    \n                    A Christian is to honor God with all the decisions he makes. This means our decisions—what to wear, eat, watch, etcetera—should not be first and foremost about what we like or want, but about what God likes or wants. In whatever we do, “we live to the Lord” (Romans 14:8; 1 Corinthians 10:31).\nSimply put, personal preference cannot be the ultimate arbiter of our decisions. We may like how certain clothes look or feel, and that’s good; but the first question we must ask is, “Will this honor God?” We may like certain foods for their nutrition or taste, but the primary consideration is, “Will this be pleasing to the Lord?”\nNow, I have good news for you: God is pleased with a LOT of different clothes and foods. From togas to t-shirts, He gives us great liberty. The same is true of food. You can go for the green smoothie or hit up Five Guys for a juicy hamburger. Both are well within the scope of God’s pleasure.\nOf course, as you make these decisions, principles of modesty, stewardship, freedom, and wisdom are in play. Paul reminds us elsewhere that, though something may be permissible, it is not always profitable (1 Corinthians 10:23). You have things to think about when you pick out that garment or order from that menu. Your life is not your own (1 Corinthians 6:19-20). In all our decisions, we must honor God and love those around us.\nBut remember, it’s a problem if we begin to judge others by our own particular convictions and choices when the Lord has given them freedom. Or worse, when we demand that others conform to our convictions when Scripture demands we extend liberty.\nLet me go back to the food illustration. Maybe today you’re munching on carrots and celery for lunch out of a commitment to be a good steward your physical body (Matthew 25:14-30), while your fellow Christian coworker across the table downs a cheeseburger as an expression of freedom and a celebration of the cleanliness of all foods (Acts 9:10-16). Which one of you is right? Don’t answer—it’s a trick question. You both have a biblical basis for the particular choices you’ve made, and you can both honor the Lord in the decisions you’ve made. What’s essential is that you are “fully convinced in your own mind” (Romans 14:5) and that you open-heartedly welcome the other’s convictions as well (Romans 14:1-3).\nWe live this way because God has already “welcomed” both carrot and burger eaters into the kingdom of Jesus Christ. It is only through grace, not perfect decision-making, that we will be able to stand at the end of time (Romans 14:4). And so we follow St. Augustine’s old dictum, “Love God and do what you will.”\nWhen Jesus is the true unifying point of community life, wine connoisseurs sit down with teetotalers and there’s not a hint of judgment. Meat eaters break bread with vegetarians, and neither looks down their nose at the other. \nWhen we’ve truly tight-gripped the gospel, we gain the liberty to hold many other things loosely, or freely. And that’s just how God would have it. \nWritten by Nate Shurden\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram33.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 13:1-14, Daniel 2:19-23, Hebrews 11:32-40",
        "devo_title": "Christian Duty",
        "devo_summary": "\n                    \n                    “The hour has already come for you to wake up from your slumber, because our salvation is nearer now than when we first believed” (Romans 13:11).\nHave you ever overslept? You know that feeling, the one where you look at the clock on your bedside table and you realize you’re already a half-hour late to that crucial meeting or final exam? Panic sets in, and your entire day feels completely thrown off.\nDid you know that it’s possible to be spiritually asleep? Elsewhere in his letters, Paul seems to use this language to describe those who are either physically or spiritually dead, but here in Romans 13 he seems to be addressing believers (“…nearer now than when we first believed.”). Paul is worried that his readers are going to miss key encounters with the Spirit and power of God because of their spiritual complacency. This concern, of course, extends to us too.\nPaul cautions the church in Rome because he can see a cycle forming. Spiritual complacency and sleepiness is not a singular issue, but rather one that ripples outward. When you atrophy spiritually, it affects many of your decisions, which in turn further diminishes your spiritual strength. The cycle Paul is worried about in Romans 13 looks something like this: Spiritual apathy leads to compromising sin choices. These behaviors lead to a more spiritually numb life, which leads to more bad choices, and so goes the cycle.\nPerhaps you’ve felt yourself stuck in a pattern like this. It can feel like being trapped on a treadmill where you have no control over the speed. Thankfully, Paul calls us all to a different, more fruitful way of living. “Rather, put on the Lord Jesus Christ” (Romans 13:14 ESV). Another translation reads, “clothe yourselves with the Lord Jesus Christ” (NIV). \nBreaking the cycle of spiritual sleep and unhealthy choices starts with a change in our understanding of who we are. We are meant to see ourselves under, in, and through the life and work of Jesus Christ and His calling over us. With this shift of our internal compass and posture, we are able to combat the cycle of spiritual sleep and distance from God.\nIf you’re reading this and feel like you’ve overslept, the good news is that it’s never too late to break your cycle or get back on track. You are a new creation and can be “clothed with the Lord.” In that place of spiritual redemption, you can choose this day “to put aside the deeds of darkness and put on the armor of light” (Romans 13:12). One of the thieves on the cross next to Jesus found this to be true in his final moments. It is never too late to make Jesus the fullness of your identity. \nTake that step today.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram32.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 12:9-21, Matthew 5:44-47, 1 Corinthians 4:6-13",
        "devo_title": "Christian Ethics",
        "devo_summary": "\n                    \n                    “Detest evil; cling to what is good” (Romans 12:9).\nThis makes me think of two scenes from two of my favorites books.\nScene 1: In Jane Austen’s Pride and Prejudice, there is a scene where Darcy is relating the sordid lifestyle of Wickham so as to dispel a rumor that Wickham is a valiant man who has been wronged by Darcy. The opposite is actually true. In fact, Darcy had been generous to a fault with Wickham, and Wickham chose a prodigal lifestyle without ever returning gratitude. In the movie, as he is telling the story, there is a scene of him walking in on Wickham, who is with a woman. And the look on Darcy’s face is one of barely being able to look at what’s happening in front of him because of how evil it is.\nScene 2: There is a scene in The Road by Cormac McCarthy when the son asks the father if they are still the good guys. The father had done something to protect them, and the son was unsure if they were still on the side of good. I’ve read this book now at least five times. Each time I am moved by this scene. In McCarthy’s nightmare, where so much evil is surrounding them and demanding things from them, this young boy is concerned about him and his father being the good guys.\nI think those two scenes sum up pretty well what Paul is wanting from the Roman Christians and from us in today’s passage. Paul wants us to regard evil as though it is hard to look upon, not because we are judging people and looking down on them in their sin, but because we know the harm evil does. \nThis is reason Christ died: to defeat evil once and for all. We are called to detest evil—like Darcy.\nPaul wants us also to cling to what is good—the way McCarthy’s boy clung to a desire to be good in the midst of a world where the darkness of evil and suffering and hurt had descended like an ever-present fog. In that scene, McCarthy’s apocalyptic world is not so different from the one we know at present. We’re called to cling to what is good.\nWhere do we get help to live out Romans 12:9? At the foot of the most evil act that did the most good: the Cross. The focal point of the gospel is the ultimate act of evil, and God’s ultimate act of detesting it and doing the ultimate good.\nThere, at the cross, sin was defeated. Above every event that ever was, this one is good beyond all human measurement. When we need help detesting evil and clinging to what is good, we can cling to the cross and hold fast.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram31.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 12:1-8, Hebrews 13:15-16, Ephesians 4:1-16",
        "devo_title": "A Living Sacrifice",
        "devo_summary": "\n                    \n                    What does it mean to be a living sacrifice? Consider a couple of everyday examples: marriage and parenthood.\nMarriage and parenthood are two of the most significant relationships people have in life. They are also two of the most demanding. Both ask for sacrifices not fully known before the “big day.” How many times have you talked with engaged couples or expectant parents and listened as they painted a glorious picture of what they thought their upcoming life would look like? And if you are already down those roads a bit, how many times have you heard this and thought, They just can’t see how many surprises await. \nIf you have traveled the road of marriage or parenthood for any significant distance, you know what’s involved. You know the coordination, the patience, and the sacrifice required. I remember a few years ago when talking with an engaged couple. The husband-to-be said, “You married people are sometimes the worst advertisements for marriage.” Surprised, I asked what he meant. He said married people often seem to take it upon themselves to warn young engaged couples about how hard marriage is. \nOf course, some of the “advice” is terrible, like: “Are you sure you really want to give your life to serve someone else?” “You really don’t know what you are signing up for.” “There goes your freedom.”\nMarriage is a sacrifice. No one argues that point. Sadly, those who make comments like these don’t seem to get the joy of living as a sacrifice. Laying down your life for another is a learned joy; it comes from humility, from valuing the other more than yourself.\nMarriage and parenthood are challenging. They are examples of the biblical call for self-sacrifice. But sacrifice is a beautiful challenge. When we sacrifice for the right things, we are shaped into a humble people, and joy is the result.\nIn our Scripture today, God calls us to be a living sacrifices (Romans 12:1). This is a beautiful thing—living while sacrificing. Just like the engaged couple that is unaware of the joyful sacrifices ahead of them, the Christ follower is also blissfully unaware of the joy that awaits him when he learns to function as a living sacrifice.\nFollowing Jesus costs us everything, but it gives us everything we really need, too. Consider what it means to present your bodies as living sacrifices, and take courage in the beautiful challenge of resting in Christ in deeper ways than you ever thought possible.\nWritten by Jason Tippetts\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram30.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 11:25-36,  Isaiah 40:13-15, 1 Corinthians 12:4-11",
        "devo_title": "The Depth of God’s Wisdom",
        "devo_summary": "\n                    \n                    A couple months ago, I was talking with my mom about how we do allowances for our kids. I said to her, “Remember how you used to do it when I was a kid? You’d put all those little sticky notes on the fridge with chores and dollar values on them, and we’d take them off and put them in a pile as we did them?” \nMom said, “Oh, we tried all kinds of things.” \n“Really? That’s all I remember,” I said, surprised. \n“I think we tried that method out for a few weeks, but that’s it.”\nIt’s funny how we remember the passage of time, isn’t it? There are things I did as a kid for only a few weeks which I remember as having done for years on end. Now a parent myself, I try all sorts of things with my own kids that might only last a week or two, but I bet when they’re grown they’ll have memories of some of those things and think we did them all the time.\nHere’s my point: the older get we, the more trouble we have remembering how things actually happened. We compress timelines. We think we did certain things all the time when we actually didn’t. And some things we did do all the time, we may have forgotten entirely. We can begin to lose our hold on the foundational truths of what really happened. \nThis is not so with God.\nIn today’s passage from Romans, Paul reminds his readers that God has been at work among His people for a long, long time. The Christian faith is undergirded with realities that have stood since before we were born and will remain long after we’re gone. \nGod has given gifts and issued calls to His people that we are likely to forget. Paul’s point is this: Whether we remember them or not, God’s gifts and callings stand. Our memory of them, or lack thereof, does not erase them.\nGod’s gifts are what He gives us, the His calling is where He leads us. In our passage, Paul is referring to the gifts God gave Israel (listed in Romans 9:4 as “the adoption, the glory, the covenants, the giving of the law, the temple service, and the promises”) and their calling, which is the promise of salvation. These, Paul says, are irrevocable.\nAs with Israel, God gives us both an eternal calling to the life to come, as well as gifts to use in this life here and now. We cannot “forget” them away. Passages like Romans 11:25-36 remind us that God has been at work since the beginning of time. God knows our hard-heartedness and sin better than we remember it, and He gives us a mercy greater than we suspect we need.\nAdmit that your memory, when it comes to sin and grace, can sometimes get a little fuzzy. And when you do, rest in the fact that God’s promises do not hinge on our ability to remember them. He remembers them perfectly, and they are irrevocable.\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram29.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 10:9-10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The fourth step shows our response to the solution God provides: confess and believe.\nIf you confess with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved.  One believes with the heart, resulting in righteousness, and one confesses with the mouth, resulting in salvation.\n—Romans 10:9-10\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/4-HRTRomans-4.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Ephesians 2:8-9",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nFor you are saved by grace through faith, and this is not from yourselves; it is God’s gift —not from works, so that no one can boast.\n—Ephesians 2:8-9\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram27.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 11:1-24, Hosea 14:4-7, Ephesians 2:8-9",
        "devo_title": "God’s Kindness and Severity",
        "devo_summary": "\n                    \n                    It’s an odd thing when fans of a team say, “We won.” Did we? Sure, our favorite team may have won the series, the game, or what have you—but the fans? Did they win too? In a real way, yes they did. They were a part of the experience. There was a bond between the team and its fans, which facilitated a shared moment of joy.\nBut imagine a fan bragging about his victory more than the team’s MVP does. Picture him filled with pride, talking himself up, discounting Tom Brady’s feats in the Super Bowl, or LeBron James’s guts in the NBA Finals. It seems a bit ridiculous, doesn’t it?\nAs crazy as it seems to think that we not only help our teams win, but deserve the trophy too—how insane is it for us overlook God’s grace when we think about our own standing in this life? \nThe Lord’s offer to save sinners through the death and resurrection of Jesus Christ is a total act of God. Our efforts bring nothing to His saving grace. We can’t muscle our way into the New Covenant. God’s kindness is at work in our salvation. He sustains us. This is what we celebrate. His victory is our victory.\nAs men, we are often tempted to compare ourselves to others, seeking a little ego boost to make ourselves feel better. We wrongly think we are more worthy of salvation than others. We may even believe God saved us because of all the great things we offer to His cause. But salvation is about a God who is rich in mercy, even when we were dead in our sins. \nPaul reminds us that apples don’t keep the apple tree going. The fruit doesn’t sustain the root. It works the other way around. There is no place for pride in the Christian life. We boast, not in ourselves, but in the cross—in Christ’s death for our sins (Galatians 6:14).\nWhenever we are tempted to crank up our self-importance, we must remember that God’s kindness is what justifies our entire lives. Knowing the gospel, reading and enjoying the Bible, serving in the Lord’s name—these are all launched and sustained by His kindness. God gets the credit. He saved you. He is saving you. He will save you. \nEnjoy and exult in God’s kindness. Rely on His strength. It’s the only way to live.\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram26.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 10:1-21, Isaiah 52:7, Joel 2:32, Galatians 3:7-14",
        "devo_title": "The Message of Christ",
        "devo_summary": "\n                    \n                    I hope you’re not like me. But I bet you are, at least when it comes to what we hear in the news these days. I’m suspicious of everything that bangs my eardrums. \nDiscerning fact from fiction in this digital age is now a full-time but necessary job. The whole intent behind fake news is the spread of misinformation, hoaxes, bogus stories, or whatever you want to call them. It’s not that this is some new phenomenon, but that the reality of social media brings an ease of spreading the stuff like never before.\nPreachers and teachers and writers and communicators of the gospel find themselves in this cultural moment. But all of us as people of faith do too, in a very real sense, for we all have a platform nowadays. And into this fact-checking mentality and culture we bring Scripture, which is filled with strange stories of people being made from dust and ribs, and axe heads that float on the surface of the water. Then there’s that virgin birth that eventually led to a man who claimed to be God but then died but then decided we were all better off with Him alive, so He un-died and is still around today. \nIn the minds of some, Christians are the original fake-newsers. Who in their fact-checking mind would believe our message? And what are we supposed to do about it?  To borrow a line from some actual news of late: Nevertheless, we must persist. But as we persist, we must be diligent to not fall into the spreading of what some call the larger category that includes fake news: bad news. \nThe good news is that if we’ll simply stop trying so hard to save ourselves, we’ll find that there is One who has already taken care of all that and then some. His name is Jesus, and His ears are poised and ready to respond to all who would call on Him—Jew or Greek, free or slave, American or Arabic, doctor or school bus driver, grandparent or hipster.\n“For everyone who calls on the name of the Lord will be saved” (Romans 10:13).\nWhen we fact-check that verse, we find that the phrase “everyone who calls” means, well, everyone who calls. And we find that “the name of the Lord” is Jesus, that virgin-born man who claimed to be God. And that last phrase—“will be saved”—is a fact you just have to take on faith.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram25.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 9:20-33, Jeremiah 18:1-6, Ephesians 1:11-14",
        "devo_title": "Righteousness through Faith",
        "devo_summary": "\n                    \n                    Wrath.\nThat word is uncomfortable for anyone to hear, much less from God Himself. Isn’t He loving and merciful and kind and gracious? How can a good God be wrathful toward people?\nThis passage in Romans 9, among many others, raises tough questions about God’s character. Good questions. Questions that God doesn’t mind you asking and that He can handle.\nHow can a good God be wrathful toward sin? He can because He is a good judge, and good judges rightfully hate and push back against evil. We want a God who says, “I am here to not allow injustice to reign as king. I am here to reign as King against injustice.” \nBecause God is perfect, His wrath isn’t like ours—it’s an outflow of His perfect love and goodness. And because of this great love, God calls us to place our faith in His righteousness and not our own.\nWe’re clay, created by God to worship Him. When we try to earn our salvation, we miss the point of our existence. This was Israel’s greatest mistake.\nIf you read through the Old Testament, you see Israel obeying and then disobeying God, worshiping Him and then worshiping idols, ultimately placing their hope in something other than God’s unmerited favor. Israel tried and tried to work for their salvation, and they even questioned God for not rewarding their efforts. But God’s not interested in our white-knuckled efforts. He’s interested in our faith driving us to love Him and others.\nGod is not surprised by sin, but that doesn’t mean He’s ambivalent toward it. God is not surprised by unbelief, but that doesn’t mean He’s satisfied with our misplaced worship. In fact, He cares so much that He sent His Son to live the life we couldn’t live and die the death we deserve.\nMay we not be bitter or angry toward God like the Israelites, questioning His character because we don’t like something He’s said or done. Instead, let us lay our lives down for Him because of His righteous, perfect character. He is good and He does good.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram24.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 9:1-19, Exodus 32:30-32, Ephesians 1:3-6",
        "devo_title": "God’s Mercy and Compassion",
        "devo_summary": "\n                    \n                    Imagine you are in a courtroom on trial for a crime you know you committed. In fact, everyone knows you are guilty. The ruling will come down and you will be condemned—there’s no way around it. \nThe judge looks at the evidence and listens to the testimony of witnesses. But then, in a dramatic turn of events, he picks up the gavel and, striking the bench like a hammer driving a nail, renders the verdict: “not guilty.” \nYou and everyone else know you are guilty of the accusations brought against you. But the judge has shown you mercy.\nThe reality is that every person saved by Jesus has been shown mercy like this. “Guilty” is the only verdict any of us deserve, and apart from Christ, it is the ruling rendered upon all men and women on this earth. All our wrongdoing and wrong-loving has stood trial, and the evidence against us is insurmountable.\nThough we do not deserve to be let off the hook, God is the only judge who can and does show mercy to anyone He desires. Some might say that pronouncing a verdict of “not guilty” upon someone who is clearly guilty is unfair, and they are correct. The unfairness of this forgiveness God grants through His mercy is called grace. Grace cannot be earned, but is a gift given by God to an otherwise hopelessly guilty people.\nMercy and compassion are gifts God gives for His good pleasure, but they are not free. God does not just let us off the hook. A price must be paid for our sin. God, in His compassion and mercy, gave His only Son, Jesus, to pay the penalty for our violation of His law. \nGod will show mercy upon whom He will show mercy. But He does not set people free without penalty. That would be unjust. He pays the wage of our sin through the blood of His Son. This is our hope: the perfectly just mercy of God, given to those who do not deserve it, through the undeserved sufferings of Christ in our place. \nWhat a great mercy! What a great cost!\nWritten by Jevon Washington\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram23.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 8:26-39, Psalm 44:17-22, Philippians 1:6, 2 Thessalonians 2:14",
        "devo_title": "The Believer’s Triumph",
        "devo_summary": "\n                    \n                    “If God loves me, He will _____.”\nWhat words would you use to fill in that blank? Most often when we answer this question, whether privately in our hearts or more boldly, we limit the love of God. We attach His love to the circumstances or results we want. We draw a straight line between God’s love and our comfort.\nRomans 8 paints an altogether different picture of a love so much bigger, richer, deeper, and more complete than anything we are even capable of imagining. It isn’t a contingent love or one designed to dole out creature comforts. It cannot be cheapened by our color-by-number effort to depict it. Romans 8 is a masterpiece of God’s love, which is intended for our good.\nIn Jesus we live loved. We breathe love and exist each moment ensconced in it. No one can condemn us. No one can judge us. No enemy can assail us. Yes, we will be condemned, judged, and assailed in this world, but no one can remove us from Christ’s love. Our own fears and insecurities, even our own death, cannot remove us from the love of God.\nThis profound love of God was ours before we were conscious of it, and will be ours for all eternity to the fullness of our joy and glorification. God promised to complete the good work He started in us (Philippians 1:6), and He will—through the transformative power of His love. \nWhen Romans 8:28 says “all things work together for good,” this is what it means: not that every painful or confusing moment will pay out in happiness, but that God’s love will not fail. We will reap its benefits throughout infinite time.\nIn this single passage we see the fullness of God—Father, Son, and Spirit—offer the fullness of His love to those who believe. The Spirit intercedes on our behalf when we lack the words or ability. The Son sacrifices Himself as the means—the access—to this rich love. The Father is the ordainer, author, and giver of the eternal plan of love. And we are part of it, in it for all time. \nWe may never get what we filled in the blank with above—that thing we attached to God’s love, that trite and limiting expected sign of His goodness. Instead we will be more than conquerors in eternal glory, no matter what we face in this temporal life.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram22.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 5:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The third step presents the solution to our problem: Jesus. \nBut God proves his own love for us in that while we were still sinners, Christ died for us.\n—Romans 5:8\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/4-HRTRomans-3-.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Galatians 5:13",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n For you were called to be free, brothers and sisters; only don’t use this freedom as an opportunity for the flesh, but serve one another through love.\n—Galatians 5:13\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram20.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 8:18-25, Isaiah 65:17, 1 Thessalonians 4:13-18, Revelation 21:1-6",
        "devo_title": "From Groans to Glory",
        "devo_summary": "\n                    \n                    I turn 40 years old this year—the prospect of which brings several realizations. First, I’ve come to understand that time moves every bit as fast as others told me it would back when I was in my 20s; and, second, I can do just about every physical act I did in my 20—but I need more time to recover. \nThe strength and vigor that once marked my life is now replaced with pains and groans. This unwanted experience has served to better my appreciation for the Apostle Paul’s references to groaning in Romans 8:18-25. In that place, Paul sets the hope of glory against the backdrop of the groaning of this fallen world.\nWe live in a world that God has subjected to futility (Romans 8:20). Everything around us is groaning under the burden of the fall of man. The fall of Adam brought misery to the entire created order. The turmoil in the world is not simply limited to the turmoil between nations and peoples. There is an innate groaning among all creatures in the animal kingdom, too. There is even a groaning among the trees and vegetation. \nAll of creation is crying out for something better. \nThis is one reason why the prophet Isaiah speaks of the glories of the new heavens and new earth under the symbol of the lion laying down with a calf in peace (Isaiah 11:6). It’s why the psalmist speaks of the trees clapping their hands at the prospect of the Lord coming to judge the world in righteousness (Isaiah 55:12). In one very real sense, the entire creation is like a woman in labor. This old, broken creation is eagerly anticipating the new creation that Christ has secured and will deliver by His death and resurrection. \nThere is, however, also the groaning of the people of God who have been subjected to the sufferings of this present life. This groaning is tied to the persecution believers endure at the hands of unbelievers—both in the church and in the world. There is a tremendous burden in the sufferings believers must bear up under as they press on to the hope of glory. But there will come a day when believers will be set free, in body and soul, from the sufferings of this present age and will be ushered into the inexpressible glory of everlasting life.\nWhenever we hear or feel the groans of this life—whether in the created order around us or in our own hearts—we must remember that there will come a day of glory for creation in general and for believers in particular. All temporal groaning will end and eternal rejoicing will commence when Christ comes in glory to raise His people from the dust.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram19.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 8:1-17, Isaiah 53:10, Mark 14:32-36",
        "devo_title": "Joint Heirs with Christ",
        "devo_summary": "\n                    \n                    October 31, 2017, marks the 500-year anniversary of the day Martin Luther nailed his Ninety-Five Theses to the door of All Saints Church in Wittenberg, Germany. Luther’s burning conviction was to preach that salvation came to God’s people only by miraculous grace through faith in Jesus Christ. Now, there were other monks and priests at the time with similar convictions, but it seems clear that Luther’s intense study of Romans was his tipping point. In passion and in conviction, he penned and posted a document that would change the face of the Church in the West forever.\nLuther knew from Paul’s letter to the Romans that the Spirit of God alone could mark us as children of God. Good works, good intentions, and good gifts to the church or the poor weren’t without value, but they could never stand as being able to save anyone in and of themselves.\nThe very good news of Romans is the same very good news of the Gospels: God entered the world, a world that He had created perfectly and that we, through sin, had marred. God sent His Son to bring us life everlasting. This life, as Paul so clearly points out here in Romans 8, comes with and through the gift of the Spirit, Who produces spiritual fruit in our lives.\nJesus said to His disciples that we could be recognized by our fruits. There seems to be a very similar thread here in Romans 8. Life in the Spirit is marked by the fruits of the Spirit. Paul is not only giving a promise here, but also a quick spiritual litmus test for our own lives. When we, as believers, examine our hearts, actions, and decisions, do we see a pattern of Spirit-filled movement? Of course, we will still see sin. In fact, both Jesus and Paul acknowledge this. But it should be troublesome to us if we see a continuous pattern in our lives incongruent with the marks of the Spirit.\nThe good news is that if you choose to be led by the Spirit, you can have confidence in your place as a child of God. Paul proclaims: “If the Spirit of him who raised Jesus from the dead is living in you, he who raised Christ from the dead will also give life to your mortal bodies because of his Spirit who lives in you” (Romans 8:11). \nThere should be evidence of the Holy Spirit’s work in the Christian’s life. But as Martin Luther contended, that spiritual fruit does not come through our work. In today’s passage, Paul encourages us that we have the power of God—the same power that raised Jesus from the dead—living in us to help us produce that spiritual fruit. \nWhen you’ve placed all of the good, the bad, and the ugly in your life at the feet of Jesus, you have the Spirit of God as your advocate. He is the one Who testifies with our spirit that we are the children of God. \nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram18.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 7:14-25, Galatians 5:16-26, 1 John 1:8-10",
        "devo_title": "The Good I Want to Do",
        "devo_summary": "\n                    \n                    My dad was a pastor, so I was pretty familiar with the Bible growing up. Check that. My dad was a Southern Baptist pastor in the 70s and 80s, so I grew up doing sword drills and memorizing Scripture as part of the air I breathed as a kid. But it seems now there was a lot of the Bible we touched on and a lot we skipped over.\nLike Romans, for instance. I knew a lot of this book. I knew the “Roman Road to heaven” in high school. But there was a lot in this book I did not discover until college.\nTake Romans 7, for example. I can remember the first time I got ahold of Paul’s own wrestling. I can remember the “aha!” moment pretty well, actually. I remember it so well because of how it made me feel less alone in my struggle with sin. Whether it was in my own head or because I heard someone say it, I walked away with the thought, “so this is the Christian life.”\nThat was a pretty revolutionary moment. Up until then I’d bought into the idea that if I was a real Christian, I would not struggle with sin as Paul describes. I would always be saying no to sin and yes to righteousness. What felt like a cosmic battle between good and evil within my own heart, which often made me feel sick to my stomach, was surely a sign of how carnal I was.\nBut this was Paul. Paul was the man. And it was clear he struggled too.\nThat was a beginning a for me. I felt less alone and more free to talk about my struggles instead of pretend to have it all together. It was a slow process, but it was sure. As one who wanted to follow Jesus and be holy, I was glad to know that struggling was a sign of fighting. And fighting was a sign of following Jesus.\nI think we assume sin will kind of fade away from us as we grow in the faith. And that is true to a point. As Paul taught in chapter 6, we have been set free from sin (6:18). But there will be seasons when we struggle in big ways. And as we grow older and wiser, we will see our sinfulness and our need for His grace more clearly. So really, what Paul reveals to us is good news: We will struggle. But that means we are fighting. And fighting is a dead giveaway that we are believing the gospel and following Christ.\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram17.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 7:1-13, Proverbs 1:19, John 14:6-7",
        "devo_title": "How Can Death Bring Life?",
        "devo_summary": "\n                    \n                    Death takes more than it brings. It takes not just people, but relationships and dreams and future plans. Death is more of an intruder than an invited guest. It brings tears and a church gathering where awkward small talk with strangers is accompanied by deviled eggs and cucumber sandwiches.\nPersonally, I hate death. I hate the emotions it brings and the loss it forces me into. I hate that it even exists. I will admit that my hatred for death is a selfish hatred. To be forced to lose my people, my relationships, and my future dreams hurts.\nDeath, at its core, reminds me that I am not in control. This life is not about my plans. Death is a deep reminder that something is seriously wrong. It pushes us to admit that this world, in its present state, is not where we belong.\nSo if we don’t belong here, then where do we belong? Where is the place we can settle into without the dread of eviction? This question is ultimately not about a place, but a person: to whom do we belong? \nFor the Christian, we belong to Him who was raised from the dead. We belong to the One who is victorious over death. We belong to Christ.\nOur Scripture today reminds us that we belong to Him who was raised from the dead in order that we may bear fruit for God in this life (Romans 7:4). Our lives here matter. We are called to bear fruit, to invest in those parts of life that last beyond the grave. This is comforting.\nThough we will all die in some sort of physical way (unless the Lord returns first), we should not dread death as though it ends everything. As the Lord assures us in Proverbs 1:33, “whoever listens to me will live securely and be undisturbed by the dread of danger.”\nDeath comes and we are shocked and grieved. We hurt with those who feel the loss. Some of the fruit we grow in this life because of Christ is the peace dwelling secure, without dread, because we know life is ultimately victorious over death. \nIn Christ, we have a security that keeps us beyond any death.  \nWritten by Jason Tippetts\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram16.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 6:15-23, Galatians 5:13-14, 1 Peter 2:11-17",
        "devo_title": "From Slaves of Sin to Slaves of God",
        "devo_summary": "\n                    \n                    We do our best to keep things open-ended. We try hard to keep all options open. We don’t RSVP to the party too early lest something better comes along. And we do all this in order to remain free.\nOr, so we think.\nSadly, this loose-ended, unattached freedom proves to be its own slavery. For in refusing to commit to relationships, we’re ensnared by loneliness. In always remaining open to the better offer, we’re trapped by anxiety. And whenever a better offer doesn’t pan out the way we hoped (and that will happen time and again), we spiral into depression. Isn’t it true that sometimes our best attempts at freedom turn into the worst kinds of captivity?\nIt’s actually through serving that we find freedom, and we’re all serving someone or some thing. Bob Dylan understood this, as the lyrics from his 1979 hit, “Gotta Serve Somebody,” make clear: \nYou’re gonna have to serve somebody, yes indeed\nYou’re gonna have to serve somebody,\nWell, it may be the devil or it may be the Lord\nBut you’re gonna have to serve somebody.\nDylan is absolutely right. You’re gonna serve something. But whether it’s the devil or the Lord – well, that will make all the difference.\nWe learn in today’s reading that the truly free life of the Christian is not so much a freedom from slavery as it is a freedom to be bound to Someone in the right kind of way. Which makes sense if you think about it, for that is exactly how true love works.\nWhen we love a friend or a spouse, we willingly restrict ourselves in service to them. We spend money on them. We carve out time to be with them. We give to them our attention and affection. We do this not because we have to, but because we want to—because we love them. Our love for them leads us into a voluntary, life-giving, joy-spreading life of service. It’s the same way with Jesus Christ, “…having been set free from sin, [we] become slaves of righteousness” (Romans 6:18) in love for Jesus Christ. \nThe more we see and experience what Jesus has done for us – paying the penalty, breaking the power, and one day removing entirely the presence of sin – the more we can then return His love with love that willingly renders us “slaves of God” (Romans 6:22).\nBrothers, take in the love of Christ for you today. Let His love free you to such a degree that you willingly and joyfully enslave yourself to God and His righteousness all the days of your life.\nWritten by Nate Shurden\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram15.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 6:23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through Romans together, we are memorizing the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The second step recognizes the consequence of our sin: death.\nFor the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\n– Romans 6:23 \nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/4-HRTRomans-2.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Colossians 1:13-14",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHe has rescued us from the domain of darkness and transferred us into the kingdom of the Son he loves. In him we have redemption, the forgiveness of sins.\n– Colossians 1:13-14\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram13.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 6:1-14, 2 Corinthians 5:18-21, Colossians 3:1-11",
        "devo_title": "Our New Life in Christ",
        "devo_summary": "\n                    \n                    After a grocery store run with my children—not forgetting a thing, item or child—I felt proud of myself when we pulled back onto our driveway.  \nAs we were getting out of my truck, I heard my daughter stomp on the concrete. Then more stomping. Then stomping with a dash of panic. She ran away, spooked and screaming, “Kill it, Papa! Kill it!” I gently put the eggs down, and ran over to see a mutant, Hot-Wheel-sized, furry, wingless wasp-looking thing. I stomped. It moved. I stomped two more times. The beast ran. Three more stomps. It darted and tried to lose me in the grass, but after a barrage of stomps and some heel-digs, it was all over. I killed what my friends on Facebook identified as a “velvet ant.”  \nVelvet ants are infamous for their bites and their toughness. Sin is, too, isn’t it? But Jesus is stronger. The temptations we face are real, no doubt. But our death to sin and new life in Christ are even more real because that life will last for 10 billion years—and more—to come.\nWe all have various sins that easily trap us (Hebrews 12:1). But Jesus introduces us to new life, new power, and a new way with Him on the throne. Sin’s grasp on us was formidable, but when Jesus died on the cross He crushed the velvet ant-ness of our sin. Christ conquered and killed what every other power could not. He rose from the dead, bringing us along with Him toward a life of grace, forgiveness, and freedom from sin (Galatians 5:1).\nOur freedom from sin’s chains is as real as Christ’s cross and His empty tomb. A no-longer-dead Jesus means a no-longer-doomed-to-sin you and me. Let’s not throw our hands up in despair, overhyping sin’s power and disbelieving Christ’s declaration of victory over it. Let’s receive it. Let’s accept the freedom Christ gives to those who believe.\nDon’t buy the propaganda that sin has power over you. Look past it. Look back to a blood-stained hill outside of Jerusalem. See, by faith, a stack of used grave clothes from your risen Friend. Look beyond what tempts you. Look to the One who saves you. \nIf you are in Christ, an obituary for your life in sin has been already published, and good news is printed on top: “Dead to sin. Alive in Christ.”\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram12.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 5:12-21, Genesis 3:17-19, 1 Corinthians 15:21-22",
        "devo_title": "Death through Adam and Life through Christ",
        "devo_summary": "\n                    \n                    Unless you’ve been living under a rock lately, you’ve heard the phrase “love wins.” It has become a rallying cry for a collection of voices, an umbrella-like conviction wide enough for many to stand under. But while inspiring, the phrase begs for clarification because there are a number of different kinds of love in this world. \nC. S. Lewis highlighted four loves. Someone else might insist there are more or less, but the point is there is more than one kind of love. The sacrificial love a spouse practices on a daily basis may indeed reflect the kind of love that wins in the end, while the “I sure do love my Ford F-150” kind of love may not. So it’s not so much a wrong phrase as a vague phrase. Something more specific would serve we the people better.\nAnd here’s something. In today’s passage, the Apostle Paul gives us an alternative for “love wins” that covers the necessary bases. In other words, it is just as powerful while at the same time rings even more clear. Paul’s phrase? Grace wins.\n“Wait, isn’t there more than one kind of grace in the world as well?”\nYes, good catch, as there most certainly is. There is the grace the old hymn writer called “amazing” and there is also the grace said before supper. But leave it to old Paul and that thing called “context” to provide our needed clarity. When Paul uses the word “grace,” he is talking about, as one translator renders it, “aggressive forgiveness.”\nNow chew on that for a second or two. Grace is God’s aggressive forgiveness. And if we fancy ourselves as people of grace, which we like to believe we are, then aggressive forgiveness will be a defining characteristic of our lives as well. But far too often we practice something along the lines of dragging-our-heels forgiveness, which is why far too often we are not winning.\nSo grab your used copy of C. S. Lewis and drive around in your F-150 and love everything and everybody, okay? But remember—“for just as through one man’s disobedience the many were made sinners, so also through the one man’s obedience the many will be made righteous.” \nWhen all is said and done—when there’s a loser and a winner—grace wins.\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram11.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 5:1-11, Galatians 4:6-7, Ephesians 2:18-22",
        "devo_title": "A Hope That Will Not Disappoint",
        "devo_summary": "\n                    \n                    Before marrying my wife, I was in a “serious” relationship with a woman I thought I’d marry. I was saving up for a ring, we were talking about our future kids, and we even began looking at neighborhoods we’d like to live in.\nIf I’m honest, I put my entire hope in her. I would not have said so at the time, but she was my god. I offered sacrifices at her altar daily, and I based my entire life around her wants, needs, schedule, and interests.\nI didn’t realize how bad it was until she broke it off. I was devastated. I’ve probably never cried more in my life than I did during that season. My god let me down—and I felt empty.\nPaul’s words here in Romans 5 were the words I needed that that time. He tells the church in Rome:\nTherefore, since we have been declared righteous by faith, we have peace with God through our Lord Jesus Christ… This hope will not disappoint us, because God’s love has been poured out in our hearts through the Holy Spirit who was given to us.\n– Romans 5:1,5\nI didn’t listen to those words at first, but I learned their truth in the midst of my suffering. Placing my hope in another person was futile. She was a sinner just as much as me, and she could never bear the weight of my worship.\nPeople aren’t built to be gods. Neither are jobs or hobbies or riches or even our best attempts at good works. None of these can fully satisfy. They’re all created things. Only the Creator deserves and can handle our worship and dependence.\nIf we confess Jesus as Lord, we become adopted into God’s family. “And because you are sons, God sent the Spirit of his Son into our hearts, crying, “Abba, Father!” (Galatians 4:6). Our Father loves us and wants us to place our hope in him.\nLay your hope—your entire life!—at his feet. He can handle it.\nWritten by Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram10.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 4:1-25, Psalm 32:1-2, Ephesians 2:4-7",
        "devo_title": "The Promise Granted through Faith",
        "devo_summary": "\n                    \n                    We take promises on faith. We have to. But what if the promise gets broken?\nIt’s an age-old story. Someone hires a contractor to build their home, and somewhere in the process the builder stops working, stops showing up, and abandons the project. The hopeful homeowner is stuck with a half-finished house, which is about as useful as no house at all. The frustration is great because the homeowner hired the builder to make something very important, and the builder promised to do the work to the end. The break in trust is painful.\nWe’re all looking for someone or something to trust in. But we live in a day where words alone don’t seem to carry much weight. Like papers blown away by a gust of wind through an open window, so go the promises people and possessions make, assuring us that we can trust in them for what our souls desperately yearn for most. \nThe truth is, only God can satisfy us. \nNo labor of our hands nor ascent of our intellects can make the promises of God come to pass. Only God can do that, and we have to trust Him. \nFaith is a gracious gift God gives to His children so that we might see His beauty and character. Just as a person might have surgery on his eyes enabling him to see light and color, so the Spirit of God gives us eyes of faith. When life gets hard, God can seem so far away. But when our trust is fastened to the reality of Jesus taking our sin and giving us His righteousness, we can rest in this busy and noisy world knowing we don’t have to go find Him. He has come to us through His son, Jesus. \nGod is not a flakey construction worker who stops in the middle of conforming us to Christ’s image. He always does what He says He will do. He will finish what He began. \nBecause our faith is a gift from God, anchored in the work of God, we can be certain of His faithfulness to us. “He was delivered up for our trespasses and raised for our justification” (Romans 4:25), and nothing can take that away.\nWritten by Jevon Washington\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram9.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 3:21-31, Ephesians 1:7-10, Colossians 1:13-14",
        "devo_title": "Faith Upholds the Law",
        "devo_summary": "\n                    \n                    What is it that makes a Christian right with God, innocent in His eyes? Can we gain it by being good enough and keeping God’s law? Most of us would pretty quickly answer no, we can’t. We must live by grace. We might even add that living by the law is legalism—trying to make ourselves right through actions and self-will. And we would be right to say this. Mostly.\nWhat sets the Christian faith apart from every other religion in the world is that we are not justified by works—that is: we are not made right and upstanding in the eyes of God because of what we do. We recognize that our works can’t accomplish this. We are justified by faith in Jesus’ perfect life, innocent death, and death-conquering resurrection. He is our atoning sacrifice—the sacrifice that takes on the punishment for another.\nBut so often we love to oversimplify and create “either / or” propositions out of rich and complex aspects of faith. We say we are saved by grace, not law, and while it is true that Christ’s sacrifice is the most profound act of grace in history, it happened because of the law.\nWe needed an atoning sacrifice to fulfill God’s law. The two are inextricably connected—God’s Law and Christ’s sacrifice. Sin could not go unpunished, and innocence cannot be handed out like candy at Halloween. God’s perfect justice led to God’s perfect mercy. So yes, we live by faith in the work of Jesus, and in so doing we are evidence that the law’s requirement was met in Christ.\nAnd our faith shows something more: we are now citizens of a new kingdom. We’ve been rescued from darkness and transferred to a “kingdom of light.” And what does it mean to be part of a kingdom but to be under the law of the land? We are under the new law that was ushered in through Christ’s perfect atonement—a law of grace.\nWe are governed by grace, shaped by grace, driven by grace. We obey God’s commands by grace and remember Christ’s work by grace. We cling to grace by faith, and so it is that we are saved by grace through faith, and that faith upholds God’s law. This is what makes us innocent in the eyes of God.\nWritten by Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram8.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 3:23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nAs we read through Romans together, we will memorize the steps in the Romans Road to salvation, a concise explanation of the gospel using verses from this epistle. The first step acknowledges the problem: our own sin. \nFor all have sinned and fall short of the glory of God.\n—Romans 3:23\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/4-HRTRomans-1.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Psalm 51:1-3",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nBe gracious to me, God,\naccording  to your faithful  love;\naccording to your abundant compassion,\nblot out my  rebellion.\nCompletely wash away my  guilt\nand cleanse me from  my  sin.\nFor I am conscious of  my  rebellion,\nand my sin is always before  me.\n—Psalm 51:1-3\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram6.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 3:1-20, Psalm 14:1-7, Ecclesiastes 7:20",
        "devo_title": "Guilty as Charged",
        "devo_summary": "\n                    \n                    When I was 18 years old, I was accused of a crime that I didn’t commit. In the course of affairs, I had to take a lie detector test—which I apparently failed. I was devastated. I felt guilty, even though I wasn’t. It was one of the worst experiences of my youth.  \nThe great irony is that I was guilty of many worse things than that for which I was falsely accused and subsequently penalized. I have revisited that experience from time to time when I consider all that the Scriptures have to say about our sinfulness before God. God’s Word is universal in the scope of its testimony about the sinfulness of humanity when it says, “There is no one righteous, not even one” (Romans 3:10).\nThe Apostle Paul went to great lengths in Romans 1 to set out the catalog of sins that mark the Gentile world, which includes our own. Whether it is the sexual sin and idolatry that is widespread among the nations (1:18-27), or the more general sins that mark the day-in and day-out lives of unbelievers (1:28-32), there is manifold evidence of the absolute pervasiveness of the depravity of all humankind.\nOf course, when we hear such an indictment, there will always those who will say, “I’m not like that. I don’t do those sorts of things. I’m not that bad.” The Apostle anticipated such objections from those he knew so well—his own countrymen! When he brings the entire Jewish nation before the divine tribunal in chapter 2, he explains that when they condemn others for sin, they must remember that they, too, are guilty of functionally practicing the same things (2:21-24).\nIn chapter 3, the Apostle goes on to set the entire world before the all-searching eye of God, thus leveling the the playing field. Paul explains that God gave the Law so that “every mouth may be stopped, and all the world may become guilty before God” (3:19). Weaving together a number of statements from the Psalms (Psalms 14:1-3; 5:9; 140:3; 10:7; 36:1), Paul explains that every part of man has been affected by sin. References to the throats, tongues, lips, mouths, feet, and eyes of men are illustrative of the fact that every part of man has been corrupted. “There is no one who seeks God” (Romans 3:11).\nComing to terms with the extent of our guilt before God is part of coming to see our need for Christ. Apart from the grace of God in Christ, we are spiritually hopeless, helpless, and powerless. \nThanks be to God that He seeks and saves sinners.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram5.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 2:17-29, Deuteronomy 7:25-26, Psalm 51:1-12",
        "devo_title": "The Spirit of the Law",
        "devo_summary": "\n                    \n                    “A man’s gotta have a code, a creed to live by…”\n– John Wayne\nMy brothers and I grew up watching Westerns with our dad. It was a Saturday night staple in our household. Good guys and bad guys, gunslingers and cattle ranchers, A Fistful of Dollars and A Few Dollars More.\nThese revered moments gave real-life weight to the words of men like Clint Eastwood, Robert Duvall, and the Duke himself, John Wayne. Wayne’s call for a code is one I’ve always respected. Of course many different moral systems could be nested under the umbrella of Wayne’s famous saying. For some it’s the golden rule, and for others it’s a fiery pursuit of justice. For still others it’s the commitment to live the way their folks raised ‘em.\nCreeds and codes are good. But they meet their greatest contest when the proclaimer of the code fails to keep it. Whether by deliberate choice or in the face of overwhelming opposition, codes eventually break down. What we do then says more about us than any ethic ever could.\nPaul was confronting this gut-wrenching sort of breakdown in his letter to the Romans. For his Jewish readers, and for the God-fearing Gentiles among them, the Old Testament law was their code. It was, in it’s purest form, a gift from God. But over-legislation by the religious leaders of the day made the law a crushing and impossible burden to bear.\nPaul knew from personal experience that even a deeply focused life dedicated to keeping the code would fall short. This murderer-turned-apostle had seen firsthand the mangled and marred disasters that could be found in the wake of law-based living.\nHis question, “Do you dishonor God by breaking the law?” begs a response; and his original readers would have intuited that. He is asking us to admit our hypocrisy. Why? So we can truly live. Rather than living as creatures of the code, Paul is calling us to be people living under lavish grace.\nIf we feel compelled to boast, let us boast in our weakness and in God’s unmerited grace and mercy. Codes, laws, rules—these things are fundamentally helpful, but our hearts are flawed. This is why God entered our litigious and punitive world: to reset the whole broken order. Certainly, we are encouraged to live lives of virtue. I think this is where the Duke got it right. But what sets us apart as New Testament believers is our ability to hand over our shortcomings, and to lay our failures at the feet of a gracious God.\nBoast not in your virtue, boast not in your vice, but rather each day offer thanks to God that He covers it all. We fail, each of us, in keeping the code. But we have a Great High Priest who stands over it all. In Him, we can seek virtue, be released from the condemnation of the Law, and find a freedom and grace in Jesus that far surpasses it all.\nWritten by Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram4.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 2:1-16, Deuteronomy 16:18-20, Titus 1:15",
        "devo_title": "Who Can Judge?",
        "devo_summary": "\n                    \n                    Children can get easily frustrated. \nWhen something they try goes poorly, even if they haven’t been at it very long, they can get very frustrated. The other day I saw it happen. A kid was shooting baskets. The first shot was bad, and he got mad instead of shooting again. Maybe you know a child who loses it when he drops something, or who sits down with math homework and is beside herself with frustration in 30 seconds or less. Kids’ sensitivities run deep. One day this may serve them well, but in the moment it can be maddening.\nMy kids struggle with this, but they come by it naturally. When I am tired after a long day at work, I tend to do the same thing. The slightest thing can cause me to spiral into being quite a grumpy dad. Spilled coffee grounds. Not being able to watch a baseball game. Running out of bacon.\nWhen I get frustrated with my kids’ behavior, it is a condemnation of my own behavior.\nI thought about this when reading Romans 2. Paul is trying to get religious people, or at least people prone to judging other’s behavior, to see that when you are critical of others, you set yourself up for condemnation. Whether you do this with laws everyone agrees on or the Law of God, you are really pronouncing a guilty sentence on yourself. Why? Because we’re guilty of doing the things we condemn others for.\nBut Paul doesn’t merely want his readers to feel guilty; he wants them own it, to know it. He wants them to buy into the idea that we all suffer from the same human condition. We are all guilty before God. We all deserve His judgment. The problem is, this is so hard to get people to see. So Paul uses their own moral compass against them. Paul’s goal, of course, is not just to make sure we know our own guilt. He wants us to trace the line from guilt, to need, and then on to the good news of what God has done in Christ.\nWhen I see bad behavior in one of my kids, I acknowledge that behavior is wrong and I tell them they need to stop. But because I do the same, I am also judging myself and revealing my own need. I need to experience the mercy and grace of the cross afresh, just as Paul’s original audience may have needed to experience it for the first time.\nWe must acknowledge our incessant need for Jesus. And when I do this—when you do this—we can know God’s kindness that leads us to repentance (Romans 2:4).\nWritten by Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram3.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 1:18-32, Proverbs 1:7, 2 Timothy 3:1-9",
        "devo_title": "The Righteousness and Wrath of God",
        "devo_summary": "\n                    \n                    In a world full of self-worship and runaway passions, Romans 1 is arresting and sobering. This isn’t the sort of thing most folks want to talk about at your local coffee shop or over dinner and drinks. Paul directly confronts sin and brings us face to face with God’s righteous wrath. Indeed, God’s wrath, says Paul, is revealed against all ungodliness.\nThe judgment described is frightening. Perhaps the most frightening phrase is this: “God gave them up” (Romans 1:24). When our hearts are blind, false, desirous of carnality and evil, He gives us what we desire. To get what we want in this life is sometimes—dare I say most of the time?—not blessing, but judgment.\nIn his Letter from a Birmingham Jail, Dr. Martin Luther King, Jr. said, “Injustice anywhere is a threat to justice everywhere.” So also, unrighteousness anywhere is a threat to righteousness everywhere. The minute we begin condoning evil, justifying our selfishness, and excusing our pet sins, instead of repenting of them, we are asking for judgment: for blindness, darkness, waywardness, folly, debased minds, and perverse passions. \nIt is a slippery slope, and there aren’t any pit stops along the way. There is no “sort-of” righteous, no “halfway” committed. There is no neutrality. There is wisdom or folly, life or death. “The fear of the Lord is the beginning of knowledge; fools despise wisdom and discipline” (Proverbs 1:7).\nHowever, this talk of judgment isn’t a load of pessimism. God’s righteous wrath is the only good response to a world of sin, and even to our own rebellious hearts. It flows from the simple fact that God is good and holy. \nGod’s holy wrath was visited upon Christ on the cross. His righteousness triumphs; yet in the midst of His wrath, He remembers mercy. Because of this, it is possible to both tremble and to trust.\nI am comforted by Paul’s words in 2 Timothy 3:9: “But they will not get very far, for their folly will be plain to all.” Folly can’t be hidden. Ungodliness and unrighteousness will be revealed for what they are. This is both sobering and glorious news. I am provoked to repentance for my own folly and unrighteousness, and also to thanksgiving for God’s faithfulness and grace. \nMay Christ Himself keep us and guard us from our own folly—from the love of self and the love of the world, from presumption and from pride. May He keep us in His grace, that we may fear Him all the days of our lives. Thanks be to God, and to Him alone be the glory!\nWritten by Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram2.jpg"
    },
    {
        "book_title": " Romans",
        "devo_passages": "Romans 1:1-17, 2 Samuel 7:12-16, 2 Corinthians 5:17",
        "devo_title": "Set Apart for the Gospel",
        "devo_summary": "\n                    \n                    Welcome to Paul’s letter to the Romans. \nMartin Luther said of this epistle, “It is well worth a Christian’s while not only to memorize it word for word but also to occupy himself with it daily, as though it were the daily bread of the soul.” Why did Luther hold Romans in such high esteem? Because, he said, “this letter is truly the most important piece in the New Testament. It is purest Gospel.”\nWhat makes Romans so special? While all Scripture is God-breathed and equally valuable, Romans is unique in that it is the most comprehensive, well-organized expression of Christian doctrine assembled in one place in the Bible.\nLuther wasn’t the only person who regarded this letter in this way. Paul did too. We see this in today’s reading when Paul actually gives us his thesis for the entire book:\n“For I am not ashamed of the gospel, because it is the power of God for salvation to everyone who believes, first to the Jew, and also to the Greek. For in it the righteousness of God is revealed from faith to faith, just as it is written: The righteous will live by faith.”\n– Romans 1:16-17 CSB\nThe reason Paul is so eager to preach Christ is that he believes the gospel has the power to give life where there is none. Jesus alone is the way to salvation. The message of Christ is free to all and powerful enough to save those who believe. \nPaul wrote this letter to explain to Jewish and Gentile converts alike what it means to believe in and be redeemed by Jesus Christ. This book reaches back deep into the Old Testament. It walks us through the origin and problem of sin, the reality of guilt, the impossibility of saving ourselves, and the ultimate rescue we’re given in the life, death, and resurrection of Jesus Christ.\nRomans is meant to be thorough—a practical, theological guide for the follower of Jesus. This book calls believers to trust Christ as it unfolds what it means to live by faith. By faith we anticipate our eternal home. But by that same faith, we also learn how to live as followers of Christ in this world. Romans speaks to both.\nThe gospel of Jesus Christ, Paul says, is the righteousness of God—meaning it is the way by which we are able to stand in the presence of God and live. In the work of Jesus, we see the character of God on display. In this letter we find a God of compassion, patience, and justice. We see unfathomable love displayed to complicated and broken people—a generosity of grace and mercy.\nWhether you are new to what it means to follow Christ, or you have read this letter many times over, read the book of Romans as though it is telling a single story—the story of how God rescues us through the sacrifice of Christ.\n Written by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/06/HRT-ROMANS-instagram1.jpg"
    }
]