[
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 12:5-13, 2 Peter 3:8-13, Revelation 1:4-8",
        "devo_title": "How Long, O Lord?",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 12:5-13, 2 Peter 3:8-13, Revelation 1:4-8\nHow long, O Lord?\nMore and more, this is the question of our society. We witness struggle, turmoil, strife. We experience suffering, need, loss.\nHow long, O Lord?\nDaniel saw and experienced things that were beyond him. He responded to God’s faithfulness in his present circumstances, speaking to the kings of Babylon and Medo-Persia. He was faithful to deliver the message God gave him, even when it was at his expense.\nNow he must trust God not only with the present, but also the future. Daniel asked a question many of us have also asked. What am I to do in light of everything I have seen? How long will this go on?\nI am a person who craves being “in the know.” I want to be well informed and ready for whatever happens. If I’m honest, I want to be in the know because it requires me to have less faith. Knowledge becomes my idol. I assume knowledge will grant peace.\nThe messenger to Daniel reminded him that it is not being in the know that grants us peace, but knowing God and His Word.\nPeter also reminded us of this in his letter to the early church, writing, “Dear friends, don’t let this one thing escape you: With the Lord one day is like a thousand years, and a thousand years like one day. The Lord does not delay His promise, as some understand delay, but is patient with you, not wanting any to perish but all to come to repentance” (2 Peter 3:8-9).\nGod’s timing is not ours, and His knowledge is above ours. We may long for answers, especially when circumstances are dire. Even then, God does not delay His promise.\nwritten by Britton Sharp\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Daniel-instagram19.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 10:1-12:4",
        "devo_title": "Hope in the Midst of Darkness",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 10:1-12:4\n“Don’t be afraid, Daniel,” he said to me, “for from the first day that you purposed to understand and to humble yourself before your God, your prayers were heard. I have come because of your prayers.”\n-Daniel 10:12\nI don’t always understand what happens or why. This past year has been hard with the tragic loss of a great friend. Sometimes the magnitude of the anxiety, sadness, or stress has left me lying on the bathroom floor in the fetal position. Those are the moments we long for hope—moments when everything seems fearfully dark.\nIn today’s reading, we see Daniel overwhelmed by what he has been shown. It caused a physical response in him, and he looked to the ground, speechless.\nWhen he encountered God’s messenger, Daniel asked, “How can someone like me, your servant, speak with someone like you, my lord? Now I have no strength, and there is no breath in me” (Daniel 10:17).\nI have asked that question myself, lying on the floor in grief and sorrow. I see the path before me and I am made aware of the magnitude of my inadequacy.\nThe messenger answered, “Don’t be afraid, you who are treasured by God. Peace to you; be very strong!” (Daniel 10:19).\nGod will supply us where He has called us. As believers, our power to persevere comes not from within us but from God. We are inadequate, but we serve a God who has no limits.\nHope may not be within my grasp but it is never beyond God’s, for He is the very source of hope. Daniel is shown the rise and fall of kings and kingdoms in these chapters, yet the point of it all is that there is hope. God is the Everlasting King, and He is sovereign and in control.\nI must hide these truths within my heart so that when life is overwhelming, I will remember: my God is never overwhelmed.\n“I have told you these things so that in Me you may have peace. You will have suffering in this world. Be courageous! I have conquered the world.”\n– John 16:33\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Daniel-instagram18.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 9:1-27, 1 Kings 9:6-9, Ephesians 2:1-5",
        "devo_title": "Daniel’s Prayer",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 9:1-27, 1 Kings 9:6-9, Ephesians 2:1-5\nDaniel is a cryptic book. I am guessing that if you have made it this far in Daniel, you are realizing just how wildly written this little book really is. It reminds me of Revelation with its imagery, visions, and stories that seem to tinker right on the edge of lunacy. This is one reason Daniel is overlooked by many Bible readers, or filtered though and picked to pieces by others. \nFor those who want something clear and distinct, Daniel appears chaotic. For those wanting to wade in the waters of mystery, Daniel is right up their alley. But what can Daniel teach all of us about living lives dedicated to God?\nIn reading today’s passage, I am reminded of the season of Lent, one of my favorite parts of the liturgical calendar. In my Christian tradition we sort of go over the top with this particular Christian season. We put ashes on our heads, we fast, we repent, and we remind ourselves of the great distance between God’s character and ours. In Lent, we practice praying in a different kind of way. In today’s passage, Daniel teaches us not only how to pray, but how to repent. He reminds us how to come to the God of mercy who is so quick to bridge that distance. \nListen to the words Daniel uses in speaking to God: We have sinned. We have acted wickedly. We have rebelled. We have not listened. These are the words of an honest man who doesn’t make light of sin. This is a prayer that cuts out the fluff.  \nNow, listen to what Daniel asks God to do: Let your anger turn away. Listen to the pleas for mercy. Hear me. Open your eyes. Forgive, pay attention, and act. These seem like strong words for someone who has admitted his people have rebelled and acted wickedly. But, here is the key: Daniel is able to pray—and you are able to pray in this way—not because of who you are, but because of who God is. He is a God of great mercy.\nWhen Jesus began preaching in Mark 1, His first words were, “Repent, for the Kingdom of God is coming!” This was more of an invitation than a warning. Repenting is the first step in our move toward God. We should do it daily, reminding ourselves of who we are and who God is. \nDo we often come to God asking only for Him to meet our needs? Do we only come when things aren’t going so well? \nDaniel shows us a different way to pray, a way that opens up our lives to the Kingdom of God.\nwritten by Aaron Wright\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Daniel-instagram17.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 8:1-27, Romans 8:31-39",
        "devo_title": "When It Doesn’t Make Sense",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 8:1-27, Romans 8:31-39\n\nThere have been so many times in my life that I don’t quite know where God was leading me. Should I take this job? Which school am I supposed to go to? What’s next for me? In the questions and uncertainties of life, I often feel confused. When I read this chapter of Daniel, I see that I am in good company. \nMaybe you read through this chapter and were confused, like me, by the vision and even the interpretation of the vision. That’s okay—Daniel was confused too. God was unfolding for him events that were to take place in the future but made little sense to him at the time. \nThe vision, though confusing, is good news for Daniel and all believers who have ever suffered at the hands of earthly kingdoms: only God’s Kingdom will last. On top of this, it offers us a lesson not to look at the troubling circumstances in front of us as insurmountable, but to instead look to the Author and Shepherd of all history and trust in His plan. As Romans 8:38-39 says, “we have confidence that nothing in the present or future can separate us from the love of God in Christ Jesus.” \nThat means whatever we are going through at this moment, although it may be difficult, is only temporary. In the end, we “are more than victorious through Him who loved us” (Romans 8:37). This is where the Christian can find joy no matter what trial or pain he is going through. In Christ, our joy is anchored in the everlasting promise of the love of God. \nWe will have moments of confusion in our faith. Daniel admits to this in verse 27. He had to stop everything he was doing because it literally made him sick. But soon after, he got up and continued going about the king’s business even when he didn’t understand the full purposes of God.\nThere have been times I have felt sick when I don’t understand what was going on in the world around me. But just like Daniel, we must carry on for the sake of the heavenly Kingdom. Even when we don’t see how God is working in a situation, our job is to remain faithful while His job is to work out the details. Many times we pray to God asking Him to reveal what lies ahead, and then we will be faithful. But what God asks of us is to be faithful no matter what lies ahead. We don’t have to know everything in order to do what God calls us to.\nWhen confusion enters into our lives, where will we run? Could our desire for clarity actually be our fleshly desire for comfort instead of faith? Am I willing to go about God’s work even when it doesn’t all make sense?\n \nwritten by Chandler Vannoy\n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram16.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 7:1-28, Psalm 104:1-5",
        "devo_title": "Everlasting Kingdom",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 7:1-28, Psalm 104:1-5\nIf you just read Daniel 7 for the first time, take a deep breath and go and read it again. Seriously.  \nGood, let’s begin. Daniel 7 is one of those chapters in the Bible where I think we can get all twisted and jumbled. Many of us don’t have a context for this kind of passage. If we try to twist it to make sense in our world, it doesn’t really work. We have to imagine a different world, One in which we find ourselves in desperate need of salvation from powers and empires wishing to devour us, crush us, stamp us out. Only then does it begin to make sense. This vision does come as good news. It sounds incredibly thrilling and hopeful, yet terrifying—all at the same time.  \nI remember going to the theatre fifteen years ago wanting to be like the Gladiator. It was my favorite movie that year. I loved thinking of myself placing my fist over my heart and saying, “Strength and honor.” Or, in other words, power and glory. I knew then the significance of those words. They were the calling card for the Roman army; it was their way of distinguishing themselves from everyone else. \nRome was an empire bent on stamping out anything and everything in its way, an empire of power and glory. But, Rome isn’t here anymore. Neither is Babylon, or Persia, or Assyria. The empires have passed away.  \nThe promise Daniel 7 is that a Kingdom is coming that will not pass away. Daniel is not simply telling a wild story to incite unfounded hope; he is pointing to God’s plan to rescue all of us (every people, nation, and language) from the empires and dominions of this world (Daniel 7:13-14, Rev. 5:9). \nIt begins with a different kind of King, a King who comes on the clouds of heaven. This is not a mere mortal— this is One who has been given authority to rule and reign.\nIf you find yourself reading the Gospels anytime soon, look at how people respond to Jesus. He is one who has real authority. He is the Son of Man, the one who speaks of the true Kingdom. Then pray the Lord’s Prayer (Matt. 6:9-13). And when you come to the end of that prayer, place your right hand over your chest. Say those words that Daniel and his listeners longed to say and that Christ taught us to pray: “For thine is the Kingdom, and the Power, and the Glory, Forever and Ever. Amen.”\nwritten by Aaron Wright\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram15.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "1 Peter 5:8-9",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day to catch up, pray, and sit in God’s presence. Pray the scripture below for someone in your life and for yourself.\nBe alert and of sober mind. Your enemy the devil prowls around like a roaring lion looking for someone to devour. Resist him, standing firm in the faith, because you know that the family of believers throughout the world is undergoing the same kind of sufferings.\n-1 Peter 5:8-9 NIV\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram14.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Isaiah 43:2-3a",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof and truth in your heart and mind each day.\nWrite these verses down, keep them in your wallet, post them on your mirror or at your desk—anywhere you will see it often.\n“When you pass through the waters, I will be with you;\nand through the rivers, they shall not overwhelm you;\nwhen you walk through fire you shall not be burned,\nand the flame shall not consume you.\nFor I am the Lord your God,\nthe Holy One of Israel, your Savior.”\n-Isaiah 43:2-3a ESV\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/4-Isaiah-43-2.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 6:1-28, 1 Peter 5:8-9, 2 Timothy 3:12-15, Philippians 4:6-7",
        "devo_title": "Perseverance in Persecution",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 6:1-28, 1 Peter 5:8-9, 2 Timothy 3:12-15, Philippians 4:6-7\n\nDaniel in the lions’ den was one of my favorite Bible stories growing up in Sunday school. Come to think of it, I’m not entirely sure why we so often tell it to small children, considering that the story ends with lions devouring whole families. More than a children’s Bible lesson, however, Daniel’s ordeal is a study of perseverance in the face of persecution. Sadly, the persecution of God’s people is very much a reality in many parts of our world today, places where faithfulness to Christ could come at the expense of one’s life. \nDaniel’s faithfulness to God had endured the longevity of the Babylonian Empire and was now extending into the burgeoning Medo-Persian Empire with its current ruler, King Darius. Once again, Daniel found himself at the right hand of a ruler who was learning that God is ruler of heaven and earth and His “kingdom shall never be destroyed” (Daniel 6:26). \nWhen he learned of the Darius’ decree, Daniel’s faithfulness to God found its outworking in the continued rhythm of daily prayer and thankfulness (Daniel 6:10). Daniel was a man accustomed to persecution, but even more accustomed to perseverance. He had learned to live in the Kingdom of God in the midst of exile. \nAs Daniel was being cast into the lions’ den, Darius proclaimed what can only be called a hopeful blessing upon Daniel: “May your God, whom you serve continually, deliver you!” (Daniel 6:16). This was at once affirmation of Daniel’s faithfulness and God’s power. \nFor most of us, we will never face hungry lions because we confess the name of Jesus. But, lest we become comfortable, 1 Peter 5:8-9 tells us that there is a lion on the prowl that is seeking to devour us. Much like Daniel’s perseverance, Peter instructs us to resist the Devil, stand firm in our faith, and stand in solidarity with our brothers and sisters in Christ throughout the world who are being persecuted. \nWhat you would do if you were in Daniel’s position? Would you maintain your allegiance to Christ in the face of death? It’s a difficult question, to be sure. \nBefore moving on to the reflection questions, take a moment to pray for perseverance for our brothers and sisters in Christ who are reading this passage around the world and experience this persecution as reality.\nwritten by Chris Comstock\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram13.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 5:1-31, 1 John 2:15-17",
        "devo_title": "Fathers and Sons",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 5:1-31, 1 John 2:15-17\nI wanted to be just like my dad when I grew up. And at this point in my life, I hope there is some significant character resemblance. I recognize this is not the case for all men, but my father has shown me what it means to walk humbly before God and trust Him for my life. \nIn Daniel Chapter 5, we are abruptly introduced to King Belshazzar, a stand-in for his father King Nabonidus and hence the successor to King Nebuchadnezzar. The situation was politically complicated, but the point is that Belshazzar walked in the footsteps—or, missteps—  of his predecessor and “father” Nebuchadnezzar.\nBelshazzar, in his great pride, threw a lavish party and decided to bring out all the golden vessels that were pillaged from the temple in Jerusalem and use them like the red plastic cups you would find at a college party. The partygoers praised Babylon’s false gods, the whole scene amounting to a direct provocation and blaspheming of the God of Israel. Between all this and the unsettling incident with the handwriting on the wall, this was no ordinary party.\nThe focus of this passage, and the message Daniel so vividly delivered to Belshazzar, is that the Most High God is the One to whom all honor and glory are due. Trust in any false god the world puts forth, including oneself, is futile. In his pride, Belshazzar had “lifted himself up against the Lord of heaven” (5:22) and was now being brought low as a result. Like father, like son.\nAs followers of Jesus we are exhorted in 1 John 2:15-17, to not love the world or the things belonging to the world. This “world-love” has its distinguishing marks: the lust of the flesh, the lust of the eyes, and pride in one’s lifestyle. If we are honest, we all struggle with these. It is not only Babylonian kings who love the “world.”\nIn reality, all of our lives bear the marks of world-love. All of us have scars that remind us how lust and pride make our lives smaller, not larger. But each of us, no matter our circumstance, is invited to bring our lives to God in repentance, so that love for Christ can swallow up our love for the world.\nTake a moment to reflect on the ways Jesus, the Son, lifts up and honors the Father. Like Jesus, may we as sons pattern our lives after our heavenly Father.\nwritten by Chris Comstock\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram12.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 4:1-37, Proverbs 16:18",
        "devo_title": "Of Kings and Kingdoms",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 4:1-37, Proverbs 16:18\nAs men, one of our biggest fears is the fear of failure— fear that we won’t measure up to the task at hand. The flip side of that fear is pride. We tend to have an unrealistic view of our own sufficiency, priding ourselves on being self-sustaining. This belief is in direct opposition to how God created and designed us. \nThe story of Nebuchadnezzar is the story of one man’s battle with pride. What is especially interesting about today’s passage is that it is written by Nebuchadnezzar himself. The narrative switches to the first person voice of the king, who describes his interaction with the God of Daniel, the God that ultimately becomes the focus of the king’s praise (Daniel 4:34-37).\nChapter 4 opens with another of Nebuchadnezzar’s dreams, and Daniel is once again called on to interpret. I have to wonder how Daniel felt in this situation. He is speaking with the current ruling king— the king of a nation who captured his people— and the message Daniel has to deliver is not exactly a pleasant one. Through Daniel, God reveals to Nebuchadnezzar that unless he humbles himself, he will be torn down. Daniel chooses to share this truth rather than manufacturing something that might please the king, and not out of spite but out of concern. So many times we wish ill for those with power over us, but God’s desire is for repentance and restoration. Daniel shares God’s desire— that Nebuchadnezzar will follow Him—and in grace, he tells the king the truth of what will happen if he does not.\nAs Nebuchadnezzar gains in power, he becomes more convinced of his self sustainability. Sometimes success is the worst thing for us. The king allows his success to blind him of the reality of his need for God.\nNebuchadnezzar reaps the consequences of his pride. He is humbled. Though painful, humbling can lead to healing. God humbles Nebuchadnezzar, and in that breaking of his pride comes repentance.\nIn taking his eyes of of himself, Nebuchadnezzar is able to see the majesty the true King, the God of Daniel.\nIn our brokenness we can either turn to bitterness or repentance. Nebuchadnezzar’s story is a beautiful picture of repentance.\nAt times we may wonder why God doesn’t allow gains in different areas of our lives. Could it be that He is protecting us from ourselves and our tendency to forget Him?\nMay we keep our eyes on the true King. May we not think too highly of ourselves, but when we do, may we respond to our breaking with repentance and not bitterness. May our stories point to the one true King: “For His dominion is an everlasting dominion, and His kingdom is from generation to generation” (Daniel 4:34b).\nwritten by Chandler Vannoy and Britton Sharp\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram10.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 3:1-30, Isaiah 43:2",
        "devo_title": "Trial By Fire",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\n Daniel 3, Isaiah 43:2\nIf you are anything like me, you love the spectacular and the grand. \nAs a culture it seems we are bombarded with distractions that are allegedly “the most amazing things ever!” Whether in the news or the feeds that come across our computer and phone screens nonstop, we are constantly being urged to give our attention to something new. Usually, if not always, these things fall well short of their hype. They don’t enhance our life. They don’t fill us with awe. They disappoint.  \nI imagine the image Nebuchadnezzar built would have been labeled as something spectacular, something worth our time and attention. It was a massive golden statue that stood roughly 90 feet tall. It probably was the “most amazing thing” anyone of the time could have imagined. All the empire was summoned to come and fall before this manmade image and bear witness to its grandeur. But this wasn’t just a “click and see” kind of call for attention. This was a requirement of loyalty to the empire— a requirement to worship Nebuchadnezzar’s magnificent statue and his false gods. \nAs we continue to read Daniel, we will begin to see how the role of earthly empire collides with the promise of God’s Kingdom. God’s Kingdom brings life. It reveals the God of mercy. Empire reveals itself as nothing but crumbling stone.  \nIn this particular passage, God takes the faithfulness and obedience of three young men and makes it a signpost of the true King and Kingdom. These three young men believed that what they did not see was far greater than what they could see. They believed that what (or rather, Who) they could not see demanded of them complete and total allegiance and obedience, above and beyond any earthly kingdom. We often talk of striving for excellence, which happens to be measured by something we can create (much like an excellent statue). But God calls us to something deeper than that: God calls us to obedience.  \nIt is in our obedience that we discover, as the three young men did, that faithfulness to God reveals the actual most amazing thing ever: His presence. Even with all of culture and empire breathing down your neck, obedience to the true King is the real test of faith. It is through hearts that are obedient, even unto death, that God transforms the world. He did it through these three men. He did it through Jesus Christ. And He calls us to the same. \nDon’t get caught up in the world of manmade excellence and the temporarily spectacular. Instead, be obedient to the only One who can give you the most amazing thing ever, Himself.\nwritten by Aaron Wright\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram91.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 2:1-49, Isaiah 44:6-8",
        "devo_title": "Mysteries of the Heart",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nDaniel 2:1-49, Isaiah 44:6-8\nMost of us at some point in time have longed to know the future. Generally we want to know what it holds for our own lives. For some of us this stems from simple curiosity, but for many others it is rooted in a desire to control outcomes. If we just knew we would one day be married or financially stable or healthy, then we could rest secure in the here and now.\nThis thought process is not too far from what Nebuchadnezzar was trying to do. In the ancient world, a king’s dreams held significance for the entire nation as they were thought to foreshadow future events. So if one could interpret a dream correctly, they could take appropriate actions to sustain their kingdom.\nConsider the lengths Nebuchadnezzar was willing to go to get a grasp on the future. Not only had he tasked his magicians and fortune-tellers with interpreting his dream’s meaning, but he also demanded they describe his own dream to him—under penalty of death!\nDaniel enters this life-threatening situation with a completely different perspective than his Babylonian counterparts. He knows he serves the God of heaven who not only writes history but reveals it. What is interesting to note is the main message of the dream: in the midst of rising and falling kingdoms, “the God of heaven will set up a kingdom that shall never be destroyed, nor shall the kingdom be left to another people…it shall stand forever” (Daniel 2:44). Simply put, the future is secure for all who trust and serve the world’s true King.\nThis passage convicts me because I recognize a bit of Nebuchadnezzar in myself. As I reflect on my own life, I find I’m guilty of the same impulse to control outcomes to favor my well being and satisfy my desires. In reality, my future security, happiness, satisfaction are ultimately not within my grasp. Granted, I can contribute to some of these realities. But my best contribution to my future and the future of those around me is to trust in God’s sovereign rule (Kingdom). The more trust I place in Him now, the more confident I can be in God’s plan for my future, even when it takes me through hardship.\nIs your desire to know and control the future battling against your allegiance to the God who writes the future? In what areas of your life do you need to offer up control of outcomes to King Jesus?\nwritten by Chris Comstock\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram8.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 3:17-18",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nTake this day to catch up, pray, and sit in God’s presence. Pray the scripture below for someone in your life and for yourself.\n“If we are thrown into the blazing furnace, the God we serve is able to deliver us from it, and he will deliver us from Your Majesty’s hand. But even if he does not, we want you to know, Your Majesty, that we will not serve your gods or worship the image of gold you have set up.”\n– Daniel 3:17-18 NIV\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram7.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Jeremiah 29:11-13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app.\nMemorizing scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof and truth in your heart and mind each day.\nWrite these verses down, keep them in your wallet, post them on your mirror or at your desk—anywhere you’ll see them often.\n“For I know the plans I have for you”—this is the Lord’s declaration—“plans for your welfare, not for disaster, to give you a future and a hope. You will call to Me and come and pray to Me, and I will listen to you. You will seek Me and find Me when you search for Me with all your heart.”\n-Jeremiah 29:11-13 HCSB\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/4-Jeremiah-29-11.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 1:17-21, 1 Samuel 12:24",
        "devo_title": "Faithfulness and Favor",
        "devo_summary": "\n                    \n                    This reading plan is designed for daily use, with new readings posted each day from the book of Daniel as well as supplementary texts for scriptural and historical context.\nWe believe there are no better words to study and meditate on than God’s. Our heart is that you would read scripture first and foremost before moving on to the guiding content found in this post. Use your personal Bible or the Daniel Legacy Book. For interactive response questions and other features, download the He Reads Truth iOS app (coming soon).\nDaniel 1:17-21, 1 Samuel 12:24\nI remember going into my first job interview, for a bag boy position at a grocery store. I also remember my dad praying with me in the car before I went in. Surprisingly, he didn’t pray I would get the job and he didn’t pray I would answer all the questions correctly. Rather, he prayed that the manager of the grocery store would show me favor and that I would demonstrate a strong work ethic.\nFaithfulness and favor— these two realities are what allowed Daniel and his friends to not only survive in Babylonian exile, but to flourish. In a foreign land, living in a strange culture with even stranger gods, and enrolled in the best education program Babylon had to offer, Daniel and his three comrades prioritized faithfulness to God above pursuit of success or status. Obedience to Yahweh’s statutes took precedence over the ways of Babylon.\nDaniel was seeking to be faithful to the God who had been faithful to him. This posture resulted in God blessing him and his friends with wisdom, knowledge, and the ability to interpret dreams (which will come in handy later, as we will see). These young men were blessed to the point that the King found them ten times better than all the Babylonian wise men and magicians (Daniel 1:20).\nLet’s pause a moment and reflect on an important distinction. We may be tempted to think Daniel somehow earned God’s blessing by what he did or didn’t do. I know many times I am tempted to think that way. But we need to remember that Daniel stands in symbolic contrast to the nation of Israel as a whole. God’s choosing Israel to be His people was an act of pure grace (favor), not a result of anything they had done. As God’s people, they were to reflect God’s character. If they were faithful to God, they would live in God’s blessing; but if they were not, they would be exiled (case in point). Daniel was merely doing what Israel was meant to do all along: trust, obey, and live out of the favor of God. The fruit of this was blessing.\nThis theme also appears in 1 Samuel 12:24: “Above all, fear the Lord and worship Him faithfully with all your heart; consider the great things He has done for you.” In short, prioritize faithfulness to God out of recognition of the favor he has already shown you.\nAs followers of Jesus, God’s favor is always being extended to us. The question is, will we will choose to live out of it—as a response to it—and let it permeate our lives?\nHow often do we reflect on “the great things He has done”? Do we live our lives as a response to the favor He has already shown us?\nMay we prioritize faithfulness to God and live our lives deeply rooted in His favor towards us in Christ.\nwritten by Chris Comstock\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram5.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 1:8-16, Proverbs 21:2-3, 1 Peter 2:15-16",
        "devo_title": "Respectful Righteousness",
        "devo_summary": "\n                    \n                    Being a Christian can make for some uncomfortable social interactions. Those awkward moments can even show up in our discussions with friends — the fidgety part of the conversation where you have the choice to speak truth or hide it away.\nHow do you live according to the truth God has called you to in a world that believes otherwise? What about the times when what you believe inconveniences others?\nWhat does respectful righteousness and humility look like?\nIn the opening chapter of Daniel, we get a picture of respectful righteousness. Daniel drew a boundary: he would not eat the king’s food. Scripture says, “Daniel determined that he would not defile himself with the king’s food or with the wine he drank” (Daniel 1:8). Some think this is a dietary reference, but is it more than that. If Daniel did not put boundaries in place, would he then continue down the slippery slope of compromise?\nWe may assume Daniel didn’t like the food, but this was the king’s best (Daniel 1:5). Refusing it must have felt like being on a diet and seeing a big piece of chocolate cake — surely it was desirable to Daniel. But this was not just a food decision; it was a heart decision.\nWould accepting the king’s food lead to accepting the king’s views? Might Daniel start to believe all of the things thrown at him and lose track of who God had called him to be? Could it be not the body that is defiled, but the heart?\n“So [Daniel] asked permission from the chief official not to defile himself. God had granted Daniel favor and compassion from the chief official, yet he said to Daniel, ‘My lord the king assigned your food and drink. I’m afraid of what would happen if he saw your faces looking thinner than those of the other young men your age. You would endanger my life with the king.’” (Daniel 1:8b-10)\nDaniel respected his overseer. He asked permission; he didn’t demand. As we will see again in a few days, God granted him favor. Daniel realizes that his convictions could cause harm/issues for others, so he takes responsibility for those issues. \n“So Daniel said to the guard whom the chief official had assigned to Daniel, Hananiah, Mishael, and Azariah, “Please test your servants for 10 days. Let us be given vegetables to eat and water to drink. Then examine our appearance and the appearance of the young men who are eating the king’s food, and deal with your servants based on what you see.” (Daniel 1:11-13)\nDaniel did not bully his way to having his convictions valued by others. Instead, he responded to God’s call, respectfully created space for God to work, and trusted. He did not try to overthrow the overseer; he reached out to him and talked with him. Daniel valued cultivating the relationship with the overseer, rather than conquering him to just get his way. He trusted in God’s sovereignty and refrained from trying to manipulate others into righteousness. \nHow are we living out that which God has called us to do? How might we learn respectful righteousness from the example of Daniel?\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram41.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Daniel 1:1-7, 1 Peter 2:11-12",
        "devo_title": "What’s In A Name?",
        "devo_summary": "\n                    \n                    I was named after my two grandfathers. I have always been proud of that. I have always valued the fact that my name has meaning and symbolism for my family.\nIn the culture of the Ancient Near East, a name was synonymous with character. In much of scripture, after someone had an interaction with God, He would often change their name. It signified a change of character.\nIn Daniel 1:1-7, we can see that King Nebuchadnezzar valued these men. Notice the types of men he gathered; pay attention to what the king was doing. What do you think his plan was for this 3-year program that culminated in a name change?\nDaniel’s name in Hebrew means “My judge is God,” while his Babylonian name Belteshazzar meant “May Bel protect his life.” Hananiah (“Yahweh is gracious”) is changed to Shadrach (“The command of Aku”). Mishael (“Who is what God is?”) is changed to Meshach (“Who is what Aku is?”). Azariah (“Yahweh has helped”) is changed to Abednego (“Servant of Nebo”).\nIn changing the names of these men, Nebuchadnezzar hoped their character would also change. And maybe some of them did. Perhaps some of the Israelites began to think this exile thing wasn’t so bad after all.\nEven in exile, we still find ourselves with choices. Many are harmless, some are fatal. Why do you think Daniel accepted some parts of his new culture while, as we will see tomorrow, taking a stand against others? \nDaniel was not alone in his captivity; there were other men with him—men who understood his culture and his faith. What could be the significance of them going through this together?\nIn 1 Peter 2:11-12, Peter charges his fellow believers to abstain from fleshly desires that wage war against their soul. Like Daniel, Peter understood that walking with God is a battle that we must fight every day. It is not limited to times of physical exile but is a daily exercise of our faith in God, the one true King.\nMay we remember our true identity and citizenship today as sons of the true King, and may we resist those things which wage war against the ways of God.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram3.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "Psalm 137, Jeremiah 28:1-17, Jeremiah 29:4-14",
        "devo_title": "Refusal, Denial or Repentance",
        "devo_summary": "\n                    \n                    How can I keep going after all this has happened?\nWe’ve all been there. We have all at some point longed for a different outcome and are left with a reality we did not desire. \nThis is what we see the nation of Israel going through in today’s readings. In Psalm 137, we hear Israel wrestling with their ability to sing praise in the midst of captivity. When you read to the end of the Psalm, you actually see a prayer of harsh vengeance. What you don’t see is Israel address their hearts and how they fell away from God. \nThat is our tendency—the refusal to look at our heart, the refusal to take ownership of our need for the Gospel.\nIn Jeremiah 28, we see the prophet Hananiah use a different tactic: the tactic of denial. Hananiah’s words sound great, but he is a false prophet. Why? Because he still does not address the heart. Hananiah is extremely adamant and he and Jeremiah have a prophetic face-off. The false prophet promises a change of circumstance without acknowledging the need for a change of their hearts. \nSometimes my desire for different circumstances eclipses my desire to do what God is asking of me in my current ones. That is when I am most likely to believe false prophets— when they give easy fixes to hard heart issues. \nIn Chapter 29, Jeremiah goes where Hananiah wouldn’t — he addresses the heart. He points out how the people have wandered from God, and he deals with the reality that they will be in exile for awhile. But even in exile, in consequences of their sin, they can find God. \nWhen we find ourselves in exile, we can remember the promise God gives us:\nYou will call to Me and come and pray to Me, and I will listen to you. You will seek Me and find Me when you search for Me with all your heart. I will be found by you”—this is the Lord’s declaration—“and I will restore your fortunes and gather you from all the nations and places where I banished you.”\n– Jeremiah 29:12-14\nWill we search for God with all of our heart, or will be incessantly try to find easy fixes? Will we say we cannot praise God where He has put us, or will we deal with our hearts and flourish in the grace of the Gospel despite our circumstances?\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram2.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "2 Kings 23:36-25:30, Jeremiah 36:3",
        "devo_title": "The Battle of the Heart",
        "devo_summary": "\n                    \n                    I once heard someone say, “We’re all 3 bad days away from a personal disaster, and I’m already on day 2.”\nIn reading this passage, it would be easy to sit back and judge Israel and act like we would never behave like this. The reality is that we would and we probably have. All of us have the capacity to fall away and the potential to fail. That is why we need Jesus. \nIsrael had come to the point where their hearts were far from God. As you read through today’s passage, you can see them drift, one king to the next. One generation’s success does not ensure the faithfulness of the next. \nIsrael was a repeat offender, continually wandering from God. When we continue to wander, we find ourselves in exile. We reap the consequences of our choices. But the story does not end there. Our failures do not define who we are. They may be part of who we are, but they are not our identity. They are not where we find our purpose. \nIn Daniel, we see a man walking with God in the midst of exile. Yes, it is possible! There is grace and hope, even in exile. Exile is not the end of the story. \nIn this book, we see God taking a remnant of His people and sending them into exile. Yet, as Daniel unfolds, we also see they have a purpose in being there, that God is still at work even in the midst of their struggle and threatening circumstances. \nThrough the book of Daniel, we observe the battle of the heart as well as God’s provision and protection in the midst of that battle. We learn that when God’s people turn their hearts towards Him, He provides for them, even in exile. I may long to be faithful, yet there is hope when I am not. \nThere is a lot of detail in today’s reading, a lot of talk about who did what and who didn’t. Take a look and ask: what is the condition of their heart? Our actions reflect our heart. \nWhat do you see about the hearts of the Kings? What can you learn about your own?\nwritten by Britton Sharp\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2015/08/HRT-Daniel-instagram1.jpg"
    },
    {
        "book_title": " Daniel",
        "devo_passages": "",
        "devo_title": "Daniel: Introduction",
        "devo_summary": "\n                    \n                    How does life change when you are not in the majority? What do you do when you are asked to go against what you believe?\nIn the book of Daniel, God gives us an example of how to remain faithful in exile, how to respond when forced to live in a world that is not our true home. Daniel, a young prophet from Judah, is taken from everything familiar. He is lifted out of a culture in which he is part of the majority and becomes a minority living in a foreign land with foreign gods. Many of us reading this today can relate. \nThe setting of Daniel is the powerful kingdom of Babylon around 605 BC. The kingdom of Judah, the last half of now-divided Israel, has fallen away from God yet again and is taken captive by King Nebuchadnezzar and moved to the kingdom of Babylonia. \nIn the first half of the book, we see Daniel walk through these difficult circumstances, all the while pointing to the Everlasting Kingdom of the one true God. In the second half of the book, we see Daniel share the dreams God gives him, dreams that also point to that Everlasting Kingdom.\nIn its dramatically compelling narrative and fascinating prophecy, the book of Daniel illustrates one consistent theme: “God’s dominion is an everlasting dominion, and His kingdom is from generation to generation.” (Daniel 4:34b)\nOur circumstances change and earthly rulers come and go, but God’s is the Everlasting Kingdom.  \nwritten by Britton Sharp\n\n                ",
        "img_url": ""
    }
]