[
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 14:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing a verse about the ways of the Lord:\nLet whoever is wise understand these things,\nand whoever is insightful recognize them.\nFor the ways of the Lord are right,\nand the righteous walk in them,\nbut the rebellious stumble in them.\n— Hosea 14:9\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/4-HHosea21.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Revelation 3:19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nAs many as I love, I rebuke and discipline. So be committed and repent.\n—Revelation 3:19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram20.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 14:1-9, Isaiah 61:1-4, Psalm 52:1-9",
        "devo_title": "Promise of Restoration",
        "devo_summary": "\n                    \n                    “You have made us for yourself, and our hearts are restless until they rest in you.”\nThese words from St. Augustine hit us where we need it most. In this short sentence, he expresses both the purpose and predicament of the human condition. We are made for rest in God, but we look for rest in all the wrong places.\nAugustine knew this struggle firsthand. For he, like you and me, had a drifter’s heart. But that’s not just true for Augustine or you or me. It’s true for everyone. This is why reading the history of Israel often feels a bit like a day in the life of a parent with a two year old. No matter how many times God tells Israel not to do something, they still wind up sticking screwdrivers into electrical sockets (spiritually speaking). \nYou might half expect the last chapter of this book to be God’s “I’ve had it up to here with you” speech. But nothing could be further from the truth. Instead, Hosea chapter 14 is God’s “I love you this much” speech. Complete with beautiful promises of healing kindness, turned-away anger, and unconditional love, God calls adulterating Israel back to the arms of His covenant affection to experience the restoration of life, joy, and peace.\nIsn’t it amazing that this chapter begins with the word “return to the Lord” and not “go away; I’m through with you”? After all we’ve done, God’s love remains. More than anything, He wants us to be restored to Him, and so He pleads for us to return in repentance and then He patiently waits and watches. \nThe daily practice of returning to God for the love and grace He freely gives is the heart of the Christian life. Today, and every day, God is calling you to return to Him. How long have you been away? If you’re like me, I bet it’s been too long. Wait no longer.\nGo to your Father now. And always.\nWritten By Nate Shurden\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram19.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 13:1-16, Acts 4:11-12, 1 Corinthians 15:54-56",
        "devo_title": "I Knew You in the Wilderness",
        "devo_summary": "\n                    \n                    I’ve never been a fan of the blockbuster “Bourne” movies. To me, they feel like the same story over and over again. It reminds me of the book of Hosea. \nOne of the biggest problems the protagonist Jason Bourne, played by Matt Damon, has is memory loss. He wakes up, suddenly a guy who can’t remember his name, where he lives, or where he works. He doesn’t even know how he got to where he is. His problem, the inability to remember, is what Hosea 13 is about. Just like with Jason Bourne, God’s people keep forgetting who they are, where they are, and how they got there. \nIn today’s reading, the prophet Hosea recounts to Israel how God remembered them in the desert, what He did to set them free, and how He forgave them in their rebellious idolatry. Forgetfulness leading to idolatry is what happened to them while they were in the desert. Though God had remembered Israel, they forgot Him, His rescue, and His promise. \nIsrael had been in bondage as slaves to Egypt’s cruel Pharaoh for hundreds of years. They labored day and night, building Pharaoh’s breathtaking city, with no hope of freedom. Their enslavement is a sad but rich picture of the evil “pharaoh” we call sin. Sin makes us work as hard as we can, promising us glory from the fruit of our hands. But it never delivers. Obedience to the commands of sin keeps us in bondage.\nUltimately, it took the death of the firstborn sons of Egypt to break Pharaoh’s hardened heart and convince him to finally set Israel free. This sacrifice points to the death of Jesus, the firstborn over all creation (Colossians 1:15), who died so that men and women who are dead in sin can be freed from their cruel taskmaster and raised to new life.\nHosea reminds us that, just as fast as Israel praised God for His deliverance, they forgot Him. They forgot His character, love, faithfulness, and goodness, and their forgetfulness led them to idolatry. They exchanged trust in God’s faithfulness for belief in lie that He was unfaithful to them. We are tempted to make the same exchange. \nForget not God and His goodness. When we forget our God, we begin to worship powerless idols like the golden calf. In our day it looks more like money, lust, control, success, power, and comfort. The list is endless, but the result is the same. The only thing these impotent idols guarantee us is emptiness – splinters of their broken promises.\nDon’t forget. Remember God’s provision: Jesus, the manna of God. He sustains us in the barren wilderness of our lives. Remember Jesus’ work. Remember your faithful Friend.\nWritten By Jevon Washington\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram18n.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 12:1-14, Psalm 135:13, Isaiah 63:11-14",
        "devo_title": "Return to Your God",
        "devo_summary": "\n                    \n                    In 1517, Martin Luther nailed his 95 Theses to the door of the Castle Church in Wittenberg, Germany. This, in turn, set the Reformation in motion. In the first of these theses, Luther boldly asserted, “When our Lord and Master Jesus Christ said, ‘Repent’ (Mt 4:17), He willed the entire life of believers to be one of repentance.” We find this to be the consistent teaching of the Scriptures—both in the Old and New Testaments. In the prophetic ministry of Hosea, God calls His people to turn from their sin and back to Him again and again.\nThe Covenant Lord—having brought unfaithful Israel before His tribunal in order to pronounce His indictment against them (Hosea 12:1-2)—now does something unexpected. Instead of simply pouring out that judgment, He reminds them of their inception by His grace and of the way in which He brought their father, Jacob, to repentance by grace. \nIn bringing the story of Jacob to bear on the current condition of Israel, the Lord encourages them to respond as their father Jacob had done at Bethel. Though a deceiver from birth, Jacob “strove with the Angel and prevailed; he wept and sought His favor. He met God at Bethel” (v. 4). \nReturning to the Lord involves striving for the covenant blessing—weeping over our sin and longing for the spiritual blessings of God in Christ. Of course, all of this also means that we recognize that it is God who takes the initiative. \nMoving from the story of Jacob to the story of the Exodus, the Lord next reminds Israel that He is the Covenant Lord who sovereignly took them “from the land of Egypt.” He promised that He would “again make them dwell in tents, as in the days of the appointed feast” (v. 9). Returning and restoration are ultimately the work of God’s free grace. God is the great grace initiator. He is the one who provides the redemption that enables His people to repent and turn back to Him.\nNext, the Lord reminded Israel of the central role that His Word plays in bringing His people to repentance. He says, “I spoke to the prophets; it was I who multiplied visions, and through the prophets gave parables” (v. 10). The Word of God is the central means by which Jacob returned to the Lord. Hosea reminds Israel that it was at Bethel (the place where Jacob wrestled with God) that “God spoke with us” (v. 4). The same thing was true at the Exodus: “By a prophet the Lord brought Israel up from Egypt, and by a prophet he was guarded” (v. 10). So, too, for us.\nGod still calls rebellious sinners back to Himself by virtue of His initiating grace and by means of His Word. Just as Luther reminded us that the entirety of the believer’s life is one of repentance, so we are reminded as we read through Hosea of who that repentance comes from and by what means it comes to us.\nWritten By Nick Batzig \n\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram17.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 11:1-12, John 6:32-40, Matthew 23:37",
        "devo_title": "The Lord’s Love for Israel",
        "devo_summary": "\n                    \n                    Growing up in North Texas, tornadoes were common. Every spring, news channels would routinely interrupt our regularly scheduled program to update us on the latest tornadic activity. We’d watch with fear, wondering if the tornado was going to make its way through our part of the state.\nSometimes the tornado came eerily close. We would hide in closets or lie in the bath tub under a mattress, hoping to protect ourselves if it took our roof off. We felt like Isaiah: “We are men of unclean lips! We’re not worthy!”\nWeather like that is fierce and unrelenting. You can’t hug a tornado into submission. It’s like an angry god, hurling its wrath toward anything in its path. It destroys a town and moves on to the next with no compassion or remorse. Honestly, I’m kind of surprised we never left a burnt offering on the doorstep to try and appease the gods of weather. Our fear was a type of worship.\nIn Hosea 11, we continue to see the interesting relationship between God and His people. Israel has been unfaithful. They don’t want God’s steadfast love. Like Gomer, they are a bride who chases after other men. They have a perfect, loving Husband at home, but to them, He’s not good enough. In this passage, there is yet another glimmer of hope because of God’s love.\nPerhaps the most powerful phrase here is in verse 9: “For I am God and not man, the Holy One among you; I will not come in rage.” The good news for God’s people, and all sinful people, is that God is not like us.\nWe seek revenge; God seeks justice. We are spiteful; God is merciful. We are unforgiving; God is über-forgiving. We are adulterers; God is faithful. We are hateful; God is love.\nGod is not like us, but He does come near to us. He is wrathful toward sin, but He doesn’t leave us in His wrath. As He has shown time and again in the book of Hosea and throughout the rest of Scripture, He draws us in rather than forcing us out.\nGod is not an uncontrollable, mindless tornado. He is not seeking to tear the roof off our house, destroy our belongings, and leave us destitute. Though our spiritual houses may collapse, and they almost assuredly will at some point, He will not leave us homeless. He doesn’t leave destruction in His wake and move on to the next town.\nThrough Jesus, God has brought us near. Through the Holy Spirit, God has made us not just His house, but His temple. He lives inside of us. He propels us toward loving and following Him. Though we cheat, He takes us back.\nWritten By Brandon D. Smith \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram16.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 10:1-15, Matthew 11:28, Psalm 25:12-22",
        "devo_title": "His Discipline Is Loving",
        "devo_summary": "\n                    \n                    There’s an old Seinfeld episode where George tries to convince his in-laws that he has a place in the Hamptons. Not believing him, they ask him to show it to them. Knowing they are trying to call his bluff, George nevertheless loads them into his car and drives them two hours away to the Hamptons just because he resents the idea of being called out. The drive is a contest of wills—a test to see who will break first. The problem is that George cannot win because his in-laws see right through him.\nIn Hosea 10, God sees right through Israel’s pretending. They make promises, but they don’t mean them. They offer sacrifices, but don’t connect their own hearts to them. They are in the process of cutting themselves off from God. They’re working so hard to hold it all together, but they’ve reached a point where everything they’re doing now is just for show. They know it. God knows it. But the pretending goes on. It is like a game of chicken, and Israel is convinced they will be the last to swerve.\nBut they’re exhausted. Are you exhausted by the effort you put into your shows of strength and self-sufficiency? I get bone tired when I’m putting up a front.\nGod gives us beautiful prayers in Scripture—words to turn to when we’re weary of pretending to be something we’re not:\nTurn to me and be gracious to me,\nfor I am alone and afflicted.\nThe distresses of my heart increase;\nbring me out of my sufferings.\nConsider my affliction and trouble,\nand take away all my sins.\n– Psalm 25:16-18\nOr, simply, Jesus calling to us:\n“Come to Me, all of you who are weary and burdened, and I will give you rest.”\n– Matthew 11:28\nBut if you’re like me, in our pride, we often refuse to be the first to relent. We just press on toward that image we’re trying to pass off as real.\nBut here’s the thing about God: He delights to take us to the end of ourselves. He will often let us drive Him all the way out to the Hamptons if that’s what we’re bent on doing, knowing we have nothing of substance to show Him there.\nWhy does He do this? Because God, out of love, uses our own stubbornness and futile efforts to discipline us. He brings us to the end of ourselves, and there we find Him ready to take us back. \nAs we grow, may it take us fewer miles of pretending to embrace that truth.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram15.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 6:6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing the key verse for Hosea:\nFor I desire steadfast love and not sacrifice,\nthe knowledge of God rather than burnt offerings.\n— Hosea 6:6 ESV\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/4-HHosea2.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Psalm 51:1",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBe gracious to me, God,\naccording to Your faithful love;\naccording to Your abundant compassion,\nblot out my rebellion.\n-Psalm 51:1\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram13.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 9:1-17, 1 Corinthians 6:9-11, Psalm 51:1-12",
        "devo_title": "Wanderers Among Nations",
        "devo_summary": "\n                    \n                    Have you ever felt like you were in a season of wandering? I’m not talking about adventure seeking or site seeing, but true wilderness wandering. You’re stuck in the desert and can’t find your way out. No way home. Wandering.\nThere is some truth in the oft quoted Tolkienism, “Not all who wander are lost.” But in today’s text, Hosea isn’t talking about the kind of whimsical “off to find yourself” sort of wandering. What Hosea is describing to the Israelites is a hopeless sort of wandering, a diaspora. He’s predicting more of an Israelite refugee crisis than a couple weeks backpacking the Appalachian trail. \nWhy such harsh words? Didn’t God still love His people? YES! But the weight of their sin and the consequences of their actions were serious. \nSometimes we, too, need to pause and have a similar moment of startling revelation. You see, we have the benefit of being able to read this passage with the end of Hosea in mind (and with the Gospels in mind, for that matter!). Chapter 14 describes an opportunity for the people of God to repent and embrace blessing, but it is a difficult time. We know God loves His people and pursues His people, but Hosea shows us that His people need prophetic—and sometimes painful—moments to face the truth.\nSometimes we have to face the depths of our sin to know what exactly it is we are being saved from. If we were to jump straight from transgression to restoration, we might not ever break out of a perpetual cycle of the same sins.\nTrue restoration comes in the wake of repentance—a repentance that understands the wrong committed, but also recognizes what hangs in the balance. The love of God, shown through the cross and resurrection of Christ, is never far from us. But the cross allows us to see the weight of our sin. Only then can we recognize that we can’t lift it.\nGod, in His love and wisdom, works toward our redemption through our repeated failures. This was the story of the nation of Israel: right relationship with God, followed by spiritual drift, followed by intentional rebellious sin, followed by prophetic truth-telling, followed by repentance, followed by restoration, and repeat cycle. In many ways, this mirrors each of our individual spiritual journeys. \nWhile God’s restoring grace is a mystery to us in certain respects, there are a few things we can be sure of: 1) A healthy fear of God is never a bad thing; 2) understanding the weight of sin is painful and scary, but necessary; and 3) God, in His all-knowing and all-embracing love, is with us every step of the way, even if we don’t feel His presence. \nWritten By Andrew Stoddard \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram12.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 8:1-14, Mark 2:15-17, 1 John 3:1",
        "devo_title": "Israel’s False Hopes",
        "devo_summary": "\n                    \n                    I’m a child of divorce. As a young teenager, my mom left my dad for another man after a year-long affair. One day while my dad was at work, we packed up and moved in with her new boyfriend.\nAt the time, it seemed like a good thing. My dad was working tons of hours and had become irritable. My mom’s boyfriend was a “cool” guy, who acted more like my friend than a father figure. I was an immature, naïve kid—I thought my immediate happiness was more important than my parents’ marriage. I was just glad to have a new friend.\nLong story short, he became abusive toward my mom. He was not a “cool” guy; he was manipulative. He destroyed my parents’ marriage and began to destroy our lives. It turns out that the destruction of marriages is not really good for anyone.\nHosea experienced similar heartache. Gomer was a serial cheater. She denied his covenantal love to chase fleeting happiness. She was more interested in the supposed greener grass that was found somewhere else. She didn’t appreciate or realize what she had at home.\nOf course, the story of Hosea and Gomer is the story of God and His people. Israel was no different than we are today. God still says of His people, “They have installed kings, but not through Me. They have appointed leaders, but without My approval. They make their silver and gold into idols for themselves for their own destruction” (Hosea 8:4). Like Adam and Eve in the Garden, we trade the unending joy of giving our lives to God for the quick taste of a rotting apple.\nThroughout the book of Hosea, we see both the loving-kindness and frustration of God with His people. Like Gomer, they refuse His repeated attempts at reconciliation and continue to ignore His love. Divorce is their only true desire.\nBut God told Hosea to stay. In today’s reading, God promises to “remember their guilt and punish their sins” (Hosea 8:13). They pay for their sins, of course. However, though breaking a covenant is painful and destructive, it doesn’t have to be the end.\nAs we see, God didn’t leave Israel to keep chasing that desire. He didn’t sign the divorce papers. He didn’t send His people packing—at least not entirely and not forever. Jesus echoes God’s love for Israel in Matthew 23:37: “Jerusalem, Jerusalem! She who kills the prophets and stones those who are sent to her. How often I wanted to gather your children together, as a hen gathers her chicks under her wings, yet you were not willing!”\nIn Jesus, God keeps His promise to both punish us and redeem us. Sin is punished ultimately through Jesus, not God’s people. He’s doesn’t tell Hosea to do something He Himself isn’t willing to do. He stays. He fights for His adulterous bride. God’s faithfulness is embodied in Jesus’ life, ministry, death, resurrection, ascension, and second coming. The Father’s sending of the Son is the definition of grace: unmerited, undeserved, logic-shattering favor.\nMy parents weren’t able to reconcile. They’re still divorced. But not every story ends that way. Because God’s grace is stronger than any earthly feeling, our story ends the way it should—with a wedding feast and an eternal relationship with the Lover of our souls (Rev. 19-22).\nWritten By Brandon D. Smith \n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram11.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 7:3-16, Galatians 6:6-10, Romans 9:22-24",
        "devo_title": "God Has Not Changed",
        "devo_summary": "\n                    \n                    Kids can be brilliant, clever, and hilarious. But they can be equally dumb and thick-headed. It seems they have two primary ways of exhibiting these latter qualities: 1. disobeying in the same ways repeatedly, no matter what parents say, or 2. thinking they can find a new way to get around rules. And, of course, both lead to the same results each time without fail. Parents’ rules don’t change, don’t bend, and don’t have loopholes. So each exhibition of thick-headedness is met with consequences. The only way this changes is if the kids begin to learn to obey and submit to their parents’ wishes.\nIn Hosea 7, Israel is the thick-headed child. Verse after verse regales the reader with the rebellion of one tribe or another. They are stubborn; they think they are clever. They are trying to put one past God or overrun His authority with sheer will – like that ever works. It’s what got them into trouble in the first place.\nEven more remarkable is that this comes on the heels of redemption upon redemption. Throughout the first part of the book of Hosea, we saw God go to great lengths to show His people how He would rescue them from themselves and their unfaithfulness. And yet, here we are. You and I should resonate with this. We should recognize our own proclivity to rebel, to ignore, to think too highly of our cleverness. We are like Israel in a million ways.\nBut Israel’s, and our, fickleness and foolishness does not change God. He shows Himself to be a Redeemer still. He says, “I want to redeem them.” Despite rebellion upon disrespect upon idolatry, God wants to redeem His people—even though they do not call on Him. They grasp at any other false hope they can find. They use the gifts and abilities God gave them for their own ends instead of for His honor. They reject God completely. Yet still He wants to redeem.\nGod does not change. He does not waffle when we waffle. God does not become distant and unavailable when we distance ourselves. He is steady though we are not. He is faithful though we are not. Though we push God away, He does not push us away. \nGod stands ready to redeem, and make whole, and restore. Always. Even when we behave like stubborn children.\nWritten By Barnabas Piper\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram10.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 6:1-7:2, Matthew 12:1-8, Isaiah 26:16-19",
        "devo_title": "Faithful Love, Not Sacrifice",
        "devo_summary": "\n                    \n                    Hosea writes to a spiritually unstable people, often wavering in their vows to return and seek God. What, then, are we to make of this declaration: “Come, let us return to the Lord” (Hosea 6:1)?\nIs this an expression of genuine repentance, or another vain commitment, a faithless promise?\nEven well-intentioned repentance, if performed in our own strength, will be like the dew that goes early away. Time and again, Ephraim and Judah had vowed and fallen away. They had promised and grown weary of keeping their promise. “What shall I do with you, O Ephraim?” God asks (v. 4). \nLike Ephraim, when I hear that question, my gut reaction is to say to God, “Give me another chance! I can do it this time!” But I cannot. God does not desire my own sacrificial efforts, or any vain attempt on my part to earn His favor. Such pursuits are not repentance. \nYet how often do I substitute “sacrifice” for faithful love? Do I measure my spiritual walk by the fruit that I bear, rather than by what He has done? Do I walk alone, rather than in the light of His fellowship and the communion of the saints? Do I engage in the Word and prayer as to-dos, rather than as feast of grace? When I sin, do I try to earn my way back into God’s favor, rather than leaning wholly upon Christ?\nWe all have Ephraim hearts. We are quick to turn aside and to seek refreshment from strange waters (Jer. 2:17-25). But God, in His great mercy, has offered deliverance even to us. God’s rebukes mercifully drive us to Christ: \n“He has struck us down, and He will bind us up.\nAfter two days He will revive us;\non the third day He will raise us up,\nthat we may live before Him.”\n– Hosea 6:1-2\nOur hope of return to the Lord is not in our efforts, but in Christ. In Him we are struck down, as God visited His just wrath against our sin on the cross. In Him are we raised on the third day. God does not desire vain sacrifice from us, for Christ Jesus, the true sacrifice, has already satisfied the demands of justice. \nTherefore, let us know; “let us press on to know the Lord” (Hosea 6:3). He has come to us as the spring rain, making even the wasteland and desert glad (Isaiah 35:1). Let us lay aside vain pursuits and walk in His steadfast love. How rich indeed is His mercy, how unfathomable His redemption!\nWritten By Caleb Faires \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram9.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 5:1-15, Isaiah 29:15-16, Revelation 3:19",
        "devo_title": "God’s Judgment",
        "devo_summary": "\n                    \n                    A few years ago, a public high school English teacher in our town had all of the junior class read Jonathan Edwards’ famous sermon, “Sinners in the Hand of an Angry God.” The teacher told his students that he had assigned it to them in order to stir up distaste for puritanical theology and preaching. After all, among the countless unpopular subjects someone could bring up, the judgment of God has got to take first place.\nThe teacher then proceeded to tell the class that Edwards was simply trying to scare men and women into a certain form of ethical behavior. Academics have often used this sermon for similar pejorative purposes. However, it must be noted that the content and purpose of this sermon, which God singularly used to bring about the Great Awakening, has often been misrepresented. As he brought this sermon to an end, Edwards, in no uncertain terms, held forth the hope of the mercy and grace of God to those who would come to Christ when he said:\n“Now you have an extraordinary opportunity, a day wherein Christ has thrown the door of mercy wide open, and stands in calling and crying with a loud voice to poor sinners; a day wherein many are flocking to Him, and pressing into the kingdom of God. Many are daily coming from the east, west, north, and south; many that were very lately in the same miserable condition that you are in, are now in a happy state, with their hearts filled with love to Him who has loved them, and washed them from their sins in His own blood, and rejoicing in hope of the glory of God.”\nThe judgment of God is a subject of supreme importance, both for our understanding of who God is and for our understanding of who we are. It is necessary that we come to come to terms with the reality of the righteous judgment of God if we are ever going to understand the nature of His saving work in Christ.\nHere in Hosea 5—as the Covenant Lord brings further indictment against Israel for her spiritual adultery—He now sets before His people, in highly symbolic language, the judgment that they deserve for their idolatrous rejection of Him. Hosea explains that God’s judgment will be poured out like water and that He was promising to come as a destroying “moth” and as “dry rot” (vv. 10, 12). Additionally, the Covenant Lord speaks of His coming in judgment as a lion, “tearing them to pieces” (v. 14). These figures are meant to stir up an understanding of what the people should expect from the Lord.\nHowever, mingled in the midst of the promise of impending judgment is a note of hope. At the end of the charge that the Lord brings against the whole nation, He says, “I will return again to My place, until they acknowledge their guilt and seek My face, and in their distress earnestly seek Me” (Hosea 5:15).\nHere the hope of mercy is held out for those who would turn from their idols and to the Lord. The same God who promises to come in judgment, offers the hope of mercy and grace. All of this, of course, is based on the fact that the Lord would take the judgment on Himself in the person of Jesus. \nWhen Christ came, the wrath of God was poured out on Him like water.\nWritten By Nick Batzig \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram8.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 6:3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing a verse that reminds us of God’s faithfulness:\nLet us strive to know the Lord.\nHis appearance is as sure as the dawn.\nHe will come to us like the rain,\nlike the spring showers that water the land.\n— Hosea 6:3\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/4-HHosea1.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Titus 3:6-7",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHe poured out this Spirit on us abundantly\nthrough Jesus Christ our Savior,\nso that having been justified by His grace,\nwe may become heirs with the hope of eternal life.\n—Titus 3:6-7\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram6.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 4:1-19, Proverbs 19:2, 2 Corinthians 4:3-6",
        "devo_title": "God’s Case Against Israel",
        "devo_summary": "\n                    \n                    I have a terrible habit when reading books. It’s so bad and embarrassing that I hesitate to even confess it. But I’m going to risk it.\nWhen I read books, I sometimes move quickly through difficult passages. So, if a character is about to do something they are not supposed to do, and I know that what they are about to do is going to get them in serious trouble, I have this intense desire to skip over the section or skim the chapter. I want to move on to the resolution or the redemptive movement as soon as possible. \nMy aversion to the dark moments in books (and movies and TV shows) probably requires a trip to the therapist. Fiction or non-fiction, it doesn’t matter. I want to skip ‘em all and get to the light as soon as possible. But, of course, you miss a great deal of beauty when you skip over those parts of the story.\nIt would be really easy to get distracted when reading chapter four of Hosea. Or to skip over the chapter altogether. After all, the author uses the word “whore,” or a variant of it, about a dozen times. It can either distract you or cause you to move along quickly without hearing the full weight of what God is saying to Israel.\nThese are God’s people. And yet, the picture of their falling away from the worship and character expected of them is so dark and twisted, it’s hard to read. We all love the redemptive story of Hosea, but man, chapter four is dark.\nBut really, without chapter four, there is no great redemptive love. If we skip over all the ugliness of the story, we miss out on all the beauty of God’s pursuit of His people. Top to bottom, God’s people were mired in sin that seems almost unimaginable. Even the priests were in on the action. They seem to have rejected God altogether and were acting just like pagans.\nThink about it. If they had only been mildly rebellious, this story of God’s redemptive pursuit of them would have been less than it is. What if they just had an issue with greed and that was it? What if they were sexually chaste and went to church like they were supposed to and were otherwise nice people? Would they still need to be saved from their sin? Sure. But through the story of Hosea, God wanted the glory of His grace to be clear. He wanted it to be something we would stand up and gawk at.\nSo maybe we should slow down when reading chapter four. Maybe we should read it slow enough to catch all the shadows of our need for redemption. Maybe we need to read it carefully enough to see the beauty of God’s redemptive pursuit through Jesus’ blood on the cross. Those are the sins He died to save us from. Read them slowly and then quickly, and remember that they no longer separate us from God.\nWritten By Matthew B. Redmond\n \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram5.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 3:1-5, Romans 5:6-8, Exodus 20:1-3",
        "devo_title": "Waiting for Restoration",
        "devo_summary": "\n                    \n                    We love heroes. The hero of a story is the one we want to resonate with and be like. If you grew up attending Sunday school like I did, that’s often how you come to Bible stories: Who is the hero I should emulate? And certainly there are some heroes in Scripture, or at least heroic moments. There is courage and faithfulness and self-sacrifice.\nIn Hosea 3 we see an act of bold, selfless, forgiving love. Hosea goes to redeem his unfaithful wife for a price, to buy her out of prostitution. Wow. He took her back and paid a price for her, despite her repeated brazen unfaithfulness.\nBut if we are looking for a character with whom to relate in this story, it is not Hosea. It is his wife, the adulteress. We are not the redeemer; we are the unfaithful ones in need of redemption. \nIf that seems harsh or crass, it simply means we lack context. Throughout the Old Testament, God iterates and reiterates His covenant of faithfulness to His people, like a marriage covenant. He affirms that He will be faithful to them (us)—He will be their God and they will be His people. Yet, time and again, the people break that covenant; they cheat on Him. They are unfaithful by seeking out other gods or seeking to be their own gods. And we are just the same.\nThe hero of this story is God the Redeemer, the One who purchased His unfaithful bride out of the bondage they (we) chose. But this is no rom-com story of unrequited love turned to affection in a twenty-minute montage. In this story, God’s people must wait for restoration. Wholeness after brokenness doesn’t happen all at once, or even in a short time.\nFor Israel, God was promising the coming of Christ after a long wait. He would free them from exile, but their restoration would come only after a long wait. And what He asks of them is faithfulness—to cling to Him and no other. And that is the command for us as well. \nOur wait after redemption is for sanctification, to be made holy. This does not happen all at once but rather by grace, through faith, over time—until the day comes when God’s people are made perfect in His presence.\nHere and now, we must look to our Redeemer, the One who paid a price for our unfaithful selves, and be faithful to Him. This is our call. We are called to be faithful to Him alone while we wait for the restoration that will make us whole and free in God’s goodness. \nWe are the rescued, and He is the hero.\nWritten By Barnabas Piper \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram4.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 2:14-23, 2 Samuel 12:1-10",
        "devo_title": "You Are My People",
        "devo_summary": "\n                    \n                    Few marriages survive in the wake of infidelity. Even fewer survive situations of serial unfaithfulness. Without the presence and love of God, it’s nearly impossible for a marriage that has suffered such a blow to become whole and healthy once again.\nSo much more than physical intimacy is severed through unfaithfulness. Emotional connectedness, relational trust, spiritual oneness—all of these are fractured through adultery.\nIt’s easy to read portions of Hosea and have a sense of indignation towards his wayward wife. But the reality is, spiritually speaking, we have all walked in the steps of Hosea’s prostitute wife more than once.\nHosea’s life was meant to be an extended illustration to the people of Israel, indicting them for their serial unfaithfulness to God. Despite the goodness God had shown them, in spite of the redemption and release from slavery He had given them, regardless of His continuous provision, the people of Israel perpetually found themselves worshiping false gods. Most prominently in Hosea, we see that the Israelites turned their affections towards Baal, a pagan god of fertility.\nGod’s relentless pursuit of His people was visualized in the life of Hosea. Hosea offered unconditional love and forgiveness to his wandering wife. Though she had countless lovers, Hosea always welcomed her home with loving arms wide open.\nHosea would speak to her, “You are my wife. You are loved. Come home.”\nGod spoke to the Israelites, “You who do not deserve to be my people, you are my people. Come home. You are loved.”\nGod speaks to you now: “You who have sought other lovers and encounters with false gods, through other people, places, and possessions – you are my bride. Come home. You are loved.”\nWe know from Paul’s letters that we are the Bride of Christ. Yet we also know from experience that we are far from being a faithful one. Only the supernatural love of God can cover and forgive such blatant and constant transgressions.\nThe product of our sin, the result of our wayward choosing, is that we end up in the camp of “not my people.” We wander away from our spiritual home in search of passions and pleasures that we think will fill the void. Yet what you need, what I need, what we all need most is to turn to God. \nHe will always call us back and always rename us, “his people.” \nWritten By Andrew Stoddard \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram3a.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 2:1-13, Ezekiel 21:1-7",
        "devo_title": "Not My People",
        "devo_summary": "\n                    \n                    I wish I could remember which friend it was. I can’t. But that friend sent me a photocopied chapter from a book that was soon to be released. The pages came with very little commentary other than “dude, read this.” So I did, sitting on a sun-warmed boulder in the middle of a swollen river in Arkansas. And to this day I cannot read these verses from Hosea without thinking of the phrase Brent Curtis used to title those pages – “less-wild lovers.”\nThat chapter from The Sacred Romance talked of the many “lovers” we chase after in our lives, the addictions we flirt with and often allow to take root in our hearts. These addictions can range from alcohol to bible studies to exercise and everything in between. We’re convinced the promises these lovers make will fill the ache in our bones, and often they do for a season. But only for a season. Then we’re faced with the choice: double up and try harder, or search out for some new same-but-different thrill, or slowly resign ourselves to what Thoreau called the life of quiet desperation.\nAll the while the wildest of lovers waits. But God’s is not some impotent waiting. It is jealous.\n“I will expose her lewdness.”\n“I will ruin her vines.”\n“I will punish her for the days she burned incense to the Baals.”\nNot the kind of let’s-make-sure-everybody-feels-good-because-love-wins spirituality that’s so viral these days, is it? No, not by a long shot. But if we’re going to read Scripture in its fullness, then this is part of the picture of God’s love.\nYou don’t need a theology degree to understand the force behind these verses. It’s humblingly clear: “she…went after her lovers, but me she forgot” (Hosea 2:13). To chase other lovers is simply to forget God, the God who set aside His glory and wrapped Himself in flesh so that you and I might be called the sons and daughters of God. If you’ve ever loved someone with all you have and then that person left you for greener pastures, so to speak, then you know the feeling of being forgotten. It is the feeling of a broken heart.\nWhile we chase the less-wild lovers, the wildest One waits. But these verses won’t allow us the excuse of “I didn’t know.” We do. Scripture is clear. God’s is not some impotent waiting. He is jealous. Jealous for our full affection.\nWritten By John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram2.jpg"
    },
    {
        "book_title": " Hosea",
        "devo_passages": "Hosea 1:1-11, Titus 3:4-7",
        "devo_title": "God’s Command to Hosea",
        "devo_summary": "\n                    \n                    Hebrews 10:31 tells us “it is a fearful thing to fall into the hands of the living God.”\nA number of years ago, a friend of mine got arrested for doing something bad in public—bad enough to make the evening news. That’s how we learned about his offense—by watching him get loaded into the back of a police car on tv.\nOne person in our friend group said, “Wouldn’t it be strangely freeing if everyone knew our most secret sins – if when we walked into a room, everyone knew the truth about us? Wouldn’t there be some good in it if people knew the things we work so hard to hide?”\nIn a manner of speaking, the book of Hosea opens with the people of Israel in cuffs, getting loaded into the back of the squad car. It happens like this: God tells His prophet to Hosea to “take to yourself a wife of whoredom and have children of whoredom, for the land commits great whoredom by forsaking the Lord” (Hosea 1:2 ESV).\nHosea’s life was to be a sort of performance art. His marriage, along with all the pain it would bring him, was meant to stand as a witness against the people to whom he had been sent to proclaim God’s call to repentance. Good things—great things, in fact—lay in store for God’s people; but first they needed to be busted for who they really were: unfaithful people, raising a new generation in their infidelity.\nThere is no greater love than to lay down your life for your friends (John 15:13), but Hosea is a hard book. When you start to imagine the circumstances that would have moved God to ask His prophet to offer up his own heart for the sake of a nation of betrayers, it gets dark quickly. Think of the nights Hosea spent alone, knowing what his wife was up to. Hosea loved Gomer. He really did. But he knew she would break his heart over and over again. Unless Gomer herself felt the pain of her infidelity, she would never repent. But for this to happen, she would have to own the truth about who she was.\nThe same is true for us. Hosea’s marriage told Israel they were living like prostitutes while in a marriage covenant with God Himself. Hosea’s marriage, along with his genuine love for and sorrow over Gomer, was meant to arrest Israel (and us) in their (and our) acts of infidelity and read to them their (and our) rights. \nBecause of Jesus, we have the right to know God and to live at peace with Him. But as long as we deny our crimes—our perpetual running after other lovers—we will never accept the means by which we find the peace our hearts long for. Unless we are apprehended and exposed for what we are, we will never understand the steadfast love and mercy of our Groom—Jesus Christ, who took us as His own and binds our wandering hearts to Him.\nIt is a fearful thing to fall into the hands of the living God. But how else will we be set free?\nWritten By Russ Ramsey \n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Hosea-instagram1.jpg"
    }
]