[
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 19:27",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse from God’s reply to King Hezekiah through the prophet Isaiah in day 23, a reminder that God is intimately involved in the lives of His people.\n“But I know your sitting down,\nyour going out and your coming in,\nand your raging against me.”\n—2 Kings 19:27\nFind the corresponding memory card in the back of this book.\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/4-Kings-4.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Corinthians 5:21",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe made the one who did not know sin to be sin for us, so that in him we might become the righteousness of God.\n—2 Corinthians 5:21\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-27.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 24:1-20, 2 Kings 25:1-30, Joshua 5:10-12, John 2:19-22",
        "devo_title": "Jerusalem Destroyed",
        "devo_summary": "\n                    \n                    The setlist is complete, the lead singer has thanked the crowd for coming, and the band has exited the stage. But the house lights remain off, the stage lights have been left shining, and a few of the group’s biggest hits have mysteriously been left unplayed. As concertgoers, we know what all of this means: an encore is coming. All we have to do is stand up and applaud like wild. After a minute or two, the band will retake the stage and deliver those missing hits.\nHere at the end of Kings, God Himself is signaling for an encore of sorts. It would seem the story is over. The people of Judah, like Israel before them, have been marched out of the promised land in shame. Jerusalem’s walls have been demolished, and the temple has been destroyed. “So Judah went into exile from its land” (2 Kings 25:21).\nBut in the midst of this apparent and heart-wrenching finality, God set the stage for another act in the story of redemption. “On the twenty-seventh day of the twelfth month of the thirty-seventh year of the exile of Judah’s King Jehoiachin, in the year Evil-merodach became king of Babylon, he pardoned King Jehoiachin of Judah and released him from prison” (v.27). A king of Judah—a descendant of David—is alive and well. There is a spark of hope flickering in the darkness. The spark isn’t much, of course, but it signaled to ancient readers—and us—that God stands ready to fan it into a flame.\nReading the books of 1 and 2 Kings this side of the New Testament, we know that God did not abandon His people. He brought them back from Babylon, and He fulfilled every Old Testament promise through Jesus Christ (2 Corinthians 1:20). We know that the Son of God died to conquer sin and death and that through Him, eternal life is available to any and all who believe—not just to the physical descendants of Abraham but also to people from every nation under heaven.\nWe know all this because we have the benefit of hindsight. But God is just as faithful even when we don’t have this benefit. In our current struggles and doubts, God has left us a spark of hope. Actually, He’s left us a bonfire of epic proportions. In His Word, He has promised to make all things new (Revelation 21:5), and to work all things for our good, if we have placed our trust in Him (Romans 8:28–29). Those are not promises of health, wealth, or comfort. In fact, Jesus was very clear when He promised we’d have trouble in this world (John 16:33). But we can rest in God, because He is faithful. No matter how dark things may seem, the story of redemption will not end until His children are safe at home with Him. The encore is coming, and we have yet to hear the best songs.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-26.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 22:1-20, 2 Kings 23:1-37, 2 Corinthians 5:21, Galatians 3:13-14",
        "devo_title": "Covenant Renewal",
        "devo_summary": "\n                    \n                    Have you ever done everything that’s been asked of you, but things still didn’t seem to work out the way you thought they would? You did everything you could to solve a problem, but despite your best efforts, you simply couldn’t do enough to fix what was broken. King Josiah faced such a situation, but before we get into that, we have to set the stage a bit.\nFollowing Hezekiah and his relatively righteous rule came his son and grandson, Manasseh and Amon. Both Manasseh and Amon did what was evil in the eyes of the Lord. Neither of them could come close to matching the faithfulness of Hezekiah. Manasseh committed idolatry worse than other nations around Judah, and God promised that disaster would follow Judah as a result. Then, his son Amon didn’t do much better. He also forgot God and followed in his father Manasseh’s footsteps, worshiping idols instead of Yahweh, and in the end, he was killed by his servants. Both men continued to drive Judah deeper and deeper into sinful idolatry.\nThe evil that had run amok throughout their reigns could not be undone by the succeeding king. After their catastrophic reigns came a king the likes of which Judah had not seen since David. Josiah, son of Amon, took over after his father’s death, and he ruled with more righteousness than even Hezekiah had three generations before him. Scripture tells us, “He did what was right in the Lord’s sight and walked in all the ways of his ancestor David; he did not turn to the right or the left” (2 Kings 22:2).\nThis pronouncement of Josiah’s righteousness calls to mind the requirements for a king laid out in the Mosaic Law in Deuteronomy 17 (vv.14–20). Speaking of a righteous king’s need to study and meditate on the Law, verse 20 says, “Then his heart will not be exalted above his countrymen, he will not turn from this command to the right or the left, and he and his sons will continue reigning many years in Israel.” Josiah fits that description.\nKing Josiah was righteous like King Hezekiah generations before him, though, just like his ancestor, Josiah wasn’t perfect by any means. As king, Josiah stayed on the straight and narrow path and was not distracted by idols or evil worship practices like his unfaithful predecessors. By all accounts, Josiah did everything in his power to restore Judah to Yahweh and right the wrongs that had been perpetuated for generations before him.\nBut it wasn’t enough. Not even this righteous king could repair the fractured relationship between Yahweh and Judah. Josiah was eventually killed by a foreign king, and Judah was still driven into exile. How frustrating it must have been to do everything “right,” relatively speaking, and yet still not see your goals fulfilled!\nJudah, like the whole world, did not simply need a king who would stay on the path of righteousness. They needed the King who had created the path of righteousness and who would walk it perfectly on their behalf. Jesus Christ is the ultimate King of Judah and of the whole world. The Father “made the one who did not know sin to be sin for us, so that in him we might become the righteousness of God” (2 Corinthians 5:21). He is the true King, who not only leads us in the ways of righteousness, but more importantly, has made us righteous before God, once and for always.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-25.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": " 2 Kings 20:1-21, 2 Kings 21:1-26, Proverbs 11:2, John 14:13-14 ",
        "devo_title": "The End of Hezekiah’s Reign",
        "devo_summary": "\n                    \n                    The spring of my freshman year of college, I was coming out of one of the most difficult periods of my life. I was looking forward to a summer at home with my friends, and most of all, I was growing ever closer to a girl I had long admired and hoped to date. Susie and I had been friends since middle school, and that spring, we planned a conversation about whether or not we should consider dating—something I desperately wanted but Susie had resisted.\nThe day of the meeting came. For six hours, from the end of my classes that day until the meeting late in the evening, I just prayed to the Lord, asking for clarity of mind and wisdom. I was nervous and unsure of myself. By the grace of God we did end up dating at the end of the summer, but most amazing to me was how faithful the Lord was to answer my prayers for clarity and wisdom in the moment. It is one of the clearest answers to prayer I have experienced in my life.\nIn 2 Kings 20–21, we see the end of Hezekiah’s reign. King Hezekiah was the most David-like king since David himself. He was the most righteous king Judah had ever seen, reforming worship practices and trusting in the Lord above all. He was certainly not a perfect king, but he was not as wicked as the kings who had come before him.\nIn today’s passage, we read that Hezekiah has become ill. Isaiah (yes, the prophet for whom the book of the Bible is named), comes to the king and gives him a word from God: “Set your house in order, for you are about to die; you will not recover” (2 Kings 20:1). In his illness, Hezekiah just wants to be left alone. Can you relate? But “then Hezekiah turned his face to the wall and prayed to the LORD, ‘Please, LORD, remember how I have walked before you faithfully and wholeheartedly and have done what pleases you.’ And Hezekiah wept bitterly” (vv.2–3). Before Isaiah had even left the palace, God gave him another word to deliver to Hezekiah:\nThis is what the LORD God of your ancestor David says: \n“I have heard your prayer; I have seen your tears. Look, I will heal you. \nOn the third day from now you will go up to the LORD’s temple. \nI will add fifteen years to your life. \nI will rescue you and this city from the grasp of the king of Assyria. \nI will defend this city for my sake and for the sake of my servant David” (vv.5–6).\nGod heard Hezekiah’s prayer, and his faith was not overlooked. No, Hezekiah was not perfect, but he trusted in a God who is. Why do we think we can do anything more? How often do we face dire circumstances and trust in our own might rather than the Lord? When we face conflict at work, do we try to resolve it without taking a moment to pray for wisdom? When we encounter a difficult parenting situation, do we discipline our children before we ask the Lord to show us how to love in the midst of our frustration? The Lord truly does hear our prayers. Our part is to turn to Him and share our hearts, to ask Him to do what only He can.\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-24.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 18:1-37, 2 Kings 19:1-37, Numbers 21:4-9, Isaiah 9:6-7",
        "devo_title": "Hezekiah’s Prayer",
        "devo_summary": "\n                    \n                    When Assyria besieged Jerusalem, King Hezekiah immediately humbled himself. He tore his clothes and put on sackcloth (2 Kings 19:1). Then he gathered his leadership team, and he sent them to the temple to seek the Lord. The officials confessed together: “Today is a day of distress, rebuke, and disgrace” (v.3). They owned that when the Assyrians’ attacked, it revealed a weakness in their own leadership.\nHezekiah may have sent tribute to Egypt in order to gain their aid in the battle against Assyria; Israel and Judah were often tempted to seek support from one neighboring superpower when they were attacked by another (2 Kings 17:4; Isaiah 20:5; Hosea 7:11). Sennacherib assumed that’s what Hezekiah had done when he called him out in his taunts: “Now look, you are relying on Egypt, that splintered reed of a staff that will pierce the hand of anyone who grabs it and leans on it” (2 Kings 18:21). Isaiah had warned Judah against trusting in Egypt (Isaiah 31:1–5). Now Hezekiah was sending his officials back to Isaiah with their tails between their legs. Isaiah doesn’t rebuke the leaders. Instead, he becomes for them a minister of mercy. He declares they’ll be vindicated—not on the basis of their skill in diplomacy but on the basis of divine intervention: “‘[the king] will hear a rumor and return to his own land, where I will cause him to fall by the sword’” (2 Kings 19:7).\nIf the story stopped there, it would be a tidy little picture of grace and deliverance. But even when he found forgiveness, Hezekiah’s misplaced trust carried consequences. You see, just as Assyria’s army was pulling out, they received word that the king of Cush was marching north to attack them (v.9). Cush is modern-day Ethiopia, and at that time, it would have been part of southern Egypt. When the Cushites arrived, it signaled that Pharaoh was making good on his alliance.\nHave you ever been in an argument and just as things start to cool down, you—or your spouse or friend—say something that ups the ante, and things get heated again? That’s what Cush’s arrival was like. When Cush arrived, the Assyrians fired a nasty message back to Hezekiah: “‘Look, you have heard what the kings of Assyria have done to all the countries: They completely destroyed them. Will you be rescued?’” (v.11).\nNow Hezekiah was desperate, so he went up to the temple. He didn’t send his officials this time. No, the king went up himself, and he laid it all out before the Lord, literally spreading out the threatening letter he’d received before God (v.14). Then the king prayed:\n“LORD God of Israel, enthroned between the cherubim, you are God—\nyou alone—of all the kingdoms of the earth. You made the heavens and the earth. \nListen closely, LORD, and hear; open your eyes, LORD, and see” (vv.15–16).\nHezekiah pleaded with God to be true to His promises. He begged for deliverance, and God answered miraculously. You see, trusting God isn’t always neat and tidy. Most often, it looks messy and desperate. However you are, come to Him today. Lay it all out before the Lord.\nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-23.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 16:1-20, 2 Kings 17:1-41, Proverbs 29:2, 1 Peter 2:21-25",
        "devo_title": "The Fall of Israel",
        "devo_summary": "\n                    \n                    When I teach the kids in our church’s children’s ministry how Israel, again and again, fell into idolatry, there’s a phrase I use. I’ll say, “They worshiped pretend gods instead of the one, true God.” That’s one way to describe it, but there’s more to idolatry than putting statuettes of false deities on your mantle and burning incense to them. In 2 Kings chapter 17, we find a chilling description of what idolatry is and how it exposes us.\nFirst, idolatry involves forgetting what God has done for us (vv. 7–8). God brought the people of Israel out of the land of Egypt from under the power of Pharaoh, king of Egypt (v.7), but they abandoned Him. They turned away from their Savior and put their trust in worldly customs and practices rather than in God. When we abandon biblical wisdom to follow what seems right by worldly standards, we do the same.\nSecond, idolatry involves closing our ears to God’s warnings (vv. 9–14). The people of Israel weren’t ignorant about what they were doing. God had clearly commanded them: “You must not do this” (v.12). He’d even sent prophets to warn them: “Turn from your evil ways and keep my commands” (v.13). But they failed to listen to His loving warnings. Any time we close our ears to godly counsel, we do the same.\nThird, idolatry reveals the fullness of our corruption (vv. 14–17). Israel goes from bad to worse. In the end, they sacrificed their own children in the fires of their sin. Our idolatry ultimately exposes the wickedness and brokenness of our sinful hearts. In Moby Dick, Herman Melville tells us about an idol worshiper named Queequeg who spends a day in fasting and bowing before a little idol named Yojo. Melville describes the protagonist, Ishmael, and how he restrained himself from correcting the pagan sailor. At one point Ishmael says to himself, “Heaven have mercy on us all… for we are all somehow dreadfully cracked about the head, and sadly need mending.”\nIn the end, Israel fell, and their idolatry was met with righteous judgment (vv. 18–23). God’s anger could no longer be held back from Israel, and He removed them from His presence by sending Assyria to take them into exile.\nWe’re so much like the nation of Israel. Like sheep, we easily go astray (Isaiah 53:6). Praise be to God that the downward spiral of idolatry can be broken. If we acknowledge the depth of our sin, we can return to the Shepherd and overseer of our souls. We can turn from idols and serve the Living God, because “he himself bore our sins in his body on the tree; so that, having died to sins, we might live for righteousness. By his wounds [we] have been healed” (1 Peter 2:24).\nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-22.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 8:19",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 2 Kings, a reminder of the Lord’s faithfulness to His people.\nFor the sake of his servant David, the Lᴏʀᴅ was unwilling to destroy Judah…\n—2 Kings 8:19\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/4-Kings-3.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "Psalm 72:18–19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBlessed be the LORD God, the God of Israel,\nwho alone does wonders.\nBlessed be his glorious name forever;\nthe whole earth is filled with his glory.\nAmen and amen.\n—Psalm 72:18–19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-20.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 14:1-29, 2 Kings 15:1-38, Ezekiel 37:1-14, Luke 5:32",
        "devo_title": "Flawed Kings and Kingdoms",
        "devo_summary": "\n                    \n                    It’s easy as a Christian to be jaded about the world. All around us, we see injustice and sliding morals. It can seem as if there is no help for society. It’s also easy, when comparing the Church to the world around us, for Christians to feel somewhat “cocky” about our moral standing. After all, we’re God’s people, salt and light and all that. The world should listen to us! In this way, we’re like the kings of Judah, with pagan nations surrounding them and the backslidden Israelites up north (2 Kings 14).\nBut Judah’s kings were hardly heroes. Even when these rulers followed God, which was more often the exception rather than the rule, they didn’t follow Him wholeheartedly. Amaziah, for instance, “did what was right in the LORD’s sight, but not like his ancestor David” (2 Kings 14:3, emphasis mine). Each of Judah’s kings failed to eradicate false worship in the land. What led to their half-hearted devotion? Pride! After defeating Edom, King Amaziah flexed his bravado and challenged the northern kingdom to war. Jehoash, his evil Israelite counterpart, tried to be a voice of reason, rebuking Amaziah: “You have indeed defeated Edom, and you have become overconfident. Enjoy your glory and stay at home. Why should you stir up such trouble that you fall—you and Judah with you?” (v.10). Amaziah didn’t listen, so Judah was routed before Israel in battle (v.12).\nWhen we judge our neighbors’ sins but fail to repent from our own pride, we’re like the cocky kings of Judah. Before we attempt to brush the sawdust from our neighbor’s face, we need to remove the log that has impaled our own (Matthew 7:3–5). Christians are called to be more concerned about our own sin than we are of the world’s sins. We must believe that but for the grace of God, we’re capable of any failure. And when we see brokenness in the world, we mustn’t stand at a distance and snub our noses. Instead, we’re called to move toward the hurting, to move toward sinners (Luke 5:32).\nWhat can motivate such humility and love? It’s confidence that God is working even in the midst of great evil. Did you notice in these chapters what God does in Israel—not in Judah, but in terrible Israel? He fulfills prophecies and promises (2 Kings 14:25; 15:12). Though there is unthinkable evil at the hands of Israelite anarchy, God preserved the backslidden nation by holding back exile (vv.16,19–20). You see, “the LORD saw that the affliction of Israel was very bitter,” and in His compassion, “he delivered them” (2 Kings 14:26–27). It’s easy to forget that God loved us even when we were dead in our trespasses and sins. Even when we were His enemies, Christ spoke life into us. How can we not be confident that He’ll love our broken world the same way?\nWritten by Jared Kennedy\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-19.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 11:1-20, 2 Kings 12:1-21, 2 Kings 13:1-25, Psalm 125:1-5",
        "devo_title": "Further Attempts at Reform",
        "devo_summary": "\n                    \n                    Every morning before classes start, I sit in a chair outside my office and greet sleepy students as they enter the building. Often, those students will stop by to talk, and we’ll have lighthearted conversation—either that or they’ll complain about the tests and quizzes they’ll be facing throughout the day. Sometimes we talk about serious things. They let me know what’s hard about a class or difficult about being a teenager at that particular moment. They ask for advice, and usually, I can give them some.\nThis morning I had one of those serious conversations. I was reading over 2 Kings 11–13 when some students walked in and asked me what I was doing. So I told them about this piece of writing I needed to work on, the one you’re reading now. I explained the story in all of its literal gory details, which led to a discussion about how the kings were “so dumb.” Why were they so blind to the fact that when they remained faithful to God, things went well for them and their people? Why couldn’t they muster the courage or care to be faithful?\nThere we were—me sitting in my chair, them leaning in the doorway, gripping backpacks—all of us shaking our heads in disbelief at the unfaithfulness of God’s people. Sure, there were some bright spots in the line of the kings, but for the most part, they were a bunch of idolaters. Even in their attempts to remain true to God they were ultimately inept and tolerated idolatry in the kingdom. So we railed against them, my students and I, feeling pretty good about ourselves as we did so. But by the time I reached 2 Kings 13, it was pretty hard for me to maintain that attitude.\n“But the LORD was gracious to them and had compassion on them, \nand he turned toward them, because of his covenant with Abraham, Isaac, and Jacob, \nand would not destroy them, nor has he cast them from his presence until now” (2 Kings 13:23).\nGod was willing to destroy because of His covenant with Abraham, Isaac, and Jacob. Because of Him, the covenant would hold true. Then it dawned on me: I’m still counting on His keeping His covenant of love. That is the crux of my faith.\nOur disbelief at the kings’ unfaithfulness was misplaced. We should have been shaking our heads in disbelief at how God did not cast them away from His presence, nor did He destroy them right there on the spot. That’s what is truly shocking. In the same way, even though I deserve worse than physical death because of my sin, because of Christ’s work on the cross, I am not cast out but invited to draw near to Him (Romans 5:8; Hebrews 4:16). It’s a covenant that is in tact by His pure grace and compassion alone—not my ability to be faithful.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-18.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 8:16-29, 2 Kings 9:1-37, 2 Kings 10:1-36, Psalm 72:1-20",
        "devo_title": "Attempts at Reform",
        "devo_summary": "\n                    \n                    “Come with me and see my zeal for the LORD!” (2 Kings 10:16).\nI went on a lot youth trips as a teenager—camps and retreats with games, Bible studies, late nights and early mornings. One constant at these events was the altar call. And like a lot of church kids, I went forward more than once over the years, so much so that the experiences blur together in my memory.\nBut I do remember this one time during an altar call when I felt convicted about the music I was listening to. So, on the way home, a friend and I decided to trash all our secular music as soon as we could. The next day we met up at his house, resolved to part with our worldlier music in one glorious, zealous, and committed act of devotion to God. Well, actually, it was a lot of little acts of devotion. I had a lot of music—hundreds and hundreds of cassette tapes and CDs—and they couldn’t all be obliterated in a single motion.\nBut we did it. Together, my friend and I destroyed them. We used a mallet and a hammer to smash them all to pieces—little tiny plastic shards of secular music. After all, we didn’t want anyone else to be able to listen to them. Needless to say, the mess in my friend’s driveway was a thing to behold. All these years later, how I approach music has changed, but my hope is to live even more committed to the Lord.\nNow, I know it’s not the same thing by a longshot, but when I read the word zeal in today’s passage, I feel like I understand Jehu a bit. He laid waste to the enemies of the Lord, and then he killed the Baal worshipers who’d used the temple as a latrine, just as if they were top-40 CDs stacked in a pile on my friend’s driveway.\nSadly, while Jehu did as the Lord commanded early on, he failed to be faithful in his reign as king over Israel. “He did not turn away from the sins that Jeroboam son of Nebat had caused Israel to commit—worshiping the gold calves that were in Bethel and Dan” (2 Kings 10:29). After going to such great lengths to rid the land of idolaters, he became an idolator himself.\nZeal for the Lord is good, but we also need to be faithful in driving out idolatry from our lives. As John Calvin once said, “Man’s nature, so to speak, is a perpetual factory of idols.” We need to cultivate a passion and commitment to the Lord that does not wax and wane, prepared to remove whatever obscures the glory of the crucified King. He is unlike Jehu or any other earthly king, and His passion and love for us never fails.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-17.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 6:1-33, 2 Kings 7:1-20, 2 Kings 8:1-15, Deuteronomy 6:10-12",
        "devo_title": "Elisha’s Ministry Continues",
        "devo_summary": "\n                    \n                    “O LORD, please open his eyes and let him see” (2 Kings 6:17).\nOne day after work, I was driving home and listening to a sermon, and I heard something I have not since forgotten. I doubt I’ll ever forget these words: “All the most important, most real things in the universe are invisible to us.” If my Toyota Camry had been struck by lightning, I would not have been jolted any more than I was that night.\nThe King and His kingdom are invisible to us. The Holy Spirit is invisible to us, and indeed, God the Father is too. We can read about God and see evidence of Him in our lives, but technically, He is invisible to our human eyes. This makes Him no less real, of course, but in my humanity I sometimes struggle to believe that the invisible is real. That God is here, with me now.\nI live as if the King is not abiding with me as promised (John 15:5). I walk around as if the visible things I can see and touch are all that truly matter, that they must take precedent. Money and clocks and transmissions and food—those are all “real.” But the King and His kingdom—do I live as if they are real? Are my eyes open to eternal realities, to what my human eyes cannot see?\nIn today’s reading, we read that the king of Assyria is understandably unhappy when one of his servants tells him that “Elisha, the prophet in Israel, tells the king of Israel even the words you speak in your bedroom” (2 Kings 6:12). Can you imagine the king’s fear and frustration? I mean, I’m actually afraid of what Alexa overhears while “listening” in our home. I can understand the king’s frustration when he realizes that Elisha, through the power of God, is able to know his every move and plan. So what does the king do? He sets out with “a massive army” to seize the prophet (v.14).\nThen, as the king’s army comes to surround the city, Elisha’s servant looks up and sees them and says, “Oh, my master, what are we to do?” (v.15), to which Elisha tells him, “Don’t be afraid, for those who are with us outnumber those who are with them” (v.16). Elisha then asks the Lord to “please open [the servant’s] eyes that he may see” the reality of the battle scene: the army surrounded them, but “the mountain was full of [God’s] horses and chariots of fire” (v.17).\nNow that’s a pretty dramatic scene, but what is truly remarkable is the fact that Elisha already knew that the angel armies were there! He saw what was invisible to the eyes of his servant. The servant saw the problem, and wondered what they needed to do to fix it. But Elisha knew that God, who is invisible, would care for them.\nIf I’m honest with myself, I know I am far more like the servant; I need to be reminded that the same God who saved me from my sin will be faithful to care for me now, in this life and in the life to come. Even now, He is at work on my behalf, though I may not be able to see how He is working. The reality is that our Savior has defeated sin and death, making us citizens of a forever kingdom, one of love, joy, and peace. May He open ours to see Him.\nWritten by Matt Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-16.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 3:1-27, 2 Kings 4:1-44, 2 Kings 5:1-27, John 4:10",
        "devo_title": "Elisha’s Ministry",
        "devo_summary": "\n                    \n                    As I see it, one of the most chilling scenes in all of literature is found within Charles Dickens’ famous masterpiece, A Christmas Carol. The Ghost of Christmas Yet to Come visits Ebenezer Scrooge, showing him a conversation where a group of businessmen are discussing someone’s death. There isn’t much good to say about the person, and when the discussion turns to the man’s funeral, they agree there isn’t much point in going unless there’s a free lunch. Of course, the vision of the future is a revelation of Scrooge’s own death, and the defining, seemingly unanimous reality of his mark on the world is that he was a miserable, lonely, friendless, hermit of a man.\nThe scene disturbs me because it gets me thinking about my own death, about what people will have to say about me when I’m gone. What reputation will hang over my life here when it is over? I don’t know if you think about these things often, but they are worth considering. So, what will others say about you and your life when all is said and done?\nElisha’s ministry is miraculous. From multiplying limited stores of oil, to proclaiming fertility to a barren woman, to raising a dead child from the dead (2 Kings 4:1–37)—these scenes are just a few glimpses of Elisha’s part in God’s miracles. And yet, these miracles aren’t necessarily the defining statement on Elisha’s life and ministry. What is noted about him and his reputation is declared by the king of Judah, Jehoshaphat.\nLooking for wisdom from the Lord in light of how to fight the neighboring Moabites, Jehoshaphat and Joram seek insight. Upon hearing a prophet is in the area, they wonder who the prophet is. When it’s revealed that the prophet is Elisha, Jehoshaphat is satisfied because he believes “the word of the LORD is with him” (2 Kings 3:12). Clearly, Elisha has a powerful reputation!\nBrother, perhaps this could be said of you? Do you long for this kind of reputation? Beyond just your occupation, your career achievements, the status of your financial portfolio, even the family and children you leave behind, what would be said of you? Perhaps the best would be that you were a man of God’s Word.\nThis starts with our faith in the Word of God incarnate, Jesus Christ, who became flesh and blood, died for our sins, and was raised to life again on the third day. We become “men of the word of God every day” as we listen, read, study, memorize, meditate, and share the truth of the gospel daily.\nKnown for more than the miracles he performed, Elisha was a man of God’s word. What reputation will you leave behind? What declaration will be made you and your life on that last day?\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-15.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 18:39",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 1 Kings, a reminder that God is Lord over all.\nWhen all the people saw it, they fell facedown and said, “The Lᴏʀᴅ, he is God! The Lᴏʀᴅ, he is God!”\n—1 Kings 18:39\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/4-Kings-2.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "Psalm 103:22",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBless the LORD, all his works\nin all the places where he rules.\nMy soul, bless the LORD!\n—Psalm 103:22\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-13.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "2 Kings 1:1-18, 2 Kings 2:1-25, Romans 11:1-6",
        "devo_title": "Elijah in the Whirlwind",
        "devo_summary": "\n                    \n                    How about ‘dem bears!\nAs a man who is deficient in the “head of hair” category and who hears the mocking of young punk kids (namely my own) because of it, this story has been read before bed on a fair number of occasions. Somehow the jesting hasn’t stopped. Apart from the humor this passage from 2 Kings brings us, it drives home the reality that the torch of ministry has been passed. Elisha now has the role of representing God as a prophet in Israel.\nThese kinds of transitions can be rather difficult. The church where I serve on staff has been in the midst of a transition between a man who served as senior pastor for over twenty-five years to a new leader. The fear that this new pastor won’t measure up to the impact of the former looms high. Following a faithful legacy-leader can bring out all kinds of insecurities and challenges that, just a few months earlier, showed no signs of bubbling to the surface.\nThe question that often sits below the surface in these kinds of transitions is one of God’s presence and favor: Is God still with us? Has His blessing, His power, His grace subsided in some way so that we’re worse off than when we were before?\nAfter Elijah is raptured away in the whirlwind, Elisha stands holding the mantle of ministry and asks, “Where is the LORD God of Elijah?” (2 Kings 2:14). The answer is immediate. God is still there, still powerful, still faithful, still holy. The transition from Elijah to Elisha was not a downgrade or transition from God’s power and glory to a lesser power and glory. In Elisha’s words to Elijah we are reminded of God’s promises to us in Christ: “As the LORD lives and as you yourself live, I will not leave you (v.4).\nYou may not be in some sort of leadership transition today, but any transition in life can draw out these questions in our hearts. In the change from one career to another, Is God still here? In the transition from health to sickness, Where is the Lord God? The movement of life and the inevitable struggles that come along with this ever-changing world unsettle our hearts and minds, leading us to ask, Where is the Lord God?\nThe good news of the gospel is that God has not abandoned us. Even in the hardest changes of our lives, from youth to old age, from health to sickness, from stability to rapid change, the Lord has promised us in Christ that He will never leave us or abandon us (Deuteronomy 31:6; Hebrews 13:5). If God is present with us and is undiminished in his power and glory from one season to another, how much more can we trust his faithfulness!\nAs Elisha performed miracles, turning undrinkable water into potable water, and calling down a curse on those who mocked God (just like his mentor had before him), God’s power was clearly demonstrated, yes, but so was His faithfulness from one season and one generation to the next. In all our transitions and changes, “Jesus Christ is the same yesterday, today, and forever” (Hebrews 13:8). He will never leave us.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-12.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 20:1-43, 1 Kings 21:1-29, 1 Kings 22:1-53, Psalm 103:20-22",
        "devo_title": "Judgment on Ahab",
        "devo_summary": "\n                    \n                    Who comes to mind when you think of the concept of courage? Is it the athlete who powers through the debilitating injury to lead his team to victory (or simply just finish a race)? Does the idea of courage bring to mind those who are first responders—the people who run toward the danger while everyone else is running away? Perhaps you think of individuals who have overcome the odds and accomplished some change or transformation in spite of great obstacles. Courage is often associated with overcoming.\nWhile they may not be the first people who come to mind when we envision courage, to me, the Lord’s faithful prophets during King Ahab’s reign in Israel absolutely embody courage. The author’s commentary on the character and rule of Ahab is astounding. “Still, there was no one like Ahab, who devoted himself to do what was evil in the LORD’s sight” (1 Kings 21:25). He was an utterly wicked man. So to be a faithful prophet of the Lord in the land of Israel, confronting the wickedness of Ahab, was dangerous.\nYet, there were some who did the job. Specifically, in today’s passage, we have the examples of Elijah and Micaiah, two prophets full of courage who spoke the truth of the Lord to Ahab. While Ahab kept prophets on retainer for whenever he needed a spiritual word to affirm his evil, a small few did not sell out their calling in order to placate the ears of the proud king. Instead of telling Ahab what he wanted to hear, they were committed to saying what God wanted to communicate—and that earned them a reputation. Ahab hated Micaiah but admitted to Jehosophat, “There is still one man who can inquire of the LORD, but I hate him because he never prophesies good about me, but only disaster” (1 Kings 22:8).\nMicaiah was devoted to saying whatever the LORD said to him (1 Kings 22:14), and in doing so, he embodied real courage, the kind we need more of today. The courage of Micaiah is a challenge for us—to be men who say and do what the Lord calls us to say and do, even when the world around us pressures us to change or compromise. We may be afraid to speak the truth in the face of worldly power or to deal with the potential consequences of saying things that may be hard for some to hear, but being men of courage means remaining faithful to God in word and deed, regardless of how we are received.\nThis isn’t a license for us to be jerks in our speech. We’re different from Micaiah in that we don’t have a message of bad news to share with people. We have an astounding message to share—one of hope, peace, and grace: the good news of the gospel. We are called to do so with “gentleness and respect” (1 Peter 3:15–16). Our gracious King and Savior, Jesus Christ, has taken our judgment to the cross, and now we get to tell others about His mercy and love.\nCourage looks like being faithful and obedient to the Lord. It’s embodied in sharing our hope, even when people may not receive it or accept it. Courage believes the blessing of God for “servants who do his will” (Psalm 103:21). May we be men of courage in Christ.\nWritten by Jeremy Writebol\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-11.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 17:1-24, 1 Kings 18:1-46, 1 Kings 19:1-21, Joshua 6:26-27",
        "devo_title": "The Ministry of Elijah",
        "devo_summary": "\n                    \n                    In our decaying society, it is becoming more and more difficult to speak the light of truth into the darkness. Some of the truths and moral claims that were once accepted by the broader culture are now regarded as bigoted hate speech. It is quite possible that faithful believers will soon have to weigh the implications of social ostracization and even judicial punishment for standing on the truth of the gospel. But this should not cause us to lose heart. In fact, reflecting on the providential work of God in the life of Elijah might even bolster our courage in the days to come.\nEmbedded in the dark narrative of Israel’s divided kingdom is the ministry of Elijah, which is a spark of light and hope for a seemingly hopeless nation. Elijah speaks truth to power and to the people, revealing what is necessary and good. However, this type of ministry does not come without a cost. Elijah lives as an outsider, under the pressure of imminent persecution and imprisonment for speaking the truth.\nBut Elijah is not alone in his faith. God informs him that there are 7,000 others like him among the people—namely, those who have not bowed the knee to idols (19:18). Elijah seems to have had a hard time believing he was not the only faithful Israelite remaining. When he’s atop Mount Carmel, ready for his showdown with the prophets of Baal, he reports, “I alone am left” (18:10). And this is just a short time after finding out Obadiah has a hundred prophets hidden away from Ahab and Jezebel. Elijah isn’t alone, and this news of 7,000 faithful should have come as a reminder that God is often at work behind the scenes in ways we cannot understand. Sometimes, when we have the courage to stand and speak truth against the rushing tide of cultural decay, as Elijah did so publicly, others are encouraged to stand with us.\nI often tell our church family that when we share the Word of God by the power of His Spirit, we get to experience the joy of being on mission with Him. Though we often think of biblical prophets as telling the future, but prophets also reminded people of what God had already done and of promises He had already made. In short, they proclaimed truth. They proclaimed the Word of God. And every one of us is called to do that.\nWhen we speak the truth of the gospel, we push back the darkness, inviting others to turn to God and honor Him with their lives so that they can experience the grace of Christ and the mercy of God’s forgiveness. The work of sharing the gospel is not just for pastors on Sunday morning. We are all called to speak the truth, whether it be in the workplace or a coffee shop, on the front yard with neighbors, or at the table with friends.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-10.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 14:21-31, 1 Kings 15:1-34, 1 Kings 16:1-34, 2 Samuel 7:14-17, Isaiah 41:28-29",
        "devo_title": "Judah and Israel’s Kings",
        "devo_summary": "\n                    \n                    God is always, without a doubt, faithful to His Word.\nWould you agree with that statement? Scripture is a historical account of His faithfulness to His people, even when they are not faithful to Him. But if we’re honest, it becomes harder to affirm the truth of God’s faithfulness in day-to-day life, especially when everything around us seems to be falling apart. Our trust can begin to falter in the face of our own failures and the failures of others. Perhaps even more difficult to bear are those circumstances where no one is clearly to blame. Still, God’s promises are always a more reliable anchor of reality than our current situations. Circumstances change, but God does not, which means we can trust His Word, even when we cannot see His hand at work.\nIn making His covenant with David, God made this promise: “When your time comes and you rest with your fathers, I will raise up after you your descendant, who will come from your body… and I will establish the throne of his kingdom forever” and “my faithful love will never leave him” (2 Samuel 7:12–13,15). Therefore, the line of succession was established and it maintained rule over God’s people as God promised. In 1 Kings 15, we read that it was “for the sake of David” that the Lord “gave him a lamp in Jerusalem by raising up his son after him and preserving Jerusalem” (v.4). This is a reminder, a testament, of God’s faithfulness to His people.\nThis narrative is also proof that God was faithful to His earlier promise in Genesis 49, that “the scepter [would] not depart from Judah” (v.10). And God did not depart from this promise. In fact, 1 Kings is primarily a narrative about the unfaithfulness of God’s people, which, ultimately, brought about division and even warfare. In other words, the very survival of the kingdom was solely dependent on God’s faithfulness to the covenant promise He made to David.\nThis is an important reminder for us all; we should not rely on our own understanding of the circumstances that surround us, but instead rest and trust “on every word that comes from the mouth of God” (Matthew 4:4). After all, our sin, the greatest conflict we will ever face, has already been dealt with on the cross of Christ. Though we have been unfaithful, the line of David was providentially protected by God to bring about the rightful heir to the throne, Jesus Christ. In preserving David’s line, God wasn’t just preserving Jerusalem; He was preserving the line through which Christ would come to rule as eternal King, granting us citizenship in His eternal kingdom, new Jerusalem.\nWhatever circumstances you are facing today, God is faithful and worthy of your trust. He has providentially overseen the trajectory of entire nations and directed the hearts of kings to bring about His purposes. Surely He is willing and able to keep His promises to you and me.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-9.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 12:1-33, 1 Kings 13:1-34, 1 Kings 14:1-20, Ephesians 4:1-6",
        "devo_title": "The Kingdom Divided",
        "devo_summary": "\n                    \n                    I grew up in a neighborhood with a large group of guys. We were all around the same age, and we spent a lot of time together up through middle school. I distinctly remember a petty rift in our group that divided us for several weeks one summer. We all learned that we could do less apart than we could together. The division in our group quickly diminished the rich bond we all enjoyed when we were together.\nThe rings of division tend to spread wide, affecting anyone near. The experience of that brief rift in relationship during my childhood pales in comparison to the implications of the division we read about in today’s passage from 1 Kings. The larger the division, the larger the impact. Imagine how many people are affected when an entire kingdom is divided?\nAfter the death of David’s son Solomon, the King of Israel, we read of the tragic story of the kingdom being torn apart, two kingdoms emerging from one. Under the rule of Jeroboam, ten northern tribes split and secede from the other two, maintaining the name Israel. The two remaining tribes became known as the southern kingdom, Judah, under the rule of Rehoboam. In a few short chapters of 1 Kings, we learn how both kingdoms headed for disaster. Judah’s heavy-handed Rehoboam no longer desired to serve the people, and Israel’s Jeroboam led the people backward into spiritual idolatry with the worship of golden calves.\nPerhaps you’ve heard the old adage, “As the king goes, so goes the nation.” So it was with Rehoboam when he “abandoned the law of the Lord—he and all Israel with him” (2 Chronicles 12:1). In fact, both Solomon and Rehoboam forfeited the promises given to David by their disobedience. Imagine the people of Israel, now divided into two kingdoms, confused and wondering: Where is God? Will He still keep the promises He made to David? What will come of us now? Their answer was just over the horizon.\nIn the case of our neighborhood’s summer rift, it was the “leaders” of each group that called a truce. Only then were we able to mend the division and come back together. As we reflect on the narrative of Israel, the question is, “Who will lead the divided nation back together?”\nIn 1 Kings, we read that “no one followed the house of David except the tribe of Judah alone” (1 Kings 12:30). And it is from the tribe of Judah that the true King would emerge, the one who would mend all divisions. The Gospel accounts make clear that only Jesus—not David, not Solomon, not Rehoboam, Jeroboam, or any other earthly king—is both the true son of David and the Son of God, the one whose perfect rule and kingdom will never end (Luke 1:32–33).\nEven better, Jesus Christ is not only King over all of Israel—He is King over all creation, over the entire cosmos. In Him, the hopes and longings of all God’s people find their fulfillment. Other kings tore Israel apart, but Jesus came to eternally unify God’s people through the bond of His sacrifice. That is a bond that can never be broken.\nWritten by Matt Capps\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-8.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 2:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a portion of 1 Kings 2:4, when King David reminds Solomon of God’s covenant and the purpose of the kings.\n“If your sons guard their way to walk faithfully before me with all their heart and all their soul, you will never fail to have a man on the throne of Israel.”\n—1 Kings 2:4\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-7.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "James 1:5",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nNow if any of you lacks wisdom, he should ask God—who gives to all generously and ungrudgingly—and it will be given to him.\n—James 1:5\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-6.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 10:1-29, 1 Kings 11:1-43, Matthew 1:1-16",
        "devo_title": "Solomon’s Unfaithfulness to God",
        "devo_summary": "\n                    \n                    Scripture tells us that Solomon was the wisest man who ever lived (1 Kings 3:12; 4:29–31), but ultimately, he was also the cause of his own downfall. When walking in God’s ways and keeping His commands (3:14), King Solomon went on to do marvelous things to advance the kingdom of God. Rulers from around the world came to see the wisdom of Solomon at work and the resulting glory of his kingdom (4:34). “Throughout Solomon’s reign, Judah and Israel lived in safety from Dan to Beer-sheba, each person under his own vine and his own fig tree” (v.25). Their own fig tree!\nSolomon, however, had a fatal flaw; he did not heed the wisdom God had given him, and failed to keep his own heart (Proverbs 4:23). The wisdom Solomon encouraged his sons to seek (Proverbs 1–9) was hard-won after seeking what was right in front of his own eyes for so long, witnessing the effects of his sin. He lost his way, and at the end of his reign, Solomon’s attention became fixed on his love of many foreign women (1 Kings 11:1–3). He had seven hundred wives, some of them princesses from other lands, marriages that were almost certainly a play for more power in the political realm. And if the wives weren’t enough, the king also had three hundred concubines. He accumulated mass amounts of wealth for himself, and perhaps most telling, Solomon adopted the gods of other nations, and then introduced the worship of those gods to Israel (vv.4–8). Solomon’s downfall was rooted in his quest for pleasure and power, and it resulted in idolatry. His bad choices led to the downfall of God’s people, Israel.\nIn chapter 11, we see how this affected Solomon’s relationship with God: “The Lord was angry with Solomon, because his heart had turned away from the Lord, the God of Israel, who had appeared to him twice. He had commanded him about this, so that he would not follow other gods, but Solomon did not do what the Lord had commanded” (vv.9–10).\nIf this could happen to Solomon, a man who encountered God Himself—twice!—it can happen to us. All too often, we begin our faith journey resolute to follow our God, only to backslide on account of our own evil desires. We forsake the wisdom of God, and instead we choose to do what seems right to us.\nThankfully, there is a greater King than Solomon—greater than his father, King David. Jesus Christ never turned away from God, and remained faithful in His messianic ministry in His atonement for our sins. He is our Great Redeemer, the perfectly wise King of kings. “It is from [God] that [we] are in Christ Jesus, who became the wisdom of God for [us]—our righteousness, sanctification, and redemption” (1 Corinthians 1:30). By His Spirit, may we choose to abide with Him and align our wills with His that He might teach us His wisdom. May He restore us when we wander from His ways.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-5.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 8:1-66, 1 Kings 9:1-28, Exodus 25:10-22",
        "devo_title": "Solomon’s Prayer",
        "devo_summary": "\n                    \n                    When our boys were little, my wife and I taught them a number of the questions and answers found in A Catechism for Boys and Girls. The first three questions are some of the most well known theological Q&A’s in all of church history. However, it was the third question that I found myself returning to over and over again, making sure our sons understood it. Question 3 asks: “Why did God make you and all things?” The answer is profoundly simple: “For His own glory.” These four all-important words teach us that God does everything for His own glory. I can imagine Solomon as a boy, growing up, learning theological truths from his own father, David. As king himself, Solomon remembered and spoke those truths at the dedication of the temple in his prayer and benediction.\nAfter sacrificing a seemingly endless number of animals (1 Kings 8:5), Solomon blessed the Lord for His covenantal faithfulness (vv.12–21). Standing there at the altar, he cried out for God to have mercy on His people when they sinned (vv.22–53), and then went on to bless them (vv.54–61). Solomon sought the Lord’s favor for His people, praying that God would give them spiritual rest, be near them, and remain with them. Yes, the king was praying on behalf of God’s people, but in doing so, he was also reminding them of their need for Him in all these things, “as each day requires” (v.59).\nThis reminder is for us too; we have a daily need for God to provide for our spiritual needs, all of which are fulfilled in Christ Jesus. God gives spiritual rest for those who believe in His Son. Those of us who are in Christ are now blessed with the constant presence of His Spirit and a promise that He will never abandon us (Hebrews 13:5). In a very real sense, God answered what Solomon prayed for at the dedication of the temple when He sent His Son, Jesus Christ, to the cross. The altar Solomon stood before, pleading with God to forgive the sins of His people, pointed to the cross where Jesus sacrificed Himself for our sins.\nSolomon closes his prayer by asking God to remember His people, to “uphold [their] cause, as each day requires,” and ultimately, for “all the people of the earth [to] know that the LORD is God. There is no other!” (vv.59–60). The king then charges Israel to “be wholeheartedly devoted to the LORD our God to walk in his statutes and to keep his commands” as if they were brand new, each and every day (v.60).\nThe God of heaven and earth not only made all things for His own glory, but He does all things with the end goal of bringing Himself glory. God is pleased to hear and answer prayers for the forgiveness of sin, spiritual rest, and the longing for His divine presence, so that the nations might come to know Him as the true and living God—the only God.\nWritten by Nick Batzig\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-4.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 5:13-18, 1 Kings 6:1-38, 1 Kings 7:1-51, Leviticus 26:11-13, Ephesians 2:19-22",
        "devo_title": "Building the Temple",
        "devo_summary": "\n                    \n                    When we moved to Tennessee a few years back, my wife and I searched and searched for our dream home. You know the one—the white farmhouse on a couple of acres, rolling hills and trees all around. The kitchen is amazing, perfect for entertaining. There’s a quiet room above the garage where I can write whenever inspiration strikes. And there’s plenty of room for the kids to play in the yard.\nWe didn’t find that house, not with our budget anyway. What we found was something that would work, but it was far from our forever home, the one we want our children to grow up in, the one we want to grow old in, the one we want our future grandkids to visit at Christmas. It’s a good house, and we’re thankful for it, but we can still see that farmhouse in the distance if we squint hard enough.\nNow, imagine you’re building a house for God, and money is no object. You literally have the resources of an entire nation at your disposal. Then what would you build? If you’re Solomon, you build the temple described in today’s reading. While many of the details may not mean much to us today, it’s clear that the finest materials were used and nothing was overlooked. It must have been beautiful. God was certainly pleased with Solomon’s efforts: “As for this temple you are building—if you walk in my statutes, observe my ordinances, and keep all my commands by walking in them, I will fulfill my promise to you, which I made to your father David. I will dwell among the Israelites and not abandon my people Israel” (1 Kings 6:12–13).\nAs glorious as the Bible tells us Solomon’s temple was, there’s one incredible thing that most readers miss: in many ways, it was a lot like other temples of the ancient world. Sure, there were some unique features in the house Solomon built for the Lord, and there was, of course, no idol in the most holy place, as there would have been in the temple’s pagan counterparts. Still, the basic design would have been familiar to people near and far.\nWhen I first discovered this truth, it was jarring. I wanted everything about God’s temple to be utterly unique, for there is no god like Him, not by a long shot. But then I realized what God was really saying to His people in the design of His house. He was speaking to them in a language they could understand. He was using the culture and conventions of the day to draw near to His people. The truth is, God didn’t need a temple to dwell among His people. But He chose to have Solomon build Him a house, because a temple in Jerusalem—a beautiful one at that—would be a way for Israel and all the people of the ancient Near East to recognize that He was there among them.\nIt’s not unlike how God put on flesh and became a man, wearing the culture and conventions of the day, speaking the language, and getting His hands dirty caring for people who needed a physical touch. We cannot ascend to God—not without Christ—so God bends low to be near us. That’s what the temple was all about, and it pointed ahead to the incarnation of the Son of God, and further still to the gift of the Holy Spirit, who has made His people into a temple (1 Corinthians 3:16), one more precious than anything Solomon could have constructed.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-3.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 3:1-28, 1 Kings 4:1-34, 1 Kings 5:1-12, Proverbs 15:33, James 1:5",
        "devo_title": "The Lord Appears to Solomon",
        "devo_summary": "\n                    \n                    When my wife, Laurin, and I brought our first son, Jonah, home from the hospital, we were terrified. I remember carefully placing Jonah, still strapped into his baby carrier, onto the kitchen floor in our home, trying not to disturb him. If he woke up, we’d have to feed him or change him or rock him back to sleep—or who knows what else he might need. As long as he slept, we were doing okay. Every minute that passed was one more minute that Jonah wouldn’t learn our little secret: we had no idea what we were doing.\nA few weeks in, and everyone was miserable. Jonah seemed to cry constantly, and because none of us were sleeping through the night, we were all tired and cranky. In desperation, Laurin reached out to her friend, Jennifer, a pediatric nurse who just happened to have written a book on caring for newborns. Jennifer came over the next day. She gave us a schedule for feeding and sleeping, showed us how to give Jonah an evening routine sure to conk him out, and even provided us with a few swaddling lessons. We took our newfound newborn knowledge and immediately applied it. Believe it or not, within the week, Jonah was sleeping through the night—and so were we.\nI love when change happens quickly. I think we all do. If your pants were looser just minutes after getting on the treadmill, wouldn’t you run more? If you could learn a new language just by watching a foreign film or two, wouldn’t you? But that’s not usually how life works. Normally, change takes place slowly. When change does happen quickly, it seems almost too good to be true. That’s how we felt that first time Jonah slept through the night. We could barely believe our ears—silence instead of crying.\nAnd that’s how it was for Solomon too. One night he was foolishly offering sacrifices to God at Gibeah (1 Kings 3:4), unaware of how worshiping the at one of the so-called “high places” was to put the one true God on the same level as the false gods who sought to lead the people of Israel into idolatry. A short time later, Solomon was back in Jerusalem, offering proper sacrifices before the ark of the covenant on the altar sanctioned by God (v. 3). What happened to Solomon in between? God gave him wisdom.\nSolomon immediately knew that God ought to be worshiped according to God’s instructions, rather than the convenient traditions of the day. But that’s not all. He was able to judge the people of Israel with justice and fairness. And soon, his wisdom was known far and wide. “Emissaries of all peoples, sent by every king on earth who had heard of his wisdom, came to listen to Solomon’s wisdom” (1 Kings 4:34). Because of Solomon, God’s people were blessing the nations of the world, just as God told Abraham they would (Genesis 12:3).\nHere’s the incredible thing: God promises to give us wisdom, too, if only we will ask. Scripture tells us, “If any of you lacks wisdom, you should ask God, who gives generously to all without finding fault, and it will be given to you” (James 1:5). Now, God doesn’t say it will come instantaneously or be as pronounced as Solomon’s, but He does promise to bless us with wisdom. So, ask Him for it—and when He gives it, follow Solomon’s example: use your new wisdom to love God and others well.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-2.jpg"
    },
    {
        "book_title": " 1 & 2 Kings",
        "devo_passages": "1 Kings 1:1-53, 1 Kings 2:1-46, 2 Samuel 7:12-13",
        "devo_title": "King David’s Last Days",
        "devo_summary": "\n                    \n                    First Kings opens with David reigning in Jerusalem. But this is not the David we remember—the David who slew Goliath with a stone, the David who lived out in the wild, keeping one step ahead of a murderous king, the David who danced freely before the Lord as the ark of the covenant was brought to Zion. This David can no longer fight, run, or dance. He is frail, sick, and old. He’s unable to keep warm, no matter how many blankets are brought to his chambers. His story, this side of heaven, is coming to a close. He knows it, and so does everyone else.\nDavid was far from a perfect man. Years earlier, he sinned with Bathsheba, and then he murdered her husband, Uriah. David repented, and I believe God cleansed his heart, just as he asked Him to (Psalm 51:10), but still I wonder if all those memories—the shame, the sorrow for sin—came rushing back into his heart when Bathsheba entered his room in those final days. She wasn’t there to bring up old wounds, however; she was there to fight for her son, Solomon: “Now, my lord the king, the eyes of all Israel are on you to tell them who will sit on the throne of my lord the king after him” (1 Kings 1:20). David didn’t refuse her.\nThroughout his life and reign, David trusted God to be faithful, despite his own sins and weaknesses. That’s why I think it’s so fitting that Solomon was given his father’s throne. As the son of Bathsheba, Solomon was a product of David’s sin. Solomon wasn’t the son who was conceived by the original illicit act, of course. He came sometime later, after Uriah was gone and David married Bathsheba. But still, Solomon would never have been born if David hadn’t sinned in the first place. Solomon is, therefore, a product of David’s weakness while also being a testament to God’s unbreakable promises. He is an image of beauty wrought from brokenness, light pulled from darkness, and redemption pieced together from bits of rebellion. In that, there is a flashing neon sign pointing to the gospel.\nNone of us deserves to be a recipient of God’s grace and mercy, yet here we stand. And not only that—the Lord is taking our brokenness and turning it into something whole and new, something truly beautiful. Like Solomon before us, we will someday reign (2 Timothy 2:12; Revelation 20:4–6). When that day comes, it will not be because we’ve earned it or in any way deserve it. It will be because God is faithful and loves us more than we can possibly imagine. But that’s how redemption works—we trade our junk for His glory. Remember, it was sinful hearts that sought Jesus’s blood, but it is only Jesus’s blood that can cleanse sinful hearts. God is in the business of making the dark and ugly places of life into something new and beautiful. In that, there is hope for us all, no matter how high the stack of regrets we may carry with us.\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/10/HRT-12Kings-Instagram-1.jpg"
    }
]