[
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 8:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nFor our study of Song of Songs we will memorize two consecutive verses from this book of the Bible. This week’s verse is a declaration of love’s power.\nMighty waters cannot extinguish love;\nrivers cannot sweep it away.\nIf a man were to give all his wealth for love,\nit would be utterly scorned.\n—Song of Songs 8:7\nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these verses throughout the day. As you memorize these verses, contemplate God’s rich gift of covenant love to His people.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/4-HRTSOS-2.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Psalm 85:10",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nFaithful love and truth will join together;\nrighteousness and peace will embrace.\n—Psalm 85:10\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-13.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 8:5-14, Deuteronomy 4:24, John 10:27-30, Hebrews 8:8-13, 1 John 4:19",
        "devo_title": "Made for Love",
        "devo_summary": "\n                    \n                    “That day she was amazed to discover that when he was saying as you wish, what he meant was I love you.”  – The Princess Bride\nMere sentimentality is not enough to sustain a marriage, but I’ll tell you what: I’m a firm believer in true love. We’ve been told for years in the Church that real marriages and relationships look nothing like what Hollywood depicts, and I think there is truth in that. But what I think we’ve heard sometimes in between the lines is that true Christian love is emotionless. We’ve been told it’s virtuous, dutiful, and righteous; but I think somewhere along the way we’ve come to overly distrust the emotional aspects of a marriage relationship.\nThe Princess Bride came out 30 years ago, but if you’ve never seen it, don’t let that be an excuse. It taps into some of the most essential and transcendent themes of the human experience, and it’s witty as all get-out. Plus, I’d be willing to wager you’ve missed at least a joke or two in your lifetime as it’s possibly one of the most quotable movies ever made. Inconceivable!\nWhat the film gets right is the same thing that the Teacher is imploring us to remember in Song of Songs 8:6: the enduring power of love. Solomon proclaims: “love is as strong as death; ardent love is unrelenting as Sheol. Love’s flames are fiery flames—the fiercest of all.” Kind of puts Shakespeare to shame. Yes, this is a poetic statement, but it seems experientially true that love really does surpass the powers of death. I’m sure each of us can think of a friends or family members who have passed through the thin veil into eternity, but we still love them. Objectively speaking, their physical bodies have been overcome by death, but that cannot vanquish our love for them.\nThe type of love Solomon describes feels like a fire burning in the pit of your stomach. It makes you do crazy, risky, and potentially embarrassing things for the sake of your beloved. The richness of God-given emotion is what drives us to action. We see in the teachings of Jesus that these actions must be tethered to the clear and careful instruction of God’s Word, but I think Song of Songs describes an enviable level of passion and poetic dedication to hold high the power of love. \nSong of Songs is a testament that God created love on purpose and that His Spirit animates us with a sense of passion for our brides. God’s love certainly is far more powerful than death. As His Spirit lives and breathes in each of us, we have the opportunity to confront death and proclaim the enduring power of holy love each and every day. We do this by loving those we have, and those we’ve lost, hopeful for the coming, glorious reunion that awaits all those who are in Christ.\nWritten By Andrew Stoddard\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-12.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 7:10-8:4, Genesis 3:14-19, Psalm 85:10",
        "devo_title": "Invitation to Enjoy a New Spring Day",
        "devo_summary": "\n                    \n                    Just about every man remembers the first time he got “the talk”—that awkward introduction to “the birds and the bees.” These talks are usually embarrassing because Dad or Mom (or son) is painfully uncomfortable even broaching the subject.\nIn the same way, it can be uncomfortable to read or write about the Song of Songs because the imagery is often overtly sexual. At times it feels like God accidentally let some French poet slip a few excerpts of his romantic verse into the pages of Scripture. Indeed, Song of Songs is so graphic that Jewish kids were not allowed to read it until they were 13 years old.\nBut here we are, my friends. And we are in a passage that fits that bill. Here, it seems Shulamith is taking significant romantic initiative toward her husband. If you didn’t know the historical context, you might think she’s whisking him away on a weekend trip to Napa Valley. This scene is full of intimate dialogue and straight-up seduction on the part of the wife. How do we read a passage like this? \nAny time marriage is discussed in the Bible, we should first remember that marriage reflects Christ’s love for His Church (Ephesians 5-22-33). As a picture of the gospel, marriage is always saying something about God.\nSo when we come across passages like these, we should perhaps move into what feels like even more awkward territory and dwell on how the intimacy between these two lovers reflects the relationship between Christ and His bride, the Church.\nNotice that throughout Scripture, there is a call for men to lead and initiate in marriage. As Christ is the servant-leader to His bride, so His bride is a servant-helper to her Husband. This doesn’t mean, of course, that the bride has no role to play in cultivation and initiation. In the same way, Christ’s bride is not merely a passive recipient of devotion or love. No, we’re active participants.\nMore than a sex talk, this passage joins others in calling us to seek and pursue Christ as active agents in discipleship (Proverbs 8:17; Psalms 27:8; Matthew 7:7-8; Acts 17:27; Hebrews 11:6; et al.). As Luther said, “We’re saved by faith alone, but not by a faith that is alone.” As Shulamith ferociously pursues her husband, we should also ferociously pursue Christ.\nWritten By Brandon D. Smith\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-11.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 7:1-9, Ephesians 5:22-30, Revelation 19:6-10",
        "devo_title": "Praise of Love",
        "devo_summary": "\n                    \n                    Okay, I’ll admit it. When I was around 12 years old, I would often read the Song of Songs during church. There wasn’t a whole lot else to do, I thought. It was a brilliant plan because not only was I reading something just as explicit as Dr. Ruth’s radio show, there was the added bonus of getting credit for reading the Bible.\n“Look at Brother Pastor Redmond’s son. He may not be listening to the sermon but at least he is reading the Bible!”\nThey had no idea.\nThen I grew up a little and was taught that chapter 7 was “not really” about red-blooded sex. It was a picture—albeit an R-rated one—pointing to our relationship to Christ as the Church. I didn’t see it, but I trusted those teaching me in Sunday School and from the pulpit and in all the books. But it was all so disappointing. And more than a little weird.\nThen I got married and went to seminary. I will never forget the day my Psalms and Wisdom professor told us, in no uncertain terms, that this book was nothing other than a romantic love poem. Not only was this one of my better days in seminary, it confirmed those early instincts that this poem was the real deal. This was a man dreaming about the body of his wife.\nI’m 45 years old and have been teaching Scripture for most of my life now, and I still cannot believe this is in the Holy Bible. But I also have grown to see something that does take a little imagination.\nWhile Song of Songs is most certainly a love poem, maybe—like every other love poem, love song, and love story we know—it is also a reverse echo of the great love story of Christ and His bride, the Church. Paul makes the link clear in Ephesians 5 when he compares the relationship between Christ and the Church to the relationship between husbands and wives. That’s a pretty big comparison to make.\nThink about it. Christ looks at the Church the way a loving husband looks at his bride. Follow me here: Christ loves the Church the way the husband in Song of Songs loves his bride. Christ’s relationship with the Church, while not sexual, is still all the more intense and real. He looks at us and loves us.\nLet me say that again, because it is really hard to believe on many of our days. Christ looks at His people and loves what He sees.\nAll the great love stories by Austen, Dickens, and Berry are pointing to this. All the great love songs by Willie, Cash, and Merle are pointing to this. And all the great love poems of Shakespeare and Auden and Donne are pointing to this reality: Christ, who loved us and gave Himself up on the cross for us, looks at us and sees a bride worthy of His love.\nWritten By Matthew B. Redmond\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-10.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 6:1-13, Psalm 48:1-14, Romans 12:1-2, Romans 12:9-13",
        "devo_title": "In the Garden",
        "devo_summary": "\n                    \n                    God is the God of literature, even of love poetry. He is the God of romance, even of the most intimate relations between a man and his wife. From the very beginning, God created us male and female. Why should we be surprised that God would inspire love poetry? The words in the Song of Songs are breathed out by God and profitable for teaching, reproof, correction, and training in righteousness (2 Timothy 3:16). So what do they tell us?\nGod gives us this love poem to drive us to His design for true romance. God’s design is not promiscuous. The celebration of marital intimacy is neither to be frowned upon nor exploited for unseemly purposes. While the Song of Songs is intimate, it is not vulgar. Indeed, the expressed mutual delight between the lovers is presented in the context of marital fidelity. The central declaration is this: I am my beloved’s and my beloved is mine.\nThe images in this passage reinforce this theme of intimate fidelity. The garden, while sensually evocative, is also full of Edenic overtones. Gardens are places of life, fruitfulness, and intimacy. There Adam walked with Eve and also with God. There Christ visits with His people—the Bridegroom calling to His bride. The bride is also said to be as lovely as Jerusalem, the city of God. The hills, full of the shepherd’s livestock, are both abundant and endearing. The descriptions are local, tied to familiar places of hearth and home, of those things dearest to the heart. \nIn a world of wandering eyes and wayward affections, God calls me to fidelity. He calls me to love my wife well, having eyes for her alone. She is my darling, my treasured one. This passage drives that home. As Adam sang his love song to Eve in the garden, as he celebrated her as “flesh of my flesh and bone of my bones” (Genesis 2:23), as the beloved delights in his lover, his dove, his perfect one, so also is every husband to woo his wife and remain faithful to her.\nIn the Song of Songs, God provides us with a rich celebration of faithful love between the bridegroom and the bride. The central declaration of the gospel is this: I am my beloved’s and my beloved is mine. This mystery is profound, as Paul remarks, and it refers to Christ and the church (Ephesians 5:32).\nWritten By Caleb Faires\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-9.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 5:1-16, Psalm 128:1-6, Colossians 3:12-17",
        "devo_title": "Night of Separation After the Wedding",
        "devo_summary": "\n                    \n                    I have a recurring dream—a nightmare of sorts. It usually comes on a Saturday night when I have some important responsibility at church the following morning. In the dream, no matter how hard I try, I cannot get to the church. And the obstacles that prevent me are the strange stuff of dreams. I get into a cab (which I never do) that has to stop by a different city first. Or there is an apocalyptic traffic jam, and I have to run over the tops of cars. Or, my favorite, the church I go to is the wrong church, even though it is my church, because no one told me we moved.\nDreams are weird. I am not the sort of person who thinks there’s some deep hidden meaning underneath everything that flies through our heads while we’re sleeping. But I do believe our dreams often are the result of the untangling of our consciences. Our worries, fears, hopes, and longings all show up—some to a great, cartoonish effect and others to nightmarish terror. But they do show up, don’t they?\nToday’s passage in Song of Songs is, many scholars believe, a description of a dream. It is the couple’s wedding night. They are in bed and she has a nightmare, which she introduces by saying, in effect, “I’m asleep, but my heart is awake, and it hears a knocking at the door” (my paraphrase of 5:2).\nIn her dream, her lover is outside knocking, asking her to let him in. In a haze of sleep, she offers excuses for why she can’t get out of bed—she’s naked and doesn’t want to get cold, she just washed her feet and doesn’t want to get them dirty. But soon, still in her dream, she warms to his presence and gets up to let him in. But when she opens the door he is gone. She panics. Has he left her to find another lover? She goes out into the night searching for him, and in her nightmare, the city watchmen find her and beat her (5:7). The worst thing that could have happened has happened. She has lost her lover on their wedding night, and her refusal to let him come inside played a part in her loss. She is sick with love.\nWhy has such a nightmare made its way into one of the greatest love poems ever written? Because her fear is a terror everyone can relate to. Will I push you away to the point that you leave me? Will I treasure my own comfort over letting you in?\nThese fears are rooted in many things. One is the false belief that the strength of love is found in the intensity of romantic passion. Young lovers fear what will happen if the wedding-night intensity fades. But deeply rooted love takes work. It is good work, but work nonetheless. Colossians 3:12-17 describes the work. It is the work of forgiving, the work of celebrating, the work of listening, the work of growing in wisdom, the work of maturing in Christ together.\nThe truth is, no matter how dark the nightmare goes, the Bridegroom is not really gone. He is right there, beside the one He loves. And He is there because He made a covenant to never leave and never forsake. \nMay God wake us from the nightmare that denies the possibility of such a love. And may we come to trust the faithfulness of God, even if our deepest fear is the fear of being left alone.\nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-8.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 8:6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n                    \n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. \nFor our study of Song of Songs we will memorize two consecutive verses from this book of the Bible. We begin this week with this verse on the power of love. \nSet me as a seal on your heart,\nas a seal on your arm.\nFor love is as strong as death;\nardent love is as unrelenting as Sheol.\nLove’s flames are fiery flames—\nthe fiercest of all.\n– Song of Songs 8:6 \nWrite this passage down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read these verses throughout the day. As you memorize these verses, contemplate God’s rich gift of covenant love to His people.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/4-HRTSOS-1.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "1 John 4:19",
        "devo_title": "Grace Day",
        "devo_summary": "\n                    \n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nWe love because He first loved us.\n—1 John 4:19\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-6.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 4:1-16, Proverbs 4:23, Revelation 22:1-5",
        "devo_title": "Wedding Night",
        "devo_summary": "\n                    \n                    There have been attempts, over the years, to try and unearth the Song of Songs—to take it out of the realm of flesh and blood and sex and love, and place it in some super spiritual realm of heady disembodied thought. For the life of me, I have never understood such attempts. They just seem weird, and sorta sad.\nSong of Songs chapter 4 presents The Man at the height of his focused powers, giving full attention to The Woman. And although I’ve no doubt he appreciated her wit and intelligence and sense of humor, this chapter is more about the curves of her body and the spicy contours of her flesh. This is essentially John Mayer singing “Your Body Is A Wonderland.” Don’t think so? Read it again. He engages in a literal head-to-toe cataloguing of her physical features, listing with increasing poetic energy everything from her fragrance, to her smile, to her neck and her breasts. Yeah, so much for thinking disembodied thoughts, right?\nThe beautiful thing here is that this is a wonderful Scriptural affirmation of what both The Man and The Woman enjoyed on their wedding night—one another’s bodies. Are there spiritual realities afoot when a man and woman come together like that? Absolutely. But do those spiritual realities somehow exclude the possible physical pleasures? Not in Song of Songs chapter 4. Those two aspects are wedded, and it appears God is quite pleased with it all.\nIt is not lost me that the partner doing most of the talking in this chapter is The Man. That’s not to say that The Woman doesn’t take a turn, for she does in chapter 5. But in this chapter we hear from his voice. And what we hear is a husband painting a verbal portrait I’m willing to bet most women would kill to hear. Sadly, many never do.\nSure, most of us are not the lyrical type. But that doesn’t mean that we can’t take a few cues from The Man and risk complimenting our wives on their physical beauty. I say “risk” because while her body is a wonderland, it can also be a minefield of past wounds and possibly even abuse. So be gentle.\nWhat’s the best way to start? The Man gives us a great opening line: You are so beautiful!\nWritten By John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-5.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 3:6-11, Psalm 144:1-15, Luke 12:22-31",
        "devo_title": "Wedding Day",
        "devo_summary": "\n                    \n                    I will never forget my wedding day. I was filled with great excitement, but also fear and anxiety about the future. I was asking myself, Can you really do this? Can you take care of her?\nI’m sure others wondered this about me as well. The people at our wedding did not only expect to see the bride; they were also looking to me. I was the man who was saying I would take on the responsibility to provide for and love this woman with everything I had. And if I didn’t have what that took, I would do whatever was necessary to acquire it. I felt like all eyes were on me, along with a lot of expectations.\nHad I let them, my fears and expectations would have paralyzed me, leaving me unable to live out the great joy and honor of being a husband. I wanted people to see in me the ability to commit to this woman forever. This is what a groom is supposed to feel—a determination to love and provide, no matter what. And this is how Christ loves the Church—with an unwavering commitment.\nSong of Song 3:6-11 describes the commitment of the groom. He will give everything he has to take care of his bride. For Christians, the groom is Jesus, who perfectly commits to His beloved and to her heart because He alone has the character and strength to do it.\nWe don’t just need the example of Jesus; we need to know the reality of His love for us. When we see the perfect Groom, we learn what it looks like to be faithful and loving in all of our relationships. Because of Jesus, we can rest secure in knowing that God our Father has equipped us with what we need to provide for our families and love the people in our lives well.\nJesus is preparing a place in His Father’s house for us, where we will dwell with Him for all eternity. We can look to Jesus, seeing His faithfulness and character, and be confident that He can love us and provide us with all we need. He is making a home for us.\nWith great joy a man stands up at his wedding, committing all of himself to the flourishing of the woman he loves. So it is with our Lord. Jesus Christ, with great joy, loves us at the expense of Himself, and He gives us everything we need to find our home with Him. \nMay we follow with our eyes fixed on Jesus—our example and the One who gives us the strength to give our lives away in love.\nWritten By Jevon Washington\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-4.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 3:1-5, 1 Kings 4:20-34, Isaiah 55:1-13",
        "devo_title": "Night of Separation Before the Wedding",
        "devo_summary": "\n                    \n                    The longing to be with the one you love is an experience like no other. On most days, the goal is just to keep things as normal as possible. But when love overtakes you, normal just won’t work any more. The desire to love and to be loved is deeply embedded in each of us, and it drives us to want more and more from love.\nToday’s reading from Solomon’s story of love describes the longing the woman has for the man, the soon-to-be bride for her soon-to-be husband. Here is a dream about their longing to be fully together on their wedding night—a glorious night of passion and care for each other, a night where they fully embrace each other, a night which marks the beginning of their shared, vulnerable life together.\nThis longing is heightened because of their faithfulness to “not stir up or awaken love until it pleases” (3:5). They want to do things in the proper order. Faithfulness and self-control are marks of great love. To wait out the intensity of our longings is to model our sacrifice for each other, which includes the daily work of loving each other in the normal, boring parts of life as well as in seasons of heightened romance and passion.\nMarriage to the one you love is a commitment to sacrifice. The days of waiting described here are part of the reality of loving someone. We can’t always get what we want when we want it. Marriage is the work of loving and serving and waiting, anticipating the ultimate fulfillment of marriage—the return of Jesus and the marriage supper of the Lamb. For young lovers, it can seem like the ultimate longing is just for the wedding night. But the more the two become one, the more they long to intimately wait together for Jesus to return. \nIn love, the work is often the waiting. The Christian life is a string of days spent waiting for the return of the One who loves us best. And if we love Him, those days will be filled with longing.\nWritten By Jason Tippetts\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-3.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 2:8-17, Isaiah 62:5, Ephesians 5:31-33",
        "devo_title": "Invitation to Enjoy a Spring Day",
        "devo_summary": "\n                    \n                    It is the feeling that comes over a child in the days leading up to Christmas, as presents begin to find their place under the tree. Or the thrill in the woman’s heart when she knows he has bought the ring but hasn’t yet proposed. Anticipation.\nYou know the feeling, right? It seems like an almost disproportionate desire for the thing you actually want. It’s the feeling when a longing outpaces the value of the thing you desire, and yet, the desire remains and sometimes even grows. Why does this happen?\nToday’s text from the Song of Songs is filled with a longing for something to happen—for the lover and the beloved to finally be together. She hears his voice over the distant hills, but cannot see him. She wants him to run, to hurry. The setting is perfect: the winter is past, the rains are gone, and the flowers are opening. It is the perfect spring day and romance is in the air.\nFinally, he arrives. He tells her to stand up so they can explore the countryside together. It is like something out of a musical—a young man and a young woman dancing and singing across the fields in bloom. They are in love.\nBut in the midst of their joyous union, they eventually turn to the hard realities of life. This world can be a tough place. They talk about how as they dance, they need to also take time to chase away the foxes that ruin their vineyards (2:10). They talk about how the shadows will come and the day will grow dark. This is the reality of the life they know. \nThey want their day of romance in the spring meadow to be a dance that will last forever, but it won’t. And yet, the longing is there—and that longing came from someplace. So it is with us. We all have insatiable longings for a perfect love that goes on and on and on without interruption, and that desire comes from someplace. Where?\nC.S. Lewis wrote, “If I find in myself desires which nothing in this world can satisfy, the only logical explanation is that I was made for another world.” The Apostle Paul said it like this: “For now we see in a mirror dimly, but then face to face. Now I know in part; then I shall know fully, even as I have been fully known” (1 Corinthians 13:12).\nBecause of the finished work of Christ, the day will come when we will dance freely without having to keep one eye on the foxes. But for now we can rest in this: our longings often feel disproportionate to the thing we desire because that thing we desire is only a foretaste of what we really want most—to have all we need, at peace with our Maker and at rest in our eternal home. \nWritten By Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-2.jpg"
    },
    {
        "book_title": " Song of Songs",
        "devo_passages": "Song of Songs 1:1-2:7, Psalm 45:1-17, Isaiah 11:1, 1 Corinthians 13:1-13",
        "devo_title": "A Song of Love",
        "devo_summary": "\n                    \n                    When it comes to keeping secrets, little kids are not to be trusted. I’ve learned never to tell our children the birthday or Christmas presents I got for my wife. They can’t help it; the secret erupts out of them.\nLove is meant to burst out of us. In Song of Songs, we see love on high-definition display. There is no hidden love in this book. This is one of the first things we learn about love from the Song of Solomon: love isn’t meant to be a secret. Solomon sings of his love for his bride, and she returns with songs of love for her suitor. Love is supposed to rise to the surface, billowing from the heart, perfuming the way we speak, serve, and live.\nLove is meant to be displayed. Love is something we do. As Paul shows us in 1 Corinthians 13, love is patient in the face of impatience. Love is kind when tempted toward anger. Love isn’t rude. Love doesn’t keep a record of wrongs done by your wife, kids, friends, or co-workers. Love is visible and active.\nIt isn’t unmanly to make our love known. We see God’s love for us in the cross of Jesus Christ: “God so loved the world, that He gave His only Son, that whoever believes in Him should not perish but have eternal life” (John 3:16). Jesus’ love for us is made known in His cross when Paul describes Him as “the Son of God, who loved me and gave Himself for me” (Galatians 2:20). In fact, Solomon and his bride aren’t the only ones moved to sing because of love. God sings over us. “The Lord your God is in your midst, a mighty one who will save; He will rejoice over you with gladness; He will quiet you by His love; He will exult over you with loud singing” (Zephaniah 3:17).\nGod doesn’t hide His love for us. Let’s not hide our love for Him. Let’s not hide our love for others. Let’s love God with all of our heart, soul, mind, and strength, and love our neighbors as ourselves. May it be with a love we’re unable to contain.\nWritten By J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2017/02/HRT-SongOfSongs-instagram-1.jpg"
    }
]