[
    {
    "book_title": "Hymns of Hope",
    "devo_passages": "Isaiah 53:1-6, John 19:1-5, John 19:28-30, Romans 8:1-4, Revelation 5:12",
    "devo_title": "Hallelujah! What a Savior!",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Isaiah 53:1-6, John 19:1-5, John 19:28-30, Romans 8:1-4, Revelation 5:12\nEaster 2015 was particularly memorable for the Davis clan. We had new baby sheep on our little farm, and I got the bright idea to take one of those sweet little lambs to our family Easter celebration at my mom’s house. My nieces and nephews were smitten with the lamb, so much so, that they decided to take him for a walk. You can probably guess where this is going, even if they couldn’t—the lamb got loose. It seems a herd of children screaming and running toward him caused the lamb to bolt, getting lost in the woods. \nThe kids handled the escape pretty well, until someone mentioned the threat of coyotes. Suddenly there was a symphony of screaming and crying. Not even the promise of another chocolate bunny could console them. For more than two days we searched for our lost lamb. His mama stood out in the field and called for him until she was hoarse. I told my boys he was likely a goner. Then someone had the bright idea to put our plight on Facebook. I never saw the post, but I am sure it went something like this: “Easter lamb led to the slaughter by adorable children in church clothes.”\nRemarkably, that post led to a phone call; our lamb had been spotted! He had wandered more than five miles in the opposite direction of our farm, was now fleabitten and starving, but he was alive. It was incredible, but the very best part of the story was yet to come.\nWhen we opened the gate, the little lamb immediately ran to his mama. And as he nursed for the first time in more than two days, his little tail wagged at super speed. What was lost had now been found. Of course, the lost lamb is a picture of a bigger, more significant drama. God used it to remind me of the wonder of the gospel. \nWe all went astray like sheep;\nwe all have turned to our own way (Isaiah 53:6).\nOur lamb ran away from all that was good for him. He chose to rebel against the safety of the sheep pen in favor of a life of hardship, sickness, and uncertainty. Just like the prodigal son Jesus described in Luke chapter 15, the lamb bolted from the source of tender care, only to wallow about in self-imposed misfortune. Though our lost sheep didn’t hold much monetary value, we searched relentlessly for him all the same. We desperately wanted him to come home. When he did, I was reminded that Jesus pursued me when I was still running away from Him in glad rebellion, in spite of the fact that I was running toward my own destruction. \nGuilty, helpless, lost were we;\nblameless Lamb of God was He,\nsacrificed to set us free:\nHallelujah, what a Savior!\nI am prone to spiritual amnesia. It’s so easy for me to forget how lost I was apart from Christ. I need frequent reminders that I was once a wayward lamb, helpless, and vulnerable to an Enemy who “is prowling around like a roaring lion, looking for anyone he can devour” (1 Peter 5:8). I didn’t save myself from that desperate situation. I couldn’t. Jesus made a way for me to come home and then came looking for me to show me the path back.  \n \nHallelujah! What a Savior!\nText and Tune: Philip P. Bliss, 1875\nMan of sorrows what a name\nfor the Son of God, who came\nruined sinners to reclaim:\nHallelujah, what a Savior!\nBearing shame and scoffing rude,\nin my place condemned He stood,\nsealed my pardon with His blood:\nHallelujah, what a Savior!\nGuilty, helpless, lost were we;\nblameless Lamb of God was He,\nsacrificed to set us free:\nHallelujah, what a Savior!\nHe was lifted up to die;\n“It is finished” was His cry;\nnow in heaven exalted high:\nHallelujah, what a Savior!\nWhen He comes, our glorious King,\nAll His ransomed home to bring,\nthen anew this song we’ll sing:\nHallelujah, what a Savior!\n \n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day1-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Jeremiah 8:18-22, Luke 7:1-10, 1 Peter 2:24",
    "devo_title": "There Is a Balm in Gilead",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Jeremiah 8:18-22, Luke 7:1-10, 1 Peter 2:24\nI hadn’t ever experienced the heartwrenching presence of cancer until my grandmother was diagnosed a little over two years ago. She was 92 years old, and the cancer took over her body quickly. After her diagnosis in May, she declined rapidly throughout the summer, until my mother called one Friday to tell me it was over. She passed away in early September—Labor Day weekend, my senior year of college. I can still remember my best friend, who’d heard the news before I did, bringing me a cup of coffee and sitting with me in my tiny bedroom apartment while I cried.\nThroughout that entire summer when my grandmother was sick, my family was already grieving. We were grieving the loss of her independent lifestyle, and the spunk with which she talked about her friends and family. We were even grieving her ability to make the best macaroni and cheese we’d ever eaten.\nIs there no balm in Gilead?\nIs there no physician there?\nSo why has the healing of my dear people\nnot come about?\n—Jeremiah 8:22\nWhen sickness and death invade our comfortable lives, we can find ourselves wondering where to turn. Like Jeremiah, we find ourselves questioning when the healing will come. We pray, we lament, we cry out for help.\nGrief hits in ways we don’t anticipate. It’s the macaroni and cheese tasting just a little bit off on Thanksgiving, even though it’s the same recipe. It’s slow Sunday afternoons that feel empty without phone calls to talk about Alabama football. It’s crying in the candy aisle over a bag of Hershey’s Kisses because there was always a bowl of them on her coffee table. Grief is hard. But grief is an appropriate response to pain—it shows that something matters. When something hurts, it’s important to lament it.\nBut because of Christ, our lamenting doesn’t have to last forever. We don’t have to put our hope in earthly healing. When the pianist played this melody at my grandmother’s memorial service, I openly wept—not necessarily out of grief, but out of gratefulness for the healing balm found in Christ.\nThere is a balm in Gilead\nto make the wounded whole,\nthere is a balm in Gilead\nto heal the sin-sick soul.\nBecause of Christ, there is healing. There is hope. There is comfort for the sick, both spiritually and physically. Christ’s sacrifice on the cross gives us new life in Him. By His wounds, we have been healed of our sin (1 Peter 2:24). Christ, the ultimate Healer, bandages our hearts and mends our broken souls.\nThere Is A Balm In Gilead\nTraditional Spiritual\nThere is a balm in Gilead\nto make the wounded whole,\nthere is a balm in Gilead\nto heal the sin-sick soul.\nSometimes I feel discouraged\nand think my work’s in vain,\nbut then the Holy Spirit\nrevives my soul again.\nThere is a balm in Gilead\nto make the wounded whole,\nthere is a balm in Gilead\nto heal the sin-sick soul.\nIf you cannot preach like Peter,\nif you cannot pray like Paul,\nyou can tell the love of Jesus\nand say, “He died for all.”\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of iced coffee, ugly dogs, and the Oxford comma. \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day2-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "John 15:1-8, 1 John 3:18-24, Numbers 23:19, 1 Corinthians 15:50-58  ",
    "devo_title": "Abide with Me",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: John 15:1-8, 1 John 3:18-24, Numbers 23:19, 1 Corinthians 15:50-58 \nThe hymn “Abide with Me” is my funeral song. It is the song that, after what I hope is a very long and sweet life, I want sung by my people when I’ve gone to glory. \nIt is also my living song, one that I have turned to in so many seasons. I sang it for months on end after my beloved grandmother died, as I wandered lost through the fog of grief for the first time. I sang it when my husband and I moved away from our first home, when I wrestled with deep fears and ached for community. I sang it when our best friends’ baby died. I sang it when I, eight months pregnant with a broken body and weary mind, paced for hours on end in the middle of the night, awaiting our sweet girl’s arrival. \nFear, death, paralyzing anxiety—these are the things I’ve carried my whole adult life. But this song reminds me that I don’t have to carry them. When I ask for the Lord’s presence to be near, He reminds me that He’s always with me, that He’ll never leave me.  \nI am hardly the first person to associate this hymn with death, nor will I be the last. When he wrote the text, Henry Francis Lyte was dying of tuberculosis. It is rumored to have been played by the band on the Titanic after it struck the fatal iceberg. It was played at Mother Teresa’s funeral, and at Richard Nixon’s too. It was played at Ground Zero after 9/11. Joyfully, it was also played at Queen Elizabeth and Prince Philip’s wedding. \nI love this hymn so much, I could write a dissertation on every line. I love it so much because it reminds me—it floods me—with the goodness, faithfulness, kindness, and trueness of God. \nIn Luke 24, Jesus appears to His disciples after the resurrection. They don’t yet recognize Him when they ask Him to stay with them, because the night is falling. Thus begins the first stanza of the hymn—Abide with me, fast falls the eventide. \nWhen I hear this hymn, I am drawn to reflect on what it says specifically about who God is: He helps the helpless, and He changes not. He is my guide and my strength, and His grace alone foils Satan’s power. This song also declares that all earthly helpers and comforts will surely fail and fade under the harsh light of sin; change and decay are the norm here in a fallen world. But most importantly, when I listen to this hymn, I am reminded of my only hope, my only comfort in both life and death—Jesus. I need Him every hour. \nThis song knits together lament and hope, the way every day of this Christian life does. I ache, and I rejoice. I long, yet I live in abundance. I weep, and I laugh. I will die, but I will also live forever because of Jesus. \nAbide with me, Lord—these are the words Henry Lyte penned before he died.\nAbide with me, the disciples asked, before they even knew He was already there.\nAbide with me, we ask, we pray, we sing.\nAbide with Me\nText: Henry Francis Lyte, 1847\nTune: William H. Monk, 1861\nAbide with me: fast falls the eventide;\nthe darkness deepens; Lord, with me abide.\nWhen other helpers fail and comforts flee,\nHelp of the helpless, O abide with me.\nSwift to its close ebbs out life’s little day;\nearth’s joys grow dim, its glories pass away.\nChange and decay in all around I see.\nO Thou who changest not, abide with me.\nI need Thy presence every passing hour.\nWhat but Thy grace can foil the tempter’s power?\nWho like Thyself my guide and strength can be?\nThrough cloud and sunshine, O abide with me.\nI fear no foe with Thee at hand to bless,\nills have no weight, and tears no bitterness.\nWhere is death’s sting? Where, grave, thy victory?\nI triumph still, if Thou abide with me.\nHold Thou Thy cross before my closing eyes.\nShine through the gloom and point me to the skies.\nHeaven’s morning breaks and earth’s vain shadows flee;\nin life, in death, O Lord, abide with me.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day3-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Psalm 62:1-12, Isaiah 61:1-3, Luke 8:22-25, James 5:7-8",
    "devo_title": "Be Still, My Soul",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 62:1-12, Isaiah 61:1-3, Luke 8:22-25, James 5:7-8\nMy soul is not good at being still.\nThis morning, I took a book and a cup of coffee to the front porch, and in just a few moments, I was distracted. My phone called to me, trapping me in the never-ending deluge of other people’s happy photos. I wondered about what I’d make for dinner. A calendar alert reminded me of an appointment I’d forgotten. And then time ran out. My moments of solace were gone because I’d given them away to lesser things.\nIt is hard to guard stillness because I live in a world that drives me to move faster, do more, and document my achievement. The word “hustle” is everywhere. There’s a constant sense that if I don’t make something of myself, nothing will ever come of my life. I know that it is a lie, but it continues to trap me anyway. In my best moments, I am exhausted. In my worst, I am detached from my soul in a way that is nearly dissociative. How can I know my own heart when I spend so little time with it?\nIt is hard to guard stillness because being still allows the emotions I’d rather ignore to rise to the surface— emotions like pain, sorrow, and loss. Fears arise about of the futility of life, how little I’ve truly accomplished, and how frequently I let my friends and myself down. When I’m quiet, my questions for God get very loud. \nAre You there, God?\nDo You see me?\nDo You know how I’m hurting?\nDo You truly love me?\nMy heart is not always a happy place. Stillness requires me to face my own grief that life isn’t really all it’s cracked up to be.\nIn Megan Devine’s beautiful book, It’s OK that You’re Not OK, she writes, “Grief is simply love in its most wild and painful form. It is a natural and sane response to loss.” In the same way, I should not be surprised by the longings, desires, and heartache that surface when I sit in stillness. My heart was designed for something other than this world I live in. The pain and sorrow surrounding me is foreign—it’s no wonder I’m homesick for a place I’ve never been before.\nThe hymn “Be Still My Soul” is a song of longing for how things will be, but aren’t yet. There are no silver linings in this song, only the promise of God’s abiding comfort in the midst of my sadness, the promise that He will ultimately dry every tear from my eyes. \nI love that this hymn was written and is sung in a minor key, because this life is not a tune of happy hallelujahs. No—it is a thorny way that leads to a joyful end. But I’m not at that joyful end—not yet. And no amount of my effort can produce what only God can accomplish. Only in stillness can I feel His presence. Only in honestly uncovering my deepest wounds can I receive His soothing care.\nThe hour is hastening on when I will be forever with the Lord. Until then, let me guard time for stillness—my soul is desperate for it. Until then, may my soul find rest in God’s presence. “He alone is my rock and my salvation, my stronghold; I will never be shaken” (Psalm 62:1–2).\n \nBe Still, My Soul\nOriginal Text: Katrina von Schlegel, 1752\nTranslation: Jane Borthwick, 1855\nBe still, my soul: the Lord is on thy side.\nBear patiently the cross of grief or pain.\nLeave to thy God to order and provide;\nin ev’ry change, He faithful will remain.\nBe still, my soul: thy best, thy heav’nly Friend\nthrough thorny ways leads to a joyful end.\nBe still, my soul: thy God doth undertake\nto guide the future, as He has the past.\nThy hope, thy confidence let nothing shake;\nall now mysterious shall be bright at last.\nBe still, my soul: the waves and winds still know\nHis voice, Who ruled them while He dwelt below.\nBe still, my soul: when dearest friends depart,\nand all is darkened in the veil of tears,\nthen shalt thou better know His love, His heart,\nwho comes to soothe thy sorrow and thy fears.\nBe still, my soul: thy Jesus can repay\nfrom His own fullness all He takes away.\nBe still, my soul: the hour is hast’ning on\nwhen we shall be forever with the Lord.\nWhen disappointment, grief, and fear are gone,\nsorrow forgot, love’s purest joys restored.\nBe still, my soul: when change and tears are past,\nall safe and blessed we shall meet at last.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day4-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Matthew 11:25-30, Jeremiah 31:7-13, Isaiah 11:6-10",
    "devo_title": "Come, Oh, Come to Me",
    "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Matthew 11:25-30, Jeremiah 31:7-13, Isaiah 11:6-10\nWhen we had four kids under the age of four, my husband and I were both teaching at a local high school. Our whole life was babies and teenagers. The teenagers played football games on a field so close to our house that we could see the lights and hear the announcer from our bed. But because of the babies, we were always so tired on Friday nights that we couldn’t bear to schlepp all our children across the street to that game. So that’s where we enjoyed those football games—at home, in bed. The bright white stadium lights reflected off our glasses of water, and the play-by-play rattled our bottles of ibuprofen. We were so weary. We felt so old. But we were barely thirty.\nThere’s always something or someone ready to wear us out. It doesn’t matter how old you are, this old world is full of weariness. Usually it’s people whose behavior has changed abruptly, money that’s turned out to be missing, or the heartbreak of discovering your life isn’t at all what you expected it would be. \nWhatever is making your heart weary today, know that you are not alone. Without exception, we all long for comfort and rest. And without exception, we are inclined to look for it in things that will ultimately leave us unfulfilled. True comfort from world weariness only comes from Christ. He is the only source of true rest.\nIn Matthew 11, Jesus promises rest for the soul to all who “come to Him” (vv.28–30). What an inviting promise! Just show up and you will find rest for you soul. But look at the lives of those who did come to Him: His disciples. They dropped everything, their fishing nets and fathers, and followed Jesus. Did they find rest for their souls? They witnessed miracles and even performed some themselves. They defended Jesus, and they denied Him. They saw up close the one true Messiah, and many of them died for their association with Him. Is this what “rest for your souls” looks like?\nIn a word, yes. The rest that Christ promises us is not a reprieve from the conflict and complication of the world. But His rest is a change of alignment that gives our souls rest, no matter what weariness is swirling around us.\nIf you are looking for all trouble to end, you will not find that here on earth. In this world, you will have trouble, but Christ gives us the ultimate promise that, “I will turn their mourning into joy, give them consolation, and bring happiness out of grief” (Jeremiah 31:13). There will be so many weary days and so many happy days, but the underscore of all our days is His steady comfort and promise. All of this true rest is found only with the true Messiah, and He invites us, just as the words of this old hymn do—to ”Come, oh come to Me”… Linger then no longer.\nCome, Oh, Come to Me\nText: Lizzie Akers, 1902\nTune: James M. Black, 1902\nWeary burdened wand’rer,\nthere is rest for thee,\nat the feet of Jesus,\nin His love so free;\nlisten to His message,\nwords forever blest,\noh, thou heavy laden,\n“Come to Me and rest.”\nRefrain:\n“Come, oh come to Me,\ncome, oh come to Me,”\nJesus now is waiting, calling\n“Come, oh come to Me.”\nBring Him all thy burdens,\nall thy guilt and sin,\nmercy’s door is open,\nrise and enter in.\nJesus there is waiting,\npatiently for thee,\nhear Him gently calling,\n“Come, oh, come to Me.”    Refrain\nLinger then no longer,\ncome just now to Him;\nere the shadows gather,\nand thy light grows dim.\nThou hast long been waiting\nfor some better time,\nbut today He’s calling,\ncome and claim Him thine.    Refrain\nHe will bid thee welcome,\nat the blessed cross,\nturn to joy thy mourning,\nturn to gold thy dross.\nHe will lead thee gently,\nall along the way,\nin the path that shineth,\nunto perfect day.    Refrain\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day5-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "1 John 3:18-20",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nLittle children, let us not love in word or speech, but in action and in truth. This is how we will know that we belong to the truth and will reassure our hearts before him whenever our hearts condemn us; for God is greater than our hearts, and he knows all things.\n-1 John 3:18-20\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day6-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Psalm 62:1-2",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nAs we read hymns of hope based on the promises of Scripture, let’s memorize this passage that celebrates the rest and refuge God offers us in all circumstances.  \nI am at rest in God alone;\nmy salvation comes from him.\nHe alone is my rock and my salvation,\nmy stronghold; I will never be shaken.\n-Psalm 62:1-2\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/4-HymnsOfHope-1-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Proverbs 3:5-12, Romans 8:26-30, 2 Corinthians 1:20-22, Hebrews 9:11-14",
    "devo_title": "‘Tis So Sweet to Trust in Jesus",
    "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Proverbs 3:5-12, Romans 8:26-30, 2 Corinthians 1:20-22, Hebrews 9:11-14\nI don’t have just one sweet tooth. I have a mouth full of them. But don’t tell my dentist, because the mere mention will probably pre-qualify me for a shiny set of dentures down the road. Chocolate chip cookie dough, funnel cakes with powdered sugar, sour gummies that make your mouth pucker—I’m here for all of it.\nCandy, along with other types of “sweets,” like newborn kittens and handwritten notes, are indulgences, unnecessary delights. But when Louisa Stead wrote the hymn, “‘Tis So Sweet to Trust in Jesus,” I don’t think it was in response to cotton candy swirls or a beautiful stroll in the park.\nIn fact, it was a very tragic day at Long Island Sound. What began as a perfectly sunny morning for Louisa, her husband, and their young daughter, Lily, quickly turned into the unfortunate. They sat on the embankment together enjoying a picnic lunch when, all of a sudden, they were interrupted by the sights and sounds of a young boy drowning in the water. Louisa’s husband jumped in after him, but neither the boy nor the man attempting to rescue him survived. Walking away from the scene a grieving widow and single parent, Louisa’s circumstances were anything but sweet. Yet, these are the words she chose to write:\n‘Tis so sweet to trust in Jesus,\nJust to take Him at His Word\nJust to rest upon His promise,\nJust to know, “Thus saith the Lord!”\nJesus, Jesus, how I trust Him!\nHow I’ve proved Him o’er and o’er!\nJesus, Jesus, precious Jesus!\nO for grace to trust Him more!\nWhen our lives reflect the brokenness of this world, it is then that we see trusting Jesus for what it truly is: an absolute necessity. We need Him, but His trustworthiness is what makes trusting Him with our need so much sweeter. \n‘Tis so sweet to trust in Jesus when our worlds are spinning deliciously on their centers, when we’re steady and our sights are set on sugary delights we don’t need. It is sweet to trust in a God who desires to give His children abundantly good things. And ‘tis so sweet to trust in Jesus when everything has fallen apart and nothing resembles the life we’re used to, when we’re disoriented and unable to fix our attention on anything but present pain. It is sweet to trust in Jesus, who identifies with our sufferings and carried them for us in His body and to the cross.\nWhile I would never wish Louisa’s loss on anyone, her story lends credibility to those of us (all of us, really) who have felt similar pain, giving us the confidence to proclaim the kindness of our God, even when our circumstances feel anything but kind. When she wrote this hymn, I don’t think Louisa was claiming that her grief had suddenly disappeared by trusting Jesus. Instead, what I hear in her words is the surprise, the sweet relief, that she could still trust Him, come what may. We can, too. O for grace to trust Him more!\n \n‘Tis So Sweet to Trust in Jesus\nText: Louisa M. R. Stead, 1882\n‘Tis so sweet to trust in Jesus,\nand to take Him at His word;\njust to rest upon His promise,\nand to know, “Thus saith the Lord.”\nRefrain:\nJesus, Jesus, how I trust Him!\nHow I’ve proved Him o’er and o’er!\nJesus, Jesus, precious Jesus!\nO for grace to trust Him more!\nO how sweet to trust in Jesus,\njust to trust His cleansing blood;\nand in simple faith to plunge me\nneath the healing, cleansing flood!    Refrain\nYes, ’tis sweet to trust in Jesus,\njust from sin and self to cease;\njust from Jesus simply taking\nlife and rest, and joy and peace.    Refrain\nI’m so glad I learned to trust Thee,\nprecious Jesus, Savior, Friend;\nand I know that Thou art with me,\nwilt be with me to the end.    Refrain\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day8-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Psalm 119:105-112, 1 Corinthians 1:18-31, Philippians 3:7-11",
    "devo_title": "Be Thou My Vision",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 119:105-112, 1 Corinthians 1:18-31, Philippians 3:7-11\n“God doesn’t give guidance, he does guidance, and you’re in the middle of it.”\nPastor and writer Tim Keller’s words shocked me. I rewound the sermon podcast and listened again. I was in a job I hated—smack dab in the middle of a two-year commitment that felt like it would never end. The world told me that since I was unhappy, I should walk away. And I liked the sound of that. Daily, I pulled into the parking lot and cried, staring at the red-brick building. Inside, 200 seventh graders and several fellow teachers were ready to wear me down, yet again. I wanted to quit. In fact, I was seeking out biblical support to walk away. Instead, Keller’s words cut through the noise.  \nI had been praying for God to give me guidance—I wanted Him to show me the way out of my work situation. But Keller’s words reminded me that God had already done the guiding, and unfortunately, He’d led me to this red-brick building. I wanted to leave, but I knew He was calling me to stay. It took every ounce of faith and courage I could muster to step out of my car each day, and into the job He’d called me to. The world tells me to follow my heart, but God tells me to follow Him. It matters greatly which path I choose.\nThe words of the hymn “Be Thou My Vision” encourage me in my endeavor to live above the common level of life. Because believe me, when I’ve chosen to follow God instead of myself, He has led me on very uncommon paths. He has led me into places of resistance and uncertainty and darkness. But if I truly want to bring light to the world, I can’t be afraid of the dark. Left to my own direction, my heart is a compass that guides me toward passions and pleasures. But God is the true compass, guiding me along His ultimate path for me, changing my heart and renewing my mind in the process.\nAs it says in 1 Corinthians, following God must look like complete foolishness to people who do not know Him (v.18). But my heart is a broken instrument, so how can I possibly trust its direction? Only God is trustworthy to lead me.\nConsider the stanzas from “Be Thou My Vision.” See how each word is antithetical to the world’s call to seek our own way—fame and fortune, pleasure and comfort. The lyrics of this hymn are a reminder of who our God is and what He provides. He is with me. He protects me. He provides power. He brings wisdom. He endows me with treasure in heaven. He is my destination, both now and for eternity. And He is my greatest hope. Heart of my own heart, whatever befall, [Lord] still be my vision, O Ruler of all. \n \nBe Thou My Vision\nText: Irish hymn, sixth century\nProse Translation: Mary Byrne, 1905\nVerse Form:  Eleanor H. Hull, 1912\nBe Thou my vision, O Lord of my heart;\nnaught be all else to me, save that Thou art:\nThou my best thought by day or by night,\nwaking or sleeping, Thy presence my light.\nBe Thou my wisdom, and Thou my true word;\nI ever with Thee and Thou with me, Lord.\nThou my great Father, I Thy true son;\nThou in me dwelling, and I with Thee one.\nBe Thou my battle shield, sword for the fight;\nbe Thou my dignity, Though my delight;\nThou my soul’s shelter, Thou my high tower,\nraise Thou me heav’nward, O Power of my pow’r.\nRiches I heed not, nor man’s empty praise,\nThou mine inheritance, now and always:\nThou, and Thou only, first in my heart,\ngreat God of heaven, my treasure Thou art.\nHigh King of heaven, my victory won,\nmay I reach heaven’s joys, O bright heav’n’s Sun!\nHeart of my own heart, whatever befall,\nstill be my vision, O Ruler of all.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day9-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "John 14:18-25, Colossians 1:15-23, Ephesians 3:8-12",
    "devo_title": "Love Divine, All Loves Excelling",
    "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: John 14:18-25, Colossians 1:15-23, Ephesians 3:8-12\nWhat is the greatest love of your life? I know it sounds ridiculous, but I have a white Great Dane named Bess who is pretty high in the love rankings for me. We are in tune to each other without using words, and our mutual love is as steady as a slow walk in a long field. My husband is probably my greatest love—he still looks at me with love in his eyes, after eighteen years, even when I’m my worst combination of bossy and lazy. There’s also my children, who have awakened a love in me that makes me feel like a mighty grizzly bear. And there are also a handful of beloved women in my life, just a few, who have invited me into a community of virtue and laughter that I can’t find anywhere else in the world. We have a lot of chances for great love, and the love of my Great Dane is not, in fact, the least among these.\nWe are transformed in small ways by all our loves. Because of Bess, I am defenseless against the sweetness of a soft pink muzzle. Because of my children, I am brave. Because of my husband, I am at peace. Because of my dear friends, I am wise. Love transforms us. I’m sure you are similarly transformed by the loves in your life. But the most profound transformation comes from the love of Christ. This divine love excels all other loves. Where my dog and my husband fail me, Christ’s love stretches as far as the east is from the west.\nHow are we transformed by Christ’s love? First, we are transformed from death to life. Jesus promised, “Because I live, you will live too” (John 14:19). A life without Christ is a life of death and ashes; His love transforms these bodies of death to vessels of life. It is a complete transformation that we cannot affect with our own power. \nFinish then Thy new creation;\npure and spotless let us be.\nLet us see Thy great salvation\nperfectly restored in Thee.\nIt is God’s divine love and mercy that have the power to change us, to bring us from death to life in Him, affecting our lives in profound ways, now and forever. We are loved by the Father and equipped by the Holy Spirit, enabling us to keep God’s commands. Jesus will reveal Himself to us, we will keep His Word, and we will be at home with Him (John 14:21–23). We are fundamentally changed when Christ loves us.\nWe are also transformed by His love because we are reconciled to Him. Apart from His love, we are forever doomed to run in circles chasing our sin. When we are transformed by His love, He lifts us off the merry-go-round of sin and reconciles us to Himself. He transforms us from dirty to clean, from darkness to light. \nOnce [we] were alienated and hostile in [our] minds expressed in [our] evil actions.\nBut now he has reconciled [us] by his physical body through his death,\nto present [us] holy, faultless, and blameless before him (Colossians 1:21-22).\nI want to be presented before God as holy, faultless, and blameless! What a wonderful mystery of the gospel that I can be transformed from a lost sinner to someone who is holy and blameless! \nFinally, Christ’s love transforms us by giving us “confident access” to Himself (Ephesians 3:12). Our access to God is a hard-won privilege, given to us by Christ’s sacrifice for us on the cross. Because of Christ, we can run to our Father in prayer, and depend on Him for comfort in every circumstance. And because of Christ’s love, His loving Spirit breathes transforming comfort “into ev’ry troubled breast.”\n \nLove Divine, All Loves Excelling\nText: Charles Wesley, 1747\nLove divine, all loves excelling,\njoy of heav’n, to earth come down,\nfix in us Thy humble dwelling;\nall Thy faithful mercies crown.\nJesus, Thou art all compassion;\npure, unbounded love Thou art;\nvisit us with Thy salvation;\nenter ev’ry trembling heart.\nBreathe, O breathe Thy loving Spirit\ninto ev’ry troubled breast!\nLet us all in Thee inherit;\nlet us find the promised rest.\nTake away the love of sinning;\nAlpha and Omega be;\nend of faith, as its beginning,\nset our hearts at liberty.\nCome, Almighty, to deliver;\nlet us all Thy life receive;\nsuddenly return and never,\nnevermore Thy temples leave.\nThee we would be always blessing,\nserve Thee as Thy hosts above,\npray and praise Thee without ceasing,\nglory in Thy perfect love.\nFinish then Thy new creation;\npure and spotless let us be;\nlet us see Thy great salvation\nperfectly restored in Thee.\nChanged from glory into glory,\ntill in heav’n we take our place,\ntill we cast our crowns before Thee,\nlost in wonder, love, and praise\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day10-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Isaiah 41:8-10, Psalm 46:1-11, Matthew 23:37-39, Mark 10:13-16",
    "devo_title": "Safe in the Arms of Jesus",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Isaiah 41:8-10, Psalm 46:1-11, Matthew 23:37-39, Mark 10:13-16\nI once heard a story of a momma hen found in the rubble of a burned down chicken coop. The hen didn’t survive the fire, but tucked up under her breast, the farmer found her brood of tiny chicks, safely sheltered by their momma’s wings. \nThis tender image has stayed with me over the years. I think of it when I drop my children off at school and a familiar pang of fear strikes my chest. It comes to mind when I watch the news in horror. I’m reminded of it when a devastating medical diagnosis hits too close to home, and I can no longer deny that we are broken people living in broken bodies in a broken world.\nOur bodies are broken, resulting in sickness that ranges from inconvenient to terminal. Our hearts are broken, leaving us hurting and hungry for relief. Our culture is broken and no political system can fix the chasm. We don’t have to look far to realize all over again, that there is much to fear. No amount of nail biting or floor pacing can change that.  \nWhen the world around me feels ablaze, I’m so grateful the Word reminds me that I am tucked safely under the wings of my Savior; there is room for everyone I love to find shelter here too. And we can stake a claim and raise a banner over these bedrock truths found in His Word:\nGod is our refuge and strength, a very present help in trouble. The LORD of hosts is with us;\nthe God of Jacob is our fortress.\n– Psalm 46:1,7\nWe see suffering and beg God to be with those who are hurting. But lean in and listen closely: Every page of His Word declares, “I’m already right here!” We don’t have the promise that our fears are unfounded or that suffering won’t come, but the safest space we can run to is the presence of Jesus. He wants to gather us like a hen gathers her brood (Matthew 23:37), to tuck us in and shelter us as the storm of sin passes over this dying world. \nSafe in the arms of Jesus,\nsafe on His gentle breast,\nthere by His love o’ershaded,\nsweetly my soul shall rest.\nFanny Crosby, the author of this hymn, surely knew a thing or two about fear and suffering. Blind since infancy, she must have faced more than her fair share of fiery trials. And yet, in addition to penning more than 5,000 hymns declaring the sufficiency of God, she is known to have uttered these faith-filled words: \n“Do you know that if at birth I had been able to make one petition, it would have been that I was born blind?…  Because when I get to heaven, the first face that shall ever gladden my sight will be that of my Savior.”\nFanny spent her life in the dark, but never alone. In this life she was tucked under the wings of her Savior, knowing that in the next all fear and hurt would fade away. Oh, we are safe in the arms of Jesus, friends. Safe on His gentle breast. In His presence we’re overshadowed by love. So sweetly, our souls can rest.  \n \nSafe in the Arms of Jesus\nText: Fanny Crosby, 1868\nSafe in the arms of Jesus,\nsafe on His gentle breast,\nthere by His love o’ershaded,\nsweetly my soul shall rest.\nHark! ’tis the voice of angels\nborne in a song to me.\nOver the fields of glory,\nover the jasper sea.\nRefrain:\nSafe in the arms of Jesus,\nsafe on His gentle breast,\nthere by His love o’ershaded,\nsweetly my soul shall rest.\nSafe in the arms of Jesus,\nsafe from corroding care,\nsafe from the world’s temptations,\nsin cannot harm me there.\nFree from the blight of sorrow,\nfree from my doubts and fears;\nonly a few more trials,\nonly a few more tears!    Refrain\nJesus, my heart’s dear refuge,\nJesus has died for me;\nfirm on the Rock of Ages,\never my trust shall be.\nHere let me wait with patience,\nwait till the night is o’er;\nwait till I see the morning\nbreak on the golden shore.    Refrain\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day11-1.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Isaiah 66:12-13, 2 Corinthians 3:13-18, Philippians 1:12-26",
    "devo_title": "It Is Well with My Soul",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Isaiah 66:12-13, 2 Corinthians 3:13-18, Philippians 1:12-26\n“It Is Well with My Soul” has been a family favorite for generations. My paternal grandmother loved the song, and after she went to be with the Lord my dad would sing it often at church.  I’ll admit I didn’t fully understand what he was singing about. I understood the song was about submitting to God, but didn’t really understand how someone could say “It Is Well with My Soul” when “sorrows” were actually rolling like “sea billows.” At that point, my faith in God was built squarely on the idea that God proves His love to me by allowing good things to happen to me. I imagined God as a good-natured, yet principled, grandfather, who blessed good people with good things and punished bad people with bad things.\nThankfully, God destroyed that image. \nI had constructed an image of God that was more like Santa Claus than anything else. Santa makes his list and checks it twice, then divvies out either gifts or coal, depending on a child’s behavior. I ordered my life around that idea: If I’m good, nothing bad will happen to me. If I’m bad, God’s going to punish me. It was a see-saw of prideful earning and shame-ridden failure.  \nEventually, the beautiful truth emerged that no matter how far I strayed from God, no matter how disobedient I’d been, the Father continued to display faithfulness to me, continued to pursue me, continued to receive me. And yet, another truth came to life: Life with God does not mean a life without pain. Surprisingly, experiencing the things I expected God to shield me from because of my “good behavior” has shown me that He alone is good. His unrelenting goodness toward me is never increased or diminished based on my actions.\nWhen peace like a river attendeth my way,\nwhen sorrows like sea billows roll;\nwhatever my lot, Thou hast taught me to say,\n“It is well, it is well with my soul.”\nNow I understand how Horatio G. Spafford could pen these words. Now I see that neither the joys nor the sufferings of this present life could ever compare to the great glory that awaits me in the life to come. With every undeserved grace He’s extended to me, God has given me the incomprehensible peace, soothing the stormy sorrows of my soul. Come what may, God is teaching my heart to sing a new song: It is well with my soul. \nBoth God’s goodness and greatness go far beyond what I can see with my natural eyes. It’s the Father’s goodness that sent Jesus to the cross for my sin. And it’s His greatness that raised Jesus to life, seating Him in heavenly places where He continues to intercede for me (Romans 8:34). \nMy sin, oh, the bliss of this glorious thought!\nMy sin, not in part, but the whole,\nis nailed to the cross, and I bear it no more;\npraise the Lord, praise the Lord, O my soul!\nCircumstances will change, but our God is steadfast and faithful—yesterday, today, and every day to come—and it’s because of His character that we are safe and secure. He is so much more, so much better than we could ever imagine Him to be. \n \nIt Is Well With My Soul\nHoratio G. Spafford, 1873\nWhen peace like a river attendeth my way,\nwhen sorrows like sea billows roll;\nwhatever my lot, Thou hast taught me to say,\n“It is well, it is well with my soul.”\nRefrain:\nIt is well with my soul;\nit is well, it is well with my soul.\nThough Satan should buffet, though trials should come,\nlet this blest assurance control:\nthat Christ has regarded my helpless estate,\nand has shed His own blood for my soul.    Refrain\nMy sin, oh, the bliss of this glorious thought!\nMy sin, not in part, but the whole,\nis nailed to the cross, and I bear it no more;\npraise the Lord, praise the Lord, O my soul!    Refrain\nO Lord, haste the day when my faith shall be sight,\nthe clouds be rolled back as a scroll;\nthe trump shall resound and the Lord shall descend;\neven so, it is well with my soul.    Refrain\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day12.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": " Romans 8:26–27",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nIn the same way the Spirit also helps us in our weakness, because we do not know what to pray for as we should, but the Spirit himself intercedes for us with unspoken groanings. And he who searches our hearts knows the mind of the Spirit, because he intercedes for the saints according to the will of God.\n– Romans 8:26–27\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-HymnsofHope-Shareimage-Day13.jpg"
},
{
    "book_title": "Hymns of Hope",
    "devo_passages": "Jeremiah 31:12",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s passage is the key verse for this reading plan—a reminder of the eternal joy that is ours in Christ. \nThey will come and shout for joy on the heights of Zion;\nthey will be radiant with joy\nbecause of the LORD’s goodness.\n-Jeremiah 31:12\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/4-HymnsOfHope-2-1.jpg"
},
{
    "book_title": "Hymns V",
    "devo_passages": "1 John 4:7-19, Hebrews 10:19-23, 1 Peter 1:3-9",
    "devo_title": "Blessed Assurance",
    "devo_summary": "\nBY Annie Downs\n\nText: 1 John 4:7-19, Hebrews 10:19-23, 1 Peter 1:3-9\n“No one takes care of you except you.”\nIt’s a lie I hear, over and over again. One I have to battle to make disappear. In a world where being a 30-something single woman is more common than it has ever been before (and, in some ways, probably easier than it was a few decades ago), it can still have its aches and pains, just like any other season of life.\nI have dear family and friends who help in any time of need, but when it all comes down to it, I feel like I’m the only one who has my back. It can feel like I have no real assurance of someone else watching out for me, like no one is there to rescue me when I am drowning in a sea of work or finances or laundry or car problems.\nThis is my story.\nFor some reason, God has purposed and planned that my best life is right here, right now, even with the hurt and loneliness and worry that come right along with all the incredibly good things. This is what’s true, and the truth wins each and every time—if only I look to it.\nJesus is mine.\nI’ve known it since I learned this song as a tiny kid. It is my assurance, that Jesus is mine. When I feel forgotten and think no one sees me, He sees. When I think no one will step in, He always steps in, to provide and protect. When I need to be rescued, He proves, again and again, that rescuing is His specialty in my life (Colossians 1:13).\nAn assurance, by definition, is a promise that is meant to give us confidence. The writer of this hymn, Fanny Crosby, felt it deep in her soul, enough that as soon as the organ notes were played, the lyrics poured out.\nDid you know Fanny Crosby became blind when she was an infant? For nearly the entirety of her life, she lacked what so many of us have: sight. I recognize my own story in hers—in not having what others have.\nIt’s different, I know. But it’s the same, too, isn’t it? Can’t we all list something others have that we don’t? Something that can’t be earned or bought but is a gift that we just plain haven’t received? I think there’s something really beautiful about loving Jesus right there, right in the middle of that tension, where we recognize the gifts we haven’t been given by our good and perfect Father.\nClearly, I don’t know Fanny Crosby personally, as she died 100 years ago. But I almost feel a little wink from her in the second stanza.\n“Visions of rapture now burst on my sight . . .”\nIt’s like she’s saying, “whatever it is you think I don’t have, I have in Him.”\nWithout Jesus, without THE blessed assurance, she couldn’t see a thing. But with Him, there were visions of rapture.\nWithout Jesus, I am the only one who takes care of me. With Jesus, I am never alone. I am loved deeply by God, and therefore, I can love and be loved by others (Deuteronomy 31:6, 1 John 4:7-19).\nWhatever it is I think I don’t have, I have in Him.\nWhatever it is you think you don’t have, you can have in Him.\nBlessed assurance, y’all, Jesus is mine. That’s a promise that brings me great confidence. I pray it brings the same for you.\nPreach on, Fanny. We’re listening.\n“Let us hold tightly without wavering to the hope we affirm,\nfor God can be trusted to keep his promise.”\n-Hebrews 10:23\nBlessed Assurance\nFanny Crosby, 1873\nBlessed assurance; Jesus is mine!\nOh, what a foretaste of glory divine!\nHeir of salvation, purchase of God,\nborn of his Spirit, washed in his blood.\nRefrain:\nThis is my story, this is my song,\npraising my Savior all the day long;\nthis is my story, this is my song,\npraising my Savior all the day long.\nPerfect submission, perfect delight,\nvisions of rapture now burst on my sight;\nangels descending bring from above\nechoes of mercy, whispers of love. [Refrain]\nPerfect submission, all is at rest,\nI in my Savior am happy and blest;\nwatching and waiting, looking above,\nfilled with his goodness, lost in his love. [Refrain]\n \nFor an added layer of worship during reading plan, we’ve created a Spotify playlist for Hymns V! You can find the complete SRT/HRT Hymns V Playlist here, or listen to the first track on the player below. Enjoy!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/01/SRT-Hymns5-Instagram1s.jpg"
},
{
    "book_title": "Hymns V",
    "devo_passages": "1 Corinthians 3:9-11, Ephesians 1:20-23, Ephesians 2:17-21, Ephesians 5:25-27, Colossians 1:17-20",
    "devo_title": "The Church’s One Foundation",
    "devo_summary": "\nBY Rebecca Faires\n\nText: 1 Corinthians 3:9-11, Ephesians 1:20-23, Ephesians 2:17-21, Ephesians 5:25-27, Colossians 1:17-20\nMy senior prom didn’t go like I expected. I invited a boy that I really liked, drove my mom crazy shopping for just the right dark blue dress with sparkles, and when the night arrived I felt like a princess in braces. Over dinner, however, my date noticed my adorable best friend, dressed in black and glittering with charming conversation, completely oblivious to him. He continued to notice her all night. And well into the morning hours, I listened to him recount her virtues and wonder at her beauty.\nI felt silly. Worse, I felt insignificant and expendable, my blue dress and smudged eyeliner just an embarrassment. In the years that followed, I have learned not to base my self-worth on the opinion of teenage boys. In fact, I have learned that my self-worth isn’t even the point of my story. But I have not lost my longing to be treasured.\nThe story of Christ and His church is like a true fairy tale. He slays the dragon, rescues the princess, and takes her home to His kingdom. From heaven He came and sought her to be His holy bride.\nAs the church, we are Christ’s treasured bride. And He gives us our place, value, and significance. Don’t worry about your sparkly dress; Christ has something even better to offer. “He did this to present the church to Himself in splendor, without spot or wrinkle or anything like that, but holy and blameless” (Ephesians 5:27).\nBut the story of Christ and His church is greater, because this story isn’t about the worthiness of the church. The church isn’t the bride of Christ because we are the prettiest, cleverest, or even the most obedient. Christ is the one who makes us worthy, and we can find that self-worth in Him, for He is sure, steadfast, and faithful.\nChrist Himself is the center and foundation of the church (1 Corinthians 3:11). Samuel Stone wrote this hymn to highlight “the one holy church, and the communion of the saints” part of the Apostle’s Creed. And it’s such a good reminder that those whose foundation is based on Christ are all united in the one holy church.\nIn all of my longing to be treasured, I can miss the actual treasure: Christ. But instead of building my life on false hopes and imagined romances, I can look to the one foundation “who is also the head of the body, the church” (Colossians 1:18). In fact, I don’t need to build my life at all; Paul writes that we are “built on the foundation of the apostles and prophets, with Christ Jesus Himself as the cornerstone” (Ephesians 2:20). So the building is already accomplished. God has already done the work of building the church on the foundation of Christ.\nNow my job is to rest in Christ, to lean on Him and the foundation that He has already laid. My worth and my security come from Christ alone. He is our hope and our treasure.\nO happy ones and holy!\nLord, give us grace that we\nLike them, the meek and lowly,\nOn high may dwell with Thee:\nThere, past the border mountains,\nWhere in sweet vales the Bride\nWith Thee by living fountains\nForever shall abide!\nThe Church’s One Foundation\nSamuel J. Stone, 1866\nThe Church’s one foundation\nIs Jesus Christ her Lord,\nShe is His new creation\nBy water and the Word.\nFrom heaven He came and sought her\nTo be His holy bride;\nWith His own blood He bought her\nAnd for her life He died.\nShe is from every nation,\nYet one o’er all the earth;\nHer charter of salvation,\nOne Lord, one faith, one birth;\nOne holy Name she blesses,\nPartakes one holy food,\nAnd to one hope she presses,\nWith every grace endued.\n’Mid toil and tribulation,\nAnd tumult of her war,\nShe waits the consummation\nOf peace forevermore;\nTill, with the vision glorious,\nHer longing eyes are blest,\nAnd the great Church victorious\nShall be the Church at rest.\nYet she on earth hath union\nWith God the Three in One,\nAnd mystic sweet communion\nWith those whose rest is won,\nWith all her sons and daughters\nWho, by the Master’s hand\nLed through the deathly waters,\nRepose in Eden land.\nO happy ones and holy!\nLord, give us grace that we\nLike them, the meek and lowly,\nOn high may dwell with Thee:\nThere, past the border mountains,\nWhere in sweet vales the Bride\nWith Thee by living fountains\nForever shall abide!\n\nFor an added layer of worship during reading plan, we’ve created a Spotify playlist for Hymns V! You can find the complete SRT/HRT Hymns V Playlist here, or listen to the first track on the player below. Enjoy!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/02/SRT-Hymns5-Instagram2s.jpg"
},
{
    "book_title": "Hymns V",
    "devo_passages": "Psalm 32:1-11, Acts 2:38, Galatians 2:16",
    "devo_title": "Blest Is the Man",
    "devo_summary": "\nBY Raechel Myers\n\nText: Psalm 32:1-11, Acts 2:38, Galatians 2:16\nIt was the song Oliver heard us sing to him from the time he was born. As we tucked him into his crib, then his toddler bed, then his big-boy bed—I would quietly sing in his ear, “blest is the man, forever blest, whose guilt is pardoned by his God…”\nSometimes he wouldn’t mind. I think he really liked it. Other times, he would interrupt me with important toddler questions about dinosaurs or characters on “Thomas the Train.” But I think he grew to love, and even expect, his weepy mommy singing hymns in his room, stroking his hair as he fell asleep. I can just imagine him telling his four-year-old buddies:\nIt is what it is, you guys. My mom cries more at bedtime than I do.\nOliver is nine now. (Nine-and-a-half, if you’re asking him.) I don’t sing to him often anymore—something even better has happened as he’s grown into a small version of a man. Instead of lying in his toddler bed, wearing robot jammies while he listens to the hymn, he now stands next to me in church on Sunday mornings, holding the sheet music (usually already covered in pre-church doodles), probably wishing he were still wearing robot jammies. If I quiet my own singing, I can tune into his voice joined with our congregation as the words “and not on works but grace relies” now come from his own lips.\nIt’s a good moment. Not because I’m a perfect mom. Not because he’s a perfect kid. Oh man, you guys, we mess up all the time— especially on Sunday mornings. (I’ve always thought Sundays were the most sanctifying days of the week; not because of the sermons, but because of the hours leading up to the sermons. That’s straight-up refining fire, y’all.)\nIt’s not a good moment because we’re good. It’s a good moment because we’re not. So whether I’m singing these words to my my son or to myself, or if he’s singing them along with me, we’re just reminding ourselves and each other that we are guilty and we need God. And that the Savior already bled and covered all our days—even our Sunday mornings. \n“Blest Is the Man” has been my prayer for the man God has given us to raise. Not just because Isaac Watts knew how to write a solid hymn, but because the lines of this hymn come straight from the pages of Scripture, through the pens of David and Paul and Luke and others. We pray this hymn in worship for our son, and for our daughter, and for ourselves, that though we fall short—though our unrighteousness is plenty—His righteousness pardons us in full.\nWhile bright the evidence of grace\nThro’ all his life appears and shines!\nBlest is the Man, Forever Blest\nIsaac Watts, 1719\nBlest is the man, forever blest,\nWhose guilt is pardoned by his God,\nWhose sins with sorrow are confessed\nAnd covered with his Savior’s blood.\nBlest is the man to whom the Lord\nImputes not his iniquities;\nHe pleads no merit of reward\nAnd not on works but grace relies.\nFrom guile his heart and lips are free;\nHis humble joy, his holy fear,\nWith deep repentance well agree\nAnd join to prove his faith sincere.\nHow glorious is that righteousness\nThat hides and cancels all his sins,\nWhile bright the evidence of grace\nThro’ all his life appears and shines!\n\nFor an added layer of worship during reading plan, we’ve created a Spotify playlist for Hymns V! You can find the complete SRT/HRT Hymns V Playlist here, or listen to the first track on the player below. Enjoy!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/02/SRT-Hymns5-Instagram3s.jpg"
},
{
    "book_title": "Hymns V",
    "devo_passages": "Philippians 2:5-8, Acts 12:6-8, Acts 16:25-26, Romans 8:1-4, Hebrews 4:14-16",
    "devo_title": "And Can It Be?",
    "devo_summary": "\nBY Guest Writer\n\nText: Philippians 2:5-8, Acts 12:6-8, Acts 16:25-26, Romans 8:1-4, Hebrews 4:14-16\nIn 1738, Charles Wesley was struggling to find peace with God. He had served as a missionary to Georgia, but that had turned out disastrously bad. Peter Bohler, the leader of the London Moravians, asked Charles if he hoped to be saved. Charles replied that he did. Bohler pressed, “Upon what basis do you hope to be saved?” Wesley said, “Because I have used my best endeavors to serve God.” Bohler shook his head sadly and walked away.\nWesley recorded his reaction in his journal: “What, are not my endeavors a sufficient ground of hope? Would he rob me of my endeavors? I have nothing else to trust to.”\nWesley was stuck in the tension that many raised in church have experienced. It is all too common to confuse the fruits of the gospel at work in our lives (good endeavors) with the root of spiritual life (the gospel promise believed).\nThe problem with trusting our good works is that they are not perfect works. Jesus said that we are to love Him with all our heart, all our mind, and all our strength, and this is a considerably higher bar than just offering Him our best endeavors.\nGod requires that we love Him perfectly from the moment we are born until the moment we die, with no lapses. Faced with this impossible requirement, many religious people attempt to take solace in such empty hopes as our best, though imperfect, endeavors. But this hymn points us to a higher ground of hope—the power of the gospel.\nLater in 1738, Wesley’s friend, John Bray, discovered Martin Luther’s Commentary on Galatians and brought it to Wesley, who was sick in bed. Luther had famously once said that the whole of the gospel was found in the personal pronouns, and Wesley found peace as the Lord gave him faith to believe that Jesus had died for him. Wesley wrote in his journal, “I spent some hours this evening in private with Martin Luther, who was greatly blessed to me, especially his conclusion of the second chapter. I labored, waited, and prayed to feel ‘Who loved me and gave Himself up for me.’”\nIt is sometimes said that “And Can It Be” was Wesley’s first hymn, written soon after his conversion. Hymn scholars are now convinced that “Where Shall My Wondering Soul Begin?” was actually his first hymn. But “And Can It Be” was written soon after and expresses beautifully and powerfully the converting power of the gospel that he had experienced.\nWesley is one of our most skilled hymn writers. He begins with a piercing question to which no real answer can be given: “How can it be, that thou my God, shoulds’t die for me?” If we ever get to the point where God’s grace seems deserved or expected, we are in deep trouble.\nWe see Wesley’s grasp of Luther’s point in his use of personal pronouns: “my God,” “for me.” But it is in the last verse where Wesley reveals the heart of his new-found hope. “Alive in Him, my living head, and clothed in righteousness divine.”\nWesley had come to understand that the gospel Christ gives us what God requires—His perfect righteousness through our union with Him. What Christ does, we get credit for; what He deserves, we get!\nRather than trusting in our best endeavors, Wesley gives us words to praise God for our only true hope, the righteousness of Christ imputed to His people through faith. This brings us not only hope, but boldness to claim the crown—not because of what we have done, but because of what Christ has done in our place.\nRev. Kevin Twit is a graduate of Berklee College of Music and Covenant Theological Seminary who has served 20 years as the RUF Campus Minister at Belmont University in Nashville, Tennessee. In 1999, Kevin and some of his students began Indelible Grace Music, a group of musicians and songwriters at the heart of the hymn movement. Indelible Grace has recorded 9 albums as well as a documentary film, “Roots And Wings: The Story Of Indelible Grace And The RUF Hymns.” Kevin is married to Wendy and they have 3 children.\nAnd Can It Be That I Should Gain?\nCharles Wesley, 1738\nAnd can it be that I should gain\nAn interest in the Savior’s blood?\nDied He for me, who caused His pain—\nFor me, who Him to death pursued?\nAmazing love! How can it be,\nThat Thou, my God, shouldst die for me?\nAmazing love! How can it be,\nThat Thou, my God, shouldst die for me?\nHe left His Father’s throne above\nSo free, so infinite His grace—\nEmptied Himself of all but love,\nAnd bled for Adam’s helpless race:\n’Tis mercy all, immense and free,\nFor O my God, it found out me!\n’Tis mercy all, immense and free,\nFor O my God, it found out me!\nLong my imprisoned spirit lay,\nFast bound in sin and nature’s night;\nThine eye diffused a quickening ray—\nI woke, the dungeon flamed with light;\nMy chains fell off, my heart was free,\nI rose, went forth, and followed Thee.\nMy chains fell off, my heart was free,\nI rose, went forth, and followed Thee.\nNo condemnation now I dread;\nJesus, and all in Him, is mine;\nAlive in Him, my living Head,\nAnd clothed in righteousness divine,\nBold I approach th’eternal throne,\nAnd claim the crown, through Christ my own.\nBold I approach th’eternal throne,\nAnd claim the crown, through Christ my own.\n\nFor an added layer of worship during reading plan, we’ve created a Spotify playlist for Hymns V! You can find the complete SRT/HRT Hymns V Playlist here, or listen to the first track on the player below. Enjoy!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/02/SRT-Hymns5-Instagram4s.jpg"
},
{
    "book_title": "Hymns V",
    "devo_passages": "Psalm 121:1-8, Psalm 145:3-7, 1 Thessalonians 4:16-17",
    "devo_title": "How Great Thou Art",
    "devo_summary": "\nBY Ellie Holcomb\n\nText: Psalm 121:1-8, Psalm 145:3-7, 1 Thessalonians 4:16-17\n“How Great Thou Art” always has a way of undoing me. Something happens to me each time I sing this old hymn, whether singing along with hundreds of other voices or alone in my car. The atmosphere seems to shift, and I’m left wondering what it is specifically about this hymn that causes such a stir within me.\nWhen Billy Graham was asked why he used the song so much at his crusades, he said this:\n“It glorifies God. It turns Christians’ eyes toward God rather than upon themselves. I use it as often as possible because it is such a God-honoring song.”\nAnd there you have it. It honors God and shifts our gaze away from ourselves back to our Father. He is greater than any joy this world has to offer, greater than any storm our souls will ever weather. \nThe past month has been filled with anxiety for me, and I’ve continually felt like a failure at life. There are so many things I’ve left undone—people I haven’t seen, phone calls I haven’t returned, and, after having a new baby boy, so much sleep I haven’t been getting. I feel like the worst version of myself, and yet as I read through this old hymn, I am once again reminded that the gospel isn’t really about me and how I’m doing. It’s about our great God and what He’s done for us.\nThe hymn began as a poem written by Carl Boberg in the late 19th century, but it was British missionary Stuart Hine who took the Russian translation of Boberg’s original and created the commonly known English version. Hine was on a trip through the Carpathian Mountains of Ukraine with his wife, preaching in a mountain village, when they were caught in a terrible storm. In awe as the thunder echoed throughout the mountains, Hine was inspired to write the first verse of his English paraphrase:\nO Lord my God, when I in awesome wonder\nConsider all the worlds thy hands have made,\nI see the stars, I hear the rolling thunder,\nThy power throughout the universe displayed\nThat power Hine witnessed is the gospel power at work in you and me. Like the Psalmist penned, “I lift up my eyes to the hills—where does my help come from? My help comes from the Lord, the Maker of heaven and earth” (Psalm 121:1-2).\nI love how this hymn helps me lift my eyes from my inadequacy to His sufficiency—from my not-enough to His always-enough. It helps me to remember the wonderful works He has done (Psalm 145:5) and to meditate on those, rather than circling around and around all the things I’ve left undone.\nI love how this song shifts my gaze—\nFrom my sin and mistakes to God’s sacrifice and grace.\nFrom my problems and pain to God’s power and mercy.\nFrom the mess of my heart to the beauty of His love.\nFrom the ache of this world to the hope of our true, eternal home.\nFriends, let’s gather ‘round and sing this song together today, turning our eyes from ourselves to our great God, proclaiming His goodness and faithfulness to our our own souls and to those around us (Psalm 145:3-7).\nThe same God who is over the storms, who created the hills and the valleys, comes down to be our helper. The same God who spoke the mountains into existence, who knit us together in our mothers’ wombs, sent His own Son to take our place on the cross. And that same God will come again one day to make all things right (1 Thessalonians 4:16-17).\nI’m so thankful for the way this song helps us remind our souls of His greatness and His goodness. May we sing it together today, and remind one another of its truths every day.\nHow Great Thou Art\nCarl Gustav Boberg, 1885; Stuart K. Hine, c. 1949\nO Lord my God, when I in awesome wonder\nConsider all the worlds thy hands have made,\nI see the stars, I hear the rolling thunder,\nThy power throughout the universe displayed:\nRefrain\nThen sings my soul, my Savior God, to thee:\nHow great thou art! How great thou art!\nThen sings my soul, my Savior God, to thee:\nHow great thou art! How great thou art!\nWhen through the woods and forest glades I wander\nAnd hear the birds sing sweetly in the trees,\nWhen I look down from lofty mountain grandeur,\nAnd hear the brook and feel the gentle breeze:\nRefrain\nAnd when I think that God, his Son not sparing,\nSent him to die, I scarce can take it in,\nThat on the cross, my burden gladly bearing,\nHe bled and died to take away my sin.\nRefrain\nWhen Christ shall come with shout of acclamation\nAnd take me home, what joy shall fill my heart!\nThen I shall bow in humble adoration,\nAnd there proclaim, My God, how great thou art!\n\nFor an added layer of worship during reading plan, we’ve created a Spotify playlist for Hymns V! You can find the complete SRT/HRT Hymns V Playlist here, or listen to the first track on the player below. Enjoy!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/02/SRT-Hymns5-Instagram5s.jpg"
},
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 100",
    "devo_title": "You Are God",
    "devo_summary": "\nBY She Reads Truth\n\nIn this 2-week reading plan, we will assume a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we will offer a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. May He use His Word to turn our hearts toward Him.\n \nPsalm 100\nBe Thankful\nA psalm of thanksgiving.\nShout triumphantly to the Lord, all the earth.\nServe the Lord with gladness;\ncome before Him with joyful songs.\nAcknowledge that Yahweh is God.\nHe made us, and we are His —\nHis people, the sheep of His pasture.\nEnter His gates with thanksgiving\nand His courts with praise.\nGive thanks to Him and praise His name.\nFor Yahweh is good, and His love is eternal;\nHis faithfulness endures through all generations.\nDig deeper:\nOur God is good and His love is eternal. Let’s follow David’s lead in Psalm 100 by humbling ourselves in gratitude before the Lord. Complete the song of praise below with your own words of thanks.\nShout triumphantly to the Lord, all the earth.\nServe the Lord with gladness;\ncome before Him with joyful songs.\n_______________________________________\n(Go ahead! Shout out or write down a triumphant praise!)\nAcknowledge that Yahweh is God.\nHe made us, and we are His —\nHis people, the sheep of His pasture.\n_______________________________________\n(Celebrate who God is and who we are to Him.)\nEnter His gates with thanksgiving\nand His courts with praise.\nGive thanks to Him and praise His name.\n_______________________________________\n(Give thanks to God and praise His name.)\nFor Yahweh is good, and His love is eternal;\nHis faithfulness endures through all generations.\n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram1.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 19:1-14",
    "devo_title": "Your Instruction is Perfect",
    "devo_summary": "\nBY She Reads Truth\n\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\nPsalm 19\nThe Witness of Creation and Scripture\nFor the choir director. A Davidic psalm.\nThe heavens declare the glory of God,\nand the sky proclaims the work of His hands.\nDay after day they pour out speech;\nnight after night they communicate knowledge.\nThere is no speech; there are no words;\ntheir voice is not heard.\nTheir message has gone out to all the earth,\nand their words to the ends of the world.\nIn the heavens He has pitched a tent for the sun.\nIt is like a groom coming from the bridal chamber;\nit rejoices like an athlete running a course.\nIt rises from one end of the heavens\nand circles to their other end;\nnothing is hidden from its heat.\nThe instruction of the Lord is perfect,\nrenewing one’s life;\nthe testimony of the Lord is trustworthy,\nmaking the inexperienced wise.\nThe precepts of the Lord are right,\nmaking the heart glad;\nthe command of the Lord is radiant,\nmaking the eyes light up.\nThe fear of the Lord is pure,\nenduring forever;\nthe ordinances of the Lord are reliable\nand altogether righteous.\nThey are more desirable than gold—\nthan an abundance of pure gold;\nand sweeter than honey,\nwhich comes from the honeycomb.\nIn addition, Your servant is warned by them;\nthere is great reward in keeping them.\nWho perceives his unintentional sins?\nCleanse me from my hidden faults.\nMoreover, keep Your servant from willful sins;\ndo not let them rule over me.\nThen I will be innocent\nand cleansed from blatant rebellion.\nMay the words of my mouth\nand the meditation of my heart\nbe acceptable to You,\nLord, my rock and my Redeemer.\nDig Deeper:\nGod’s Word is true and complete! As you engage with verses 12-14, give thanks to God for His perfect Word that leads us to confession and repentance, restores us, and makes our hearts glad. Fill in the blanks as you pray the prayer below.\nWho perceives my unintentional sins?\nCleanse me from _______________________.\nMoreover, keep me from _______________________.\nDo not let them rule over me.\nThen I will be innocent and cleansed from blatant rebellion.\nMay the words of my mouth and the meditation of my heart be acceptable to You, Lord, my rock and my Redeemer.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram2-1.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 34:1-22",
    "devo_title": "You Hear & Deliver",
    "devo_summary": "\nBY She Reads Truth\n\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\nPsalm 34\nThe Lord Delivers the Righteous\nConcerning David, when he pretended to be insane in the presence of Abimelech, who drove him out, and he departed.\nI will praise the Lord at all times;\nHis praise will always be on my lips.\nI will boast in the Lord;\nthe humble will hear and be glad.\nProclaim Yahweh’s greatness with me;\nlet us exalt His name together.\nI sought the Lord, and He answered me\nand delivered me from all my fears.\nThose who look to Him are radiant with joy;\ntheir faces will never be ashamed.\nThis poor man cried, and the Lord heard him\nand saved him from all his troubles.\nThe Angel of the Lord encamps\naround those who fear Him, and rescues them.\nTaste and see that the Lord is good.\nHow happy is the man who takes refuge in Him!\nYou who are His holy ones, fear Yahweh,\nfor those who fear Him lack nothing.\nYoung lions lack food and go hungry,\nbut those who seek the Lord\nwill not lack any good thing.\nCome, children, listen to me;\nI will teach you the fear of the Lord.\nWho is the man who delights in life,\nloving a long life to enjoy what is good?\nKeep your tongue from evil\nand your lips from deceitful speech.\nTurn away from evil and do what is good;\nseek peace and pursue it.\nThe eyes of the Lord are on the righteous,\nand His ears are open to their cry for help.\nThe face of the Lord is set\nagainst those who do what is evil,\nto erase all memory of them from the earth.\nThe righteous cry out, and the Lord hears,\nand delivers them from all their troubles.\nThe Lord is near the brokenhearted;\nHe saves those crushed in spirit.\nMany adversities come to the one who is righteous,\nbut the Lord delivers him from them all.\nHe protects all his bones;\nnot one of them is broken.\nEvil brings death to the wicked,\nand those who hate the righteous will be punished.\nThe Lord redeems the life of His servants,\nand all who take refuge in Him will not be punished.\nDig Deeper:\nThe Lord hears and delivers us! Psalm 34 is full of God’s gracious gifts to David and to us—like a treasure hunt of promises. Using the verse number clues below, make a list of how God cares for His children. \nGod’s gracious gifts to me!\nverse 4:  He answers me\nverse 4:  He delivers me\nverse 5:  _____________________\nverse 6:  _____________________\nverse 7:  _____________________\nverses 9-10:  __________________\nverse 15:  ____________________\nverse 18:  ____________________\nverse 20:  ____________________\nverse 22:  ____________________\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram3.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 40:1-17",
    "devo_title": "You Put a New Song in My Mouth",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 40:1-17\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 40\nThanksgiving and a Cry for Help\nFor the choir director. A Davidic psalm.\nI waited patiently for the Lord,\nand He turned to me and heard my cry for help.\nHe brought me up from a desolate pit,\nout of the muddy clay,\nand set my feet on a rock,\nmaking my steps secure.\nHe put a new song in my mouth,\na hymn of praise to our God.\nMany will see and fear\nand put their trust in the Lord.\nHow happy is the man\nwho has put his trust in the Lord\nand has not turned to the proud\nor to those who run after lies!\nLord my God, You have done many things—\nYour wonderful works and Your plans for us;\nnone can compare with You.\nIf I were to report and speak of them,\nthey are more than can be told.\nYou do not delight in sacrifice and offering;\nYou open my ears to listen.\nYou do not ask for a whole burnt offering or a sin offering.\nThen I said, “See, I have come;\nit is written about me in the volume of the scroll.\nI delight to do Your will, my God;\nYour instruction lives within me.”\nI proclaim righteousness in the great assembly;\nsee, I do not keep my mouth closed—\nas You know, Lord.\nI did not hide Your righteousness in my heart;\nI spoke about Your faithfulness and salvation;\nI did not conceal Your constant love and truth\nfrom the great assembly.\nLord, do not withhold Your compassion from me;\nYour constant love and truth will always guard me.\nFor troubles without number have surrounded me;\nmy sins have overtaken me; I am unable to see.\nThey are more than the hairs of my head,\nand my courage leaves me.\nLord, be pleased to deliver me;\nhurry to help me, Lord.\nLet those who seek to take my life\nbe disgraced and confounded.\nLet those who wish me harm\nbe driven back and humiliated.\nLet those who say to me, “Aha, aha!”\nbe horrified because of their shame.\nLet all who seek You rejoice and be glad in You;\nlet those who love Your salvation continually say,\n“The Lord is great!”\nI am afflicted and needy;\nthe Lord thinks of me.\nYou are my helper and my deliverer;\nmy God, do not delay.\nDig Deeper:\nThe Lord rescues us! He turns our cries for help into hymns of praise. Use the prompts below to reflect honestly on life’s dark valleys, giving thanks to God that He thinks of you.\n1. When have you been in a desolate pit?\n2. How did the Lord set your feet on a rock?\n3. Are you in a desolate pit right now?\n4. What has the Lord promised to do?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram4.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 66:1-20",
    "devo_title": "Your Works Are Awe-Inspiring",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 66:1-20\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 66\nPraise for God’s Mighty Acts\nFor the choir director. A song. A psalm.\nShout joyfully to God, all the earth!\nSing about the glory of His name;\nmake His praise glorious.\nSay to God, “How awe-inspiring are Your works!\nYour enemies will cringe before You\nbecause of Your great strength.\nAll the earth will worship You\nand sing praise to You.\nThey will sing praise to Your name.” Selah\nCome and see the wonders of God;\nHis acts for humanity are awe-inspiring.\nHe turned the sea into dry land,\nand they crossed the river on foot.\nThere we rejoiced in Him.\nHe rules forever by His might;\nHe keeps His eye on the nations.\nThe rebellious should not exalt themselves.Selah\nPraise our God, you peoples;\nlet the sound of His praise be heard.\nHe keeps us alive\nand does not allow our feet to slip.\nFor You, God, tested us;\nYou refined us as silver is refined.\nYou lured us into a trap;\nYou placed burdens on our backs.\nYou let men ride over our heads;\nwe went through fire and water,\nbut You brought us out to abundance.\nI will enter Your house with burnt offerings;\nI will pay You my vows\nthat my lips promised\nand my mouth spoke during my distress.\nI will offer You fattened sheep as burnt offerings,\nwith the fragrant smoke of rams;\nI will sacrifice oxen with goats. Selah\nCome and listen, all who fear God,\nand I will tell what He has done for me.\nI cried out to Him with my mouth,\nand praise was on my tongue.\nIf I had been aware of malice in my heart,\nthe Lord would not have listened.\nHowever, God has listened;\nHe has paid attention to the sound of my prayer.\nMay God be praised!\nHe has not turned away my prayer\nor turned His faithful love from me.\nDig Deeper:\nSing about the glory of our God! The author of Psalm 66 gives thanks to God by proclaiming His mighty deeds—even those which he calls tests from the Lord—and praising God for His awe-inspiring goodness and might. Let’s do the same today.  \nCome and listen, all who fear God,\nand I will tell what He has done for me!\n(make a list in your study journal and/or share in the comments)\n_________________________\n_________________________\n_________________________\n_________________________\n_________________________\n_________________________\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram5.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "1 Thessalonians 5:16-18",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nText: 1 Thessalonians 5:16-18\nRejoice always!\nPray constantly.\nGive thanks in everything,\nfor this is God’s will for you in Christ Jesus.\n-1 Thessalonians 5:16-18\nGratitude is not just an emotion. Rejoicing is not a passive pursuit. The Bible instructs us to declare God’s goodness in every circumstance! We are to pray, seek, and give thanks with an expectant, joyful heart. THIS is God’s will for us. \nHis love for you is steadfast, no matter the path you’re walking.\nHis promises hold fast, even when your world is crumbling.\nIn everything, He is good. In everything give thanks.\nGratitude List\nLet’s actively thank our good God today.\nI will give thanks in…\n\nthis joyful thing:\nthis suffering:\nthis certainty:\nthis stress:\nthis injustice:\nthis sorrow:\nthis plenty:\nthis want:\nthis wandering:\nthis waiting:\n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram6.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 118:1",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 118:1\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a reminder of our reason for thankfulness:\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\n-Psalm 118:1\n Write this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/4-Psalm-118-1.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 98:1-9",
    "devo_title": "You Have Made Your Victory Known",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 98:1-9\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\nPsalm 98\nPraise the King\nA psalm.\nSing a new song to the Lord,\nfor He has performed wonders;\nHis right hand and holy arm\nhave won Him victory.\nThe Lord has made His victory known;\nHe has revealed His righteousness\nin the sight of the nations.\nHe has remembered His love\nand faithfulness to the house of Israel;\nall the ends of the earth\nhave seen our God’s victory.\nShout to the Lord, all the earth;\nbe jubilant, shout for joy, and sing.\nSing to the Lord with the lyre,\nwith the lyre and melodious song.\nWith trumpets and the blast of the ram’s horn\nshout triumphantly\nin the presence of the Lord, our King.\nLet the sea and all that fills it,\nthe world and those who live in it, resound.\nLet the rivers clap their hands;\nlet the mountains shout together for joy\nbefore the Lord,\nfor He is coming to judge the earth.\nHe will judge the world righteously\nand the peoples fairly.\nDig Deeper:\nOur God is forevermore victorious! In Psalm 98, the Israelites declared that “all the ends of the earth have seen our God’s victory”—and they joined loudly in the chorus of praise. Let’s do the same as we work through the text below.\n1. Look at verses 1-3. Why were the Israelites singing a song to the Lord?\n2. Now look at verses 7-9. Why should we sing a song to the Lord?\n3. Why did the Israelites celebrate their victory with so much noise?\n4. How can we celebrate the Lord’s victory?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram8.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 103:1-22",
    "devo_title": "You Have Compassion on Your Children",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 103:1-22\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\n \nPsalm 103\nThe Forgiving God\nDavidic.\nMy soul, praise Yahweh,\nand all that is within me, praise His holy name.\nMy soul, praise the Lord,\nand do not forget all His benefits.\nHe forgives all your sin;\nHe heals all your diseases.\nHe redeems your life from the Pit;\nHe crowns you with faithful love and compassion.\nHe satisfies you with goodness;\nyour youth is renewed like the eagle.\nThe Lord executes acts of righteousness\nand justice for all the oppressed.\nHe revealed His ways to Moses,\nHis deeds to the people of Israel.\nThe Lord is compassionate and gracious,\nslow to anger and rich in faithful love.\nHe will not always accuse us\nor be angry forever.\nHe has not dealt with us as our sins deserve\nor repaid us according to our offenses.\nFor as high as the heavens are above the earth,\nso great is His faithful love\ntoward those who fear Him.\nAs far as the east is from the west,\nso far has He removed\nour transgressions from us.\nAs a father has compassion on his children,\nso the Lord has compassion on those who fear Him.\nFor He knows what we are made of,\nremembering that we are dust.\nAs for man, his days are like grass—\nhe blooms like a flower of the field;\nwhen the wind passes over it, it vanishes,\nand its place is no longer known.\nBut from eternity to eternity\nthe Lord’s faithful love is toward those who fear Him,\nand His righteousness toward the grandchildren\nof those who keep His covenant,\nwho remember to observe His precepts.\nThe Lord has established His throne in heaven,\nand His kingdom rules over all.\nPraise the Lord,\nall His angels of great strength,\nwho do His word,\nobedient to His command.\nPraise the Lord, all His armies,\nHis servants who do His will.\nPraise the Lord, all His works\nin all the places where He rules.\nMy soul, praise Yahweh!\nDig Deeper:\nMay we forget not the Lord’s benefits! The faithful love and compassion God showed to David is true for us too. Read verses 3-5 again, and record God’s goodness to you by writing specific mercies in the blanks below.\nHe forgives _________;\nHe heals ____________.\nHe redeems __________;\nHe crowns me with __________.\nHe satisfies me with __________.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram9.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 118:1-29",
    "devo_title": "You Are Steadfast",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 118:1-29\nn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 118\nThanksgiving for Victory\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\nLet Israel say,\n“His faithful love endures forever.”\nLet the house of Aaron say,\n“His faithful love endures forever.”\nLet those who fear the Lord say,\n“His faithful love endures forever.”\nI called to the Lord in distress;\nthe Lord answered me\nand put me in a spacious place.\nThe Lord is for me; I will not be afraid.\nWhat can man do to me?\nThe Lord is my helper,\nTherefore, I will look in triumph on those who hate me.\nIt is better to take refuge in the Lord\nthan to trust in man.\nIt is better to take refuge in the Lord\nthan to trust in nobles.\nAll the nations surrounded me;\nin the name of Yahweh I destroyed them.\nThey surrounded me, yes, they surrounded me;\nin the name of Yahweh I destroyed them.\nThey surrounded me like bees;\nthey were extinguished like a fire among thorns;\nin the name of Yahweh I destroyed them.\nYou pushed me hard to make me fall,\nbut the Lord helped me.\nThe Lord is my strength and my song;\nHe has become my salvation.\nThere are shouts of joy and victory\nin the tents of the righteous:\n“The Lord’s right hand performs valiantly!\nThe Lord’s right hand is raised.\nThe Lord’s right hand performs valiantly!”\nI will not die, but I will live\nand proclaim what the Lord has done.\nThe Lord disciplined me severely\nbut did not give me over to death.\nOpen the gates of righteousness for me;\nI will enter through them\nand give thanks to the Lord.\nThis is the gate of the Lord;\nthe righteous will enter through it.\nI will give thanks to You\nbecause You have answered me\nand have become my salvation.\nThe stone that the builders rejected\nhas become the cornerstone.\nThis came from the Lord;\nit is wonderful in our eyes.\nThis is the day the Lord has made;\nlet us rejoice and be glad in it.\nLord, save us!\nLord, please grant us success!\nHe who comes in the name\nof the Lord is blessed.\nFrom the house of the Lord we bless you.\nThe Lord is God and has given us light.\nBind the festival sacrifice with cords\nto the horns of the altar.\nYou are my God, and I will give You thanks.\nYou are my God; I will exalt You.\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\nDig Deeper:\nOur circumstances change, but God and His faithful love remain unchanged. Use the structure of verses 1-9 in David’s psalm to write a personal song of thanks to God. Contrast the unique details of your changing life with God’s unchanging truth.\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\nLet ____________ say,\n“His faithful love endures forever.”\nLet the house of ____________ say,\n“His faithful love endures forever.”\nLet those who fear the Lord say,\n“His faithful love endures forever.”\nI called to the Lord in________________;\nthe Lord answered me\nand ______________________________.\nThe Lord is for me; I will not be afraid.\nWhat can man do to me?\nThe Lord is my helper,\nTherefore, _________________________.\nIt is better to take refuge in the Lord\nthan to_____________________________.\nIt is better to take refuge in the Lord\nthan to ____________________________.\n(adapted from verses 1-9)\nThe details change. God remains the same.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram10.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 136:1-26",
    "devo_title": "Your Love Is Eternal",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 136:1-26\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 136\nGod’s Love Is Eternal\nGive thanks to the Lord, for He is good.\nHis love is eternal.\nGive thanks to the God of gods.\nHis love is eternal.\nGive thanks to the Lord of lords.\nHis love is eternal.\nHe alone does great wonders.\nHis love is eternal.\nHe made the heavens skillfully.\nHis love is eternal.\nHe spread the land on the waters.\nHis love is eternal.\nHe made the great lights:\nHis love is eternal.\nthe sun to rule by day,\nHis love is eternal.\nthe moon and stars to rule by night.\nHis love is eternal.\nHe struck the firstborn of the Egyptians.\nHis love is eternal.\nand brought Israel out from among them\nHis love is eternal.\nwith a strong hand and outstretched arm.\nHis love is eternal.\nHe divided the Red Sea\nHis love is eternal.\nand led Israel through,\nHis love is eternal.\nbut hurled Pharaoh and his army into the Red Sea.\nHis love is eternal.\nHe led His people in the wilderness.\nHis love is eternal.\nHe struck down great kings.\nHis love is eternal.\nand slaughtered famous kings—\nHis love is eternal.\nSihon king of the Amorites.\nHis love is eternal.\nand Og king of Bashan—\nHis love is eternal.\nand gave their land as an inheritance,\nHis love is eternal.\nan inheritance to Israel His servant.\nHis love is eternal.\nHe remembered us in our humiliation.\nHis love is eternal.\nand rescued us from our foes.\nHis love is eternal.\nHe gives food to every creature.\nHis love is eternal.\nGive thanks to the God of heaven!\nHis love is eternal.\nDig Deeper:\nHe alone does great wonders! Write your own “His love is eternal” psalm to God. List who God is and what He has done in your life. Make the details specific and personal. Let it be a song to Him.\nHe changes the seasons.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nGive thanks to the God of Heaven!\nHis love is eternal.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram11.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 139:1-24",
    "devo_title": "You Hem Me In",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 139:1-24\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 139\nThe All-Knowing, Ever-Present God\nFor the choir director. A Davidic psalm.\nLord, You have searched me and known me.\nYou know when I sit down and when I stand up;\nYou understand my thoughts from far away.\nYou observe my travels and my rest;\nYou are aware of all my ways.\nBefore a word is on my tongue,\nYou know all about it, Lord.\nYou have encircled me;\nYou have placed Your hand on me.\nThis extraordinary knowledge is beyond me.\nIt is lofty; I am unable to reach it.\nWhere can I go to escape Your Spirit?\nWhere can I flee from Your presence?\nIf I go up to heaven, You are there;\nif I make my bed in Sheol, You are there.\nIf I live at the eastern horizon\nor settle at the western limits,\neven there Your hand will lead me;\nYour right hand will hold on to me.\nIf I say, “Surely the darkness will hide me,\nand the light around me will be night”—\neven the darkness is not dark to You.\nThe night shines like the day;\ndarkness and light are alike to You.\nFor it was You who created my inward parts;\nYou knit me together in my mother’s womb.\nI will praise You\nbecause I have been remarkably and wonderfully made.\nYour works are wonderful,\nand I know this very well.\nMy bones were not hidden from You\nwhen I was made in secret,\nwhen I was formed in the depths of the earth.\nYour eyes saw me when I was formless;\nall my days were written in Your book and planned\nbefore a single one of them began.\nGod, how difficult Your thoughts are\nfor me to comprehend;\nhow vast their sum is!\nIf I counted them,\nthey would outnumber the grains of sand;\nwhen I wake up, I am still with You.\nGod, if only You would kill the wicked—\nyou bloodthirsty men, stay away from me—\nwho invoke You deceitfully.\nYour enemies swear by You falsely.\nLord, don’t I hate those who hate You,\nand detest those who rebel against You?\nI hate them with extreme hatred;\nI consider them my enemies.\nSearch me, God, and know my heart;\ntest me and know my concerns.\nSee if there is any offensive way in me;\nlead me in the everlasting way.\nDig Deeper:\nWhat a privilege to know the God who knows us! Use the questions below to meditate on Psalm 139, giving thanks for the Almighty God who knows His children through and through.\n1. How does God know us? (verses 1-6)\n2. How does God go with us? (verses 7-12)\n3. How does God create us? (verses 13-16)\n4. Does God’s knowledge of us require any action on our part? (verses 17-24)\n5. What does this teach me about the character of God?\n6. Notice how verse 23 parallels verse 1. Why does David ask God to do what he knows God has already done?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram12.jpg"
  },
  {
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Revelation 7:12",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nText: Revelation 7:12\nAs we wrap up this time of thanksgiving to the Lord by reflecting on Psalms of Gratitude from His Word, let’s spend today meditating on this powerful verse from the book of Revelation. \nMay our prayers of thanks to God bring Him blessing and glory and honor forever and ever. Amen. \nAmen! Blessing and glory and wisdom\nand thanksgiving and honor\nand power and strength\nbe to our God forever and ever. Amen.\n-Revelation 7:12\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram13.jpg"
  },
    {
        "book_title": "Hymns IV",
        "devo_passages": "Exodus 33:18-23, Isaiah 6:1-3, Isaiah 57:15, Revelation 4:6, Revelation 4:8",
        "devo_title": "Holy, Holy, Holy",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Exodus 33:18-23; Isaiah 6:1-3; Isaiah 57:15; Revelation 4:6, 8\nI’ve been singing this song since I wore my hair in pigtail braids. Maybe you remember singing it too. Did you notice how we say the word “holy” so many times? If I were editing this song for content, I would mark out a big chunk of holies with the note “redundant!” in the margin.\nBut is it redundant to call God holy three times? Is it just flowery and poetic, or is there real theological reason for this repetition? \nPoetry was in Reginald Heber’s blood. When he attended Oxford, his fellows threw him up on their shoulders and celebrated his earnest attempts at writing poems. They weren’t great poems, but that early recognition was enough to spur young Reg to a lifetime pursuit of verse.\nLike most rich young men in the early 1800s, Reginald was poised to take a Grand European Tour after graduation. However, Napoleon had disrupted normal business, and instead of sunning himself in the south of France, Reginald found himself traveling by sledge to Moscow in the middle of January.\nOne might assume that, after that chilling experience, Reginald would be content to warm his feet by an English fire for the rest of his days. Instead, this experience opened up the world for him.\nYears later, working in India as the Bishop of Calcutta, he continued to write poetry—both bad verses and beautiful ones. And somewhere between the foothills of the Himalayas and Bombay, he sat down to write his now famous hymn, “Holy, Holy, Holy.”\nJust like a winter vacation in Russia, some things seem destined to disappoint. But Heber learned that God is not like men; He does not fail. God is not just a little holy. He is superlatively holy: the most holy.\nBecause of our own unholy nature, it’s difficult for us to conceive of just how holy and other is our good God. We see everything through the lens of our human experience, and it’s difficult not to let our sight be marred and limited by our own impurity and sin. Many cultures impose human weakness on their gods (remember the petty and impatient Greek gods?), but our God is not made in our image. He is holy and set apart.\n“Holy, holy, holy” not only points us to God’s holiness, but also to the Trinity. The Trinity is unique to the Christian faith. Both God’s Holiness and His Trinitarian nature are foreign to us—but also absolutely vital. The unblemished majesty of God, in His Trinitarian perfection, sets Him apart from all of creation.\nTo understand God as He is, perfect in power, love and purity, will necessarily change how we see our world—disappointments, plans, and joys. God calls us to fix our eyes on Him and to see the beauty of His holiness, in the light of which the things of this earth grow dim.\nGod is both One and Many, Unity and Diversity. Let’s join all His works and praise His name, on earth, and sky, and sea.\n\nHoly, Holy, Holy\nReginald Heber, 1826\nHoly, holy, holy! Lord God Almighty!\nEarly in the morning our song shall rise to Thee;\nHoly, holy, holy, merciful and mighty!\nGod in three Persons, blessèd Trinity! \nHoly, holy, holy! All the saints adore Thee,\nCasting down their golden crowns around the glassy sea;\nCherubim and seraphim falling down before Thee,\nWho was, and is, and evermore shall be. \nHoly, holy, holy! though the darkness hide Thee,\nThough the eye of sinful man Thy glory may not see;\nOnly Thou art holy; there is none beside Thee,\nPerfect in power, in love, and purity. \nHoly, holy, holy! Lord God Almighty!\nAll Thy works shall praise Thy Name, in earth, and sky, and sea;\nHoly, holy, holy; merciful and mighty!\nGod in three Persons, blessèd Trinity!\n\n* Source: The English Hymn: A Critical and Historical Study, by J. R. Watson.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-Hymns4-instagram1.jpg"
    },
    {
        "book_title": "Hymns IV",
        "devo_passages": "Isaiah 6:8, Philippians 1:20-21, Romans 12:1",
        "devo_title": "Take My Life and Let It Be",
        "devo_summary": "\nBY Annie Downs\n\nText: Isaiah 6:8, Philippians 1:20-21, Romans 12:1\nI was in third grade. For our church’s play, I was dressed as a blue hymnal named Psalty the Singing Songbook. And I had a solo.\nTake my life and let it be,\nconsecrated Lord to Thee.\nIt was my role to sing this entire song in front of our church, alone. So I practiced those lyrics, making sure I knew each couplet well. I could just see myself mixing up some of the lines and accidentally singing, “take my feet and let them move… let them flow in endless praise.” Which would be wrong. And sound weird.\nSo I worked hard after school each day to get every single word right. I sang upstairs in my bedroom and outside on my bicycle and waiting at the bus stop. Over and over. Every stanza.\nEven today, 25 years later, I can still hear myself singing it. I’m not the best singer in the world (I wouldn’t dare sing a solo now), but I belted out those words with confidence when I was a kid.\nI believed them then, the words to this old hymn. I can’t explain it any better than that, but I knew as I was singing that those words were true. Sometimes I think my childhood sang truer than the song my life sings today—less mess and fewer mangled-heart moments in the Annie vault, I guess. My little self meant every single word. I wanted my life to be His. \nI had no idea the power of the words I was singing. It didn’t register with my nine-year-old brain that I was proclaiming truth over my life, but I was. I didn’t know what it meant or what it would cost or how it would play out—none of us do, really—but I knew it was what I wanted.\nTake my voice and let me sing,\nAlways, only for my King.\nTake my lips and let them be\nFilled with messages from Thee.\nI believe these words today, just as I did when dressed up like a hymnal in 1989. It’s just that these days I have a little more baggage and a lot more grace. I’m also more assured that this is the path for me. This song, in particular, covers every part of my life: where I walk, what I say, the money I make, and the life I lead. It is all His.\nSomehow, as she wrote this hymn in the mid-1800s, Frances Ridley Havergal felt the same push in her soul that I still feel today—to say to God that all I have and all I am is for Him and His glory. There is no category of my life I want to withhold from Him.\nPeople in the Bible—folks who were just like us, not knowing where their lives were going or how their stories would end—said similar things. In Isaiah chapter six, we see Isaiah telling God that he was willing to go wherever God would send him (Isaiah 6:8). In the opening chapter of Philippians, Paul writes that, no matter his situation, he wants his life to glorify Christ, whether in life or in death (Philippians 1:20-21).\nSo, that is what we sing. And that may be why we sing. Maybe those lyrics say it braver and better than I ever could on my own. The innocence of my childhood voice may have gotten me here today, but it’s the conviction of my voice as an adult that keeps me here, by His grace—offering all I am, and ever will be, to Him.\nTake myself and I will be\nEver.\nOnly.\nAll for Thee.\nTake My Life and Let It Be\nFrances R. Havergal, 1874\nTake my life and let it be\nConsecrated, Lord, to Thee.\nTake my moments and my days,\nLet them flow in endless praise.\nTake my hands and let them move\nAt the impulse of Thy love.\nTake my feet and let them be\nSwift and beautiful for Thee.\nTake my voice and let me sing,\nAlways, only for my King.\nTake my lips and let them be\nFilled with messages from Thee.\n\nTake my silver and my gold,\nNot a mite would I withhold.\nTake my intellect and use\nEvery pow’r as Thou shalt choose.\n\nTake my will and make it Thine,\nIt shall be no longer mine.\nTake my heart, it is Thine own,\nIt shall be Thy royal throne.\n\nTake my love, my Lord, I pour\nAt Thy feet its treasure store.\nTake myself and I will be\nEver, only, all for Thee.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-Hymns4-instagram2.jpg"
    },
    {
        "book_title": "Hymns IV",
        "devo_passages": "Psalm 46:10, Psalm 37:3-9, Psalm 62:5-8, Psalm 107:28-35",
        "devo_title": "Be Still, My Soul",
        "devo_summary": "\nBY Guest Writer\n\nBe still before the LORD and wait patiently for him.\n-Psalm 37:7\nBe still, and know that I am God.\nI will be exalted among the nations,\nI will be exalted in the earth!\n-Psalm 46:10\nBe still my soul, be still. Ka­tha­ri­na A. von Schle­gel, the writer of this hymn, gives us many gifts in these words I carry around with me. Last week, I visited a chapel in New Jersey, a building about as old as these lyrics. I wandered into the dim, resonant space on that bright, autumn afternoon. The pews were empty but for a few folks milling about on the outside aisles. As I found my way to a well-worn bench toward the middle, I began to trace the storylines of the painted glass in the arched ceilings above my head.\nI marveled at the commitment of architectural design, artistic gifts, the time and resources it must have taken to create a place like this. Such beauty ushered me into stillness and conversation with God. An organist played hymns intermittently on the organ pipes, and each time he finished one, the room imploded into stunning silence. No applause. No cheers. No audible response necessary.\nLife is noisy. A hymn like “Be Still My Soul” gives me assurance that in the noise of life, my soul is held secure in the silence—silence that goes before and behind me. In the noise of my emotions or in daily work rhythms, the silence between the happenings is a constant. The silence helps me find my place in the world, to see who I am, and it makes space for my soul to listen to God. Even in the most joyful tones of life, as in music, the space between the notes is just as important as the notes themselves.\nHebrew scholar Ellen Davis translates the first verse of Psalm 65 in this way:\n“To you, O God, silence is praise.” \nSilence is praise? You mean I don’t have to say or prove anything? I can just be here, be who I am, where I am, and let the silence envelop me?\nLike Job’s declaration of God’s goodness in spite of his personal losses (Job 1:21), Katharina echoes:\n“Be still, my soul, your Jesus can repay,\nfrom his own fullness, all he takes away.”\nThese are challenging and comforting words, strung disruptively close together. The challenging part is the reminder that we are not the ones in control. If space is a kind of loss, the comfort of the stanza is this: like music notes on a page, we ought to submit ourselves to receive both the notes themselves (like joy) and the space between the notes (like loss) before God.  \nHe, in His fullness, is the Great Composer of our souls, moving us in and out of seasons, giving and taking away. Using both space and melody, He composes our lives into a symphony far more dynamic and beautiful than we ever could have written for ourselves.\nAdmittedly, we can’t always hear the music that is being written in us. Sometimes, the people around us can hear the song more easily than we can. It’s then that we need our friends to sing it for us and sing it to us.\nIn a hymn such as “Be Still My Soul,” in both space and melody, we are instructed in the practice of silence and the symphony of grace. We are encouraged to “be still before the Lord and wait patiently for Him” (Psalm 37:7). And we are invited to “begin the song of praise.”\n____\nSandra McCracken is a singer, songwriter and producer from Nashville, TN. Over the course of nine critically acclaimed studio albums, Sandra has developed a body of work that encompasses hook-driven melodic pop, No Depression-style Americana, contemporary recastings of classic hymns, and even children’s music as part of the Nashville alt-folk super-group Rain For Roots. Her new album, Psalms, was released this spring.\nBe Still My Soul\nwords by Ka­tha­ri­na A. von Schle­gel, 1752\ntrans by Jane L. Borth­wick, 1855\nBe still, my soul: the Lord is on thy side.\nBear patiently the cross of grief or pain.\nLeave to thy God to order and provide;\nIn every change, He faithful will remain.\nBe still, my soul: thy best, thy heavenly Friend\nThrough thorny ways leads to a joyful end.\nBe still, my soul: thy God doth undertake\nTo guide the future, as He has the past.\nThy hope, thy confidence let nothing shake;\nAll now mysterious shall be bright at last.\nBe still, my soul: the waves and winds still know\nHis voice Who ruled them while He dwelt below.\nBe still, my soul: when dearest friends depart,\nAnd all is darkened in the vale of tears,\nThen shalt thou better know His love, His heart,\nWho comes to soothe thy sorrow and thy fears.\nBe still, my soul: thy Jesus can repay\nFrom His own fullness all He takes away.\nBe still, my soul: the hour is hastening on\nWhen we shall be forever with the Lord.\nWhen disappointment, grief and fear are gone,\nSorrow forgot, love’s purest joys restored.\nBe still, my soul: when change and tears are past\nAll safe and blessèd we shall meet at last.\nBe still, my soul: begin the song of praise\nOn earth, believing, to Thy Lord on high;\nAcknowledge Him in all thy words and ways,\nSo shall He view thee with a well pleased eye.\nBe still, my soul: the Sun of life divine\nThrough passing clouds shall but more brightly shine.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-Hymns4-instagram3.jpg"
    },
    {
        "book_title": "Hymns IV",
        "devo_passages": "Psalm 86:15, Matthew 20:16, Isaiah 53:5-6, Ephesians 3:14-19",
        "devo_title": "There’s a Wideness in God’s Mercy",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Psalm 86:15; Matthew 20:16; Isaiah 53:5-6; Ephesians 3:14-19\nI once claimed a Dixie Chicks’ song as my “anthem.” If you haven’t heard of this pop-country group from the 90’s, you’re likely more qualified to write about hymns than yours truly.\nBut since you’re stuck with me today, I get to tell you just exactly why a beloved hymn of the Church reminds me of “Wide Open Spaces”— my teenage theme song, go-to karaoke choice, and lyrical inspiration for more than one boyfriend break-up.\nThe chorus goes like this:\nShe needs wide open spaces\nRoom to make her big mistakes\nShe needs new faces\nShe knows the high stakes\nThe truth is, I’d be hard-pressed to find another song with the same stride as my own steps. My sneakers practically lace themselves at the sound of wide open spaces, brand new faces, and room for big mistakes. Without question, I’d leave for a getaway to spacious ground with strangers who tip their hats in silence, leaving my story unchartered. I will always choose flight over fight, passport stamps over picket fences, and a fresh start over familiarity.\nIn the height of my Dixie Chicks days, I was afraid of what it might mean to slow down and stay. Suitcase in hand, I believed whatever I was facing was too big for the space I’d been given. My pride was too tall, my fear too deep, my anger too heavy, my grief too cumbersome, my questions too complicated. I hoped that free-falling into my next spontaneous choice would reverse the gravity of my own reality. And it did, but only because I bumped into the territory of Christ. \nAt that time in my life, God was the vaguely-loving being I sang songs about at summer camp. If He were to find me running away, I was sure He’d reprimand me and tell me to go home. But that’s not what He did at all. He was there, extending His mercy into the wide open and filling the spaces with His love. David knew the feeling: \nWhere shall I go from your Spirit? Or where shall I flee from your presence? If I ascend to heaven, you are there! If I make my bed in Sheol, you are there!\n-Psalm 139:7-9\nIn fact, there was more space than before: space for God’s grace, space to be found, space to be known, space to be welcomed, space to be home. Christ Himself was the spacious refuge I’d been looking for all along. \nHad I been born a century sooner, I’m convinced I would have been best friends with Lizzie S. Tourjee in high school. Lizzie, lacking the companionship of the Dixie Chicks, wrote the tune to the hymn “There’s A Wideness in God’s Mercy” for her school’s graduation ceremony. The lyrics for the hymn were taken from a poem written by Frederick W. Faber in 1854, titled “Come to Jesus.”\nThe thirteen-verse poem begins with words for a weary traveler: \nSouls of men, why will ye scatter\nlike a crowd of frightened sheep?\nFoolish hearts, why will ye wander\nfrom a love so true and deep?\nBeing rooted and established in Christ’s love fills us with all the fullness of God (Ephesians 3:17-19), extinguishing our need to run. Christ’s own arms, spread open on the cross, placed us within infinite mercy. Friends, there is room for us! \nFather, as we continue trusting You, may the size of Your mercy continue to surprise us. Keep us in the fullness Your love and presence. Amen. \n“He brought me out to a spacious place; He rescued me because He delighted in me.”\n-Psalm 18:19\nThere’s a Wideness in God’s Mercy\nby Fred­er­ick W. Fa­ber, 1854\nThere’s a wideness in God’s mercy,\nLike the wideness of the sea;\nThere’s a kindness in His justice,\nWhich is more than liberty.\nThere is welcome for the sinner,\nAnd more graces for the good;\nThere is mercy with the Savior;\nThere is healing in His blood.\nThere is no place where earth’s sorrows\nAre more felt than up in Heaven;\nThere is no place where earth’s failings\nHave such kindly judgment given.\nThere is plentiful redemption\nIn the blood that has been shed;\nThere is joy for all the members\nIn the sorrows of the Head.\nFor the love of God is broader\nThan the measure of our mind;\nAnd the heart of the Eternal\nIs most wonderfully kind.\nIf our love were but more simple,\nWe should take Him at His word;\nAnd our lives would be all sunshine\nIn the sweetness of our Lord.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-Hymns4-instagram4.jpg"
    },
    {
        "book_title": "Hymns IV",
        "devo_passages": "Hosea 6:3, Lamentations 3:22-24",
        "devo_title": "As Sure As The Sun",
        "devo_summary": "\nBY Ellie Holcomb\n\nText: Hosea 6:3, Lamentations 3:22-24\n“Let us acknowledge the Lord; let us press on to acknowledge him. As surely as the sun rises, he will appear; he will come to us like the winter rains, like the spring rains that water the earth.”\n-Hosea 6:3\nTruth be told, I am a worrier in progress.\nI know I’m not supposed to worry. I know God calls us to trust Him and tells us He will carry our burdens (Matthew 11:28). But if I’m honest, a lot of days it feels easier to worry than to trust.\nI guess worrying gives me the illusion of control. I’ll lay in bed at night mulling questions or scenarios over in my mind: What if…? How will I ever…? What if I never…? And if I don’t have something to worry about today, I’ll often borrow worry from tomorrow. It’s a problem God is continually addressing in my life.\nBut there is one thing I never fall asleep at night worrying about, and that’s whether or not the sun’s going to come up in the morning. It’s a sure bet. And God promises that with each morning sunrise, He offers mercies anew and love unfailing (Lamentations 3:22-23). That, too, is a sure thing, yet I doubt it all the time.\nI am so grateful that God wrote His promises in the sky. He knew we would forget His love and His mercy and His faithfulness. So every morning, He instructs the sun to sing out a chorus of undeserved and unending love, a song of mercies anew.\nI love God’s promise in Hosea is that “He will appear” (Hosea 6:3). He doesn’t promise a problem-free life, or a life without suffering. He doesn’t say, “As surely as the sun rises, life will be easy and you will never struggle.” I’m so glad that’s not the promise He gives us because it wouldn’t ring true.\nWe all know this life doesn’t come without struggle and disappointment and hurt (John 16:33). We’ve all got unanswered questions and unspoken fears. The beauty of these verses to me is that God promises His presence. He promises that no matter what we are walking through, He will show up and He will be there with us.\nWhat are you worried about today, sisters? I’m praying that as we lift our eyes to the sky, we’d see evidence of God’s promised presence in our lives. Even on the days we can’t feel His presence, may we always know He’s there… as surely as the sun that rises each morning.\nAs Sure As The Sun\nby Ellie Holcomb\nThere is good news\nThere is good truth\nThat you could never change\nNo matter what you do\nYou are loved\nMore than you know\nMore than you could hope for\nAfter everything you’ve done\nAs sure as the sun will rise\nAnd takes away the night\nHis mercy will not end\nHis mercy will not end\nThere is good news\nThere’s a promise\nThat no matter where you go\nYou will never be alone\nIn the dark\nIn the doubting\nWhen you can’t feel anything\nOh, his love remains the same\nAs sure as the sun will rise\nAnd takes away the night\nHis mercy will not end\nHis mercy will not end\nEven through the night\nSilver stars will shine\nHope of glory’s light\nThat will wake us once again\nAs sure as the sun will rise\nAnd takes away the night\nAs sure as the sun will rise\nHis mercy will not end\nHis mercy will not end\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-Hymns4-instagram5.jpg"
    },

{
    "book_title": "Hymns III",
    "devo_passages": "Romans 5:20-21, Luke 15:1-10, Ephesians 2:4-9, John 9:25",
    "devo_title": "Amazing Grace",
    "devo_summary": "\nBY Ellie Holcomb\n\nAmazing grace! how sweet the sound\nthat saved a wretch like me.\nI’m running on about two hours of sleep today.\nI’m almost seven months pregnant, and I’ve been away from home for the past five days working. I’m doing work that I love, but today I miss my little girl. I miss my husband. I miss my community. I missed Mother’s Day and my little sister’s birthday. And now—because of a flight delay—I’m even missing out on the morning I was supposed to get to celebrate my sister before we pick up my daughter at school. On top of it all, I’m writing this in the back row of an airplane that does not recline, next to a man who does not seem to notice or care that I am pregnant because he’s taking up about half of my seat with his elbow room. For some reason, his lack of concern that I have any space at all, even though I am technically two people right now, is what has sent me over the edge.\nThe tears are flowing—which is fine, since said man next to me is paying no attention at all. I am maxed out. Spent. Exhausted. I can feel the discontent rising up in my heart. It sounds like inaudible curse words that I want to spit in anger towards this man next to me hogging the armrest.\nI know part of this is due to lack of sleep, but I also know that deep down, it is a heart issue for me. I have gone too hard for too long, and once again, I have tried to do too much of this life in my own strength. Yet here is the Lord in His kindness, reminding me to write about His amazing grace. I am cursing in my heart at a stranger, and God is calling me deeper into His grace—to receive it for myself, and to repent and offer it to those around me, even the armrest bullies. He is calling me to believe the truth of Romans 5:20: where sin abounds, grace abounds even more.\nI am ashamed of my gut reaction to my circumstances and grieved by my lack of gratitude, my fierce desire for independence, and my pride. But God loves me enough to meet me in my heart’s sickness (Jer 17:9). He leads me to write about His grace today that I might experience it again-—with eyes refreshed and sight regained (Jn 9:25). Amazing.\nSo what does grace sound like?\nFrom where I sit in the back of this airplane, it sounds like the gentle voice of the Holy Spirit asking me to let go of my anger, admit my weakness, and allow Him to replace my deficit with the surplus of His love. It sounds like God seeking me with His truth when I am lost in my sin (Luke 15). It sounds like God beckoning me to write about this strong, old hymn-—even when I’m feeling more wretched than redeemed—so I can experience, once again, the beauty and power and relief of His grace washing over me.\nTwas grace that taught my heart to fear,\nand grace my fears relieved.\nIt is because of God’s grace that I am able to see my weakness, my pride, and my not-enough. It is His grace that is more than enough to meet and cover me in all my broken, messy places (2 Cor 12:9). And it is His grace that brings me rest, as He tenderly instructs my heart to worship Him alone (Ps 86:11).\nDear sisters, there is unmerited, undeserved, and unbridled grace for us today and every day. It sounds like an invitation to rest in Jesus. It sounds like this beautiful, old song—a song we get to sing today, tomorrow and forever! And that truly is amazing.\nFather, would You continue to show me the offensive ways in my heart, that I may see my deep need of Your grace and know more deeply Your great sufficiency to meet my every need. Amen.\n____\nAmazing Grace\nJohn Newton, 1779\nAmazing grace! how sweet the sound,\nThat saved a wretch like me!\nI once was lost, but now am found,\nWas blind, but now I see.\n’Twas grace that taught my heart to fear,\nAnd grace my fears relieved;\nHow precious did that grace appear\nThe hour I first believed!\nThe Lord has promised good to me,\nHis word my hope secures;\nHe will my shield and portion be\nAs long as life endures.\nThrough many dangers, toils, and snares\nI have already come;\n‘Tis grace hath brought me safe thus far,\nAnd grace will lead me home.\nWhen we’ve been there ten thousand years,\nBright shining as the sun,\nWe’ve no less days to sing God’s praise\nThan when we first begun.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-HymnsIII_instagram1.jpg"
},
{
    "book_title": "Hymns III",
    "devo_passages": "Lamentations 3:22-24, James 1:17, Psalm 19:1-6, Psalm 36:5-10, Psalm 104:19",
    "devo_title": "Great Is Thy Faithfulness",
    "devo_summary": "\nBY Guest Writer\n\nThou changest not; thy compassions, they fail not.\nAs thou hast been thou forever wilt be.\nI was a little intimidated to record a new version of “Great Is Thy Faithfulness” for this new She Reads Truth project, but I was also drawn to it for the same reason—because it felt like a challenge. Sometimes a song feels too big to reduce into a few chords.\nAs I started to work with this iconic hymn, I tried to zoom in on a particular memory to help me connect with the lyrics more deeply than surface sentimentality. I remembered how we sang that hymn in a close family friend’s wedding more than 20 years ago. I remembered my pink, handmade dress, the french braid in my hair and those uncomfortable dress flats. But as I traced the memory further, I remembered how that tumultuous marriage was, more or less, a long, slow trainwreck, and so I tried to push down that memory and think of another one instead. But the memory followed me around for a few days, and I realized maybe it was exactly this memory I needed to explore. \nIf I were sitting across the table from God having a conversation today, I would ask Him questions about His faithfulness and what it means in the loose ends of life—in the unresolved and ongoing bits. What is God’s role in the vow-keeping process between broken people trying to work things out? In our tender moments before bedtime, my sweet kids frequently bring up rather impossible-to-answer questions about life’s loose ends. They are so honest and direct, unfiltered and earnest in their asking. It makes me wonder how God might feel when we really stop to talk with Him.\nWhen I make space to ask God my own honest questions, I have found that, just like with my kids, talking about it together serves to deepen the intimacy between us. As we see in the Psalms, there is often more significance in the questions than the answers. The questions invite us closer to each other. When I finally get quiet, I find God is not afraid of honesty. He welcomes me. His love pushes out my fear. It’s gonna be ok. I’m here. I’ve got you. He presses in with His clarifying invitation: “Come to me, all you who are weary and heavy hearted” (Mt 11:28).\nLike a flashlight in a dark room, God’s faithfulness is the illumination that comes in and brings a mysterious relief when I am brave enough to say my fears out loud. We are not in control of the universe. We have limitations. But the limitations are part of who we are and they remind us with discomfort and distress signals—like little alarms going off in our lives—that we need a Savior. They remind us that we need human community, too. I need sisters to sit with me in these hard questions, and we need space to be together in the silence that comes after the question mark.\nWhen everything around and within us turns, “There is no shadow of turning with thee.” We try to make sense and find meaning in the patterns. Cycles and seasons pull us back and forth. We are tossed, habitually, by life’s waves and and occasionally realigned. People come and go in our lives. “Summer and winter and springtime and harvest.” We cannot yet see the whole picture. But God pursues us in our seeking, earnest to meet us in our sorrow and poised to celebrate with us in our joy.\nGod is the only constant. He is the unchanging centerpiece, holding all things together.  He holds our life circumstances. He is holding the chaos of this world. He is holding our hearts—holding us. In all things, He works for our good and for His glory. But this truth is progressively revealed, even as it is sure. Truth comes to us, but not all at once. The answers sometimes move painfully and articulate slowly.\nSinging the faith declarations in “Great Is Thy Faithfulness” with honesty is delicate work. I think you can almost hear the evidence of fragility and vulnerability in the sound of the recording. But there is strength there, too. I could recount to you a thousand mercies of God in my life. And many of God’s richest mercies have come in the hardest times. “He is close to the brokenhearted,” says the Psalmist (Ps 34:18). I am convinced ABOVE ALL THINGS that God’s faithfulness abides when all else fails. “Strength for today and bright hope for tomorrow.” How can this be?\nI look back and I see in my story, start to finish, that God has been so good to me. He comes to meet us, like Jesus at the tomb of Lazarus, calling Mary outside and weeping when He sees her face. He is ready to meet us with the sorrowful embrace of a friend. He is ready to meet us in the boat, waking from sleep in the middle of a chaotic storm, saying, “Peace!” (Mk 4:39). And He is ready to meet us in the heat of the battle, saying, “I will fight for you, you need only to be still” (Ex 14:14).\nGod is great. God is faithful. And His love is set upon us.\nWe come as we are, with trembling trust.\nPlease help us, Father. Bring your steadfast love to bear in our lives. Bring your comforting Spirit to guide us, and your mercy to support us. All we have needed your hand has provided. Help us to walk forward in this truth, morning by morning, and through every changing scene. Amen.\n____\nSandra McCracken is a singer, songwriter and producer from Nashville, TN. Over the course of nine critically acclaimed studio albums, Sandra has developed a body of work that encompasses hook-driven melodic pop, No Depression-style Americana, contemporary recastings of classic hymns, and even children’s music as part of the Nashville alt-folk super-group Rain For Roots. Her new album, Psalms, was released this spring.\nGreat Is Thy Faithfulness\nThomas O. Chisholm, 1923 \nGreat is thy faithfulness, O God my Father;\nthere is no shadow of turning with thee;\nthou changest not; thy compassions, they fail not.\nas thou hast been thou forever wilt be. \nRefrain\nGreat is thy faithfulness!\nGreat is thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed thy hand hath provided.\nGreat is thy faithfulness, Lord unto me! \nSummer and winter and springtime and harvest,\nsun, moon, and stars in their courses above\njoin with all nature in manifold witness\nto thy great faithfulness, mercy, and love. \nRefrain\nPardon for sin and a peace that endureth,\nthine own dear presence to cheer and to guide,\nstrength for today and bright hope for tomorrow  –\nblessings all mine, with ten thousand beside! \nRefrain\n \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-HymnsIII_instagram2.jpg"
},
{
    "book_title": "Hymns III",
    "devo_passages": "Jeremiah 9:23-24, Matthew 6:21, Romans 8:14-17, 2 Corinthians 3:16-18, 2 Corinthians 4:16-18",
    "devo_title": "Be Thou My Vision",
    "devo_summary": "\nBY Guest Writer\n\n\nBe Thou my Vision, O Lord of my heart;\nNaught be all else to me, save that Thou art.\nThis morning I set out to ride my bike in the pouring rain. I’m training for my mid-life crisis triathlon. It’s a mini-triathlon, really; 400 meter swim, 14 mile bike ride, and 3 mile run. Nevertheless, it exhausts me to type that much physical activity, much less train for it. I figured if I’m heading over the hill this year, I might as well try to swim, bike and run over it.\nThe rain was cold and exhilarating this morning, waking me with each drop. There was a sweet smell of honeysuckle in the air, hinting towards eternity, and a small waterfall was forming off the front of my bike helmet making it hard for me to see. It reminded me of when my eye doctor prescribed my coke bottle-sized glasses when I was in the 3rd grade. I was nearsighted—like today, I could only see the road near me. Everything off in the distance was just a blur.\nThere’s something about training for a race that makes you think in terms of distance, focusing on the end goal. You begin to calculate the miles, getting so caught up in your vision of the finish line that you miss the beauty around you on the journey.\nDuring my rainy bike ride it dawned on me: too often I think of God in the distance, like a far-off God in the sky, listening to my lowly prayers from high above. Imagining Him this way causes me to create false rules in an effort to get His attention—if I get on my knees will He incline His ear to hear me? if I’m good enough, will He draw closer to me?—all the while forgetting that He promised to be near from the moment I gave my life to Him. In John 14:23, Jesus says, “My father will love him and we will come and make our home in him.” He says of His Spirit a few verses earlier, “But you know Him, for He lives with you and will be in you” (Jn 14:17).\nSo, the Holy Spirit is ALREADY in me when I pray? It is gospel truth, and it’s no less true just because it’s sometimes hard for us to believe.\nOur God is always near to us, even when our vision is unclear. I could feel the Lord nudging me awake to His closeness as I rode my bike through the park. He was leading me to green pastures and open spaces. He was wooing me with cool raindrops falling upon my skin, with the rhythmic sounds of water and my own breathing. My Savior was beckoning me with a green, glowing landscape and the sweet smell of honeysuckle, and the combination resonated deep within me. The smells and sounds and scenery were intimate, just like Jesus—His very name, Emmanuel, meaning “God with us.”\nAs this truth sunk in and I began to see God as near, because He always is, I began to smile and sing. Yes, I sang out loud, and yes, some more serious cyclists dressed in better attire than me heard, but I kept singing nonetheless: Be Thou my vision, O Lord of my HEART.\nFriends, it begins here, with the heart—the intimate place, the wellspring, the place we store up treasure. It is here in our hearts that we see God with the nearsighted vision that is a gift of the Holy Spirit, and it’s here that I began to sing that hymn differently. I sang it to my heart instead of to the sky, as I pedaled onward in the rain.\n____\nMandy Mann lives with her hubby, Kevin, and their two boys in Nashville, Tennessee. A lover of Jesus, Mandy’s favorite things are the ones that beckon her closer to Him—Scripture, singing and songwriting, photography, the great outdoors, and drawing laughter out of those she loves. Overseas, you might hear Mandy’s songs played on various commercials. Stateside, she is working on new music and enjoying her time as a stay-at-home mama.  \nBe Thou My Vision\nattributed to Dal­lan For­gaill, 8th cent.\ntranslated by Mary E. Bryne, 1905\nBe Thou my Vision, O Lord of my heart;\nNaught be all else to me, save that Thou art;\nThou my best Thought, by day or by night,\nWaking or sleeping, Thy presence my light.\nBe Thou my Wisdom, and Thou my true Word;\nI ever with Thee and Thou with me, Lord;\nThou my great Father, I Thy true son;\nThou in me dwelling, and I with Thee one.\nBe Thou my battle Shield, Sword for the fight;\nBe Thou my Dignity, Thou my Delight;\nThou my soul’s Shelter, Thou my high Tow’r:\nRaise Thou me heav’nward, O Pow’r of my pow’r.\nRiches I heed not, nor man’s empty praise,\nThou mine Inheritance, now and always:\nThou and Thou only, first in my heart,\nHigh King of Heaven, my Treasure Thou art.\nHigh King of Heaven, my victory won,\nMay I reach Heaven’s joys, O bright Heav’n’s Sun!\nHeart of my own heart, whate’er befall,\nStill be my Vision, O Ruler of all.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-HymnsIII_instagram3.jpg"
},
{
    "book_title": "Hymns III",
    "devo_passages": "Revelation 5:6-14, Hebrews 12:1-2, Philippians 2:11, 1 Peter 2:24, 1 John 3:1, John 15:13, John 3:16",
    "devo_title": "What Wondrous Love Is This",
    "devo_summary": "\nBY Kaitlin Wernet\n\n\nWhat wondrous love is this, O my soul, O my soul!\nWhat wondrous love is this, O my soul!\nOther than genes, I share a few distinct commonalities with my grandmother.\nWe both ditched our overly-Southern double names (so long, Mary Kaitlin and Mary Helen!), we were both born with a head full of chocolate-colored ringlets, and we both have a profound love for sour candy and sno cones, especially eaten together.\nI also owe my band geek pride and hymn-induced teary eyes to my grandmother, who, because she’d want you all to feel like close friends, I’ll refer to by her nickname, Polly.\nMy childhood summers spent in her humid Florida town were marked by fishing trips and blueberry picking, vegetable chopping and frizzy hair. At the end of the day, Polly was the only one brave enough to delicately comb through my thick, tangled locks, patiently unraveling knots and twists along the way. While most hairdressers would become overwhelmed with my violent tresses and send me home with wet hair, my grandmother would methodically see the process through until my mane was just so. Even when I reached for the scissors to quickly detach an unruly gnarl, she’d tell me to put them down, assuring that the cleansing process had worked before and this time would be no exception.\nI think Polly probably learned this lesson from her days as an elementary school music teacher. She would clink the keys of a worn piano, calmly teaching her students the technique of adjusting pitch and style. At the end of the class she would sit back and listen to a chorus of young voices singing her favorite hymn, washing her soul once more.\nI’m sure Polly introduced her students to “What Wondrous Love Is This.” If we were in her class today, she’d probably relish the opportunity to teach us about the history of the hymn, and we’d circle around her, sitting criss-cross applesauce style. (And we’d seriously hope she had jars of her homemade pepper relish in her bag, too, because YUM.)\nShe’d tell us how, although the hymn has become a staple in many sanctuaries, its original author remains unknown. Because it was written in the early 1800’s, it was passed down orally from person to person, which explains the repetition of easy-to-remember lyrics. While the tune varied each time it was sung, the words remained the same. Whether sung as a haunting tune in a minor key or a cheery, major-key march, the truths are unchanging. Then, in keeping with the tradition of this truth-filled hymn, Polly would have us set our sheet music aside and sing it by heart.\nShe always made sure we’d go home with the important things tucked in our hearts, and most of the time we didn’t realize their value until later. When I think about all the songs I’ve memorized over the years—my ABC’s, 50 Nifty United States, the books of the Bible, the Electric Slide—I begin to see they all serve a particular purpose: instruction or inspiration. It makes me lean in a little closer to hear the truths Polly would intentionally pass along to us via “What Wondrous Love Is This.”\nThis hymn—a song specifically addressed to our souls, the core of who we are—reveals the simple yet vital soundtrack of our humanity: the sweet shock of our Father’s wondrous love. Our 18th century friends did what we would also be wise to do—they identified the foundational truths of their faith, and they hung on for dear life. They memorized these truths backwards and forwards, set them to music and shared them in song.\nAnd when we sing these same words, we get to join in the same precious cycle: When we recount the wonders of the Lord’s love, it leads us to worship. When we worship, we are led back to His wondrous love. And through eternity, we’ll sing on.\nWhat foundational truths of the Gospel do you need to sing to your soul today? Which parts of the Father’s wondrous love do you need to hang onto for dear life?\nLike our favorite love song, let’s personalize these truths, set them to our own melody and pass them down.\nWhat Wondrous Love Is This!\nAmerican Folk Hymn, 19th cent.\nWhat wondrous love is this, O my soul, O my soul!\nWhat wondrous love is this, O my soul!\nWhat wondrous love is this that caused the Lord of bliss\nto bear the dreadful curse for my soul, for my soul,\nto bear the dreadful curse for my soul?\nWhen I was sinking down, sinking down, sinking down,\nwhen I was sinking down, sinking down;\nwhen I was sinking down beneath God’s righteous frown,\nChrist laid aside his crown for my soul, for my soul,\nChrist laid aside his crown for my soul.\nTo God and to the Lamb, I will sing, I will sing,\nto God and to the Lamb, I will sing;\nto God and to the Lamb who is the great I AM –\nwhile millions join the theme, I will sing, I will sing;\nwhile millions join the theme, I will sing.\nAnd when from death I’m free, I’ll sing on, I’ll sing on,\nand when from death I’m free, I’ll sing on;\nand when from death I’m free, I’ll sing and joyful be,\nand through eternity, I’ll sing on, I’ll sing on,\nand through eternity I’ll sing on.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-HymnsIII_instagram4.jpg"
},
{
    "book_title": "Hymns III",
    "devo_passages": "Matthew 27:27-50, Philippians 3:7-11, Galatians 6:11-16, Isaiah 53",
    "devo_title": "When I Survey The Wondrous Cross",
    "devo_summary": "\nBY Amanda Bible Williams\n\n\nDid e’er such love and sorrow meet,\nOr thorns compose so rich a crown?\nI once performed the hymn “When I Survey the Wondrous Cross” in Notre Dame Cathedral. Yes, it was just to the tourists who happened to be present. And yes, it was freezing in there, so our choir wore big, winter coats and shivered our way through the stanzas. But it was one of the most stunning, cherished experiences of my college life. The majesty of that place and the splendor of this song collided to create a moment I will never forget. (It didn’t even matter that I’m not much of a singer!)\n\nOur choir director was a petite German man whom we referred to with enormous affection as “Dr. B.” Dr. B had a way of bringing out the best in us—not just our best sound, but our best selves. He taught us to hold our words with reverence, to form our vowels with care, and to never draw out our S’s or mumble our O’s.\nWords like “cross” and “sorrow” and “demands” (sung “dih-mahnds”, with a heavy “d” and jaw dropped to the floor on the “ah”) somehow held more worship when directed by Dr. B, his arms moving sharply with the rhythm, eyes wide with calm intensity, and white hair flipped back in distinguished whimsy. He taught us to recognize the weight of the lyric we were singing and communicate it appropriately.\nWe weren’t just singing songs when we stood up in front of this small, powerful man. We were taking the melodies and lyrics carefully in, then offering them up to a beauty-starved world. We were doing important work and our perfect posture was proof that we knew it.\nI think of that time, now so many years ago, and I wonder—Do I faithfully regard the cross of Christ with as much reverence now as I sang it with then, from the rehearsal room risers to faraway cathedral walls? Do I hold the reality of those words in my heart as carefully and diligently as they deserve, with no mumbling, no air of flippancy? The honest answers to these questions cause me to bow down low, confessing my sin, “pouring contempt on all my pride” like the old hymn says.\nBut the glorious cross of Jesus does not leave me there in guilt of my sin. The same Savior who reveals the depth of my need fulfills it by His mercy and love. The Cross that begs my confession is the Cross that lifts my head to salvation.\nOur college choir ended every performance with this hymn. No matter the occasion or the other songs we sang, we always left it here—beholding the Prince of Glory’s wondrous cross.\nSisters, by God’s grace, let’s do the same. Let’s spend our days in awe of the suffering Savior who poured Himself out for us. With careful words and reverent hands, may we proclaim the amazing and divine love of Jesus, our richest gain. And when our show is over, be it days or decades from now, may it have been always and ultimately about that wondrous Cross.\n\nWhen I Survey the Wondrous Cross\nIsaac Watts, 1707\nWhen I survey the wondrous cross\nOn which the Prince of glory died,\nMy richest gain I count but loss,\nAnd pour contempt on all my pride.\nForbid it, Lord, that I should boast,\nSave in the death of Christ my God!\nAll the vain things that charm me most,\nI sacrifice them to His blood.\nSee from His head, His hands, His feet,\nSorrow and love flow mingled down!\nDid e’er such love and sorrow meet,\nOr thorns compose so rich a crown?\nWere the whole realm of nature mine,\nThat were a present far too small;\nLove so amazing, so divine,\nDemands my soul, my life, my all.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-HymnsIII_instagram5.jpg"
},
{
    "book_title": "Hymns II",
    "devo_passages": "Proverbs 29:18, Philippians 3:7-11, Colossians 3:1-3, Hebrews 12:1-2",
    "devo_title": "Be Thou My Vision",
    "devo_summary": "\nBY Raechel Myers\n\nText: Proverbs 29:18, Philippians 3:7-11, Colossians 3:1-3, Hebrews 12:1-2\nI had a favorite teacher in junior high and high school named Mr. Twining. I remember a surprising number of details about Mr. Twining for his time as my “Critical Thinking” (chess) teacher and all the years he led me through Saxon Algebra. I remember his thick, sausage-y fingers that were almost always covered in a bit of a dark substance. “Wal-nuts!” he would answer with enthusiasm when we asked him why his hands were so dirty. Dude loved to crack walnuts.\nI remember his wild white tuft of hair that sometimes stuck straight up when he was feeling particularly passionate about perpendicular angles, and the way he wouldn’t throw away a small piece of chalk—rolling it around in his hands and wildly writing formulas on the chalkboard until it dissolved into an exhausted cloud of chalk dust. It’s funny the little details we remember about people in our lives.\nYou know what else I will never forget about Mr. Twining? Whether he was teaching us “Protect your bishops!” in chess class or working through an awful problem in pre-calculus, nearly every day at the start of class he would announce, as he also scrawled on the chalkboard with his tiny piece of chalk, “WITHOUT A VISION, THE PEOPLE WILL PERISH!”\nIt wasn’t until much later that I understood this was not just a way to get us to show our work or win a chess match—this was Biblical! (Proverbs 29:18) In any event, it stuck with me. You can’t just wildly move your pawns around the chessboard without a plan and hope it works out. And definitely don’t start working a math problem without knowing where you’re headed. We all need a vision.\nThat was enough for me when I was eighteen. My “vision” at the time was pretty straightforward: get married, be an interior designer, have babies, maybe live in one of those cute brownstones in downtown Chicago. But true vision, as it turns out, is less strategy and more heartbeat. It’s less “rook takes queen” and more “the surpassing worth of knowing Christ Jesus my Lord” (Philippians 3:8). My endgame didn’t reach much beyond this side of Heaven.\nI don’t pretend to think my heart has fully matured in this area—I know it hasn’t!—but I do see the Lord faithfully teaching me to “delight in the law of God in my inner being” (Hebrews 7:22). And when I set my heart on new marble countertops, the Holy Spirit reminds me of the lasting richness that comes from “setting my mind on things above” (Colossians 3:2).\nIt’s like when you’re learning to drive, and the inevitably awkward driving instructor nervously and repeatedly reminds you as you weave down the road (and take a few curves on two wheels, in my case…): cast your gaze as far as possible in the direction you want to go, and you’ll just naturally drive straighter. Also, safer.\nI think this is why I love the hymn “Be Thou My Vision” so much. The author isn’t interested in anything short of Jesus. There’s no glancing to the right or to the left—no weaving from side to side. And when we sing this song-prayer ourselves, we call on the Lord to be our vision, our wisdom, our true Word, our battle Shield, our Dignity and Delight—our One Thing and our All Things.\nWhen we ask God to be our “best thought,” our “great Father,” “soul’s Shelter” and our “high Tower”—that’s when strategy falls quickly to the wayside and we march to the beat of a heart that longs for Heaven.\nFriends, Proverbs 29:18 is absolutely right (and, I suppose, so was Mr. Twining): without a vision, the people will perish. We can laugh about the reality that we could lose at chess, not get our Chicago brownstone, or run our car off the road if we don’t have a proper vision, but the greater Truth outlasts all of these things, and the risk is much greater: without a vision, we will most certainly perish.\nAs believers, let our vision be simply this: “that I may know him and the power of his resurrection, and may share his sufferings, becoming like him in his death, that by any means possible I may attain the resurrection from the dead.” (Philippians 3:10-11)\n“Therefore…let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us, looking to Jesus, the founder and perfecter of our faith”\n– Hebrews 12:1-2\n\n (hymn artwork by Patrick Laurent of Quiet Boy Studio!)\nBE THOU MY VISION\nby Dallan Forgaill, 8th century \n(translated by Eleanor H. Hull and versified by Mary E. Byrne)\nBe Thou my Vision, O Lord of my heart;\nNaught be all else to me, save that Thou art.\nThou my best Thought, by day or by night,\nWaking or sleeping, Thy presence my light.\nBe Thou my Wisdom, and Thou my true Word;\nI ever with Thee and Thou with me, Lord;\nThou my great Father, I Thy true son;\nThou in me dwelling, and I with Thee one.\nBe Thou my battle Shield, Sword for the fight;\nBe Thou my Dignity, Thou my Delight;\nThou my soul’s Shelter, Thou my high Tower:\nRaise Thou me heavenward, O Power of my power.\nRiches I heed not, nor man’s empty praise,\nThou mine Inheritance, now and always:\nThou and Thou only, first in my heart,\nHigh King of Heaven, my Treasure Thou art.\nHigh King of Heaven, my victory won,\nMay I reach Heaven’s joys, O bright Heaven’s Sun!\nHeart of my own heart, whatever befall,\nStill be my Vision, O Ruler of all.\n_________\nFind an exclusive hand-lettered print with lyrics from “Be Thou My Vision” in the She Reads Truth shop!\nClick below to hear an adaptation of the hymn on the She Reads Truth |Hymns II Spotify playlist. \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/SRT-Hymns2_instagramday1.jpg"
},
{
    "book_title": "Hymns II",
    "devo_passages": "Luke 12:4-7, Matthew 6:25-34; Psalm 91:1-16, John 14:1-4",
    "devo_title": "His Eye Is On The Sparrow",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Luke 12:4-7, Matthew 6:25-34; Psalm 91:1-16, John 14:1-4\nWe have a photo of my family from a few years ago, on the day my dad came home from a long hospital stay. He sits wearily but happily in his recliner, wearing a plaid flannel shirt and an oxygen tube, and the group of us is gathered, standing, around him. It’s one of my favorites.\nWe’re all smiling in that picture—each and every one of us. It was a happy day for our family, though “happy” is not exactly the word I’d use to describe that time in our lives. It was a hard season—harder than I care to remember most of the time. We were terrified, facing death together for the first time in such an intimate way. Making it from one day to the next was an overwhelming chore. Even so, the season was somehow undergirded with a steady, pulsing joy. The word “supernatural” doesn’t often escape my lips, but that’s only the way I know to describe the peace that covered us. It was peace that passes understanding.\nI love Civilla Martin’s hymn, “His Eye Is On The Sparrow,” because it so beautifully embodies this mysterious juxtaposition of circumstance and joy. The words of the refrain are so enthusiastic and certain! “I sing because I’m happy, I sing because I’m free! His eye is on the sparrow, and I know He watches me.” But the melody is somber, almost haunting.\nThe lyrics speak truth—our lives are in God’s careful, constant care.\nThe melody sings reality—life can be oh so hard.\nThis collision of condition and joy is what inspired Mrs. Martin to write the hymn in the first place. She and her husband were traveling in New York in the early 1900’s, when they befriended a couple named the Doolittles. Mrs. Doolittle had been bedridden for nearly 20 years, and her husband was wheelchair bound. Still, their disposition was bright and hopeful, enough that the Martins asked them the simple question: Why are you so happy? Mrs. Doolittle’s reply became the heart of the soon-to-be refrain: “His eye is on the sparrow, and I know He watches me.”*\nI just paused my writing to look up the word “happy” in the dictionary. Merriam-Webster defines it as “feeling pleasure and enjoyment because of your life, situation, etc.”\nI don’t know about you, but belting out “I siiiiing becaaaaause I feel pleasure about my situation!” just doesn’t ring true. If I look at my tangible circumstances—my struggles, my uncertainties, all the ways I feel I’m failing at all the things—happiness hardly seems to fit. But if I look to Jesus—to the promises of His Word and the glory of His cross—a holy joy begins to hum underneath the sound of earthly sorrow.\nWhen I turn my ear away from temporary troubles—real and painful though they are—and turn toward the Savior, I can hear the sure and steady song of redemption.\nIt’s the song my family heard that day as we gathered around my dad, laughing at our lack of camera-timer savvy. It’s the song the Doolittles sang as they chose joy in a life most of us would pity. It’s the song that has played from the beginning of the Gospel Story, when God made a covenant with His children to carry them close and bring them Home.\n“Because he loves me,” says the Lord, “I will rescue him;\nI will protect him, for he acknowledges my name\nHe will call on me, and I will answer him;\nI will be with him in trouble,\nI will deliver him and honor him.\nWith long life I will satisfy him\nand show him my salvation.”\n– Psalm 91:14-16, NIV\n*source: cyberhymnal.org\n\nHIS EYE IS ON THE SPARROW\nby Civilla D. Martin, 1905\nWhy should I feel discouraged, why should the shadows come,\nWhy should my heart be lonely, and long for heaven and home,\nWhen Jesus is my portion? My constant friend is He:\nHis eye is on the sparrow, and I know He watches me;\nHis eye is on the sparrow, and I know He watches me.\nRefrain\nI sing because I’m happy,\nI sing because I’m free,\nFor His eye is on the sparrow,\nAnd I know He watches me.\n“Let not your heart be troubled,” His tender word I hear,\nAnd resting on His goodness, I lose my doubts and fears;\nThough by the path He leadeth, but one step I may see;\nHis eye is on the sparrow, and I know He watches me;\nHis eye is on the sparrow, and I know He watches me.\nRefrain\nWhenever I am tempted, whenever clouds arise,\nWhen songs give place to sighing, when hope within me dies,\nI draw the closer to Him, from care He sets me free;\nHis eye is on the sparrow, and I know He watches me;\nHis eye is on the sparrow, and I know He watches me.\nRefrain\n_________\n\nFind an exclusive hand-lettered print with lyrics from “His Eye Is On The Sparrow” in the She Reads Truth shop!\nClick below to hear the hymn on the She Reads Truth |Hymns Spotify playlist. \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/SRT-Hymns2_instagramday2.jpg"
},
{
    "book_title": "Hymns II",
    "devo_passages": "Colossians 1:13-29, Philippians 2:1-11",
    "devo_title": "Thy Mercy, My God",
    "devo_summary": "\nBY Guest Writer\n\nText: Colossians 1:13-29, Philippians 2:1-11\nJohn Stocker wrote a hymn, “Thy Mercy My God, Is The Theme Of My Song,” in 1776 that I discovered on the pages of a Gadsby’s Hymnal about ten years ago. I wrote a new melody to his four stanzas that afternoon, and these words have been an arresting companion for me in many changing seasons since that day.\nYour mercy, my God.\nThis morning, I was heavy with sleep when my double alarms went off at 6:00 and 6:08. I was slow-moving to get out of bed, having been awake during the night thinking about my kids, their school progress, my work schedule and the intersection of all those life forces. And still that sun came up again today. The faithful mercies of God—they come every morning, whether I am bleary-eyed or bright. When the sun is hidden behind winter, overcast clouds, still this mercy, this morning is new. Still, the sun rises.\nToday, His mercy is coming. I am reminded as I pray those words with my kids in the backseat on the way to school—His mercy is already here.\nWithout your sweet mercy, I could not live here.\nMercy is God giving us what we need when we don’t deserve an ounce of goodness. We can’t earn it. It’s a bold expectation, appealing for mercy when I don’t have anything measurable to contribute or to earn for myself. I can’t bargain with a Holy God. My appeal for grace is only and always Jesus.\nSome days we see a quick answer to yesterday’s prayers. Some days we decidedly get the opposite of what we asked for. Some days, in the silence, we are just asked to wait. Most days are like that, I think.\nI can say sometimes, like St. Paul, that I have learned to be content in lots of situations. But my contentment is fleeting. It slips through my fingers. And gratitude is both a practice and a gift to be received.\nYour goodness, I own.\nHere, John’s hymn proclaims another bold expectation. In the midst of our failings and fears, we are the recipients of LOVE by a fiercely loving God—an obliging God, even. He gives Himself to us again and again. It is as if we are the receiving address where He sends and supplies His goodness daily. I love the phrase in the Anglican communion liturgy that says, “For it is Your property always to have mercy.” Mercy is a demonstration of God’s abundant nature. In Philippians 2, we are reminded of how Jesus humbled Himself in obedience to the Father’s will. His faithfulness toward us is measurable by His provision—daily bread, of every variety.\n“In him and by him and for him, all things hold together” (Colossians 1:16). In all things, Jesus holds the world together—the rhythms of our families, the rhythm of the sunrise, and everything in creation, held together by the sheer magnetic and dynamic force of His mercy.  Mercy for you. Mercy for me. Mercy for the world.\n________\nSandra McCracken is a singer, songwriter and producer from Nashville, TN. Over the course of eight critically acclaimed studio albums, Sandra has developed a body of work that encompasses hook-driven melodic pop, No Depression-style Americana, contemporary recastings of classic hymns, and even children’s music as part of the Nashville alt-folk super-group Rain For Roots. Her 2013 solo record, “Desire Like Dynamite” charted as one of Billboard’s Top 50 Heatseekers, and her new album, “Psalms” will be available this spring.\n\nTHY MERCY, MY GOD, IS THE THEME OF MY SONG\nby John Stocker, 1776\nThy mercy, my God, is the theme of my song,\nThe joy of my heart. and the boast of my tongue;\nThy free grace alone, from the first to the last,\nHath won my affections, and bound my soul fast.\nWithout Thy sweet mercy I could not live here;\nSin would reduce me to utter despair;\nBut, through Thy free goodness, my spirits revive,\nAnd He that first made me still keeps me alive.\nThy mercy is more than a match for my heart,\nWhich wonders to feel its own hardness depart;\nDissolved by Thy goodness, I fall to the ground,\nAnd weep to the praise of the mercy Ive found.\nGreat Father of mercies, Thy goodness I own,\nAnd the covenant love of Thy crucified Son;\nAll praise to the Spirit, Whose whisper divine\nSeals mercy, and pardon, and righteousness mine.\n_________\n\nFind an exclusive hand-lettered print with lyrics from “Thy Mercy, My God” in the She Reads Truth shop!\nClick below to hear the hymn on the She Reads Truth |Hymns II Spotify playlist,\nperformed by today’s guest writer, singer/songwriter Sandra McCracken.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/SRT-Hymns2_instagramday3.jpg"
},
{
    "book_title": "Hymns II",
    "devo_passages": "Romans 5:6-11, Romans 8:31-39, Hebrews 6:19",
    "devo_title": "O The Deep, Deep Love of Jesus",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Romans 5:6-11, Romans 8:31-39, Hebrews 6:19\nI am not a great singer.\nIn middle school, I decided to make up for mediocre pitch and air support with huge confidence and volume. Instead of being the best singer in the choir, I’m the most enthusiastic. You’ve probably sat next to me in church and thought, “Well, she sure is enjoying herself.”\nOnce you start to take joy in singing you can really go to town with the harmony. And when I learned to read harmony, well, I was unstoppable. Or is it insufferable? Hard to know.\nIn college I had a great teacher who taught us to love the rich theological heritage of church music. We all started singing these dear hymns and songs together, and as we learned them, the words and melodies became the background and texture of our college life. Adorable as it sounds, those hymns really were a touchstone for us.\nMy hands-down favorite from that season is “O The Deep, Deep Love of Jesus.” The harmony is so satisfying to sing, and the whole song rumbles with robust enthusiasm. The hymn writer, Samuel Trevor Francis, didn’t always rumble with robust enthusiasm. When he tells the story of his life, he remembers walking along the Thames in London as a young man and wishing he could throw himself in the water and end it all.\nTo varying degrees, I think a lot of us have moments of wanting to give up. And not just because “Thames” is hard to pronounce (FYI- it’s “tems”). That college girl singing hymns couldn’t imagine letting go of life; there was still so much joy to be squeezed out of it! But years later, when all the babies were crying and all the diapers needed changing, life looked less plump with promise to me.\nSamuel went on to live a very long and gospel-driven life. Good for him, right? Well, I believe that God rescued him. Samuel had a bad spell and he longed for the numbing embrace of water all around him, but instead God gave him love—love “rolling as a mighty ocean in its fullness” over him!\nWe’ve all heard the lies that Samuel heard in his head. Life can be the worst. Let’s just stop here for a minute: I hear you. I read your stories, too. Some of you have been kicked in the gut too many times for it to be funny anymore.\nBut I have to believe that the solid, reliable, and deep love of Jesus that surrounds me is better than the ephemeral lies swirling in my head. The Bible promises that He is “a sure and steadfast anchor of the soul, a hope that enters into the inner place behind the curtain.” (Hebrews 6:19)\nI get super car sick when I’m the passenger, and a few years ago I was riding with my sister and feeling like I was for sure going to lose it. I put my head down, rocked back and forth, and sang this song to myself. After the trip was over, everyone had a good laugh about how I’m the crazy singing lady.\nBut isn’t that what we all need sometimes? Sometimes we just need to tuck our heads low, forget about everything else, and hold on to the one thing we know to be true. Shut everything else out for just a minute today, and hold on to the “deep, deep love of Jesus—vast, unmeasured, boundless, free.”\nI pray that you, being rooted and established in love, may have power, with all the saints, to grasp how wide and long and high and deep is the love of Christ.\n– Ephesians 3:17-18\n\nO THE DEEP DEEP LOVE OF JESUS\nby Samuel Trevor Francis, 1875\nO the deep, deep love of Jesus,\nVast, unmeasured, boundless, free!\nRolling as a mighty ocean\nIn its fullness over me!\nUnderneath me, all around me,\nIs the current of Thy love\nLeading onward, leading homeward\nTo Thy glorious rest above!\nO the deep, deep love of Jesus,\nSpread His praise from shore to shore!\nHow He loveth, ever loveth,\nChangeth never, nevermore!\nHow He watches o’er His loved ones,\nDied to call them all His own;\nHow for them He intercedeth,\nWatcheth oer them from the throne!\nO the deep, deep love of Jesus,\nLove of every love the best!\nTis an ocean vast of blessing,\nTis a haven sweet of rest!\nO the deep, deep love of Jesus,\nTis a heaven of heavens to me;\nAnd it lifts me up to glory,\nFor it lifts me up to Thee!\n_________\n\nFind an exclusive hand-lettered print with lyrics from “O The Deep, Deep Love Of Jesus” in the She Reads Truth shop!\nClick below to hear the hymn on the She Reads Truth |Hymns II Spotify playlist. \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/SRT-Hymns2_instagramday4.jpg"
},
{
    "book_title": "Hymns II",
    "devo_passages": "Revelation 5:11-13 , Isaiah 61:1-4",
    "devo_title": "O For A Thousand Tongues to Sing",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Revelation 5:11-13 , Isaiah 61:1-4\nI’ve always envied people who know their “spiritual birthday”—the day that marks the moment in time they received Jesus as Savior. My faith journey was not so black and white, and I never knew what to say when the topic came up in youth group or college Bible studies.\nCharles Wesley did not have this problem. The famous Methodist minister was captured by the beauty of the Gospel on May 21, 1738—at 8:45pm, to be exact. He describes that his heart was “strangely warmed” and that the Holy Spirit “chased away the darkness of [his] unbelief.” Exactly a year later, in 1739, Wesley penned nineteen stanzas (!!) of the hymn we now call “O For A Thousand Tongues to Sing.” He wrote it to commemorate the first anniversary of his conversion, inspired by missionary Peter Boehler’s statement: “Had I a thousand tongues, I would praise Christ Jesus with all of them.”\nIt’s a great story, right? Here’s the craziest part: Charles Wesley had been an active, ordained, teaching and preaching member of the church for nearly two decades by the time he wrote this hymn. He and his brother John even led a missionary excursion to America in 1735, three years before their heart-warming gospel transformation. The Wesleys had an abundance of knowledge and a host of good deeds, but they discovered they didn’t have faith. They needed to believe.\nSome 250 years later, in 1999, a naive and well-meaning college girl named Amanda went on her own overseas adventure, to carry the Gospel to the youth on the streets of Wales. Her heart had been warmed and she did know Jesus, but she mistook salvation as a commodity to be sold rather than Good News to be shared. I have a journal from the time I spent in Wales, and I read through it just the other day. I read the names of young people I met—kids not much younger than I was at the time—and how desperately I wanted them to know Jesus. I look back on that experience with fondness and regret. Rather than handing those teenagers a sales pitch and a tract, I wish so badly I would have shared my heart.\nThe worship of a changed heart is the best evidence of the Gospel. No other case for Christ comes close, no matter how well-rehearsed. This is not to diminish the importance of teaching and preaching—it was during a sermon that Charles Wesley first believed! But following Jesus is not a decision of logic; it is a determination of the heart—a determination that only comes by grace through faith when the Holy Spirit softens that heart to see and receive the beauty of Christ and opens our lips to sing His praise.\nWe hear the words of a grace-changed heart in this beloved hymn. Wesley practically gushes about his Lord!\nJesus! The Name that charms our fears,\nThat bids our sorrows cease,\nTis music in the sinner’s ears,\nTis life, and health, and peace.\n“The glories of my God and King, the triumphs of His grace”—that’s what I wish I would have shared with those scared, seeking kids on the streets of Wales all those years ago. Rather than sell the transactional Jesus I’d created, I wish I would have simply sung the praises of my Savior: He brings me peace. He gives me life. He trumps all my fears and sorrows.\nI wish I had looked Nikola and Scott and Chris and all the others straight in the eye and said,\nI was a prisoner in a cell of my own making, and Jesus set me free.\nWe want so badly to convince the world of the beauty and hope of our Lord, but only God can warm the heart. The Creator of heaven and earth does not need our defense—He deserves our praise. The Rescuer of hearts is not made more beautiful by my salesmanship—He is regarded as beautiful in my worship.\nSisters, may the God whose grace has triumphed over us “assist us to proclaim” His praise to the poor and the brokenhearted, to the captives and those who mourn, to sing with all the hosts of heaven:\n“To him who sits on the throne and to the Lamb\nbe blessing and honor and glory and might forever and ever!”\n(Revelation 5:13b, ESV)\n\nO FOR A THOUSAND TONGUES TO SING\nby Charles Wesley, 1749\nO for a thousand tongues to sing\nMy great Redeemer’s praise,\nThe glories of my God and King,\nThe triumphs of His grace!\nMy gracious Master and my God,\nAssist me to proclaim,\nTo spread through all the earth abroad\nThe honors of Thy Name.\nJesus! The Name that charms our fears,\nThat bids our sorrows cease;\nTis music in the sinner’s ears,\nTis life, and health, and peace.\nHe breaks the power of canceled sin,\nHe sets the prisoner free;\nHis blood can make the foulest clean,\nHis blood availed for me.\nHe speaks, and, listening to His voice,\nNew life the dead receive,\nThe mournful, broken hearts rejoice,\nThe humble poor believe.\nHear Him, ye deaf; His praise, ye dumb,\nYour loosened tongues employ;\nYe blind, behold your Savior come,\nAnd leap, ye lame, for joy!\n_________\nFind an exclusive hand-lettered print with lyrics from “O For A Thousand Tongues To Sing” in the She Reads Truth shop!\nClick below to hear the hymn on the She Reads Truth |Hymns II Spotify playlist. \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/SRT-Hymns2_instagramday5.jpg"
},
{
    "book_title": "Hymns II",
    "devo_passages": "Psalm 150, Matthew 6:9-13, Philippians 4:4, 1 Peter 1:3-5",
    "devo_title": "The Doxology",
    "devo_summary": "\nBY Ellie Holcomb\n\nThere is such beauty in singing His praises—not just in church, but in our dirty kitchens, with breaking hearts, in the middle of our unmet longings, or at the end of our weary days. Praise turns our hearts from ourselves toward the One we were made to adore—toward the One who adores us, to the One who was broken for us, and to the One from whom all blessings flow.\n“Let everything that has breath praise the Lord.” \n– Psalm 150:6\nOver and over in Scripture, there are commands and exhortations to give God praise. Praise rings out all over the Psalms. Paul tells us to “rejoice always” (Phil 4:4). God asks us to praise Him, even when our hearts are heavy. The Lord’s Prayer opens with praise: “Our Father, in heaven, hallowed be Thy name” (Matt 6:19).\nThere’s a lovely mystery to rejoicing always, to choosing to praise God in every moment. How on earth is that possible? Always?\nWe have walked through some seriously heartbreaking circumstances with dear friends and family over the past few months. Praising God feels like the opposite of what I want do most of the time, especially in the middle of such sadness. But as I direct my heart back to the Cross and the empty grave, I begin to remember that we do have this Living Hope, even in the middle of the most desperate circumstances.\nI don’t know how to rejoice always, but I do know that every time I remember who He is—and how He gave Himself up for us so that we could know wholeness—something shifts in my heart, even when it’s breaking.\nSo let’s listen to the invitations and encouragement all throughout Scripture today, dear sisters. Let’s raise our voices as creatures here below and let them mingle with the saints that have gone before us and with the heavenly hosts, to give praise to the Author of every blessing and to the One who gives us a Living Hope, even on our darkest days.\n \n\n \nTHE DOXOLOGY\nby Thomas Ken, 1674\nPraise God, from Whom all blessings flow;\nPraise Him, all creatures here below;\nPraise Him above, ye heavenly host;\nPraise Father, Son, and Holy Ghost.\nAmen.\n_________\n\nFind an exclusive hand-lettered print with lyrics from The Doxology in the She Reads Truth shop!\nClick below to hear the hymn on the She Reads Truth |Hymns II Spotify playlist. \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/01/SRT-Hymns2_instagramday6.jpg"
},
{
    "book_title": "Hymns",
    "devo_passages": "Romans 3:21-26, Luke 5:27-32, 1 Timothy 1:15",
    "devo_title": "Come, Ye Sinners",
    "devo_summary": "\nBY Raechel Myers\n\nText: Romans 3:21-26, Luke 5:27-32, 1 Timothy 1:15\nJesus answered them, “It is not the healthy who need a doctor, but the sick.\nI have not come to call the righteous, but sinners to repentance.”\n– Luke 5:31-32, NIV\nMy husband Ryan hates to go to the doctor. Hates it. Would rather overpay on taxes while drinking room temperature coffee with sand in his teeth than find himself in the exam room.\nBut, this fall I finally took the bull by the horns and made a call to schedule some long-overdue health maintenance checks. Y’all, they didn’t even know his name. He wasn’t in their system. He’d never been seen by a doctor since we moved to Nashville more than eight years ago.\nOnce the dates were finally on the calendar, he was really sweating it. Ryan lost sleep for an entire week worrying that the doctor would uncover some terminal illness or lecture him like he was a child about regular well-checks and diet and exercise. He’d waited so long, it felt awkward to show up. He set up camp at the intersection of “ignorance is bliss” and “I can’t bear the judgment” and lived there for years.\nI laughed at him then and I still chuckle about it now—so silly to be afraid to be seen by a caretaker. But when I zoom out to a larger picture I realize that, in a lot of ways, I’m just the same in my relationship with my Caretaker.\nLord, could we please postpone the “examine my heart” prayer until I’ve got something worth shining your headlamp on?\nFather, I’m a mess right now. I promise you don’t want me walking around proclaiming your name – I’m a PR nightmare.\nGod, I don’t really know you very well, but I’d like to. Let me see if I can get my act together a bit, then let’s be friends!\nFriends, we are all sick with sin. Every one of us is diseased with iniquity. We hear each other saying, “I’m broken and guilty,” and we think to ourselves, “If only they knew – it’s me. I’m the worst.” We live in fear of shining a light on the very darkest parts of our hearts—afraid to whisper those dark parts by name, let alone hold them in our outstretched hands in plain sight of the One who bled and died to redeem them.\nJesus our Healer, says, “Come.” Yes, you are very sick, but that’s why I’m here!\nJesus our Justifier, says, “Come.” Child, you are ill, and I am the only One who can make you well.\nWe live in shame and fear, afraid to come into the light until we we know the Physician will be pleased with what He sees. We’re worried we’ve waited too long. The author of the hymn “Come, Ye Sinners” echoes Christ Himself when he says, don’t wait another minute!\n“If you tarry till you’re better, you will never come at all.”\n“Let not conscience make you linger,\nNot of fitness fondly dream;\nAll the fitness he requireth is to feel your need of him.”\nDo you need Him today, Sisters? Come to Him.\nAre you waiting to be better on your own? Come to Him.\nIn Him you will find not condemnation, but healing.\n\nCOME, YE SINNERS\nby Joseph Hart, 1759\nCome, ye sinners, poor and needy,\nWeak and wounded, sick and sore;\nJesus ready stands to save you,\nFull of pity, love and power.\nRefrain\nI will arise and go to Jesus,\nHe will embrace me in His arms;\nIn the arms of my dear Savior,\nO there are ten thousand charms.\nCome, ye thirsty, come, and welcome,\nGod’s free bounty glorify;\nTrue belief and true repentance,\nEvery grace that brings you nigh.\nRefrain\nCome, ye weary, heavy laden,\nLost and ruined by the fall;\nIf you tarry till you’re better,\nYou will never come at all.\nRefrain\nView Him prostrate in the garden;\nOn the ground your Maker lies.\nOn the bloody tree behold Him;\nSinner, will this not suffice?\nRefrain\nLo! th’incarnate God ascended,\nPleads the merit of His blood:\nVenture on Him, venture wholly,\nLet no other trust intrude.\nRefrain\nLet not conscience make you linger,\nNot of fitness fondly dream;\nAll the fitness He requireth\nIs to feel your need of Him.\nRefrain\nFind an exclusive hand-lettered print with lyrics from “Come, Ye Sinners” in the She Reads Truth shop!\nClick below to hear the traditional melody of “Come, Ye Sinners” on the She Reads Truth |Hymns Spotify playlist. An additional version of the hymn is also available on the full playlist.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/SRT-Hymns_instagram_day1.png"
},
{
    "book_title": "Hymns",
    "devo_passages": "Psalm 16:1-11, Romans 5:6-11, 7:21-25, 1 Samuel 7:12",
    "devo_title": "Come, Thou Fount of Every Blessing",
    "devo_summary": "\nBY Ellie Holcomb\n\nCome, Thou fount of every blessing,\nTune my heart to sing Thy grace.\n– Robert Robinson\nWhat a beautiful prayer to the Author of EVERY blessing: “Tune my heart.”\nWhen my guitar is out of tune, the song that is meant to be beautiful can sound more like nails on a chalkboard to me. Something’s not right. So, I stop. And I take the time to gently restore each string to its right place so the song will be beautiful again.\nAnd, oh, how my heart needs tuning! I forget His goodness. I forget there are “streams of mercy, never ceasing.” I forget that I’m already accepted, covered, held, known, beloved. And when I forget that I’m His cherished daughter, I start hustling for my worth. Grasping for “good” as if I don’t already have access to the Giver of every good thing.\nProne to wander, Lord, I feel it.\nI’d never play a song with an out of tune guitar, but so often (too often) I am willing to live with a heart that is out of tune. Dissonant. Fearful. Discontent. Ashamed. All because I don’t take the time to restore my heart to its rightful place, to a place of gratitude for a Love that will never leave me.\nIt seems that our work as followers of Jesus is to remember. To sing His grace over and over. And because of what He did on the Cross, it’s a song that will never grow old. We can’t sing it too much or too loudly. We can’t wear that record out.\nWhile we were still sinners, Love gave Himself up for us, and walked out of the grave, so that we could taste the sweetness of mercy and belonging. That song is powerful. Lord, would you help us to sing it?\nI need this hymn. I need the truth that it carries.\nIt calls me back to remembering the Fount of every blessing.\nIt beckons me to raise up Ebenezer stones. Rocks to remember how God has been my helper. Rocks to remember our Rock.\nBecause I’ve got nothing if I don’t have Him. And we HAVE HIM. He stands with open arms, ready to transform our hearts if we’ll but hand them over. Bind us to Your side, Lord Jesus.\nWhat might happen if we invited Him to tune our hearts to sing His grace today?\n \n\nCOME, THOU FOUNT OF EVERY BLESSING\nRobert Robinson, 1735-1790 \nCome, thou Fount of every blessing,\ntune my heart to sing thy grace;\nstreams of mercy, never ceasing,\ncall for songs of loudest praise.\nTeach me some melodious sonnet,\nsung by flaming tongues above.\nPraise the mount! I’m fixed upon it,\nmount of thy redeeming love.\nHere I raise mine Ebenezer;\nhither by thy help I’m come;\nand I hope, by thy good pleasure,\nsafely to arrive at home.\nJesus sought me when a stranger,\nwandering from the fold of God;\nhe, to rescue me from danger,\ninterposed his precious blood.\nO to grace how great a debtor\ndaily I’m constrained to be!\nLet thy goodness, like a fetter,\nbind my wandering heart to thee.\nProne to wander, Lord, I feel it,\nprone to leave the God I love;\nhere’s my heart, O take and seal it,\nseal it for thy courts above.\nFind an exclusive hand-lettered print with lyrics from “Come, Thou Fount” in the She Reads Truth shop!\nClick below to hear “Come, Thou Fount of Every Blessing” on the She Reads Truth |Hymns Spotify playlist. \n\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/SRT-Hymns_instagram_day2a.png"
},
{
    "book_title": "Hymns",
    "devo_passages": "Isaiah 66:12-14, Job 19:25-26, James 5:7-11, Colossians 2:13-14",
    "devo_title": "It Is Well With My Soul",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Isaiah 66:12-14, Job 19:25-26, James 5:7-11, Colossians 2:13-14\nFor I know that my Redeemer lives, and at the last he will stand upon the earth. And after my skin has been thus destroyed, yet in my flesh I shall see God… \n– Job 19:25-26, ESV\nThe last few years had been pretty terrible for the man. He and his wife, Anna, had 4 beautiful children—3 girls and a boy—when scarlet fever stole the life of their only son. The boy was just four years old.\nThe family was wealthy; he was a successful lawyer with influential friends. The year after his little boy died, the man invested a sizeable portion of their money in northern Chicago’s growing real estate market. A handful of months later, it was gone—the property and the family fortune destroyed by the Great Chicago Fire of 1871.\nBut it’s what came next that undid him.\nThe year was 1873, two years after the fire. He sent Anna and their children (there were 4 girls now, one born since the loss of their son) ahead to England for a family holiday. He stayed back on business with the plan of following shortly after. Only, something went terribly wrong. The ship wrecked with another in the Atlantic, and the girls perished at sea. A grieved Anna reached shore and sent her husband a telegram: “Survived alone.”\nSurvived alone.\nHave you ever felt that sorrow, Sister? Have you ever found yourself standing, lost and suddenly alone, in the wreckage of what was or what might have been?\nWe know our Redeemer lives. We believe it, even when we cannot feel it. Yet grief is thick and tangible and our bodies pain under its weight. Whatever and whomever we grieve, the emotions consume and toss us like ragdolls in the waves and we have no energy left to swim. And so we do the only thing we know to do: we give the grief back to God.\nWhen a broken Chicago businessman named Horatio Spafford sailed past the very spot on the Atlantic where his baby girls breathed their last, he offered up these words of worship to the God who presides over all the sorrows and the seas, to the One who has borne the whole of our grief and our sin:\nWhatever my lot, Thou has taught me to say,\nIt is well, it is well with my soul.\nYes, Lord, haste the day where our faith shall be sight. And may be spend all our days until then offering you our joys, our grief, everything we are. Amen.\n\n\nIT IS WELL WITH MY SOUL\nHo­ra­tio G. Spaf­ford, 1873\nWhen peace, like a river, attendeth my way,\nWhen sorrows like sea billows roll;\nWhatever my lot, Thou has taught me to say,\nIt is well, it is well, with my soul.\nRefrain\nIt is well, with my soul,\nIt is well, with my soul,\nIt is well, it is well, with my soul.\nThough Satan should buffet, though trials should come,\nLet this blest assurance control\nThat Christ has regarded my helpless estate,\nAnd hath shed His own blood for my soul.\nRefrain\nMy sin, oh, the bliss of this glorious thought!\nMy sin, not in part but the whole,\nIs nailed to the cross, and I bear it no more,\nPraise the Lord, praise the Lord, O my soul!\nRefrain\nAnd Lord, haste the day when my faith shall be sight,\nThe clouds be rolled back as a scroll;\nThe trump shall resound, and the Lord shall descend,\nEven so, it is well with my soul.\nRefrain\nFind an exclusive hand-lettered print with lyrics from “It Is Well With My Soul” in the She Reads Truth shop!\nClick below to hear “It Is Well With My Soul” on the She Reads Truth |Hymns Spotify playlist. \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/SRT-Hymns_instagram_day3b_alt.png"
},
{
    "book_title": "Hymns",
    "devo_passages": "Isaiah 43:1-3, Psalm 66:8-12, Deuteronomy 31:1-8",
    "devo_title": "How Firm a Foundation",
    "devo_summary": "\nBY Raechel Myers\n\nText: Isaiah 43:1-3, Psalm 66:8-12, Deuteronomy 31:1-8\nIt is the Lord who goes before you. He will be with you; he will not leave you or forsake you. Do not fear or be dismayed.” \n– Deuteronomy 31:8, ESV\nI’ll be honest. With everything in me today I want to respond to these scriptures and this incredible hymn on a joyful, super-tidy level. But every time I sit down to write—even in the in-between when I’m avoiding writing—I sense the Lord showing me something I’m not sure I want to see. He’s asking me to share something I’m not sure I want to share.\nI don’t want to write about it because it’s so honest it hurts. It’s my sin and it’s ugly and who wants to air that out in public? But as I confess this to the Father, I feel Him nudging me to share some dark-but-now-forgiven parts of me with you, and I hope they may help you feel less alone and confident to repent, too.\nThe truth is, I have such a difficult time trusting people that my insecurity can be downright paralyzing. Just last week I spent two full days in a gridlock of fear—unable to function, unable to carry out any of my callings, just a mess of a puddle on the floor. (The opposite of free, you guys. The opposite of joyful.) I struggled with insecurity about the position He’s given me in She Reads Truth and as a writer, I felt ill-equipped to teach anyone anything about God’s precious Word, and I was absolutely terrified that somehow, some way, I would be betrayed or taken advantage of because I just didn’t know any better.\nThat’s a lot of honest for one paragraph. If it didn’t pain you to read it, it super pained me to write it. There are seasons when I carry a crippling fear of betrayal around like an old heavy suitcase strapped to my back, and it goes with me everywhere and keeps me from living life the way I’m called to live it. I’ve walked through a number of unspeakable betrayals as a child and as an adult, and I’m sure that’s a lot of why I struggle with this. I tried to tie a neat little bow around it for my husband just the other day, confidently summarizing that I can trust the Lord with abandon, it’s just people that make me crumble sometimes.\nBut you guys, it’s still fear. And when my worst case scenarios are played out in my head—or out loud for a friend—at the end of the game I’m never without my Jesus. So do I even really trust Him?\nIf I do trust God, then I have nothing to fear and I have every reason for joy. And the question “But what if I suffer?” instead becomes “What am I so afraid of?”\nCharles Spurgeon says it this way:\n“…if it shall come to pass that for Christ’s sake and the gospel’s you shall endure suffering in any shape, shrink not, but rejoice in the honour thus conferred upon you, that you are counted worthy to suffer with your Lord; and joy also in this – that your sufferings, your losses, and persecutions shall make you a platform, from which the more vigorously and with greater power you shall witness for Christ Jesus.”\nWe’re all a mess and we know it. We reason with each other that we trust God, we just don’t trust people—or vice versa. But our Savior lifts our lowered eyes to meet His and says, What are you so afraid of? I will not leave you or forsake you. That’s a promise.\n\nHOW FIRM A FOUNDATION\nRobert Keene, 18th century\nHow firm a foundation, ye saints of the Lord,\nIs laid for your faith in His excellent Word!\nWhat more can He say than to you He hath said,\nYou, who unto Jesus for refuge have fled?\nIn every condition, in sickness, in health;\nIn poverty’s vale, or abounding in wealth;\nAt home and abroad, on the land, on the sea,\nAs thy days may demand, shall thy strength ever be.\nFear not, I am with thee, O be not dismayed,\nFor I am thy God and will still give thee aid;\nI’ll strengthen and help thee, and cause thee to stand\nUpheld by My righteous, omnipotent hand.\nWhen through the deep waters I call thee to go,\nThe rivers of woe shall not thee overflow;\nFor I will be with thee, thy troubles to bless,\nAnd sanctify to thee thy deepest distress.\nWhen through fiery trials thy pathways shall lie,\nMy grace, all sufficient, shall be thy supply;\nThe flame shall not hurt thee; I only design\nThy dross to consume, and thy gold to refine.\nEven down to old age all My people shall prove\nMy sovereign, eternal, unchangeable love;\nAnd when hoary hairs shall their temples adorn,\nLike lambs they shall still in My bosom be borne.\nThe soul that on Jesus has leaned for repose,\nI will not, I will not desert to its foes;\nThat soul, though all hell should endeavor to shake,\nI’ll never, no never, no never forsake.\nFind an exclusive hand-lettered print with lyrics from “How Firm a Foundation” in the She Reads Truth shop!\nClick below to hear “How Firm a Foundation” on the She Reads Truth |Hymns Spotify playlist. \n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/SRT-Hymns_instagram_day4a.png"
},
{
    "book_title": "Hymns",
    "devo_passages": "Hebrews 4:15-16, 1 Thessalonians 5:16-18, John 15:1-11",
    "devo_title": "I Need Thee Every Hour",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Hebrews 4:15-16, 1 Thessalonians 5:16-18, John 15:1-11\n“…apart from me you can do nothing.” – John 15:5b, NIV\nThe first time I can remember acknowledging feeling completely and utterly in need of Jesus — not just in theory or heart, but emotionally and physically “if you don’t come, Lord Jesus, I’m not gonna make it” in NEED of the Lord — was when my daughter was two years old.\nI adore my daughter. She is stubborn and kind and smart and just the right amount of crazy, and I’m in awe of the way God made her. But when she discovered the art of disobedience I thought it would be the death of me. We went head-to-head on a daily basis—me with my expectations and rules and her with her fearless, freakishly-strong toddler will—and more often than not I’d end up in tears.\nWhat was wrong with me? Why couldn’t I do this? Why was I so bad at patience and discipline and grace and having fun, and why was I so emotionally fragile that a two year old could push ALL MY BUTTONS?\nTo say this was a rough patch in my parenting career would be an understatement.\nOh, but that little girl taught me—teaches me!—what grace looks like. She offers it to me like candy, and I offer it back to her. We apologize a lot. We talk about how we want to love each other well and we ask Jesus to help us do that. We ask Jesus lots of things, actually.\nI ask Jesus to help me mother. I ask Jesus to help me listen to my friends and really love them. I ask Him to help me look strangers in the eye and really see them.\nI ask Jesus to care for all the people I love because there are so many I lose count and I don’t get to hug any of them as often as I wish I could. I ask Him to put a blanket of peace and comfort around my friends with achy hearts.\nI ask Jesus to fill in the gaps where I’ve been negligent. I ask Him to forgive me of the damage I’ve knowingly and unknowingly caused, to smooth it over with the holy spackle of His grace. I also ask Him to help me write true stories with odd metaphors.\nI ask Jesus for all the things, but I don’t ask Him enough.\n“Apart from me you can do nothing.” That’s what Jesus says about us in John 15:5. Do you hear the freedom in that today? You and I don’t have to manufacture our own goodness, our own enoughness. Everything good is from Him and for Him.\nThis hymn has always been one of my favorites, but this quote from author Annie Hawks sealed the deal.\n“One day as a young wife and mo­ther of 37 years of age, I was bu­sy with my reg­u­lar house­hold tasks. Sud­den­ly, I be­came so filled with the sense of near­ness to the Mast­er that, won­der­ing how one could live with­out Him, ei­ther in joy or pain, these words, ‘I Need Thee Ev­e­ry Hour,’ were ush­ered in­to my mind, the thought at once tak­ing full pos­sess­ion of me.”*\nIsn’t that typical of how God loves us? We’re busy doing life the best we can when God gently or not-so-gently nudges us to say, “I’m right here. Can’t you see? I’m what you need.”\nMay this hymn be the prayer of heart today and every day.\n\nI NEED THEE EVERY HOUR\nAnnie S. Hawks, 1872\nI need Thee every hour, most gracious Lord;\nNo tender voice like Thine can peace afford.\nRefrain\nI need Thee, O I need Thee;\nEvery hour I need Thee;\nO bless me now, my Savior,\nI come to Thee.\nI need Thee every hour, stay Thou nearby;\nTemptations lose their power when Thou art nigh.\nRefrain\nI need Thee every hour, in joy or pain;\nCome quickly and abide, or life is in vain.\nRefrain\nI need Thee every hour; teach me Thy will;\nAnd Thy rich promises in me fulfill.\nRefrain\nI need Thee every hour, most Holy One;\nO make me Thine indeed, Thou blessèd Son.\nRefrain\n\n*quote source: cyberhymnal.org\n\nFind an exclusive hand-lettered print with lyrics from “I Need Thee Every Hour” in the She Reads Truth shop!\nClick below to hear “I Need Thee Every Hour” on the She Reads Truth |Hymns Spotify playlist. \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/11/SRT-Hymns_instagram_day5.png"
}
]