[
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Matthew 5:4, Ecclesiastes 3:1-15, John 16:33, John 16:20, Psalm 30:1-12, 1 Peter 1:6-9",
        "devo_title": "A Time to Mourn and a Time to Dance",
        "devo_summary": "\nBY Raechel Myers\n\nGod created us as complex creatures, capable of feeling and sensing a whole garden of emotions. Made in the image of our Creator, we can both grieve the wrongs of this world, and celebrate the sweetness of this life. This 2-week reading plan will lead us through a series of passages from Scripture that examine the seasons of mourning and dancing in the life of a believer. In the written responses here on the site, our writers will enter into this tension, articulating their personal experiences with grief and joy in hopes of freeing you to explore your own. By immersing our hearts and minds in God’s Word, and honestly presenting our laments to Him, may we remember that God is present with us, He is good, and He is faithful. \nOn the day our daughter died, I planted flowers.\nIt was April in Tennessee, and the reality that my child was hanging in a precarious balance between life and death, in part because my womb was acting as her life support, was never far from my mind. That Monday morning, I kissed my husband and weekend guests out the door, then helped my toddler son get dressed and fed him yogurt and Cheerios for breakfast.\nEven while death was happening, so was life.\nThat Monday morning, we blew bubbles. We played on the swing set. I read a book on the back porch, and we snacked on strawberries. When my toddler was fast asleep in his crib, I slipped my hands into a pair of old gardening gloves, knelt in the dirt, and got to work with my spade. Bent over my pregnant belly, hands in the soil, the evidence of life kicked and turned within me. The gravity of the moment was lost on me at the time, but I see it now. \nPlanting. Acting on hope. Believing promises. Burying seeds in the darkness. Knowing a thing can only produce something beautiful if it dies first (John 12:24). Ecclesiastes 3 tells us there is a time for every matter under heaven.\nA time to be born, and a time to die.A time to plant, and a time to uproot.A time to weep, and a time to laugh.A time to mourn, and a time to dance.\nFor our precious daughter, that Monday afternoon in April was a time to die. For us, it was a time to mourn. But it was also a time to actively hope in promises that life comes from death. It was a time to dance because our child was in the presence of her Savior.\nThat day, not knowing what the night would hold, the Lord led me through the motions of actively hoping and believing that death brings life. An object lesson of the resurrection in my soil-covered hands, I could not have known these would be some of the last turns and kicks I’d ever feel. And so, I planted.\nLife and death are not respecters of each other. Mourning and dancing—they don’t always take turns. Not in my story, not in yours, not in our world. While people celebrate weddings and first steps and the sweetness of life, the broken world continues to break our hearts, sometimes at the very same time. The tension is there—wondering when to celebrate and when to cry. Often the best thing we can do is acknowledge that tension and do both, seeking the Lord as we navigate the complexities of this world.\nWe must never stop mourning brokenness. It is right to mourn. And we must never cease to celebrate life and beauty. It is right to dance. Because of Christ, life comes from death. Because of Christ, we will dance again.\n“Truly I tell you, you will weep and mourn, but the world will rejoice.  You will become sorrowful, but your sorrow will turn to joy” (John 16:20).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-1-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Matthew 27:32-50, Galatians 2:19-20, Luke 24:36-49, Colossians 1:15-20",
        "devo_title": "The Death and Resurrection of Christ",
        "devo_summary": "\nBY Rebecca Faires\n\nWhen I was nine, I had a theory that it always rained on Good Friday. And in my limited experience north of the Mason-Dixon line, it did rain on most Fridays before Easter. This made me believe that the earth was grieving, groaning, and remembering the world-altering death of Christ on that day. Looking up from my coloring book there at the dining room table to the cold, spring rain on our grass, I felt what I still feel today: sadness. \nA feeling of melancholy, sentimental or otherwise, over the death of Christ is certainly not an emotion unique to little girls in the Midwest. Christ’s misery was deeply painful to those who were with Him on that day, and is still real to us today. In his “Homily of the Passion,” second-century bishop Melito of Sardis wondered:\nWhat new mystery is this?The judge is judged and remains silent;The invisible one is seen and does not hide himself;The incomprehensible one is comprehended and does not resist;The unmeasurable one is measured and does not struggle;The one beyond suffering suffers and does not avenge himself;The immortal one dies and does not refuse death.What new mystery is this?\nWe can join the bishop in his wonder at this deep and painful mystery. And it is right that we should mourn. It is right that we want to turn away from the thought of Christ crucified. It is truly painful, and it’s the pain of the world turned upside down. Immortality gasping for breath means something has gone terribly wrong.\nThe wrong is written on our own foreheads. Every Ash Wednesday, we remember that we are the ones who are dust and ashes, that the sin that turned the world upside down is our sin. It is my sin—my daily run-of-the-mill gossip and petty jealousy. In spite of my horror and grief when I remember Christ’s suffering, I also rise up in joyous wonder that He has taken my place.\nThere is a tension here. We mourn at the pain of Christ’s suffering, but we dance—and I do mean dance—because we are restored by His sacrifice. My grief can turn to celebration because, like Paul, “I have been crucified with Christ, and I no longer live, but Christ lives in me” (Galatians 2:20). What a glorious realization of our freedom! \nIt doesn’t matter whether or not I think it should rain on Good Friday as some symbol of cosmic mourning. What matters is that on a certain day, many years ago, the sky turned black (Matthew 27:45), the world was turned upside down, and the Son of God gave Himself for us. And in spite of our sadness, we will forever rejoice.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-2-Text-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Jeremiah 17:9-10, Isaiah 64:6-7, Galatians 5:19-21, Romans 3:23, John 11:25, Ephesians 1:3-10, Hebrews 4:15-16, Romans 8:31-39",
        "devo_title": "Sin and Redemption",
        "devo_summary": "\nBY Amanda Bible Williams\n\nI have a favorite sin.\nI want so badly to hate it, and sometimes I do. When I see its effects on the people I love, when I’m granted an objective view of its effects on my own heart, when I remember how utterly contrary to the gospel it is—those are the times my sin brings me to my knees. But on most days, any average, busy day, I ignore it. Not only that, I tend to it under the radar, taking care to subtly stoke its flame.\nIt’s the sin of self-absorption.\nThere are flashier sins out there, and I have plenty of those to repent of too. But my bent to only see the world as relative to me—what I think, what I need, what I hope, what I believe—has single-handedly caused more collateral damage than most of those other sins put together.\nIt is the sin I’ve used to belittle my children, putting my need for space and silence before their need for love and listening.\nIt is the sin I’ve used to put off my friends, glossing over their hurts and hard spots in favor of redirecting their eyes to my own.\nIt is the sin I’ve used to not love my neighbors, ignoring instead of listening, choosing indifference over engagement.\nIt is the sin I’ve used to quench the Holy Spirit, looking past conviction and clutching harder to my idols.\nThese aren’t just phrases on a screen. These are real choices made in real relationships with real people—people I’ve hurt in large and small ways when I cling to the shards of my shattered self instead of embracing the life Christ calls me to live. There are wounds I can’t mend, moments I can’t get back, words I can’t rewind. My sin is deep. My heart aches to think of the vastness of things done and left undone.\nScripture says the Lord examines our hearts. All manner of our sins are known to Him. And our holy God, knowing every ounce of our sin, must “give to each according to his way, according to what his actions deserve” (Jeremiah 17:10). And He did. But Christ intervened, taking the Father’s holy wrath on Himself.\nWhen Christ went to the cross, He wore the dirty rags of my attempts at righteousness, the stench of my selfishness, the weight of my blatant refusal to worship my Creator with all that I am. He suffered, not because God the Father is cruel, but because my sin was heinous and merited punishment. He bled, not because He was weak but because I am. He died, not because they executed Him, but because a sacrifice was required. When Christ went to the cross, He left nothing undone.\nI hate my sin. And I hate that I don’t always hate my sin. I am broken, not in a sweet, sentimental, sing-songy way, but in a real, painful, and pain-inducing way. I am broken in a way that often breaks the people around me. I am broken in a way that should, logically speaking, separate me from a holy God. But Christ’s death is not a legend, not a story we tell to sober us into false humility or ankle-deep love. No, Christ’s death is true. His death was full, complete. Our debt has been paid by Jesus’s death, and our hope has been eternally sealed by His resurrection.\nI weep with sorrow for my sin. I weep with joy for my redemption. And nothing, not even myself and my sin, will ever separate me from the love of God in Jesus Christ (Romans 8:35). Thanks be to Him. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-3-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Psalm 103:15-16, Psalm 90:12-17, 1 Corinthians 15:26, Psalm 139:1-24, John 15:9-11, Revelation 21:4-5",
        "devo_title": "Mortality and Life",
        "devo_summary": "\nBY Bailey Gillespie\n\nThere is an Irish poet named John O’Donohue who writes blessings for many types of life experiences. In his piece “A Blessing for a Friend on the Arrival of Illness,” he says, “May you find in yourself a courageous hospitality towards what is difficult, painful, and unknown. May you use this illness as a lantern to illuminate the new qualities that will emerge in you.” \nMy friend Greg read this aloud at a songwriting retreat this spring, and the moment I heard it, I was moved. The poet’s words were at the same time deeply comforting and deeply provoking. Although Donohue was writing specifically of illness, his words spoke to the greater reality that each of our mortal bodies is slowly dying, yet there is wisdom and beauty to be harvested on the journey. We can use our mortality as a lantern. I don’t know about you, but I enjoy showing hospitality to others far more than I enjoy showing it to myself—especially to my fragile body. \nIn Psalm 103:15–16, the psalmist describes how our days are like the grass and flowers of the field that vanish. There is beauty in this fragility. But our modern culture is uncomfortable with our own mortality because we’re so removed from death—animal death, human death, even the death of our dreams. The American dream tells me I can have and do whatever my heart wants, but often what my heart wants is outside my control and slips through my fingers. It is like those grasses of the field. What endures is the life to come, our eternal inheritance that is sturdy and true and real enough to last. \nThough it’s easy to admire the seemingly timeless endurance of human achievements like the great cathedrals or other wonders of the world, knowing that my own skin and bones are more susceptible to death than these is something of a paradox. How strange that these artifacts would outlive the humans who built them. But this past summer, we observed how even the grandeur of Notre Dame was not enough to protect it from being partially consumed by fire. Even what appears timeless isn’t always so.\nWe would be without hope if it weren’t for the promised redemption of all things. Christ is making all things new. Scripture says that “Death will be no more; grief, crying, and pain will be no more, because the previous things have passed away” (Revelation 21:4–5). The hope of new heavens and a new earth and new bodies doesn’t take away the sting of these current decaying ones, but it should relieve some of the despair attached to it. \nMay we show ourselves a courageous hospitality. May those deep, dark, dying places inside us reveal even deeper ways to enter into the love of Jesus, no matter what season we find ourselves in. Although the process is painful, it enlarges our understanding of God and what it means to be co-heirs with Christ and His coming, eternal kingdom. This is not all there is. Mourning will end in dancing, and death will end in life.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-4-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Jeremiah 8:18, Psalm 42:1-11, Genesis 23:1-4, Genesis 23:19, Isaiah 25:8, Psalm 43:1-5, Isaiah 65:19-20",
        "devo_title": "Grief and Remembrance",
        "devo_summary": "\nBY Kaitlin Wernet\n\nMy very first memory is the day I became a sister. As soon as the birth of my baby brother was announced, I kicked open the maternity ward doors with my red Keds, singing, “I’m a Little Teapot” at the top of my lungs. He was the tiniest, sweetest, greatest thing to happen to my two-and-a-half-year-old life. \nA few years later, I’d be clever enough to replace the words in another favorite nursery rhyme, “Mary Had a Little Lamb,” with my own name and reality, singing, \nMary Kaitlin had a little brother,Had a little brother, had a little brother.Mary Kaitlin had a little brotherWho lived in her house too.\nI taught the song to my classmates, who’d sing it as I paraded through the elementary school carpool line, hand in hand with my little lamb. Some days I still wake up with this tune stuck in my head, rolling over to realize, yet again, the song’s taunting truth: I had a little brother—past tense. He’s gone now. \nIn the days following my brother’s death, the influx of sympathy cards, corn casseroles, news stories, pastoral visits, written obituaries, and floral arrangements all sang in unison, stuck on the same line: “Had a little brother, had a little brother, had a little brother.” \nDeath had stolen my song. \nDuring the funeral, I stood in the first church pew, ready to lace up my red Keds, kick open the sanctuary doors, and go claim my little brother. I decided it wasn’t too late for it to all be a big mistake. I was waiting for Grief to admit it had chosen the wrong family, for Tragedy to apologize, and for Sorrow to pack its bags. It all made more sense that way, because my brother was the kind of guy who’d blush at all this attention and giggle at the amount of formality. Or was he? I was already forgetting. \nMy thoughts are my most unreliable grief companion, with the capacity to be my sweetest advocate or my biggest traitor. Like having a sore muscle, I become afraid to make the next move, knowing that walking through memories has the power to heal, but it also has the power to hurt. \nInside the front door of our childhood home, there’s a piano, the bench cushion worn equally on both sides. Together, my brother and I had written our own rendition of “Heart and Soul”—he on the bass clef, me on the treble. I sit in the same spot now, alone, recalling all of my notes perfectly, the duet only heard in my head. I remember all of his notes too. And I’m reminded that I am still Mary Kaitlin, but I no longer have a little brother who lives in my house too. I feel like the psalmist, pounded by the waves:\n“Deep calls to deep in the roar of your waterfalls; all your breakers and your billows have swept over me. The Lord will send his faithful love by day; his song will be with me in the night— a prayer to the God of my life” (Psalm 42:7–8).\nDeath can steal our song, but it cannot stop us from singing. And while I hold onto the hope of heaven, I am relieved and comforted by remembering God’s faithfulness to me in all things, right now.\nWhen I hear one of our old songs, sometimes I listen, and other times I don’t. But when I’m feeling brave, I begin to mouth the words of that childhood song about my little brother, and I’m reminded of the true root of my grief: love. And that’s something I’ll never forget. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Ecclesiastes 3:1, Ecclesiastes 3:4",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Focusing on the first part of verse 4, ask the Holy Spirit for the freedom to weep and to laugh in every season of your life. \nEcclesiastes 3:1,4:There is an occasion for everything,and a time for every activity under heaven:\na time to weep and a time to laugh; a time to mourn and a time to dance \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-6-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "John 16:20",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nThis week, we’re committing to memory this profound promise from Jesus to His disciples. \n“I assure you: You will weep and wail, but the world will rejoice. You will become sorrowful, but your sorrow will turn to joy.” —John 16:20\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Lockscreen-7-576x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Psalm 22:24, John 11:28-44, 1 Thessalonians 4:13-18, Matthew 11:28, Romans 12:12-15, Hebrews 10:24-25, 2 Corinthians 1:3-7",
        "devo_title": "Weeping and Rejoicing with Others",
        "devo_summary": "\nBY Claire Gibson\n\nI stood with the other guests, sandals planted in the grass, finger pressed to the top of a can of Silly String, waiting in anticipation to see what emerged from the tip of the spout. Blue or pink? Blue or pink? \nTime and time again for the previous eighteen months, my husband and I had experienced a similar suspense in the privacy of our own home, waiting for the results. One line or two? One line or two? But there were no shouts of joy or photos taken. No blue Silly String raining down on our heads. Just the sound of plastic hitting the bottom of a trash can as another month closed on our dreams. \nAs our friends learned they would soon welcome a baby boy, I grabbed my husband’s hand and dragged him through their master bedroom, bathroom, and into the closet—not totally weird, since this particular gender reveal also doubled as a housewarming party. The place still smelled like paint. In my friends’ walk-in closet, shoes lined shelves on the left and right, all in perfect rows. Without warning, I began to sob, crumbling into my husband’s shoulder, laughing and crying at the same time as I realized I wanted everything they have.\nI’m not sure I know how to weep with those who weep and rejoice with those who rejoice. All too often, I do it all backwards, because this life is really, really hard, and I’m just barely keeping it together. I find I’m detached when others weep, never quite sure what to say or how to make it better. And I’m sad to say I’m jealous when others rejoice, disappointed with my own circumstances. \nI’m even worse with my own pain, minimizing it because I don’t want to burden other people. Downplaying my successes because I don’t want to seem vain or selfish. And God’s call to walk alongside others in their deepest sorrow and joy seems almost impossible (Romans 12:12–15). So for better or for worse, I fake it the best I can, hoping that someday my feelings will catch up to my actions.\nBut I think God wants so much more than for me to ignore my emotions. And He is most definitely not asking me to “fake it ‘til I make it.” He’s calling me to real emotion—to the odd, uncomfortable reality of holding grief and joy at the same time, without minimizing either experience, naming the good, the bad, and the ugly. This means allowing myself to feel the depth of my pain, so that, when the time comes, I will know what it means to grieve with my friends. \nBeing honest and vulnerable with our emotions isn’t easy. But ultimately, if we are real with Him—and with each other—every grief and every joy can transform into a glimpse of redemption. If I let it happen, every affliction can give me a greater capacity to care for and understand someone else’s pain. Every joy I allow myself to fully experience can give me a greater capacity to dance at someone else’s wedding.\nIn 2017, we brought home our son through adoption; we are writing a new story from many broken pieces. And yet, our journey with infertility is not over. Our bodies still don’t do what others can. But I’m learning that Christ is the ultimate empathizer. No one weeps with us and rejoices with us like He does. “For as the sufferings of Christ overflow to us, so our comfort overflows through Christ” (2 Corinthians 1:5). \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Mark 2:17, Mark 1:40-42, 2 Corinthians 12:5-10, Psalm 34:19, Psalm 147:3, Matthew 14:14, 1 Peter 2:24, 2 Corinthians 4:7-18",
        "devo_title": "Affliction and Healing",
        "devo_summary": "\nBY Guest Writer\n\nLifting the hammer up with both hands, I knocked the shelf loose from its fixed position. My screams had become muffled by the sobs caught in my throat, but through shallow breaths and clenched teeth, I made my complaints known and laid into Him.\nI want my babies! Where are they? Why do You give them to me if You’re only going to take them away?\nAfter our first miscarriage, I wept as I painted our bedroom walls, covering up the sunny yellow and replacing it with a controlled, subdued neutral. The linen closet received a welcome facelift and my wardrobe was purged, streamlined to a more manageable system for daily use. After years of unexplained infertility, I was told to be happy I’d gotten pregnant in the first place. Chin up, Buttercup. Let’s soldier on.\nBut this second miscarriage, four months later, was different. I felt utterly unhinged, untethered to anything. Forgotten. And so I drifted violently across the kitchen floor, from cabinet to cabinet and shelf to shelf, re-organizing and reordering, wielding a hammer and railing on my Maker.\nYears passed, and I grew numb. Empty. And very sick, it turns out. I found myself in a neurologist’s office with a diagnosis of multiple sclerosis. What’s more, my doctor discovered an anomaly in my blood work. An autoimmune disease and now an antibody—the doctor believed that together, they’d caused me to miscarry.\nHe may have been right. Three months into being on my MS meds, and without trying, I became pregnant with identical twin girls. I laughed out loud as my obstetrician pointed out two fluttering heartbeats on the ultrasound. I laughed, and I promise you, I heard Him laugh too.\nPain, loss, and affliction—I know them well. We all do because they’re a promised byproduct of life here in a fallen world (John 16:33). They come tangled up with joy and abundance and blessing. I’ve tried to extricate the good from the seemingly bad, but to no avail. They’re a packaged deal.\nSo while my dream of having children has been realized, and then some, I still have multiple sclerosis. Now, being well enough to keep up with our girls the way I’d always imagined is a struggle, a deep shame I do battle with daily.\nThis is my Ebenezer: my affliction, healing, and blessing bound together in a monument to Him and for His glory (Genesis 35:14; 1 Samuel 7:3–12). It’s here that I’ve wrestled with my God and have come to know Him face to face. I cannot praise Him and thank Him for our girls without praising and thanking Him for my diagnosis of MS. Learning to do so will no doubt take a lifetime. \nHe’s chosen to weave great joy into deep sorrow. This forces me to wonder if my affliction and physical limitations are somehow God’s kindness to me (2 Corinthians 12:5–10)—constant reminders that my body, this temporal world, and everything in it are fading away. Meanwhile, the eternal wages on, refreshed and renewed, out in the open air and light of His presence. “Therefore we do not give up. Even though our outer person is being destroyed, our inner person is being renewed day by day” (2 Corinthians 4:16).\n\nKara Gause is a content editor for She Reads Truth, happily residing with her family in Nashville, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Genesis 3:17-19, Ecclesiastes 2:18-26, Romans 8:19-23, Ecclesiastes 9:9-10, 1 Corinthians 10:31, Colossians 3:23, Philippians 2:12-16",
        "devo_title": "Fallen and Redeemed Work",
        "devo_summary": "\nBY Lore Ferguson Wilbert\n\nI was once a well-oiled working machine, churning out articles, speaking at conferences, ministering within my capacity and out of my weaknesses and strengths. While I’d never envisioned myself as an unmarried woman, I found fullness and contentment in the plot God had given me to tend.\nThen I got married. And moved. And moved again. I’m no longer in my home, or church, or comfort zone. I still don’t really know anyone here, and we haven’t found a local church home in the D.C. area yet. We feel displaced.\nMeanwhile, all the work that’s been done in me and through me is suddenly no longer for me. I can’t write about singleness anymore. I’ve begun to see others picking up the banner I laid down for the gift of marriage—and I’ve resented myself for losing it. My heart echoes King Solomon’s words: \n“I hated all my work that I labored at under the sun because I must leave it to the one who comes after me. And who knows whether he will be wise or a fool? Yet he will take over all my work that I labored at skillfully under the sun. This too is futile” (Ecclesiastes 2:18–19).\nThere is this sadness in me that I cannot shake. The earthly identity I worked hard to build, and tried my best to bear faithfully, is no longer mine to carry. Those days of fruitful ministry feel very far behind me across the chasm of this difficult year. The enemy loves to taunt me, to tell me I’ve wasted and been wasted, that all those words and thoughts are now lost. It’s hard to trust that my previous work has not been done in vain, though I know it was never mine to begin with. It was always His. \nI dreamt of this time for years, didn’t I? I longed to be married. Why then is it so hard to reconcile the work I once did with the work I’m called to now? I agonize over how to spend the eleven-hour days stretching from the still-dark hours through sunset when my husband returns. I sweep the kitchen floor, wash the towels, and put fresh flowers in the vase, growing weary and resentful of all I’ve lost, straining to remember that I’ve also gained. Happy as my husband and I are together, happy as I am to be called his wife, this place in life is still not our true home. It isn’t supposed to be. \nToday I do four loads of laundry. I sweep the kitchen floor. I write. I text Nate and our friends to tell them I love them, that I’m praying for them. I heed King Solomon’s words: “Whatever your hands find to do, do with all your strength” (Ecclesiastes 9:10). But in my struggle as a new stay-at-home wife, I remember that work is still work, no matter the title, no matter how blessed. God explained this to Adam at the fall, that the work of his hands would be hard from then on (Genesis 3:17). And it still is, for all of us. It will be until the day in Glory when pain in all its forms is no more (Revelation 21:4). \nSometimes the days drag on, the work feels endless. I can’t sort through the mountain of to-dos quickly enough, and yet it feels like I’m searching for things to do with my hands. But this is the plot to which I am called today: this home, this house, this husband. It is a life both better and harder than I imagined, and it’s being redeemed by God with every light and heavy step along the way. “For it is God who is working in [us] both to will and to work according to his good purpose” (Philippians 2:13).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-10-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Deuteronomy 16:19, Psalm 94:1-23, Hebrews 13:3, Isaiah 1:17, Psalm 68:4-10, Matthew 5:13-16, Proverbs 29:7",
        "devo_title": "Injustice and Justice",
        "devo_summary": "\nBY Guest Writer\n\nSome moments have a ripple effect. As a thrown stone breaks the glassy surface of water causing rings to swell and radiate to the shore, some moments break through us and the ripples radiate for days, months, even a lifetime.\nYears ago, a distinguished professor who’d been visiting our church agreed to come lead our small group for the evening. I don’t remember his initial topic that night, but as we lingered in conversation, the discussion soon turned to his travels, specifically his time in India. Tears filled his eyes as he recounted the crushing poverty and mind-boggling crowds of men and women and their children, begging in the streets all around him. His voice trembled as he described the enormity of human suffering he’d witnessed there. The heartbreaking stories he shared left mental images of miles of poverty and millions of suffering souls.\nAfter the meeting, I pulled the professor aside and confessed how utterly overwhelmed I was after hearing his stories. I shared how I’d been strangely burdened by the concept of suffering since I was a young girl. “How can this be?” I asked him. “Where is God in the midst of all this? And how on earth can we even begin to enter in and respond to such enormous injustice and suffering?”\nThe mild-mannered, soft-spoken professor snapped his head toward me, his eyes piercing and focused. “No,” he declared. “Being overwhelmed by suffering is no excuse for doing nothing.” He explained that there will always be more need than we can meet. But that does not mean we aren’t called to enter in and do the things we are able to do right now. His words landed hard. They felt like a rebuke because they were. To be paralyzed by the harsh reality of suffering, to be stuck inwardly condemning global injustice while doing nothing to alleviate it, is not an option God gives us.\nGod doesn’t sugarcoat the pain and brokenness of the world. He calls out evil, suffering, and injustice (Proverbs 6:16–19). He shines a light on those who are lonely, abandoned, oppressed, and poor (James 1:27). He knows the desperation, the dire circumstances, and the darkness we encounter, both in global proportions and in our most intimate and personal daily struggles (Psalm 139:12). Our God knows we need rescue. And Christ scandalously declares, \n“The Spirit of the Lord is on me,  because He has anointed me to preach good news to the poor.  He has sent me to proclaim freedom for the prisoners  and recovery of sight for the blind,  to release the oppressed,  to proclaim the year of the Lord’s favor.”  – Luke 4:18–19\nBecause He has solidarity with us, we can offer solidarity to the hurting.Because He defends us, we can defend others.Because He is our ultimate Judge, we can fight for justice.Because He is our hope, we can hold on to hope for ourselves and extend it to others.\nChrist entered in to rescue us. And the ripple effect of that rescue goes on and on. Thanks be to God alone.\n\nPatti Sauls lives in Nashville, Tennessee, with her husband Scott and daughters, Abby and Ellie, where they serve alongside the people of Christ Presbyterian Church. Prior to living in Nashville, the Sauls planted churches in Kansas City and Saint Louis and served at New York City’s Redeemer Presbyterian Church. A trained speech therapist, Patti also enjoys serving behind the scenes, hiking with friends, and reading good books.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-11-text-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Psalm 46:10, Lamentations 3:25-28, Mark 6:30-32, Matthew 11:25-30, Hebrews 10:23-25, Psalm 133:1, Matthew 18:20, Romans 12:4-5, Romans 12:15-19",
        "devo_title": "Solitude and Community",
        "devo_summary": "\nBY Rebecca Faires\n\nI didn’t adopt because I wanted to make orphans miserable. But in the bumpy jostle of daily family life, between Don’t wake the baby! and Everyone get in bed!, I feel like I’m failing. We pursued adoption because we wanted to help—we wanted to make the world a better place, to shine the light of the gospel. But I didn’t know I would need to shine the light of the gospel at 5am, every day, for so many years. In the process, my flashlight has grown dull and weak.\nEvery day, my husband and I feel the pendulum swing between the tension of Christ’s invitation to “come away by yourselves to a remote place and rest for a while,” and His admonition to “meet together” in fellowship (Mark 6:31; Hebrews 10:25). After one too many family activities ending in disaster, we’ve learned to let our wounds heal in private and decline the next dinner invitation. \nAdoptive parenting has been the most difficult task of my life. It’s been astonishingly isolating, because from the outside, we look like an adorable, bustling, young family. But underneath, I’m clenching my teeth, waiting for the shoe to drop and the next terrible thing to happen. During this season, we’ve felt the tension of pulling out of community activities, playdates, dinners, and visits with family. And I fear that folks won’t understand we are dealing with more than just a case of the wiggles.\nBut in pulling away from community, we miss out on the real, loving, encouragement and affirmation we need from our people. We imagine disapproval in their eyes and judgment on their brows. Again and again, I have wanted to hide our messy family life because I am sure no one will understand. \nOne May day just a few years ago, my very, very cute adopted son was singing—with perfect pitch—a Christmas song, while I stood in the checkout line at Goodwill. He has a face like a chipmunk and a voice like a chorister, and he knows it. He’d been singing that song for weeks, and now he was shining his face around to draw the attention and approval of the other adults standing nearby. His endless fishing for applause from strangers touches on my fear that he’s still not quite settled on us as his parents; he’s still interviewing for the position. \nAlthough we can never erase the brokenness that led to his birth parents’ inability to raise him, we are the parents that God has given him. In spite of my commitment to love him, his singing was exhausting and painful at the end of a draining day—on top of six wearying years. For me, his song felt like a jarring syncopation, rattling out the death of my dreams. I asked him to stop singing.\nAt my left elbow, a woman snorted and leaned away from me. “That sweet little boy wasn’t hurting anything. You should know better than to stop him from singing!” she admonished, shaking her head and looking away. I felt my tired shoulders slump lower, even more resolved to hide our troubled story.\nAnd we have found relief and safety in solitude. We’ve been able to rally our forces and find heart for the next fight. But pulling away from community robs us of its gifts, and neglecting solitude robs us of its replenishing powers.\nSo we live in the in-between tension of the two. We live like a child on a swing, swaying out a little further and retreating a little further, learning to trust our community and learning to accept the peace of solitude.The further we venture out, the deeper we need to retreat afterward. We don’t have an easy solution, but I am sure about which direction to look for hope. “Come to Me, all of you who are weary and burdened, and I will give you rest,” Jesus says (Matthew 11:28). But in this in-between, our hearts are broken every single day. We are rejected and we are befriended. We are lonely and we are loved.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-12-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "Ecclesiastes 3:1, Ecclesiastes 3:4",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. Focusing on the second part of verse 4, ask the Holy Spirit for the freedom to mourn and dance in every season of your life. \nEcclesiastes 3:1, 4:\nThere is an occasion for everything,and a time for every activity under heaven:\na time to weep and a time to laugh; a time to mourn and a time to dance \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Instagram-13-1024x1024.jpg"
    },
    {
        "book_title": "Mourning and Dancing",
        "devo_passages": "1 Corinthians 10:31",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nThis week, we are memorizing this reminder from the Apostle Paul that we can worship God in every situation—big and small, in joy and in sorrow.\n“Therefore, whether you eat or drink, or whatever you do, do everything for God’s glory.” —1 Corinthians 10:31\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us? \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-MourningAndDancing-Lockscreen-14-576x1024.jpg"
    },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Genesis 3:1-24, Psalm 51:1-19, Psalm 16:11",
    "devo_title": "Our Need for Home",
    "devo_summary": "\nBY Andrea Lucado\n\nI’ve lived in 17 different homes during my 32 years of life, counting every dorm room and short-term apartment. From a young age, I’ve attempted to nest in each one. In eighth grade, I painted my room lime green. In college, I carefully picked out every accessory for my dorm room. In my adult life I’ve nested hard, spending weeks and months picking out furniture, arranging and rearranging gallery walls until everything was just right. It’s not that I’m a brilliant interior decorator (lime green, remember?); I just want each place I live in to feel like a home.\nWe may express it differently, but we all long for home. We have an innate desire to be where we belong—or to belong where we are. I wonder if this longing can be traced back to Adam and Eve when they lost their home, banished from the Garden of Eden for good.\nFor their entire existence, Adam and Eve had operated one way within in the garden. Naked and free, they had no shame or fear. They were at one with God. Then in a moment, everything changed, and “the eyes of both of them were opened” (Genesis 3:7). Suddenly, Adam and Eve were aware of their nakedness. They were afraid of God and ashamed to be seen by Him. When they left the garden that day, they lost more than their home; they lost themselves too.\nI wonder if at the root of our desire to know where we belong is the desire to know who we are. Not only do we crave a return to Eden, but a return to who we were within Eden: unashamed, free, in communion with our God. Now we are as David laments, “guilty when I was born… sinful when my mother conceived me” (Psalm 51:5).\nWe have an opportunity during this Easter season to grieve the loss of Eden and the loss of innocence. We can sit and contemplate our desire for home and belonging, place and identity. We do so with pain and sadness, but also with expectancy and hope.\nIn our quests for home, we need look no further than what we celebrate during Easter—an empty tomb. That is where our identities changed from sinful to righteous, from banished to welcome. When I know who I am in Christ, I always know where I belong. I always know where home is—in Him.\nSo this season we grieve and we celebrate. We are banished no more, guilty no more. We are ashamed no more because of Christ, the cross, and a tomb that lay empty. Let’s rejoice in Christ, the joy of our salvation. And let us give thanks to God who has revealed “the path of life to me,” the path leading home (Psalm 16:11).\n\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day1.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Genesis 6:11-22, Genesis 8:13-22, Isaiah 54:1-10",
    "devo_title": "Our Need for a Savior",
    "devo_summary": "\nBY Claire Gibson\n\nBack in college, I was still of the mindset that if I behaved and performed well, God would reward me accordingly. And because I did the “right” things and got good grades, I assumed my post-college life would be smooth sailing. I expected that once graduation rolled around, I’d have a big plan—a big job—something I could tell people that would make their eyebrows go up an inch, showing that they were impressed.\nBut by March of my senior year, with just a couple months until the end of the semester and graduation looming, I still had no plans. The country was facing a recession. I had no job. No prospects. And I was angry at God, frustrated that I had no direction for the future, and convinced He had forgotten me. Slowly, my heart began to rebel against God, growing cold and guarded. I didn’t believe He cared about me, and so I withdrew from Him. In anger, I did all the things I knew in my heart weren’t His best for me. I would call them mistakes, except my actions were entirely intentional. I ran directly toward sin, only to end up feeling burned and ashamed.\nThe good news of Christ is so good because the bad news is so bad. And what’s the bad news? Not much has changed since the time of Noah. In Mark 7:21, Jesus told a crowd that what defiles a person isn’t from the outside, but what comes from the heart. All you have to do is turn on the news to see that evil still reigns in this world. But the worst of us comes from within. I have extreme memories that remind me of my wayward heart. I also have daily decisions, moments when I put aside my devotion to Christ and serve my whims, appetites, and desires.\nMy heart is a place of longing, doubt, and restlessness. I seek out quick comfort and distraction long before I seek God’s counsel and righteousness. I need a Savior, not to save me from sin out there. I need a Savior to save me from myself. The flood isn’t the world of other people. The most dangerous flood is the faithlessness of my heart. I need an ark. A hiding place. A safe haven from the deluge of my own desire and rebellion that would take me far from God.\nGod has given me such a Savior.\nThere is nothing I can do to remove His love from me. The door to the ark is always open. The covenant will not change. The destruction I deserve is not coming for me. “Though the mountains move and the hills shake, [His] love will not be removed from [us]” (Isaiah 54:10).\nThe good news is so good: Jesus is far better than any wooden boat that spares my life from external destruction. Jesus provides shelter and safety when the floodwaters of my own disobedience have risen too high for me to see. He takes me up in His arms and tells me there is no condemnation. Nothing can separate me from His love. Not even me.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day2.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Genesis 22:1-19, Hebrews 11:17-19, Daniel 12:2-3",
    "devo_title": "Our Need for Resurrection",
    "devo_summary": "\nBY Rebecca Faires\n\nThe binding of Isaac breaks my heart every time I read it. I subconsciously swap myself for Abraham and replace Isaac with my beloved firstborn son, and suddenly the story hurts in a real and visceral way. (Did you do this when you read the passage?) Each physical hurdle becomes agonizing—the saddling of the donkey, the splitting of the wood, the long walk uphill, and finally, the binding up of a beloved boy. The whole agonizing ordeal truly begs the question: How did Abraham do it? How did he make it through all the steps up to the very point of raising a knife over his promised and beloved son?\nChillingly, child sacrifice has a long, established history in many cultures, including that of Mesopotamia. Abraham was from Ur (Genesis 11:31), and so he would have been familiar with the sacrifice of a child to prove devotion to a god. Similarly, the Canaanites worshipped Molech, the false god most famous for demanding child sacrifice. The idea behind the sacrifice was this: If you are willing to sacrifice the person most precious to you—and for parents, nothing could be more precious to us than our children—then you could prove your devotion to your god. Abraham had certainly encountered this kind of demand before with regard to other cultural gods.\nSecond, Abraham trusted God. He trusted that “I AM” was not just another Baal or Molech. Abraham believed that God was the one true God, and he cherished the profound hope that “I AM” was different. Abraham had such trust that he reasoned God would provide for a miraculous resurrection to save Isaac, if that’s what it took (Hebrews 11:19). He even told Isaac, “God himself will provide the lamb for the burnt offering, my son” (Genesis 22:8).\nFor both these reasons, we find Abraham shuddering with a knife raised over that which is most precious to Him. And we find ourselves standing right beside him, surveying the hopelessness of our station. We are dead in our trespasses, we live under a curse, and we have no hope of satisfying the chasm of debt that we owe. Indeed, the consequence of our sin is death (Romans 6:23).\nWe need a God who can raise the dead (Matthew 10:8). We need a God who has the power to undo the curse (Romans 8:2). And our God has promised and proven that He can and will do both. Our God does not demand child sacrifice—He abhors it! After all, He knits together our children and treasures them because they are His very own. We don’t need a false god with a lust for flesh and a desire for pain. Rather, we worship the one true God, who preserves, protects, loves, and cherishes us and our children. Hallelujah!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day3-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Exodus 32:1-14, Exodus 32:30-35, Acts 7:37-43, Jeremiah 31:31-34",
    "devo_title": "Our Need for a Mediator",
    "devo_summary": "\nBY Erin Davis\n\nLet’s face it, when the Lord called the Israelites “stiff-necked,” He was being kind.\nOn their best days, they were whiney, rebellious, fearful, and contentious. And this particular day we’re reading about was definitely not one of their best. \nWith metal they’d pillaged from their enemies (Exodus 12:35), they fashioned a statue of a calf and convinced themselves that the idol was the Lord Himself, the one who had delivered them from slavery in Egypt. \nIt’s okay to shake your head. Their error was preposterous. In hindsight, I suppose it’s obvious that rebellion against a loving and sovereign God always is. No wonder God declared, “Now leave me alone, so that my anger can burn against them and I can destroy them” (32:10). \nThis was the nation that had seen God send plagues to torment their oppressors. These were the ones who had walked across the Red Sea on dry ground. These were God’s chosen people, those who had tasted the manna He’d rained from heaven. And still, as soon as their leader was out of earshot, they turned their adoration toward a weaker god—one who could never save them. God’s wrath was surely justified.\nGod is holy.  His people were unholy. \nHe is generous.  They were greedy. \nHe is faithful.  They were faithless.\nHe showcased His power.  They bowed before a powerless statue instead. \nWe’ve all bowed before the wrong altars. Who will plead our cause? We cannot shake our sin nature. Who will defend our case? We are the rebellious children of a holy, holy, holy God. Who will stay His hand?\nThis moment in Israel’s history allows us to peek at the glory of the gospel. In pleading with the Lord to spare the Israelites, Moses was pointing forward to Christ, who right now—right this very minute—is our advocate, standing between our sin and the punishment we rightly deserve (Romans 8:34). We remain God’s beloved, yet rebellious, children—our hearts ever turning toward all that glitters. Even so, God’s wrath is stayed because there is One who pleads for us even now. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day4-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "2 Samuel 7:1-17, 1 Chronicles 28:1-8, Isaiah 33:22, Jeremiah 23:5-6",
    "devo_title": "Our Need for a Righteous King",
    "devo_summary": "\nBY Melanie Rainer\n\nAs an undergrad, I studied political science and economics, and spent more hours than I can count learning, arguing, unlearning, and repositioning my political compass. But after four years of study, it was clear to me that there is no perfect form of government, no flawless ideology or leader. \nAnd yet, I find myself wrapped up in the political whirlwind even now. I think, But what if the promises are true? What if this person really can make a difference? What if she or he will make my life easier, my money stretch farther, my kids safer? \nIt is easy to fall into the same trap as the Israelites oh-so long ago. When things get tough, personally or globally, the lure of a strong leader is hard to resist. They must have thought, What if we had a king to protect us from our enemies? What if we had someone who could make us into a strong nation?\nGod gave Israel a king: first Saul, then the great King David, then Solomon. Saul fought for them, David led them, and Solomon dispensed wisdom from his throne. But ultimately, these men failed, as all earthly kings do. This narrative is a rather simple one to unpack: the people asked for a king, God gave them kings, those kings failed, and then God promised to send them the real King, all of which is true, of course. \nBut our need for a king goes back further than Solomon, David, and Saul. It goes back to the garden, when Adam and Eve walked with God and the serpent tempted them with power. Because isn’t that the root of our desire for a king? Power. Power over our enemies, our circumstances, and our future. \nFrom the beginning, God was wiring us for a king and setting the stage for the King of kings. He called Abraham to become the father of a nation. He called Moses and His people to a land. He gave Moses a law rooted in His character, brimming with justice and righteousness. He sent judges to call His people back to Him, to remind them of the boundaries the law provided. And then He gave them earthly kings, men whose résumés were filled with both successes and failures but who, ultimately, could never be the King the people truly needed. \nIn Jeremiah, during the cycle of mostly terrible kings, the prophet wrote on behalf of the Lord: “I will raise up a Righteous Branch… He will reign wisely as king and administer justice and righteousness in the land. In his days Judah will be saved, and Israel will dwell securely. This is the name he will be called: The LORD Is Our Righteousness” (23:5–6). \nThis was the promise, but also the deep desire, God had sown into the hearts of His people. The pieces were there: a people, a land, a just law. But the King was missing, and one day, the King would come. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day5-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Zechariah 12:10",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“Then I will pour out a spirit of grace and prayer on the house of David and the residents of Jerusalem, and they will look at me whom they pierced. They will mourn for him as one mourns for an only child and weep bitterly for him as one weeps for a firstborn.” —Zechariah 12:10\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day6-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Matthew 21:1-11, Zechariah 9:9",
    "devo_title": "Our Savior Comes",
    "devo_summary": "\nBY Amanda Bible Williams\n\nThis morning I drove past the lake near our house, as I always do. Today the spring sun was especially bright, causing me to squint my eyes as the light poured through my driver’s side window. A dense layer of fog covered the water as far as I could see. Gulls danced in and out of the cloud-like mist, some resting still and peaceful on the glassy surface. The sun, the fog, the gulls, the water—the combination stunned me, caught that deep sigh in my chest and held it there a minute. \nIt was the second day in a row the lake looked exactly like this, and both times it brought worship to my lips:\nI praise you, Lord, for you are the Creator God, the maker of the water and the birds, the sun and the mist, and the breath in my lungs. You are God, you are Lord, and I give you all of me today. \nThere was no analyzing my prayer outline or word choice, no time for false pretense or doubt. I’d seen a glimpse of the glory of the Lord, and immediate, unhindered praise felt like the only possible response.\nSpontaneous worship sessions are not new to our Almighty God. Since the making of mankind and the dawn of creation, people and nature have praised Him. On this day recorded in Matthew 21, Jesus rode into Jerusalem on a donkey, and another chorus of praise erupted: \nHosanna to the Son of David!Blessed is he who comes in the nameof the Lord!Hosanna in the highest heaven! (v. 9). \nAs Luke’s Gospel tells it, “the whole crowd of the disciples began to praise God joyfully with a loud voice for all the miracles they had seen” (Luke 19:37). Miracles—plural. Many of them. These people who had been following Jesus had seen evidence that this was not just a man. This man was the Son of God. They had seen glimpses of His glory, and it led them to worship.\nLuke also records that as Jesus rode on toward the gates of Jerusalem that day—toward the death due every single human but Him—He also wept for its brokenness. He cried for those who did not recognize the Messiah in their midst (Luke 19:44). \nThe Savior had come, but they did not know Him.\nAs we enter Holy Week on this Palm Sunday, may we see Jesus for who He is. May we read with clear eyes and open hearts the Gospel account of these days and events that are the foundation of our faith. And may we worship the One at the center of it all.\nBlessed is He who comes in the name of the Lord! Blessed is Jesus, who comes to save us.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/4-Easter-1-576x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Matthew 21:12-17, Mark 14:1-9, 1 John 4:7-10",
    "devo_title": "Our Savior Is Anointed",
    "devo_summary": "\nBY Andrea Lucado\n\nIn today’s reading, Christ is anointed in both word and deed. First, we read about the children in the temple who declare, “Hosanna to the Son of David!” (Matthew 21:15). And then there is the woman in Bethany who anoints Jesus physically, breaking open a jar of perfume and pouring it out on His head (Mark 14:3). Both are beautiful examples of exulting Christ both with our words and with our actions, though not everybody in the story is happy.\nScripture describes the chief priests and scribes as indignant after hearing children call Jesus “Son of David,” a title reserved for the Messiah. And after the woman anoints Christ with perfume, the onlookers are described in the same way—indignant—asking, “Why has this perfume been wasted?” (v.4).\nThe anointing of Christ was an offense and a disruption. For the chief priests and scribes, it represented a disruption to their hierarchy, placing this man Jesus at the top. For those watching the woman spend her most expensive perfume, the anointing seemed irresponsible: Why waste such a precious possession? Additionally, as members of two marginalized and powerless demographics in first-century Judea, a woman and a group of children would not have had the authority to make such claims about a man. The anointing of Christ grated against an otherwise ordered and reasonable existence.\nBut did Jesus come to ensure a reasonable and ordered existence for us all?\nWhen the woman anoints Jesus, He says she is foreshadowing an even greater disruption to society as they knew it. Jesus’s death, burial, and resurrection were about to turn humanity upside-down. The greatest societal disruption of all was still to come, one in which the unclean would be clean and the unrighteous made righteous. \nIf I’m honest, I can be resistant to the Jesus who disrupts my order in the same way He disrupted the temple and the town of Bethany. I can grow very comfortable in the world I’ve created for myself and my place in it. The anointing of Christ, as well as the way He was anointed, tell me my purpose is not to be complacent with the way things are. I am to anoint Christ in word and in deed, following my King and doing His work, even if it pushes social boundaries, even if it prioritizes the wellbeing of the marginalized over my own comfort. This is the work that acts out real love toward one another, not because we are so good at loving, but because we have been so loved.\nThis is my prayer for us today, that our hearts would be set on the anointed Christ. I pray that the sacrificial love we have been shown and given would propel us to love others, so that one day Jesus will look at us and say, “She has done a noble thing for me” (v.6).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day8-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "John 13:1-35, 1 Corinthians 11:23-26",
    "devo_title": "Our Savior Washes Feet",
    "devo_summary": "\nBY Claire Gibson\n\nMy mother sat in the passenger seat, and I was behind the wheel. My eyes glanced at the clock on the dash. Up ahead, a train inched along the track, cutting us off from the road we needed to take. People made reservations a month in advance to get a seat at this restaurant. I knew if we were too late, we’d lose our seats. I couldn’t wait any longer.\nWhipping the car around, I turned onto a side road and tried to find my way to the restaurant by an alternate route. But as I veered to the left, I forgot to check my blind spot. A truck barreled into the back of my car with a loud crunch. We weren’t going fast. No one was hurt. But it was most definitely my fault. I was in such a rush to get to dinner that I put our lives in danger. Thirty minutes later, we made it to the restaurant, and the hostess didn’t even mention the fact that we were late.\nWhen I feel the pinch of time, I rush. Jesus doesn’t. \nWhile reading today’s passages, I was struck by how slow and purposeful Jesus is with His disciples in their final hours together before His arrest. From the beginning of John 13, we’re told Jesus knew it was the end. He knew exactly what was coming. He even knew that Judas would be the one to deliver the deadly kiss. And yet, He doesn’t get up and start rushing around. He doesn’t point fingers or hatch an escape plan. He doesn’t open the Scriptures and start teaching frantically. He doesn’t even complete a few extra miracles, just for good measure. \nIn less than twenty-four hours, Jesus would be hanging on a tree, yet He stops to fill a basin with water. \nIn this moment, Jesus had no agenda to complete before He died, other than to show His disciples love. Putting His own fear aside, He focused solely on the words, actions, and encouragement His brothers needed to hear before He departed. Jesus knelt, took foul-smelling feet in His hands, and wiped them completely clean. (We live in a culture that is dying of thirst for this kind of selfless, slow, real love.) \nIn His last meal on earth, Jesus is my example. He shows me that I do not need to rush. I do not need to check items off my bucket list. I don’t even have to leave the room to do His work. All I have to do is love the people at my particular table. He teaches me that loving well doesn’t always mean teaching—it also means doing. Love means washing feet. It means embracing the foul parts of life. It means listening attentively to my friends and breaking bread, being still, even when every instinct of my heart tells me to run because we’re running out of time. \nThere is no need to rush when God is in control. If my Lord and Savior rested in this truth and served in this way, then He will surely help me do the same (John 13:14–15). Regardless of what appears to be blocking my path or barreling toward me in this life, I can be still and rest in Him. I can speak kindly to those around me. I can serve right now, right where I am. \nDear Lord, give me the strength to fill basins.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day9-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Matthew 26:30-68, Luke 22:55-62, Isaiah 53:7",
    "devo_title": "Our Savior Is Betrayed",
    "devo_summary": "\nBY Rebecca Faires\n\nThe summer I was seventeen, I spent a few weeks house sitting for family friends. The house was beautiful, the owners had cable, and I got to have full independence so, let’s be honest, they were doing me the favor. I was working down the road at a country club in the esteemed dual position of waitress and lifeguard, and after work, sometimes the cool kids wanted to come hang at my house. I definitely did not have permission to bring lifeguards and bartenders back to the house, but I was intoxicated with the independence that only real estate can bring. When the homeowners returned, they found a picture frame upstairs that someone had accidentally broken, and every once in a while, I still feel a little prick of embarrassment due to my betrayal.\nI had one job. But instead of doing it perfectly and responsibly, I did an okay job with a little betrayal along the way. I had watered the plants but failed to protect the house. We like to think that we are so close to getting it just right every time, but then some external factor seems to hold us back from pitching that perfect game. (If only I hadn’t been so young and naive! If only I’d had more time. If only I weren’t so tired.)\nWhat if Judas felt the same way? He was so close to being a great disciple, but he missed the mark because the lure of silver proved too strong. When Judas joined the inner circle, he didn’t do it just so he could betray their leader. \nCertainly the rest of the disciples intended to do a great job of following Jesus. Peter, James, and John wanted to stay awake and wait with Christ while He prayed in the garden. But then they grew tired, their eyes heavy, and every single one of them gave in to sleep.\nIf anyone could come close to showing us an example of perfect righteousness and devotion, surely it would have been Peter; he’s “the rock,” after all (Matthew 16:18). Peter strenuously insisted that he would never make the mistake of betraying Christ, but even his very best intentions were garbage by the time the rooster crowed. If even Peter betrayed Christ in His hour of need, where does that leave us?\nIs it really just external hindrances holding us back, or is it possible that we don’t even understand how desperately we need the gospel? None of our righteousness—even our shiniest stuff—is sufficient. We all have Judas hearts, and even our best intentions are filthy rags. Our betrayals show us that, in big and small ways, our selfish interests are so strong we can’t resist those silver coins or those teenage lifeguards. We are all capable of deep betrayal.\nWhen Judas arrives in the garden to betray Him, Jesus asks, “Friend,… why have you come?” (Matthew 26:50). And He asks us the same question: Why have we come? We come out of our desperate need for a Redeemer. We come with ash smeared on our faces. \nWhether we feel like Judas or like Peter, we need Christ’s grace exactly the same. Even in our betrayals, Christ reaches out to His people with mercy. We are to come for this alone: Christ. We are to come for His perfect righteousness, leaning wholly upon Him, for He is the Messiah, the Son of God, and is now seated at the right hand of Power, and will come again in glory.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day10-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "John 18:28-38, Luke 23:5-16, Matthew 27:15-23, John 19:1-16, Isaiah 50:6-7",
    "devo_title": "Our Savior Is Handed Over",
    "devo_summary": "\nBY Erin Davis\n\nI know the events of Holy Week unfolded more than two thousand years ago. I wasn’t there, and yet, as I prepare my heart for Easter morning, I keep bumping into reflections of myself in the text. \nHere I am in John 18: \nI am the Jews who escorted Jesus to Pilate. They thought they were righteous because they stayed in the front yard, yet convinced themselves their hands weren’t dirty as they handed over an innocent man for the slaughter. How often do I rely on all manner of rules to make me “clean” while willfully rebelling against a holy God? How often is my heart soiled by sin that I ignore because I’ve stuck to some arbitrary list of dos and don’ts?\nI am Pilate. I want to wash my hands of the matter of sin and suffering. Don’t you? Don’t we all? How often do I utter, “What is truth?” when the truth is inconvenient to me? The answer, I’m afraid, is all too often.\nLook, there I am in Luke 23: \nI am the crowds, offended by the ways Jesus interrupts the status quo and upends my paradigms. As He strips me of my comfort and convicts me of my obsession with self, my heart becomes indignant. I want to yell, scream, and stomp my feet.\nI am Herod. I am willing to use Jesus to suit my purposes, to elevate my own power. \nI see myself most clearly in Matthew 27:\nI am Barabbas. There’s no use in trying to deny it. I am a sinner, guilty of violating the holy law of God. Barabbas was a “notorious prisoner” of the Roman government. Without Christ, I am a prisoner to my sin. I deserve whatever punishment God could hurl at me, but He takes my place instead. Because of Him, I walk in undeserved freedom. \nFriend, I know you are these things too. We all are. \nWe are prone to value rules over righteousness. We are capable of distancing ourselves from inconvenient truth. We are irritated by the ways that following Christ can stir up trouble for us in this world, yet more than okay with using Him to elevate ourselves in the eyes of other believers. We are guilty of sin—undeniably so—and are so often imprisoned because of it. And we are as responsible for sending Jesus to the cross as the crowds who yelled, “Crucify him!”\nBut there is none like Him. Amen? His grace and mercy transcend time and geography. His actions on Holy Week have the power to save us just as much as they have the power to save the ones who lined the streets to see Him punished. Go on, see yourself in the story. Feel the sting of your sin. But let your eyes move quickly to Jesus, who willingly took our place so that we might be a people who walk in undeserved freedom. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day11-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Mark 15:20-22, John 19:19-22, Luke 23:32-43, Matthew 27:45-54, John 19:38-42, Isaiah 53:12",
    "devo_title": "Our Savior Is Crucified",
    "devo_summary": "\nBY Melanie Rainer\n\nThis is it. \nThis is the question and answer, the moment, the hinge upon which all of history sits. \nDid Jesus, fully man and fully God, die on the cross, not just as a Jewish rebel and teacher in ancient Rome, but as the promised Messiah and Savior of all humanity? Did He?\nDo you believe it? \nDo I?\nI have a very vivid memory of standing in the emerald-green-tiled shower of our charmingly dilapidated St. Louis apartment, a year and a half into seminary, water washing over me and tears rushing down my face. I asked myself, “Do you really believe this is true? Do you?” The questions, the concepts, and the reordering of my heart and mind were almost too much. \nI have an equally vivid memory of driving to Target the afternoon our little friend-family experienced unspeakable tragedy, and of whisper-screaming with every breath I took, saying, “Jesus, be real. Jesus, BE REAL. Jesus, please be real.”  \nI have just as many if not more moments of deep assurance, of knowing Christ to be true. I resonate with John Wesley’s words describing his own faith: “I felt my heart strangely warmed. I felt I did trust in Christ, Christ alone for salvation; and an assurance was given me that He had taken away my sins, even mine, and saved me from the law of sin and death.”\nAll this makes me wonder, reflecting on today’s Scripture, how many people who were there at Christ’s crucifixion found themselves feeling the terror of unbelief? And who felt the sweet, blessed assurance of faith? What would it have been like to be a witness to this moment, to believe that all the promises of the ages were coming true? Or to be a blind witness, without faith, and to feel nothing more for Jesus than for the criminals who hung next to Him? \nThe terror of unbelief settled on Peter, who denied Jesus three times. Disbelief motivated the scoffing Jewish leaders, and the insulting criminal on the cross. It led Pilate to apathy.\nBut the repentant thief on the cross next to Jesus believed. The centurion gasped at the sudden darkness and knew this was not just another prisoner hanging nearby. \nJoseph and Nicodemus believed, and acted in faith to care for the broken body of the Son of God. Chapters earlier we read that Nicodemus, a pharisee, wasn’t sure if he believed in Jesus; but in today’s reading, we suddenly find him doing the humiliating work of preparing the Lord’s dead body for burial—work typically reserved for women and slaves. Nicodemus knew it was all true.\nThis is it. And it is all true. \nIt is true on the days I am blindsided by the terror of unbelief. And it is true on the days I feel it doubtlessly in every bone and blood cell in my body. \nMy Good Friday prayer, in this between-Friday-and-Sunday life that we live, is that I will always remember and proclaim, “Truly, this man is the Son of God” (Matthew 27:54). \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day12-2-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Isaiah 53:4-6",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n4 Yet he himself bore our sicknesses, and he carried our pains; but we in turn regarded him stricken, struck down by God, and afflicted. 5 But he was pierced because of our rebellion, crushed because of our iniquities; punishment for our peace was on him, and we are healed by his wounds. 6 We all went astray like sheep; we all have turned to our own way; and the LORD has punished him for the iniquity of us all. —Isaiah 53:4–6\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day13-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Matthew 28:1-6",
    "devo_title": "Our Savior’s Empty Tomb",
    "devo_summary": "\nBY She Reads Truth\n\nHe is risen! Join us in reading this brief account of the empty tomb from Matthew 28. Save the image below as the lock screen for your phone so you can be reminded that everything has changed because of Jesus’s resurrection. \nHallelujah! The gospel is true!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day14-819x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "John 20:3-29, 1 Peter 1:8-12",
    "devo_title": "Our Savior’s Nail-Scarred Hands",
    "devo_summary": "\nBY Andrea Lucado\n\nAs a serial doubter, I have always loved the resurrection story and its honest portrayal of who was quick to believe Jesus was the risen Christ and who was more skeptical. Historically, I have been more like Thomas, wanting proof and evidence: “If I don’t see the mark of the nails in his hands, put my finger into the mark, and put my hand into his side, I will never believe” (John 20:25).\nMary Magdalene’s reaction to the risen Christ differed from that of Thomas. She believed as soon as Jesus spoke her name. “Rabboni!” she cried in recognition (v.16). And later when she saw the disciples, she said with confidence, “I have seen the Lord!” (v.18).\nThomas trusted Jesus’s scars. Mary trusted Jesus’s voice.\nIn my early twenties, I went through a dark season of doubt. Out in the real world for the first time, surrounded by people who did not believe in Christianity, much less God, I was suddenly very unsure of my own beliefs. I desperately wanted to prove God’s existence to my unbelieving friends—and to myself. So I searched for answers in apologetics, academics, and science, confident that if I could pull enough evidence together, I could believe again, and my friends would too.\nDuring that youthful season, it was not the hard evidence of academics and apologetics that I grew to trust and understand. Ultimately, what pulled me back to faith was this: At some point in my life I had known the risen Christ. I had felt the love of God through Him. I had experienced grace and forgiveness. I was not sure how to prove the existence of God through science, but I could not deny that I had experienced the risen Christ. I had heard Him say my name.\nThis is not to say investigating our faith is fruitless. After all, Jesus did not chastise Thomas for asking for proof. He gave it to him, saying, “Put your finger here and look at my hands. Reach out your hand and put it into my side. Don’t be faithless, but believe” (John 20:27). But even today, when I find myself wrestling with questions about God, the Bible, Jesus, or religion, what I return to is not the evidence I’ve gathered, proving His existence. What I remember is the fact that Jesus has touched my life, and I have seen the marks on it as a result. \nWhen the doubt is crippling, when the road before us is unclear, may we remember this day near the tomb. Mary Magdalene thought she had lost her friend, her teacher, her Rabbi. All was sorrow before and around her—and then, she heard Him speak her name. Have you heard Him speak yours?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day15-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Luke 24:9-49, Acts 13:32-38",
    "devo_title": "Our Savior on the Emmaus Road",
    "devo_summary": "\nBY Claire Gibson\n\nWhat would you do if you wanted to start a revolution? If you wanted to prove that you were the most powerful person to ever walk the earth? If you wanted to prove that you had in fact just been raised from the dead? What would you do first?\nI think I would shoot fireworks from my fingertips. Or maybe go to the people who had tried to kill me, and show them I was alive once again. I think I’d go flying around in the sky shouting from the rooftops. \nThese final few verses were Luke’s last chance to convince readers that Jesus really did rise from the dead. That He really is the Son of God. As a writer, I cannot fathom a more challenging task. But Luke made a decision. He decided to stick to the facts, and the facts are mind-bogglingly simple. \nFirst, the women. A group of women find the empty tomb and return to their friends babbling in an excited confusion. This in itself should convince us of the veracity of this story. After all, in the first century, women were considered unreliable witnesses; their testimony wasn’t even permitted in a court of law. Tim Keller writes: “If the Christians were making up these stories to get their movement off the ground, they never would have written women into the story as the first eyewitnesses to Jesus’s empty tomb. The only possible reason for the presence of women in these accounts is that they really were present and reported what they saw.”\nSecond, the walk. While Peter runs to the tomb to determine if what the women said is true, Jesus goes on a walk. Oh, how I love this story! Two disciples I’ve never heard of—Cleopas and a disciple who goes unnamed—are walking and talking, processing recent events, when this stranger sidles up next to them. They recount all the events of the week: “How have you not heard about this?!” And then, still under the guise of a stranger, Jesus begins to teach from the Scriptures, starting from Genesis 1:1. Jesus loves Scripture. He knows it—He is the Word made flesh, after all (John 1:14)—and His teaching sets their hearts aflame. They have a simple meal together, and then just as quickly as He appeared to them, Jesus was gone. \nThen, His words. Jesus’s first resurrected words to His gathered disciples were, “Peace be with you” (John 20:21). He knows they are terrified, full of doubt. And again, His first action in their presence is not to perform a miracle, but to perform the mundane. He invites them to touch Him, to see His hands and feet. He takes a bite of fish—at face value, an act not of divine power as much as simple human digestion. He then goes on to bless them and remind them of the meaning of the Scriptures, of what’s true. There is no rush. No hurry. In other words, Jesus acts in resurrection exactly as He had in life. Nothing has changed, and yet absolutely everything has. \nJesus is alive! He really is. And for that reason, I can trust that the rest of my life here on earth is but a shadow of what is to come. Jesus did not hustle. He did not worry. He did not feel threatened by doubt. He simply held up His hands and said, “Here… touch.” He walked alongside His friends, and He walks with you and me, too—even if we do not recognize Him at first. \n“The Lord has truly been raised” (Luke 24:34), and we are not the same. So go babble excitedly like the women that first Easter morning. Run to the empty tomb like Peter. Walk at a leisurely pace with your God. Invite Him to teach you through His Word. Break bread. Take a bite of fish. Everything is different now, even the seemingly mundane. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day16-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "John 21:1-19, 2 Peter 1:3-15",
    "devo_title": "Our Savior Restores",
    "devo_summary": "\nBY Rebecca Faires\n\nI get hungry every time I read the Gospels. So much eating! So much cooking and drinking—the clanking of plates and the clinking of cups veritably rings off the pages! Remember when Jesus departed from the disciples to face the cross? He did so with a parting meal. When He came to them again, resurrected, He served them breakfast on the beach. It’s hard to imagine literally anything better than breakfast on the beach—two of the best things in life all at once.\nAt other meals, both metaphorically and with real bread, Jesus is continually feeding His sheep, because He is the Good Shepherd. He reminds us that He is the bread of life and no other food will ultimately satisfy. And when He feeds us, He is teaching us what the kingdom of heaven looks like.\nHis kingdom is not of this world, and man does not live by bread alone. But Christ is also the Christ of feasts. He feeds every part of us, body and soul. And when He asks Peter, “Do you love me?” He follows with this: “Feed my sheep” (John 21:17). \nHe asks us the same question: “Do you love me?” If so, then you also will have a heart for the flock. Others will know we are His disciples in this way, that we love one another, we feed one another, and we share with one another the true and living bread of life—as well as the bread broken together at our own dining room tables.\nThe beckoning call of the kingdom says, “Come, everyone who is thirsty, come to the water; and you without silver, come, buy, and eat! Come, buy wine and milk without silver and without cost!” (Isaiah 55:1). The beckoning call of Christ is this: “Come and have breakfast” (John 21:12). Both are invitations to come to Him and to His table.\nRobert Farrar Capon, writer and cook, understood this. In his book, The Supper of the Lamb, he says: \n“To be sure, food keeps us alive, but that is only its smallest and most temporary work. Its eternal purpose is to furnish our sensibilities against the day when we shall sit down at the heavenly banquet and see how gracious the Lord is. Nourishment is necessary only for a while; what we shall need forever is taste.”\nSince the very beginning, God has fed us, calling us to feed from Christ, from the tree of life, rather than lean upon our own understanding or depend upon the bread of Egypt (Genesis 2–3; Exodus 16:3–8). He is using food to give us a taste for the eternal. He is using food to teach us that He is good and faithful. He is using food to teach us to feed one another. At every turn, we are called to “taste and see that the LORD is good” (Psalm 34:8).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day17-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Matthew 28:16-20, Daniel 7:13-14, 2 Corinthians 5:1-21",
    "devo_title": "Our Savior’s Great Commission",
    "devo_summary": "\nBY Erin Davis\n\nAllow me to show you two snapshots of my life. \nIn the first frame, I am a new believer on a mission trip to Jamaica. Our team went door to door handing out bags of seeds and sharing the gospel with any natives who would listen, a venture that was terrifying for me. First, the idea of talking to strangers (much less strangers in a foreign country) was intimidating. Second, sharing my faith scared me so much that I lied and claimed I had the spiritual gift of intercessory prayer. While the team knocked on doors, I stood at a distance and pretended to pray. Lest you desire to give me the benefit of the doubt—don’t. I lied about spiritual gifts to get out of sharing the good news, one of many reasons I am gobsmacked by the goodness of God’s grace. \nSnapshot two is more recent. I was invited to speak in a remote fishing village in Alaska. I would be dropped by bush plane into a region with no phones, where I would teach a native people group who were openly hostile to the gospel. My knees still knocked. My palms were plenty sweaty. But I went and delivered the good news to anyone who would listen—and a few who didn’t want to.\nWhat shifted? I got a bigger view of God. \nHere in chapter 28, the book of Matthew comes to a close with an awe-inspiring encounter between Jesus and His disciples. It’s a moment that could have been pulled from the movie Braveheart. The disciples have already scattered in fear during Jesus’s trials. They were nowhere to be found as He was being crucified and murdered. They mourned as His body was placed in a borrowed tomb. And then… they got a bigger view of God too. They felt the earth tremble as an angel rolled the stone away. They peeked inside the empty tomb. They ran their fingers along the scars in His hands. Everything they thought they knew about Jesus expanded, because now they served a risen Savior. \nThat’s why, when Jesus said, “All authority in heaven and on earth has been given to me” (v.18), they knew His words were true. And when He told them to “go,” they got busy going. Believer, aren’t you glad they did?\nChurch, we have been commissioned to go and tell, to preach and praise, to be disciples and make disciples. And there is only one reason to do it, one truth that will get our feet unstuck: Jesus. Is. Worthy. In this Lenten season may we gain a bigger view of Him. There’s a whole world waiting for us to go and tell. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day18-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Acts 1:1-11, John 14:18-21, Hebrews 1:1-13, Revelation 1:7",
    "devo_title": "Our Savior Ascends",
    "devo_summary": "\nBY Melanie Rainer\n\nI don’t remember the first presidential inauguration I watched as a child, but I vividly remember planning to have one of my own one day—complete with an inaugural ball, naturally. Today my daughter whirls around the living room, singing the songs of Queen Elsa’s coronation day from Frozen, feeling the same flutters of imagination that I did when I watched Princess Mia crowned princess of Genovia in The Princess Diaries. \nWe hardly ever think of inaugurations as the end of something, but rather as the beginning. And yet, when we read about Christ’s ascension in Acts 1, it can feel like the end of His story rather than the inauguration of His kingdom. \nHe ascends into heaven, sits down at the right hand of the Father, and history goes on. Often, I stop there: Christ, frozen in time, seated on the throne, and waiting for His return. \nBut the truth is so much richer, deeper, and more beautiful than that. When Jesus ascended into heaven, He received the mantle of King over all creation.\nWhen Christ ascended, He did so into a cloud. Clouds are often used in Scripture to reveal God’s divine presence, from the cloud that showed the Israelites where to travel by day (Exodus 13:22), to the cloud that filled the tabernacle (Exodus 40:35), to the cloud that appeared at the transfiguration (Matthew 17:5), and the cloud upon which Jesus will descend at His second coming (Revelation 1:7).\nChrist’s homecoming to God in Acts 1 foreshadows our own. But the ascension is more than foreshadowing; it also inaugurated Christ’s new role as our advocate. By joining the Father at His right hand, the risen Jesus grants us access to God. On the cross, He became our substitute. At the ascension, He has become our advocate. Tim Keller writes, “When the eyes of God the Father look at you, they see the ascended Jesus; when they listen to you, they hear him.” \nAnother element of Christ’s Kingship on full display at the ascension was His commissioning authority. Just before He rose to join God, He commissioned His disciples to spread the gospel—not just to the Jewish people, but everyone around the whole world: to Judea, Samaria, and the ends of the earth (Acts 1:8). Christ was claiming the whole earth as His kingdom as He rose to take His place as King. \nWe wait for Christ’s second coming, but today we remember the day He ascended victoriously to the right hand of the Father, inaugurating His rule as King over all His creation. We celebrate the glorious truth about His reign: \n“Your throne, O God, is forever and ever, and the scepter of your kingdom is a scepter of justice.” –Hebrews 1:8\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day19-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Psalm 68:18-19",
    "devo_title": "Grace day",
    "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n18 You ascended to the heights, taking away captives; you received gifts from people, even from the rebellious, so that the Lord God might dwell there.\n19 Blessed be the Lord! Day after day he bears our burdens; God is our salvation. Selah —Psalm 68:18–19\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day20-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "John 14:19",
    "devo_title": "Resurrection Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the first half of the key verse for this plan.\n“In a little while the world will no longer see me, but you will see me. Because I live, you will live too.”  John 14:19\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day21-819x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Acts 2:22-36, Colossians 1:9-23",
    "devo_title": "Jesus Is Our Righteous King",
    "devo_summary": "\nBY Melanie Rainer\n\n“Is He coming? Where is He?”\nMy daughter craned her neck, trying to see from our spot in the very last row of the very old church we sat in on Good Friday. \n“What?” I whispered. \n“Jesus! Is He here? Is that the cross? Are those His bloody clothes?” she asked, pointing to the decorative cross draped in white cloth at the front of the sanctuary. \nMusic started, and she returned to doodling in the bulletin. Meanwhile, I was reeling. How do I answer that? In the particularly concrete mind of a four-year-old, of course it would make sense that Jesus would be present. We remind her over and over again that Jesus is real, and He is always with us. \nThe jump to faith, to believing in what we have not seen, is hard to explain to her, and harder still to model. But this is the tension we hold: we believe in something we cannot see, but it is something real and present and happening right now. \nChrist is holding session as King over all creation. Right now. This very moment. He has since the day He ascended, and He will until the day He returns. Christ’s “session” began when He ascended into heaven to sit at the right hand of God the Father. \nTheologian Karl Barth wrote, “The summit has been reached, the perfect tenses lie behind us and we enter the realm of the present… Whatever prosperity or defeat may occur in our space, whatever may become and pass away, there is one constant, one thing that remains and continues, this sitting of his at the right hand of God the Father.” \nFrom the day Adam and Eve fell and were banished from Eden, people have been waiting for a king. David, with promised covenant kingship, knew that a greater King was coming. He wrote in Psalm 110, “The LORD declared to my Lord, ‘Sit at my right hand until I make your enemies your footstool’” (v.1).\nGod called together a people, first through Abraham and his descendants, and later through the apostles whom Jesus commissioned to go to the nations and invite people into the kingdom. We are now God’s people: a chosen race, a royal priesthood, a holy nation, and a people for His possession. (1 Peter 2:9–10) And we are a people with a King, living by faith in the already-but-not-yet kingdom of Christ, inaugurated when He ascended to take His spot on the throne, “exalted to the right hand of God” (Acts 2:33). \nIn Colossians, Paul wrote that in His rescue of us, Christ has “ transferred us into the kingdom of the Son he loves” (Colossians 1:13). We, the communion of saints through the ages, live presently in the kingdom ruled by Jesus the Son, who holds His continuous session at the right hand of God. Our King holds all things together. \nWhen my daughter asks, “Where is He? Where is Jesus?” my answer isn’t as simple as pointing her to the front of the church. But it is an easy one: He is on His throne, seated at the right hand of God the Father, ruling His kingdom and loving His people. And our response to Him is honor, service, and faithfulness. \nThe sweet, sweet hymn “Fairest Lord Jesus” summarizes our posture so beautifully:\nFairest Lord Jesus, ruler of all nature, O thou of God and man the Son, Thee will I cherish, Thee will I honor, Thou, my soul’s glory, joy, and crown. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day22-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Hebrews 8:1-6, 1 Timothy 2:1-6, Jude 1:20-25",
    "devo_title": "Jesus Is Our Mediator",
    "devo_summary": "\nBY Erin Davis\n\nThe cross looms large over all of history. Its shadow is cast in all directions—forward and backward, before and behind. Every narrative in Scripture is draped in the gospel. \nThink back to the moment the children of Israel decided to worship a golden calf at the base of Mount Sinai (Exodus 32:1–14). God was poised to destroy them for their rebellion, and His holy wrath was fully justified.\nIn response, Moses turned to God, aware of how impossible it was for his people to save themselves from God’s just wrath. Unless he intervened, his beloved nation would be destroyed. In the end, the Israelites were spared, not because they were worthy or sinless (they weren’t), but because Moses pleaded for mercy on their behalf to a merciful God. \nAnd yet, Moses’s pleading can’t save you or me from our sin. Moses is gone, his body buried in a secret grave dug by the Lord Himself (Deuteronomy 34:5–7). Humanity’s part of God’s covenant with Moses is broken. We remain as rebellious as our Hebrew forefathers. But this is more than a story about a time when God saved a bunch of silly idol-worshippers. In the light of the cross, the image changes. True gospel hope emerges for you and for me. \n“These serve as a copy and shadow of the heavenly things, as Moses was warned when he was about to complete the tabernacle. For God said, ‘Be careful that you make everything according to the pattern that was shown to you on the mountain.’ But Jesus has now obtained a superior ministry, and to that degree he is the mediator of a better covenant, which has been established on better promises” (Hebrews 8:5–6, emphasis mine). \nChrist is our Mediator, the bridge to the better covenant. We are not—nor could we ever be—holy as He is holy (1 Peter 1:16). God’s wrath toward us is fully justified. In response, Jesus turned to face God, fully aware of how impossible it was for people to save themselves from God’s just wrath. Unless He intervened, His beloved Bride would be destroyed. \nAt the cross, Christ intervened for us. Yet He is not buried in a tomb. He arose with the power to keep pleading our case. Even now, this very moment, He advocates for us before the Father. He is the Savior who keeps saving us from our sin, the Mediator who keeps making our case, based on His righteousness, not our own. \nBeloved child of God, you have been spared. Not because you are worthy, but because Christ advocates for you. Amen. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day23-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "1 Corinthians 15:1-28, Colossians 3:1-17",
    "devo_title": "Jesus Is the Firstfruits of the Resurrection",
    "devo_summary": "\nBY Rebecca Faires\n\nI spent much of my twenties running a high school theatre department. We had so much fun. There are few things that bond people together like putting on a show with limited time and resources. One year we produced a spoof on Shakespeare. There was one line, shouted frantically by a young man dressed in an ornate Elizabethan dress as Juliet, that still makes me laugh: “SWEAR NOT BY THE MOON!”\nIn Shakespeare’s original play, Romeo and Juliet, young Juliet uses these words to warn Romeo to be careful with his vows, to not swear his love by the “inconstant moon,” which is ever-changing in its phases. Turns out Juliet’s warning is actually profound and timely advice for more folks than just Romeo.\nWhat we swear by is what we put our trust in, and it’s easy to misplace our trust. Maybe you don’t swear by the moon, but are you inclined to swear by your bank account, your job, your retirement plans, or your carefully scheduled week? It’s tempting to hope in things that are ultimately destined to fail, but when we try to build upon the unsteady foundation of our own whims and wistful thinking, we end up disappointed.\nPaul’s address to the church at Corinth, however, leaves no question about where we can lay our hope and fix our trust. He clarifies that the gospel does not fall short in any way. What is this gospel hope Paul speaks of? It is simply this: Christ was crucified for our transgressions and raised from the dead (Romans 4:25).\nIf Christ has not been raised from the dead, then we are much to be pitied (1 Corinthians 15:12–19). Like foolish Shakespearean moon-swearers, we have put our trust in something unreliable. How ridiculous would it be to trust in a god who dies and has no power beyond this earthly life? And so, if Christ has not been raised, then our faith in Him is as worthless as faith in the stock market or faith in the moon.\nBut Scripture is unequivocal: Christ has been raised from the dead. This declaration is no fool’s hope, but the sure foundation of our faith. Our faith is confirmed by fulfilled prophecy and eyewitness accounts. We can bet everything on Christ. Because “He has been raised from the dead,” we don’t have to swear by the moon or anything else. Our hope is secure in Christ’s resurrection.\nJesus Christ died and rose again for us. This is good news for the whole body of Christ, because “if the firstfruits are holy, so is the whole batch. And if the root is holy, so are the branches” (Romans 11:16). Because He has been raised, we who are united to Him by faith also have the guarantee of resurrection life, an everlasting and sure hope.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day24-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "1 Corinthians 15:35-58, 1 Thessalonians 4:13-18",
    "devo_title": "Jesus Is Our Returning Savior",
    "devo_summary": "\nBY Claire Gibson\n\nCorrie Ten Boom’s memoir The Hiding Place chronicles the Nazi occupation of Holland during WWII. Under constant watch, Corrie and her family decided to form an underground network of resistance, hiding Jewish men, women, and children in homes across Holland, including their own. They knew the day would come when the Nazis would learn the truth—and soon that day came. For their crimes against Germany, Corrie and Betsey were both sent to Ravensbruck Concentration camp, where their bodies deteriorated under the weight of overwork, malnutrition, and disease.\nIf that were the end of the story, it would be a tragedy. But day after day, in the flea-ridden dormitory that the guards would not enter for fear of being infested themselves, Corrie and Betsey read the Bible aloud for all the imprisoned women of Bunk 28. Holding daily services, they learned that the Word of God speaks boldly, even in—perhaps especially in—the darkest circumstances. And while their health faltered, their hearts grew more convinced that they would be together with God when the ordeal was over, whether through death or through survival.\nOur temporary bodies hold eternal souls. My body is susceptible to illness, breakdown, injury, paralysis, and even death. But my soul is eternal. My body might stop working all together; organs might fail, and my womb may never function as it was designed to function. That is okay with me. Because my body is not me. It is a temporary home for God to do His work in the world. Even if that work is in a place I do not recognize. Even if that work is in a concentration camp. \nDeath—real death—is not physical. Spiritual death is eternal separation from God, and that kind of death has been swallowed up forever, because our Lord Jesus Christ took the penalty for our sin as He hung on the cross. Now, “Death has been swallowed up in victory” (1 Corinthians 15:54). So while our bodies might deteriorate, our souls will grow closer to our Creator. And one day, when Christ returns with a shout (1 Thessalonians 4:16), we will be raised to be like Him, bearing the image of heaven. “In a moment, in the twinkling of an eye… we will be changed” (1 Corinthians 15:50–52).\nI pray that no one will ever experience anything as cruel and inhumane as a Nazi concentration camp. But all of us will at some point experience the impact of disease, death, and disappointment on this side of eternity. Those earthly losses are deep, and our heavenly Father grieves them with us. Yet in that grief, He invites us to shift our gaze to Him, to trust that He has plans that far exceed what we can see in this world, beyond the physical realm. \nWhen my time comes to shed this shell, I pray that God will give me the courage to believe the truth; I lose nothing when I lose a human body, because I gain everything in Him. For the believer, Christ’s resurrection has secured eternity with Him. One day soon, He will return for us, and we will always be with Him, forevermore (1 Thessalonians 4:17). “Thanks be to God, who gives us the victory through our Lord Jesus Christ!” (1 Corinthians 15:57).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day25-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "John 14:1-6, Hebrews 11:1-2, Hebrews 11:13-16, Revelation 21:1-8, Revelation 21:22-27, Revelation 22:1-5, Revelation 22:20",
    "devo_title": "Jesus Brings Us Home",
    "devo_summary": "\nBY Andrea Lucado\n\nNothing reveals my inner control freak like letting a friend take over the GPS while I drive. Accustomed to seeing each upcoming turn on Google maps, I assault my passenger-navigator with questions: When is my next turn? How much longer on this road? How many miles until we’re there? I’m sure my gracious navigator wishes I would shut up and drive, trusting that we are on the right road, and she will get us to our destination safely. \nThomas is a bit like an angsty driver in today’s passage. Jesus holds the GPS: “I am going away to prepare a place for you” (John 14:2). But Thomas needs more details, a specific address: “‘Lord,’ Thomas said, ‘we don’t know where you’re going. How can we know the way?’” (v.5).\nJesus’s answer to Thomas was simply, “I am the way, the truth, and the life” (v.6, emphasis added). He did not provide Thomas with a specific address, but Jesus did point to the road that would get him there.\nThis is a reassuring promise to a control freak like me, and it’s as much a promise for the life to come as it is for our lives today. So often I feel like I need to know my exact destination and then figure out how to get there. Where is my career headed? How do I mend this broken friendship? Where will I live when my lease is up? Jesus may not provide specific answers, but He has asked us to believe and trust in the way He’s paved for us. \nWhere is my career headed?  “I am the way, the truth, and the life.” \nHow do I mend this broken friendship?  “I am the way, the truth, and the life.” \nWhere will I live when my lease is up?  “I am the way, the truth, and the life.” \nWant to know where your life is headed? Follow the way of Jesus. Live life in the way He told us to live it. Believe in God, believe also in Christ, and you will get to where you’re supposed to go. \nLiving in the way of Jesus is counterintuitive for those of us who like to both drive and hold the GPS. It requires surrender. It requires us to trust our navigator. When we do this, however hard it may be, we’re able to be present on the journey without worrying about the destination.\nThough we cannot point to it on a map, ultimately, we know where are headed. Perhaps we don’t know how long it will take us to get there, but one thing we know for sure: Christ our Lord has prepared a place for us there, and He is coming back to receive us to Himself (v.3). For that promise, let us say, Praise be to God! \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day26-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "Job 19:25-27",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n25 But I know that my Redeemer lives, and at the end he will stand on the dust. 26 Even after my skin has been destroyed, yet I will see God in my flesh. 27 I will see him myself; my eyes will look at him, and not as a stranger.  My heart longs within me. —Job 19:25–27\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day27-1024x1024.jpg"
  },
  {
    "book_title": "Because He Lives",
    "devo_passages": "John 14:20",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the second half of the key verse for this plan.\n“On that day you will know that I am in my Father, you are in me, and I am in you.”  —John 14:20\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/4-Easter-4-576x1024.jpg"
  },
  {
        "book_title": "Because He Lives",
        "devo_passages": "Genesis 3:1-24, Psalm 51:1-19, Psalm 16:11",
        "devo_title": "Our Need for Home",
        "devo_summary": "\nBY Andrea Lucado\n\nI’ve lived in 17 different homes during my 32 years of life, counting every dorm room and short-term apartment. From a young age, I’ve attempted to nest in each one. In eighth grade, I painted my room lime green. In college, I carefully picked out every accessory for my dorm room. In my adult life I’ve nested hard, spending weeks and months picking out furniture, arranging and rearranging gallery walls until everything was just right. It’s not that I’m a brilliant interior decorator (lime green, remember?); I just want each place I live in to feel like a home.\nWe may express it differently, but we all long for home. We have an innate desire to be where we belong—or to belong where we are. I wonder if this longing can be traced back to Adam and Eve when they lost their home, banished from the Garden of Eden for good.\nFor their entire existence, Adam and Eve had operated one way within in the garden. Naked and free, they had no shame or fear. They were at one with God. Then in a moment, everything changed, and “the eyes of both of them were opened” (Genesis 3:7). Suddenly, Adam and Eve were aware of their nakedness. They were afraid of God and ashamed to be seen by Him. When they left the garden that day, they lost more than their home; they lost themselves too.\nI wonder if at the root of our desire to know where we belong is the desire to know who we are. Not only do we crave a return to Eden, but a return to who we were within Eden: unashamed, free, in communion with our God. Now we are as David laments, “guilty when I was born… sinful when my mother conceived me” (Psalm 51:5).\nWe have an opportunity during this Easter season to grieve the loss of Eden and the loss of innocence. We can sit and contemplate our desire for home and belonging, place and identity. We do so with pain and sadness, but also with expectancy and hope.\nIn our quests for home, we need look no further than what we celebrate during Easter—an empty tomb. That is where our identities changed from sinful to righteous, from banished to welcome. When I know who I am in Christ, I always know where I belong. I always know where home is—in Him.\nSo this season we grieve and we celebrate. We are banished no more, guilty no more. We are ashamed no more because of Christ, the cross, and a tomb that lay empty. Let’s rejoice in Christ, the joy of our salvation. And let us give thanks to God who has revealed “the path of life to me,” the path leading home (Psalm 16:11).\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day1.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Genesis 6:11-22, Genesis 8:13-22, Isaiah 54:1-10",
        "devo_title": "Our Need for a Savior",
        "devo_summary": "\nBY Claire Gibson\n\nBack in college, I was still of the mindset that if I behaved and performed well, God would reward me accordingly. And because I did the “right” things and got good grades, I assumed my post-college life would be smooth sailing. I expected that once graduation rolled around, I’d have a big plan—a big job—something I could tell people that would make their eyebrows go up an inch, showing that they were impressed.\nBut by March of my senior year, with just a couple months until the end of the semester and graduation looming, I still had no plans. The country was facing a recession. I had no job. No prospects. And I was angry at God, frustrated that I had no direction for the future, and convinced He had forgotten me. Slowly, my heart began to rebel against God, growing cold and guarded. I didn’t believe He cared about me, and so I withdrew from Him. In anger, I did all the things I knew in my heart weren’t His best for me. I would call them mistakes, except my actions were entirely intentional. I ran directly toward sin, only to end up feeling burned and ashamed.\nThe good news of Christ is so good because the bad news is so bad. And what’s the bad news? Not much has changed since the time of Noah. In Mark 7:21, Jesus told a crowd that what defiles a person isn’t from the outside, but what comes from the heart. All you have to do is turn on the news to see that evil still reigns in this world. But the worst of us comes from within. I have extreme memories that remind me of my wayward heart. I also have daily decisions, moments when I put aside my devotion to Christ and serve my whims, appetites, and desires.\nMy heart is a place of longing, doubt, and restlessness. I seek out quick comfort and distraction long before I seek God’s counsel and righteousness. I need a Savior, not to save me from sin out there. I need a Savior to save me from myself. The flood isn’t the world of other people. The most dangerous flood is the faithlessness of my heart. I need an ark. A hiding place. A safe haven from the deluge of my own desire and rebellion that would take me far from God.\nGod has given me such a Savior.\nThere is nothing I can do to remove His love from me. The door to the ark is always open. The covenant will not change. The destruction I deserve is not coming for me. “Though the mountains move and the hills shake, [His] love will not be removed from [us]” (Isaiah 54:10).\nThe good news is so good: Jesus is far better than any wooden boat that spares my life from external destruction. Jesus provides shelter and safety when the floodwaters of my own disobedience have risen too high for me to see. He takes me up in His arms and tells me there is no condemnation. Nothing can separate me from His love. Not even me.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day2.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Genesis 22:1-19, Hebrews 11:17-19, Daniel 12:2-3",
        "devo_title": "Our Need for Resurrection",
        "devo_summary": "\nBY Rebecca Faires\n\nThe binding of Isaac breaks my heart every time I read it. I subconsciously swap myself for Abraham and replace Isaac with my beloved firstborn son, and suddenly the story hurts in a real and visceral way. (Did you do this when you read the passage?) Each physical hurdle becomes agonizing—the saddling of the donkey, the splitting of the wood, the long walk uphill, and finally, the binding up of a beloved boy. The whole agonizing ordeal truly begs the question: How did Abraham do it? How did he make it through all the steps up to the very point of raising a knife over his promised and beloved son?\nChillingly, child sacrifice has a long, established history in many cultures, including that of Mesopotamia. Abraham was from Ur (Genesis 11:31), and so he would have been familiar with the sacrifice of a child to prove devotion to a god. Similarly, the Canaanites worshipped Molech, the false god most famous for demanding child sacrifice. The idea behind the sacrifice was this: If you are willing to sacrifice the person most precious to you—and for parents, nothing could be more precious to us than our children—then you could prove your devotion to your god. Abraham had certainly encountered this kind of demand before with regard to other cultural gods.\nSecond, Abraham trusted God. He trusted that “I AM” was not just another Baal or Molech. Abraham believed that God was the one true God, and he cherished the profound hope that “I AM” was different. Abraham had such trust that he reasoned God would provide for a miraculous resurrection to save Isaac, if that’s what it took (Hebrews 11:19). He even told Isaac, “God himself will provide the lamb for the burnt offering, my son” (Genesis 22:8).\nFor both these reasons, we find Abraham shuddering with a knife raised over that which is most precious to Him. And we find ourselves standing right beside him, surveying the hopelessness of our station. We are dead in our trespasses, we live under a curse, and we have no hope of satisfying the chasm of debt that we owe. Indeed, the consequence of our sin is death (Romans 6:23).\nWe need a God who can raise the dead (Matthew 10:8). We need a God who has the power to undo the curse (Romans 8:2). And our God has promised and proven that He can and will do both. Our God does not demand child sacrifice—He abhors it! After all, He knits together our children and treasures them because they are His very own. We don’t need a false god with a lust for flesh and a desire for pain. Rather, we worship the one true God, who preserves, protects, loves, and cherishes us and our children. Hallelujah!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day3-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Exodus 32:1-14, Exodus 32:30-35, Acts 7:37-43, Jeremiah 31:31-34",
        "devo_title": "Our Need for a Mediator",
        "devo_summary": "\nBY Erin Davis\n\nLet’s face it, when the Lord called the Israelites “stiff-necked,” He was being kind.\nOn their best days, they were whiney, rebellious, fearful, and contentious. And this particular day we’re reading about was definitely not one of their best. \nWith metal they’d pillaged from their enemies (Exodus 12:35), they fashioned a statue of a calf and convinced themselves that the idol was the Lord Himself, the one who had delivered them from slavery in Egypt. \nIt’s okay to shake your head. Their error was preposterous. In hindsight, I suppose it’s obvious that rebellion against a loving and sovereign God always is. No wonder God declared, “Now leave me alone, so that my anger can burn against them and I can destroy them” (32:10). \nThis was the nation that had seen God send plagues to torment their oppressors. These were the ones who had walked across the Red Sea on dry ground. These were God’s chosen people, those who had tasted the manna He’d rained from heaven. And still, as soon as their leader was out of earshot, they turned their adoration toward a weaker god—one who could never save them. God’s wrath was surely justified.\nGod is holy.  His people were unholy. \nHe is generous.  They were greedy. \nHe is faithful.  They were faithless.\nHe showcased His power.  They bowed before a powerless statue instead. \nWe’ve all bowed before the wrong altars. Who will plead our cause? We cannot shake our sin nature. Who will defend our case? We are the rebellious children of a holy, holy, holy God. Who will stay His hand?\nThis moment in Israel’s history allows us to peek at the glory of the gospel. In pleading with the Lord to spare the Israelites, Moses was pointing forward to Christ, who right now—right this very minute—is our advocate, standing between our sin and the punishment we rightly deserve (Romans 8:34). We remain God’s beloved, yet rebellious, children—our hearts ever turning toward all that glitters. Even so, God’s wrath is stayed because there is One who pleads for us even now. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day4-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "2 Samuel 7:1-17, 1 Chronicles 28:1-8, Isaiah 33:22, Jeremiah 23:5-6",
        "devo_title": "Our Need for a Righteous King",
        "devo_summary": "\nBY Melanie Rainer\n\nAs an undergrad, I studied political science and economics, and spent more hours than I can count learning, arguing, unlearning, and repositioning my political compass. But after four years of study, it was clear to me that there is no perfect form of government, no flawless ideology or leader. \nAnd yet, I find myself wrapped up in the political whirlwind even now. I think, But what if the promises are true? What if this person really can make a difference? What if she or he will make my life easier, my money stretch farther, my kids safer? \nIt is easy to fall into the same trap as the Israelites oh-so long ago. When things get tough, personally or globally, the lure of a strong leader is hard to resist. They must have thought, What if we had a king to protect us from our enemies? What if we had someone who could make us into a strong nation?\nGod gave Israel a king: first Saul, then the great King David, then Solomon. Saul fought for them, David led them, and Solomon dispensed wisdom from his throne. But ultimately, these men failed, as all earthly kings do. This narrative is a rather simple one to unpack: the people asked for a king, God gave them kings, those kings failed, and then God promised to send them the real King, all of which is true, of course. \nBut our need for a king goes back further than Solomon, David, and Saul. It goes back to the garden, when Adam and Eve walked with God and the serpent tempted them with power. Because isn’t that the root of our desire for a king? Power. Power over our enemies, our circumstances, and our future. \nFrom the beginning, God was wiring us for a king and setting the stage for the King of kings. He called Abraham to become the father of a nation. He called Moses and His people to a land. He gave Moses a law rooted in His character, brimming with justice and righteousness. He sent judges to call His people back to Him, to remind them of the boundaries the law provided. And then He gave them earthly kings, men whose résumés were filled with both successes and failures but who, ultimately, could never be the King the people truly needed. \nIn Jeremiah, during the cycle of mostly terrible kings, the prophet wrote on behalf of the Lord: “I will raise up a Righteous Branch… He will reign wisely as king and administer justice and righteousness in the land. In his days Judah will be saved, and Israel will dwell securely. This is the name he will be called: The LORD Is Our Righteousness” (23:5–6). \nThis was the promise, but also the deep desire, God had sown into the hearts of His people. The pieces were there: a people, a land, a just law. But the King was missing, and one day, the King would come. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day5-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Zechariah 12:10",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“Then I will pour out a spirit of grace and prayer on the house of David and the residents of Jerusalem, and they will look at me whom they pierced. They will mourn for him as one mourns for an only child and weep bitterly for him as one weeps for a firstborn.” —Zechariah 12:10\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day6-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Matthew 21:1-11, Zechariah 9:9",
        "devo_title": "Our Savior Comes",
        "devo_summary": "\nBY Amanda Bible Williams\n\nThis morning I drove past the lake near our house, as I always do. Today the spring sun was especially bright, causing me to squint my eyes as the light poured through my driver’s side window. A dense layer of fog covered the water as far as I could see. Gulls danced in and out of the cloud-like mist, some resting still and peaceful on the glassy surface. The sun, the fog, the gulls, the water—the combination stunned me, caught that deep sigh in my chest and held it there a minute. \nIt was the second day in a row the lake looked exactly like this, and both times it brought worship to my lips:\nI praise you, Lord, for you are the Creator God, the maker of the water and the birds, the sun and the mist, and the breath in my lungs. You are God, you are Lord, and I give you all of me today. \nThere was no analyzing my prayer outline or word choice, no time for false pretense or doubt. I’d seen a glimpse of the glory of the Lord, and immediate, unhindered praise felt like the only possible response.\nSpontaneous worship sessions are not new to our Almighty God. Since the making of mankind and the dawn of creation, people and nature have praised Him. On this day recorded in Matthew 21, Jesus rode into Jerusalem on a donkey, and another chorus of praise erupted: \nHosanna to the Son of David!Blessed is he who comes in the nameof the Lord!Hosanna in the highest heaven! (v. 9). \nAs Luke’s Gospel tells it, “the whole crowd of the disciples began to praise God joyfully with a loud voice for all the miracles they had seen” (Luke 19:37). Miracles—plural. Many of them. These people who had been following Jesus had seen evidence that this was not just a man. This man was the Son of God. They had seen glimpses of His glory, and it led them to worship.\nLuke also records that as Jesus rode on toward the gates of Jerusalem that day—toward the death due every single human but Him—He also wept for its brokenness. He cried for those who did not recognize the Messiah in their midst (Luke 19:44). \nThe Savior had come, but they did not know Him.\nAs we enter Holy Week on this Palm Sunday, may we see Jesus for who He is. May we read with clear eyes and open hearts the Gospel account of these days and events that are the foundation of our faith. And may we worship the One at the center of it all.\nBlessed is He who comes in the name of the Lord! Blessed is Jesus, who comes to save us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/4-Easter-1-576x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Matthew 21:12-17, Mark 14:1-9, 1 John 4:7-10",
        "devo_title": "Our Savior Is Anointed",
        "devo_summary": "\nBY Andrea Lucado\n\nIn today’s reading, Christ is anointed in both word and deed. First, we read about the children in the temple who declare, “Hosanna to the Son of David!” (Matthew 21:15). And then there is the woman in Bethany who anoints Jesus physically, breaking open a jar of perfume and pouring it out on His head (Mark 14:3). Both are beautiful examples of exulting Christ both with our words and with our actions, though not everybody in the story is happy.\nScripture describes the chief priests and scribes as indignant after hearing children call Jesus “Son of David,” a title reserved for the Messiah. And after the woman anoints Christ with perfume, the onlookers are described in the same way—indignant—asking, “Why has this perfume been wasted?” (v.4).\nThe anointing of Christ was an offense and a disruption. For the chief priests and scribes, it represented a disruption to their hierarchy, placing this man Jesus at the top. For those watching the woman spend her most expensive perfume, the anointing seemed irresponsible: Why waste such a precious possession? Additionally, as members of two marginalized and powerless demographics in first-century Judea, a woman and a group of children would not have had the authority to make such claims about a man. The anointing of Christ grated against an otherwise ordered and reasonable existence.\nBut did Jesus come to ensure a reasonable and ordered existence for us all?\nWhen the woman anoints Jesus, He says she is foreshadowing an even greater disruption to society as they knew it. Jesus’s death, burial, and resurrection were about to turn humanity upside-down. The greatest societal disruption of all was still to come, one in which the unclean would be clean and the unrighteous made righteous. \nIf I’m honest, I can be resistant to the Jesus who disrupts my order in the same way He disrupted the temple and the town of Bethany. I can grow very comfortable in the world I’ve created for myself and my place in it. The anointing of Christ, as well as the way He was anointed, tell me my purpose is not to be complacent with the way things are. I am to anoint Christ in word and in deed, following my King and doing His work, even if it pushes social boundaries, even if it prioritizes the wellbeing of the marginalized over my own comfort. This is the work that acts out real love toward one another, not because we are so good at loving, but because we have been so loved.\nThis is my prayer for us today, that our hearts would be set on the anointed Christ. I pray that the sacrificial love we have been shown and given would propel us to love others, so that one day Jesus will look at us and say, “She has done a noble thing for me” (v.6).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day8-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "John 13:1-35, 1 Corinthians 11:23-26",
        "devo_title": "Our Savior Washes Feet",
        "devo_summary": "\nBY Claire Gibson\n\nMy mother sat in the passenger seat, and I was behind the wheel. My eyes glanced at the clock on the dash. Up ahead, a train inched along the track, cutting us off from the road we needed to take. People made reservations a month in advance to get a seat at this restaurant. I knew if we were too late, we’d lose our seats. I couldn’t wait any longer.\nWhipping the car around, I turned onto a side road and tried to find my way to the restaurant by an alternate route. But as I veered to the left, I forgot to check my blind spot. A truck barreled into the back of my car with a loud crunch. We weren’t going fast. No one was hurt. But it was most definitely my fault. I was in such a rush to get to dinner that I put our lives in danger. Thirty minutes later, we made it to the restaurant, and the hostess didn’t even mention the fact that we were late.\nWhen I feel the pinch of time, I rush. Jesus doesn’t. \nWhile reading today’s passages, I was struck by how slow and purposeful Jesus is with His disciples in their final hours together before His arrest. From the beginning of John 13, we’re told Jesus knew it was the end. He knew exactly what was coming. He even knew that Judas would be the one to deliver the deadly kiss. And yet, He doesn’t get up and start rushing around. He doesn’t point fingers or hatch an escape plan. He doesn’t open the Scriptures and start teaching frantically. He doesn’t even complete a few extra miracles, just for good measure. \nIn less than twenty-four hours, Jesus would be hanging on a tree, yet He stops to fill a basin with water. \nIn this moment, Jesus had no agenda to complete before He died, other than to show His disciples love. Putting His own fear aside, He focused solely on the words, actions, and encouragement His brothers needed to hear before He departed. Jesus knelt, took foul-smelling feet in His hands, and wiped them completely clean. (We live in a culture that is dying of thirst for this kind of selfless, slow, real love.) \nIn His last meal on earth, Jesus is my example. He shows me that I do not need to rush. I do not need to check items off my bucket list. I don’t even have to leave the room to do His work. All I have to do is love the people at my particular table. He teaches me that loving well doesn’t always mean teaching—it also means doing. Love means washing feet. It means embracing the foul parts of life. It means listening attentively to my friends and breaking bread, being still, even when every instinct of my heart tells me to run because we’re running out of time. \nThere is no need to rush when God is in control. If my Lord and Savior rested in this truth and served in this way, then He will surely help me do the same (John 13:14–15). Regardless of what appears to be blocking my path or barreling toward me in this life, I can be still and rest in Him. I can speak kindly to those around me. I can serve right now, right where I am. \nDear Lord, give me the strength to fill basins.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day9-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Matthew 26:30-68, Luke 22:55-62, Isaiah 53:7",
        "devo_title": "Our Savior Is Betrayed",
        "devo_summary": "\nBY Rebecca Faires\n\nThe summer I was seventeen, I spent a few weeks house sitting for family friends. The house was beautiful, the owners had cable, and I got to have full independence so, let’s be honest, they were doing me the favor. I was working down the road at a country club in the esteemed dual position of waitress and lifeguard, and after work, sometimes the cool kids wanted to come hang at my house. I definitely did not have permission to bring lifeguards and bartenders back to the house, but I was intoxicated with the independence that only real estate can bring. When the homeowners returned, they found a picture frame upstairs that someone had accidentally broken, and every once in a while, I still feel a little prick of embarrassment due to my betrayal.\nI had one job. But instead of doing it perfectly and responsibly, I did an okay job with a little betrayal along the way. I had watered the plants but failed to protect the house. We like to think that we are so close to getting it just right every time, but then some external factor seems to hold us back from pitching that perfect game. (If only I hadn’t been so young and naive! If only I’d had more time. If only I weren’t so tired.)\nWhat if Judas felt the same way? He was so close to being a great disciple, but he missed the mark because the lure of silver proved too strong. When Judas joined the inner circle, he didn’t do it just so he could betray their leader. \nCertainly the rest of the disciples intended to do a great job of following Jesus. Peter, James, and John wanted to stay awake and wait with Christ while He prayed in the garden. But then they grew tired, their eyes heavy, and every single one of them gave in to sleep.\nIf anyone could come close to showing us an example of perfect righteousness and devotion, surely it would have been Peter; he’s “the rock,” after all (Matthew 16:18). Peter strenuously insisted that he would never make the mistake of betraying Christ, but even his very best intentions were garbage by the time the rooster crowed. If even Peter betrayed Christ in His hour of need, where does that leave us?\nIs it really just external hindrances holding us back, or is it possible that we don’t even understand how desperately we need the gospel? None of our righteousness—even our shiniest stuff—is sufficient. We all have Judas hearts, and even our best intentions are filthy rags. Our betrayals show us that, in big and small ways, our selfish interests are so strong we can’t resist those silver coins or those teenage lifeguards. We are all capable of deep betrayal.\nWhen Judas arrives in the garden to betray Him, Jesus asks, “Friend,… why have you come?” (Matthew 26:50). And He asks us the same question: Why have we come? We come out of our desperate need for a Redeemer. We come with ash smeared on our faces. \nWhether we feel like Judas or like Peter, we need Christ’s grace exactly the same. Even in our betrayals, Christ reaches out to His people with mercy. We are to come for this alone: Christ. We are to come for His perfect righteousness, leaning wholly upon Him, for He is the Messiah, the Son of God, and is now seated at the right hand of Power, and will come again in glory.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day10-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "John 18:28-38, Luke 23:5-16, Matthew 27:15-23, John 19:1-16, Isaiah 50:6-7",
        "devo_title": "Our Savior Is Handed Over",
        "devo_summary": "\nBY Erin Davis\n\nI know the events of Holy Week unfolded more than two thousand years ago. I wasn’t there, and yet, as I prepare my heart for Easter morning, I keep bumping into reflections of myself in the text. \nHere I am in John 18: \nI am the Jews who escorted Jesus to Pilate. They thought they were righteous because they stayed in the front yard, yet convinced themselves their hands weren’t dirty as they handed over an innocent man for the slaughter. How often do I rely on all manner of rules to make me “clean” while willfully rebelling against a holy God? How often is my heart soiled by sin that I ignore because I’ve stuck to some arbitrary list of dos and don’ts?\nI am Pilate. I want to wash my hands of the matter of sin and suffering. Don’t you? Don’t we all? How often do I utter, “What is truth?” when the truth is inconvenient to me? The answer, I’m afraid, is all too often.\nLook, there I am in Luke 23: \nI am the crowds, offended by the ways Jesus interrupts the status quo and upends my paradigms. As He strips me of my comfort and convicts me of my obsession with self, my heart becomes indignant. I want to yell, scream, and stomp my feet.\nI am Herod. I am willing to use Jesus to suit my purposes, to elevate my own power. \nI see myself most clearly in Matthew 27:\nI am Barabbas. There’s no use in trying to deny it. I am a sinner, guilty of violating the holy law of God. Barabbas was a “notorious prisoner” of the Roman government. Without Christ, I am a prisoner to my sin. I deserve whatever punishment God could hurl at me, but He takes my place instead. Because of Him, I walk in undeserved freedom. \nFriend, I know you are these things too. We all are. \nWe are prone to value rules over righteousness. We are capable of distancing ourselves from inconvenient truth. We are irritated by the ways that following Christ can stir up trouble for us in this world, yet more than okay with using Him to elevate ourselves in the eyes of other believers. We are guilty of sin—undeniably so—and are so often imprisoned because of it. And we are as responsible for sending Jesus to the cross as the crowds who yelled, “Crucify him!”\nBut there is none like Him. Amen? His grace and mercy transcend time and geography. His actions on Holy Week have the power to save us just as much as they have the power to save the ones who lined the streets to see Him punished. Go on, see yourself in the story. Feel the sting of your sin. But let your eyes move quickly to Jesus, who willingly took our place so that we might be a people who walk in undeserved freedom. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day11-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Mark 15:20-22, John 19:19-22, Luke 23:32-43, Matthew 27:45-54, John 19:38-42, Isaiah 53:12",
        "devo_title": "Our Savior Is Crucified",
        "devo_summary": "\nBY Melanie Rainer\n\nThis is it. \nThis is the question and answer, the moment, the hinge upon which all of history sits. \nDid Jesus, fully man and fully God, die on the cross, not just as a Jewish rebel and teacher in ancient Rome, but as the promised Messiah and Savior of all humanity? Did He?\nDo you believe it? \nDo I?\nI have a very vivid memory of standing in the emerald-green-tiled shower of our charmingly dilapidated St. Louis apartment, a year and a half into seminary, water washing over me and tears rushing down my face. I asked myself, “Do you really believe this is true? Do you?” The questions, the concepts, and the reordering of my heart and mind were almost too much. \nI have an equally vivid memory of driving to Target the afternoon our little friend-family experienced unspeakable tragedy, and of whisper-screaming with every breath I took, saying, “Jesus, be real. Jesus, BE REAL. Jesus, please be real.”  \nI have just as many if not more moments of deep assurance, of knowing Christ to be true. I resonate with John Wesley’s words describing his own faith: “I felt my heart strangely warmed. I felt I did trust in Christ, Christ alone for salvation; and an assurance was given me that He had taken away my sins, even mine, and saved me from the law of sin and death.”\nAll this makes me wonder, reflecting on today’s Scripture, how many people who were there at Christ’s crucifixion found themselves feeling the terror of unbelief? And who felt the sweet, blessed assurance of faith? What would it have been like to be a witness to this moment, to believe that all the promises of the ages were coming true? Or to be a blind witness, without faith, and to feel nothing more for Jesus than for the criminals who hung next to Him? \nThe terror of unbelief settled on Peter, who denied Jesus three times. Disbelief motivated the scoffing Jewish leaders, and the insulting criminal on the cross. It led Pilate to apathy.\nBut the repentant thief on the cross next to Jesus believed. The centurion gasped at the sudden darkness and knew this was not just another prisoner hanging nearby. \nJoseph and Nicodemus believed, and acted in faith to care for the broken body of the Son of God. Chapters earlier we read that Nicodemus, a pharisee, wasn’t sure if he believed in Jesus; but in today’s reading, we suddenly find him doing the humiliating work of preparing the Lord’s dead body for burial—work typically reserved for women and slaves. Nicodemus knew it was all true.\nThis is it. And it is all true. \nIt is true on the days I am blindsided by the terror of unbelief. And it is true on the days I feel it doubtlessly in every bone and blood cell in my body. \nMy Good Friday prayer, in this between-Friday-and-Sunday life that we live, is that I will always remember and proclaim, “Truly, this man is the Son of God” (Matthew 27:54). \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day12-2-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Isaiah 53:4-6",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n4 Yet he himself bore our sicknesses, and he carried our pains; but we in turn regarded him stricken, struck down by God, and afflicted. 5 But he was pierced because of our rebellion, crushed because of our iniquities; punishment for our peace was on him, and we are healed by his wounds. 6 We all went astray like sheep; we all have turned to our own way; and the LORD has punished him for the iniquity of us all. —Isaiah 53:4–6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day13-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Matthew 28:1-6",
        "devo_title": "Our Savior’s Empty Tomb",
        "devo_summary": "\nBY She Reads Truth\n\nHe is risen! Join us in reading this brief account of the empty tomb from Matthew 28. Save the image below as the lock screen for your phone so you can be reminded that everything has changed because of Jesus’s resurrection. \nHallelujah! The gospel is true!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day14-819x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "John 20:3-29, 1 Peter 1:8-12",
        "devo_title": "Our Savior’s Nail-Scarred Hands",
        "devo_summary": "\nBY Andrea Lucado\n\nAs a serial doubter, I have always loved the resurrection story and its honest portrayal of who was quick to believe Jesus was the risen Christ and who was more skeptical. Historically, I have been more like Thomas, wanting proof and evidence: “If I don’t see the mark of the nails in his hands, put my finger into the mark, and put my hand into his side, I will never believe” (John 20:25).\nMary Magdalene’s reaction to the risen Christ differed from that of Thomas. She believed as soon as Jesus spoke her name. “Rabboni!” she cried in recognition (v.16). And later when she saw the disciples, she said with confidence, “I have seen the Lord!” (v.18).\nThomas trusted Jesus’s scars. Mary trusted Jesus’s voice.\nIn my early twenties, I went through a dark season of doubt. Out in the real world for the first time, surrounded by people who did not believe in Christianity, much less God, I was suddenly very unsure of my own beliefs. I desperately wanted to prove God’s existence to my unbelieving friends—and to myself. So I searched for answers in apologetics, academics, and science, confident that if I could pull enough evidence together, I could believe again, and my friends would too.\nDuring that youthful season, it was not the hard evidence of academics and apologetics that I grew to trust and understand. Ultimately, what pulled me back to faith was this: At some point in my life I had known the risen Christ. I had felt the love of God through Him. I had experienced grace and forgiveness. I was not sure how to prove the existence of God through science, but I could not deny that I had experienced the risen Christ. I had heard Him say my name.\nThis is not to say investigating our faith is fruitless. After all, Jesus did not chastise Thomas for asking for proof. He gave it to him, saying, “Put your finger here and look at my hands. Reach out your hand and put it into my side. Don’t be faithless, but believe” (John 20:27). But even today, when I find myself wrestling with questions about God, the Bible, Jesus, or religion, what I return to is not the evidence I’ve gathered, proving His existence. What I remember is the fact that Jesus has touched my life, and I have seen the marks on it as a result. \nWhen the doubt is crippling, when the road before us is unclear, may we remember this day near the tomb. Mary Magdalene thought she had lost her friend, her teacher, her Rabbi. All was sorrow before and around her—and then, she heard Him speak her name. Have you heard Him speak yours?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day15-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Luke 24:9-49, Acts 13:32-38",
        "devo_title": "Our Savior on the Emmaus Road",
        "devo_summary": "\nBY Claire Gibson\n\nWhat would you do if you wanted to start a revolution? If you wanted to prove that you were the most powerful person to ever walk the earth? If you wanted to prove that you had in fact just been raised from the dead? What would you do first?\nI think I would shoot fireworks from my fingertips. Or maybe go to the people who had tried to kill me, and show them I was alive once again. I think I’d go flying around in the sky shouting from the rooftops. \nThese final few verses were Luke’s last chance to convince readers that Jesus really did rise from the dead. That He really is the Son of God. As a writer, I cannot fathom a more challenging task. But Luke made a decision. He decided to stick to the facts, and the facts are mind-bogglingly simple. \nFirst, the women. A group of women find the empty tomb and return to their friends babbling in an excited confusion. This in itself should convince us of the veracity of this story. After all, in the first century, women were considered unreliable witnesses; their testimony wasn’t even permitted in a court of law. Tim Keller writes: “If the Christians were making up these stories to get their movement off the ground, they never would have written women into the story as the first eyewitnesses to Jesus’s empty tomb. The only possible reason for the presence of women in these accounts is that they really were present and reported what they saw.”\nSecond, the walk. While Peter runs to the tomb to determine if what the women said is true, Jesus goes on a walk. Oh, how I love this story! Two disciples I’ve never heard of—Cleopas and a disciple who goes unnamed—are walking and talking, processing recent events, when this stranger sidles up next to them. They recount all the events of the week: “How have you not heard about this?!” And then, still under the guise of a stranger, Jesus begins to teach from the Scriptures, starting from Genesis 1:1. Jesus loves Scripture. He knows it—He is the Word made flesh, after all (John 1:14)—and His teaching sets their hearts aflame. They have a simple meal together, and then just as quickly as He appeared to them, Jesus was gone. \nThen, His words. Jesus’s first resurrected words to His gathered disciples were, “Peace be with you” (John 20:21). He knows they are terrified, full of doubt. And again, His first action in their presence is not to perform a miracle, but to perform the mundane. He invites them to touch Him, to see His hands and feet. He takes a bite of fish—at face value, an act not of divine power as much as simple human digestion. He then goes on to bless them and remind them of the meaning of the Scriptures, of what’s true. There is no rush. No hurry. In other words, Jesus acts in resurrection exactly as He had in life. Nothing has changed, and yet absolutely everything has. \nJesus is alive! He really is. And for that reason, I can trust that the rest of my life here on earth is but a shadow of what is to come. Jesus did not hustle. He did not worry. He did not feel threatened by doubt. He simply held up His hands and said, “Here… touch.” He walked alongside His friends, and He walks with you and me, too—even if we do not recognize Him at first. \n“The Lord has truly been raised” (Luke 24:34), and we are not the same. So go babble excitedly like the women that first Easter morning. Run to the empty tomb like Peter. Walk at a leisurely pace with your God. Invite Him to teach you through His Word. Break bread. Take a bite of fish. Everything is different now, even the seemingly mundane. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day16-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "John 21:1-19, 2 Peter 1:3-15",
        "devo_title": "Our Savior Restores",
        "devo_summary": "\nBY Rebecca Faires\n\nI get hungry every time I read the Gospels. So much eating! So much cooking and drinking—the clanking of plates and the clinking of cups veritably rings off the pages! Remember when Jesus departed from the disciples to face the cross? He did so with a parting meal. When He came to them again, resurrected, He served them breakfast on the beach. It’s hard to imagine literally anything better than breakfast on the beach—two of the best things in life all at once.\nAt other meals, both metaphorically and with real bread, Jesus is continually feeding His sheep, because He is the Good Shepherd. He reminds us that He is the bread of life and no other food will ultimately satisfy. And when He feeds us, He is teaching us what the kingdom of heaven looks like.\nHis kingdom is not of this world, and man does not live by bread alone. But Christ is also the Christ of feasts. He feeds every part of us, body and soul. And when He asks Peter, “Do you love me?” He follows with this: “Feed my sheep” (John 21:17). \nHe asks us the same question: “Do you love me?” If so, then you also will have a heart for the flock. Others will know we are His disciples in this way, that we love one another, we feed one another, and we share with one another the true and living bread of life—as well as the bread broken together at our own dining room tables.\nThe beckoning call of the kingdom says, “Come, everyone who is thirsty, come to the water; and you without silver, come, buy, and eat! Come, buy wine and milk without silver and without cost!” (Isaiah 55:1). The beckoning call of Christ is this: “Come and have breakfast” (John 21:12). Both are invitations to come to Him and to His table.\nRobert Farrar Capon, writer and cook, understood this. In his book, The Supper of the Lamb, he says: \n“To be sure, food keeps us alive, but that is only its smallest and most temporary work. Its eternal purpose is to furnish our sensibilities against the day when we shall sit down at the heavenly banquet and see how gracious the Lord is. Nourishment is necessary only for a while; what we shall need forever is taste.”\nSince the very beginning, God has fed us, calling us to feed from Christ, from the tree of life, rather than lean upon our own understanding or depend upon the bread of Egypt (Genesis 2–3; Exodus 16:3–8). He is using food to give us a taste for the eternal. He is using food to teach us that He is good and faithful. He is using food to teach us to feed one another. At every turn, we are called to “taste and see that the LORD is good” (Psalm 34:8).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day17-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Matthew 28:16-20, Daniel 7:13-14, 2 Corinthians 5:1-21",
        "devo_title": "Our Savior’s Great Commission",
        "devo_summary": "\nBY Erin Davis\n\nAllow me to show you two snapshots of my life. \nIn the first frame, I am a new believer on a mission trip to Jamaica. Our team went door to door handing out bags of seeds and sharing the gospel with any natives who would listen, a venture that was terrifying for me. First, the idea of talking to strangers (much less strangers in a foreign country) was intimidating. Second, sharing my faith scared me so much that I lied and claimed I had the spiritual gift of intercessory prayer. While the team knocked on doors, I stood at a distance and pretended to pray. Lest you desire to give me the benefit of the doubt—don’t. I lied about spiritual gifts to get out of sharing the good news, one of many reasons I am gobsmacked by the goodness of God’s grace. \nSnapshot two is more recent. I was invited to speak in a remote fishing village in Alaska. I would be dropped by bush plane into a region with no phones, where I would teach a native people group who were openly hostile to the gospel. My knees still knocked. My palms were plenty sweaty. But I went and delivered the good news to anyone who would listen—and a few who didn’t want to.\nWhat shifted? I got a bigger view of God. \nHere in chapter 28, the book of Matthew comes to a close with an awe-inspiring encounter between Jesus and His disciples. It’s a moment that could have been pulled from the movie Braveheart. The disciples have already scattered in fear during Jesus’s trials. They were nowhere to be found as He was being crucified and murdered. They mourned as His body was placed in a borrowed tomb. And then… they got a bigger view of God too. They felt the earth tremble as an angel rolled the stone away. They peeked inside the empty tomb. They ran their fingers along the scars in His hands. Everything they thought they knew about Jesus expanded, because now they served a risen Savior. \nThat’s why, when Jesus said, “All authority in heaven and on earth has been given to me” (v.18), they knew His words were true. And when He told them to “go,” they got busy going. Believer, aren’t you glad they did?\nChurch, we have been commissioned to go and tell, to preach and praise, to be disciples and make disciples. And there is only one reason to do it, one truth that will get our feet unstuck: Jesus. Is. Worthy. In this Lenten season may we gain a bigger view of Him. There’s a whole world waiting for us to go and tell. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day18-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Acts 1:1-11, John 14:18-21, Hebrews 1:1-13, Revelation 1:7",
        "devo_title": "Our Savior Ascends",
        "devo_summary": "\nBY Melanie Rainer\n\nI don’t remember the first presidential inauguration I watched as a child, but I vividly remember planning to have one of my own one day—complete with an inaugural ball, naturally. Today my daughter whirls around the living room, singing the songs of Queen Elsa’s coronation day from Frozen, feeling the same flutters of imagination that I did when I watched Princess Mia crowned princess of Genovia in The Princess Diaries. \nWe hardly ever think of inaugurations as the end of something, but rather as the beginning. And yet, when we read about Christ’s ascension in Acts 1, it can feel like the end of His story rather than the inauguration of His kingdom. \nHe ascends into heaven, sits down at the right hand of the Father, and history goes on. Often, I stop there: Christ, frozen in time, seated on the throne, and waiting for His return. \nBut the truth is so much richer, deeper, and more beautiful than that. When Jesus ascended into heaven, He received the mantle of King over all creation.\nWhen Christ ascended, He did so into a cloud. Clouds are often used in Scripture to reveal God’s divine presence, from the cloud that showed the Israelites where to travel by day (Exodus 13:22), to the cloud that filled the tabernacle (Exodus 40:35), to the cloud that appeared at the transfiguration (Matthew 17:5), and the cloud upon which Jesus will descend at His second coming (Revelation 1:7).\nChrist’s homecoming to God in Acts 1 foreshadows our own. But the ascension is more than foreshadowing; it also inaugurated Christ’s new role as our advocate. By joining the Father at His right hand, the risen Jesus grants us access to God. On the cross, He became our substitute. At the ascension, He has become our advocate. Tim Keller writes, “When the eyes of God the Father look at you, they see the ascended Jesus; when they listen to you, they hear him.” \nAnother element of Christ’s Kingship on full display at the ascension was His commissioning authority. Just before He rose to join God, He commissioned His disciples to spread the gospel—not just to the Jewish people, but everyone around the whole world: to Judea, Samaria, and the ends of the earth (Acts 1:8). Christ was claiming the whole earth as His kingdom as He rose to take His place as King. \nWe wait for Christ’s second coming, but today we remember the day He ascended victoriously to the right hand of the Father, inaugurating His rule as King over all His creation. We celebrate the glorious truth about His reign: \n“Your throne, O God, is forever and ever, and the scepter of your kingdom is a scepter of justice.” –Hebrews 1:8\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day19-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Psalm 68:18-19",
        "devo_title": "Grace day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n18 You ascended to the heights, taking away captives; you received gifts from people, even from the rebellious, so that the Lord God might dwell there.\n19 Blessed be the Lord! Day after day he bears our burdens; God is our salvation. Selah —Psalm 68:18–19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day20-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "John 14:19",
        "devo_title": "Resurrection Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the first half of the key verse for this plan.\n“In a little while the world will no longer see me, but you will see me. Because I live, you will live too.”  John 14:19\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day21-819x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Acts 2:22-36, Colossians 1:9-23",
        "devo_title": "Jesus Is Our Righteous King",
        "devo_summary": "\nBY Melanie Rainer\n\n“Is He coming? Where is He?”\nMy daughter craned her neck, trying to see from our spot in the very last row of the very old church we sat in on Good Friday. \n“What?” I whispered. \n“Jesus! Is He here? Is that the cross? Are those His bloody clothes?” she asked, pointing to the decorative cross draped in white cloth at the front of the sanctuary. \nMusic started, and she returned to doodling in the bulletin. Meanwhile, I was reeling. How do I answer that? In the particularly concrete mind of a four-year-old, of course it would make sense that Jesus would be present. We remind her over and over again that Jesus is real, and He is always with us. \nThe jump to faith, to believing in what we have not seen, is hard to explain to her, and harder still to model. But this is the tension we hold: we believe in something we cannot see, but it is something real and present and happening right now. \nChrist is holding session as King over all creation. Right now. This very moment. He has since the day He ascended, and He will until the day He returns. Christ’s “session” began when He ascended into heaven to sit at the right hand of God the Father. \nTheologian Karl Barth wrote, “The summit has been reached, the perfect tenses lie behind us and we enter the realm of the present… Whatever prosperity or defeat may occur in our space, whatever may become and pass away, there is one constant, one thing that remains and continues, this sitting of his at the right hand of God the Father.” \nFrom the day Adam and Eve fell and were banished from Eden, people have been waiting for a king. David, with promised covenant kingship, knew that a greater King was coming. He wrote in Psalm 110, “The LORD declared to my Lord, ‘Sit at my right hand until I make your enemies your footstool’” (v.1).\nGod called together a people, first through Abraham and his descendants, and later through the apostles whom Jesus commissioned to go to the nations and invite people into the kingdom. We are now God’s people: a chosen race, a royal priesthood, a holy nation, and a people for His possession. (1 Peter 2:9–10) And we are a people with a King, living by faith in the already-but-not-yet kingdom of Christ, inaugurated when He ascended to take His spot on the throne, “exalted to the right hand of God” (Acts 2:33). \nIn Colossians, Paul wrote that in His rescue of us, Christ has “ transferred us into the kingdom of the Son he loves” (Colossians 1:13). We, the communion of saints through the ages, live presently in the kingdom ruled by Jesus the Son, who holds His continuous session at the right hand of God. Our King holds all things together. \nWhen my daughter asks, “Where is He? Where is Jesus?” my answer isn’t as simple as pointing her to the front of the church. But it is an easy one: He is on His throne, seated at the right hand of God the Father, ruling His kingdom and loving His people. And our response to Him is honor, service, and faithfulness. \nThe sweet, sweet hymn “Fairest Lord Jesus” summarizes our posture so beautifully:\nFairest Lord Jesus, ruler of all nature, O thou of God and man the Son, Thee will I cherish, Thee will I honor, Thou, my soul’s glory, joy, and crown. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day22-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Hebrews 8:1-6, 1 Timothy 2:1-6, Jude 1:20-25",
        "devo_title": "Jesus Is Our Mediator",
        "devo_summary": "\nBY Erin Davis\n\nThe cross looms large over all of history. Its shadow is cast in all directions—forward and backward, before and behind. Every narrative in Scripture is draped in the gospel. \nThink back to the moment the children of Israel decided to worship a golden calf at the base of Mount Sinai (Exodus 32:1–14). God was poised to destroy them for their rebellion, and His holy wrath was fully justified.\nIn response, Moses turned to God, aware of how impossible it was for his people to save themselves from God’s just wrath. Unless he intervened, his beloved nation would be destroyed. In the end, the Israelites were spared, not because they were worthy or sinless (they weren’t), but because Moses pleaded for mercy on their behalf to a merciful God. \nAnd yet, Moses’s pleading can’t save you or me from our sin. Moses is gone, his body buried in a secret grave dug by the Lord Himself (Deuteronomy 34:5–7). Humanity’s part of God’s covenant with Moses is broken. We remain as rebellious as our Hebrew forefathers. But this is more than a story about a time when God saved a bunch of silly idol-worshippers. In the light of the cross, the image changes. True gospel hope emerges for you and for me. \n“These serve as a copy and shadow of the heavenly things, as Moses was warned when he was about to complete the tabernacle. For God said, ‘Be careful that you make everything according to the pattern that was shown to you on the mountain.’ But Jesus has now obtained a superior ministry, and to that degree he is the mediator of a better covenant, which has been established on better promises” (Hebrews 8:5–6, emphasis mine). \nChrist is our Mediator, the bridge to the better covenant. We are not—nor could we ever be—holy as He is holy (1 Peter 1:16). God’s wrath toward us is fully justified. In response, Jesus turned to face God, fully aware of how impossible it was for people to save themselves from God’s just wrath. Unless He intervened, His beloved Bride would be destroyed. \nAt the cross, Christ intervened for us. Yet He is not buried in a tomb. He arose with the power to keep pleading our case. Even now, this very moment, He advocates for us before the Father. He is the Savior who keeps saving us from our sin, the Mediator who keeps making our case, based on His righteousness, not our own. \nBeloved child of God, you have been spared. Not because you are worthy, but because Christ advocates for you. Amen. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day23-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "1 Corinthians 15:1-28, Colossians 3:1-17",
        "devo_title": "Jesus Is the Firstfruits of the Resurrection",
        "devo_summary": "\nBY Rebecca Faires\n\nI spent much of my twenties running a high school theatre department. We had so much fun. There are few things that bond people together like putting on a show with limited time and resources. One year we produced a spoof on Shakespeare. There was one line, shouted frantically by a young man dressed in an ornate Elizabethan dress as Juliet, that still makes me laugh: “SWEAR NOT BY THE MOON!”\nIn Shakespeare’s original play, Romeo and Juliet, young Juliet uses these words to warn Romeo to be careful with his vows, to not swear his love by the “inconstant moon,” which is ever-changing in its phases. Turns out Juliet’s warning is actually profound and timely advice for more folks than just Romeo.\nWhat we swear by is what we put our trust in, and it’s easy to misplace our trust. Maybe you don’t swear by the moon, but are you inclined to swear by your bank account, your job, your retirement plans, or your carefully scheduled week? It’s tempting to hope in things that are ultimately destined to fail, but when we try to build upon the unsteady foundation of our own whims and wistful thinking, we end up disappointed.\nPaul’s address to the church at Corinth, however, leaves no question about where we can lay our hope and fix our trust. He clarifies that the gospel does not fall short in any way. What is this gospel hope Paul speaks of? It is simply this: Christ was crucified for our transgressions and raised from the dead (Romans 4:25).\nIf Christ has not been raised from the dead, then we are much to be pitied (1 Corinthians 15:12–19). Like foolish Shakespearean moon-swearers, we have put our trust in something unreliable. How ridiculous would it be to trust in a god who dies and has no power beyond this earthly life? And so, if Christ has not been raised, then our faith in Him is as worthless as faith in the stock market or faith in the moon.\nBut Scripture is unequivocal: Christ has been raised from the dead. This declaration is no fool’s hope, but the sure foundation of our faith. Our faith is confirmed by fulfilled prophecy and eyewitness accounts. We can bet everything on Christ. Because “He has been raised from the dead,” we don’t have to swear by the moon or anything else. Our hope is secure in Christ’s resurrection.\nJesus Christ died and rose again for us. This is good news for the whole body of Christ, because “if the firstfruits are holy, so is the whole batch. And if the root is holy, so are the branches” (Romans 11:16). Because He has been raised, we who are united to Him by faith also have the guarantee of resurrection life, an everlasting and sure hope.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day24-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "1 Corinthians 15:35-58, 1 Thessalonians 4:13-18",
        "devo_title": "Jesus Is Our Returning Savior",
        "devo_summary": "\nBY Claire Gibson\n\nCorrie Ten Boom’s memoir The Hiding Place chronicles the Nazi occupation of Holland during WWII. Under constant watch, Corrie and her family decided to form an underground network of resistance, hiding Jewish men, women, and children in homes across Holland, including their own. They knew the day would come when the Nazis would learn the truth—and soon that day came. For their crimes against Germany, Corrie and Betsey were both sent to Ravensbruck Concentration camp, where their bodies deteriorated under the weight of overwork, malnutrition, and disease.\nIf that were the end of the story, it would be a tragedy. But day after day, in the flea-ridden dormitory that the guards would not enter for fear of being infested themselves, Corrie and Betsey read the Bible aloud for all the imprisoned women of Bunk 28. Holding daily services, they learned that the Word of God speaks boldly, even in—perhaps especially in—the darkest circumstances. And while their health faltered, their hearts grew more convinced that they would be together with God when the ordeal was over, whether through death or through survival.\nOur temporary bodies hold eternal souls. My body is susceptible to illness, breakdown, injury, paralysis, and even death. But my soul is eternal. My body might stop working all together; organs might fail, and my womb may never function as it was designed to function. That is okay with me. Because my body is not me. It is a temporary home for God to do His work in the world. Even if that work is in a place I do not recognize. Even if that work is in a concentration camp. \nDeath—real death—is not physical. Spiritual death is eternal separation from God, and that kind of death has been swallowed up forever, because our Lord Jesus Christ took the penalty for our sin as He hung on the cross. Now, “Death has been swallowed up in victory” (1 Corinthians 15:54). So while our bodies might deteriorate, our souls will grow closer to our Creator. And one day, when Christ returns with a shout (1 Thessalonians 4:16), we will be raised to be like Him, bearing the image of heaven. “In a moment, in the twinkling of an eye… we will be changed” (1 Corinthians 15:50–52).\nI pray that no one will ever experience anything as cruel and inhumane as a Nazi concentration camp. But all of us will at some point experience the impact of disease, death, and disappointment on this side of eternity. Those earthly losses are deep, and our heavenly Father grieves them with us. Yet in that grief, He invites us to shift our gaze to Him, to trust that He has plans that far exceed what we can see in this world, beyond the physical realm. \nWhen my time comes to shed this shell, I pray that God will give me the courage to believe the truth; I lose nothing when I lose a human body, because I gain everything in Him. For the believer, Christ’s resurrection has secured eternity with Him. One day soon, He will return for us, and we will always be with Him, forevermore (1 Thessalonians 4:17). “Thanks be to God, who gives us the victory through our Lord Jesus Christ!” (1 Corinthians 15:57).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day25-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "John 14:1-6, Hebrews 11:1-2, Hebrews 11:13-16, Revelation 21:1-8, Revelation 21:22-27, Revelation 22:1-5, Revelation 22:20",
        "devo_title": "Jesus Brings Us Home",
        "devo_summary": "\nBY Andrea Lucado\n\nNothing reveals my inner control freak like letting a friend take over the GPS while I drive. Accustomed to seeing each upcoming turn on Google maps, I assault my passenger-navigator with questions: When is my next turn? How much longer on this road? How many miles until we’re there? I’m sure my gracious navigator wishes I would shut up and drive, trusting that we are on the right road, and she will get us to our destination safely. \nThomas is a bit like an angsty driver in today’s passage. Jesus holds the GPS: “I am going away to prepare a place for you” (John 14:2). But Thomas needs more details, a specific address: “‘Lord,’ Thomas said, ‘we don’t know where you’re going. How can we know the way?’” (v.5).\nJesus’s answer to Thomas was simply, “I am the way, the truth, and the life” (v.6, emphasis added). He did not provide Thomas with a specific address, but Jesus did point to the road that would get him there.\nThis is a reassuring promise to a control freak like me, and it’s as much a promise for the life to come as it is for our lives today. So often I feel like I need to know my exact destination and then figure out how to get there. Where is my career headed? How do I mend this broken friendship? Where will I live when my lease is up? Jesus may not provide specific answers, but He has asked us to believe and trust in the way He’s paved for us. \nWhere is my career headed?  “I am the way, the truth, and the life.” \nHow do I mend this broken friendship?  “I am the way, the truth, and the life.” \nWhere will I live when my lease is up?  “I am the way, the truth, and the life.” \nWant to know where your life is headed? Follow the way of Jesus. Live life in the way He told us to live it. Believe in God, believe also in Christ, and you will get to where you’re supposed to go. \nLiving in the way of Jesus is counterintuitive for those of us who like to both drive and hold the GPS. It requires surrender. It requires us to trust our navigator. When we do this, however hard it may be, we’re able to be present on the journey without worrying about the destination.\nThough we cannot point to it on a map, ultimately, we know where are headed. Perhaps we don’t know how long it will take us to get there, but one thing we know for sure: Christ our Lord has prepared a place for us there, and He is coming back to receive us to Himself (v.3). For that promise, let us say, Praise be to God! \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day26-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "Job 19:25-27",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n25 But I know that my Redeemer lives, and at the end he will stand on the dust. 26 Even after my skin has been destroyed, yet I will see God in my flesh. 27 I will see him myself; my eyes will look at him, and not as a stranger.  My heart longs within me. —Job 19:25–27\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/SRT-Easter-Instagram-Day27-1024x1024.jpg"
    },
    {
        "book_title": "Because He Lives",
        "devo_passages": "John 14:20",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the second half of the key verse for this plan.\n“On that day you will know that I am in my Father, you are in me, and I am in you.”  —John 14:20\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/4-Easter-4-576x1024.jpg"
    }

    {
        "book_title": "Give Thanks",
        "devo_passages": "1 Chronicles 16:4-36, Psalm 107:8, Psalm 118:21, Isaiah 38:17-19, Hebrews 13:15",
        "devo_title": "What Does It Mean to Give Thanks?",
        "devo_summary": "\nBY Jessica Lamb\n\nScripture Reading: 1 Chronicles 16:4-36, Psalm 107:8, Psalm 118:21, Isaiah 38:17-19, Hebrews 13:15\nOne year ago, my husband woke up to the smell of smoke filling our home. The rest of the morning is a blur—calling 911, then standing barefoot on a neighbor’s front lawn while the fire department extinguished flames on the house we’d finished unpacking only the day before. We’d moved more than a thousand miles to this new place and knew only my coworkers and a neighbor or two through brief introductions. \nPeople were quick to help. Near strangers offered us guest rooms and finished basements. A neighbor brought my daughter a stuffed animal to hold. My new coworkers showed up with lunch, and old friends sent gift cards. At one point, exhausted and spent, I found a laundry basket full of toiletries and groceries on the doorstep of our temporary residence. \nThe juxtaposition of kind acts against our difficult circumstances kept God, His goodness, and His constancy at the front of my mind. But now, in the safe routine of my daily life, I’m ashamed to say I go long stretches without pausing to thank God. I treat gratitude toward Him like a pile of thank-you notes I never get around to writing. \nMaybe the opposite is true for you. Maybe in seasons of abundance, it is easy for you to remember that every good gift comes from God; however, in seasons of sorrow, words of thanksgiving stick in your throat. Still, God’s Word to us in 1 Thessalonians 5:16–17 remains the same: It is His will for us in Christ Jesus to give thanks in everything. \nThe Bible presents gratitude as more than a box to check or a note to send. In each of today’s readings, we see that a grateful heart isn’t a response to our circumstances or possessions. It is a posture of worship, an active response to our unchanging God and what He has already accomplished and continues to accomplish.\nIn 1 Chronicles 16, David decrees that the people of God give thanks to Him in proclaiming His deeds and sharing about His wondrous works. The psalmist points to God’s faithful love and act of salvation as reasons to thank Him. Isaiah tells us thanksgiving is a privilege reserved for the living. We’re shown in these words how we can cultivate thanksgiving in ourselves by taking time to notice who God is, what He has done, and what He continues to do. \nGiving thanks isn’t complicated, but it isn’t easy either. It is a discipline—the habit of turning our hearts and minds to the past and present work of our good God. I pray this study of biblical gratitude will bring you peace and confidence in God’s care for you, and point you toward Him in praise and thanksgiving. We have been given so much in Him.\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day1.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 136:1-26, Hebrews 12:28-29, Revelation 4:9-11, Revelation 11:16-17",
        "devo_title": "Why Do We Give Thanks?",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Psalm 136:1-26, Hebrews 12:28-29, Revelation 4:9-11, Revelation 11:16-17\nI have a three-year-old right now. (Don’t make fun of me. I’ll remove the marker stains from my table legs and find all my measuring cups when he’s older.) He loves to see things done over and over again. Horsey ride? Do it again! Final chapter of a book? Start it again! Improperly played chess game? Let’s play again! Maybe you have or know children like this—children who delight in simple things.  \n Author G. K. Chesterton wonderfully likened the delight of children to that of God’s joy over His creation. He described it in this way:\n “Because children have abounding vitality, because they are in spirit fierce and free, therefore they want things repeated and unchanged. They always say, ‘Do it again’; and the grown-up person does it again until he is nearly dead. For grown-up people are not strong enough to exult in monotony. But perhaps God is strong enough to exult in monotony. It is possible that God says every morning, ‘Do it again’ to the sun; and every evening, ‘Do it again’ to the moon. It may not be automatic necessity that makes all daisies alike; it may be that God makes every daisy separately, but has never got tired of making them. It may be that He has the eternal appetite of infancy; for we have sinned and grown old, and our Father is younger than we.”\nOur Father has the energy to forever celebrate and endlessly love. And if there’s one thing that’s worth repeating twenty-six times, it’s “His faithful love endures forever” (Psalm 136:1). But the psalmist isn’t just repeating these words; he’s listing example after example of how God has shown His faithful love to His people. And this insistent repetition shows us how His love isn’t just repeated in the past, because He continues to love us in the future, again and again. Forever.\nWe are sinful and just tired out. We grow weary of giving one more horsey ride, handling one more irate customer, navigating another family conflict, and facing yet another rejection. But God’s love is new every morning, and our only response to His steadfast love ought to be thankfulness.\nThank you, Lord, for giving us another day to learn and try again.\nThank you, Lord, for giving us these beautiful children.\nThank you, Lord, for sustaining us and providing everything we need.\nThank you, Lord, for your everlasting, never-ending, never-giving-up faithful love.\n\nEven when we don’t have the energy or enthusiasm to celebrate the sunrise, let alone say, “Do it again!” in those dark morning hours, God’s love for us and for His creation is unbounded. He loves us again, and again, and again, and again. In the face of this kind of love, our hearts will warm with thanksgiving.\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day2.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "2 Chronicles 6:13-14, Psalm 100:1-5, Lamentations 3:22-23 , 1 Timothy 4:4-5, Philippians 2:1-11",
        "devo_title": "The Posture of Thanksgiving",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Chronicles 6:13-14, Psalm 100:1-5, Lamentations 3:22-23 , 1 Timothy 4:4-5, Philippians 2:1-11\nEvery morning, when my newborn baby wakes, his arms spring upward. His grandma says he’s growing, but what if, instead, he’s just really grateful?\nI’ve been paying attention, and our bodies, it seems, give thanks automatically. \nLittle girls twirl and giggle with the delight of being alive without ever watching a YouTube tutorial. \nWhen we’ve been spared a calamity or rescued from peril, our lungs naturally heave deep sighs that sound a whole lot like “Yahweh,” one of the powerful names of our rescuing God. As we age, our shoulders tend to stoop. Sure, there’s a medical reason for the change, but is it possible that age brings humble gratitude? Might we naturally bend lower as the years reveal the faithfulness of God?\nWe tend to think of gratitude like a greeting card, a warm sentiment sent to someone special. Or maybe it’s a journal entry, a place where we are “intentional” to write down our expressions of thanks. \nBut what if gratitude doesn’t require pen and paper or a stamp? \nHere in 2 Chronicles chapter 6, Solomon’s body seems electrified with thanks. First, he stands and spreads out his hands, gratefully receiving the gifts of God’s favor (v.12). Next, he kneels, lifting his hands toward heaven. We might expect Solomon to parade or puff up at this important occasion. Instead, he lowers his body into a posture of humility (v.13). Gratitude will do that; it knocks us out, and lays us flat. \nMary must have knelt before Jesus as she poured perfume on His feet and wiped them with her hair (John 12:3). Since Jesus had just raised her brother from the dead, surely Mary knew the kind of gratitude that leaves us awestruck and weak at the knees. \nEventually, we’ll all kneel before Him (Philippians 2:10). I’ve always assumed it was shame or sheer power that would bend our knees, but maybe not. As the beloved, adopted daughters of God, recipients of His undeserved grace, I imagine we will kneel with delight, bowled over with gratitude for the things He has done for us. Quadriplegic Joni Eareckson Tada said it this way: \n“On the day I receive my new body in heaven, I’m sure Jesus will be delighted to watch me stretch glorified muscles and dance on tiptoe. But there’s something I plan to do that may please Him more. I will kneel. To choose not to move in heaven will be my demonstration to Him of heartfelt thanks for the grace He gave all those many years when my legs and hands were paralyzed. It will be my sacrifice of praise.”\nWe don’t have to wait for the trumpet blast or the moment we are called heavenward to express our gratitude. Like my little fella greets the morning from his bassinet, let’s reach forward in praise right now, refusing to keep our thanksgiving neat and tidy, confined to a postcard or a lined journal page. \nMay our hearts learn to bend in gratitude to our God, for there is “no God like [Him] in heaven or on earth, who keeps his gracious covenant with [His] servants who walk before [Him] with all their heart (2 Chronicles 6:14). May we shout it from the rooftops and dance it out in the streets. May we bend our knees in humble thanksgiving, and laugh with utter delight in Him, knowing He delights in us (149:3–4).\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day3.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Ezra 3:11, Acts 2:42-47, Ephesians 5:15-21, Philippians 4:4-9, Colossians 4:2",
        "devo_title": "How We Give Thanks",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Ezra 3:11, Acts 2:42-47, Ephesians 5:15-21, Philippians 4:4-9, Colossians 4:2\nI was somewhat unfamiliar with the concept of spiritual disciplines until I took a class on them in seminary. In that course, we read a litany of life-changing books on prayer, fasting, Sabbath, and more. The guilt-inducing tradition of daily “quiet time” in my life was transformed into a rich and beautiful understanding of practices that led me closer to the heart of Jesus.\nThere are different ways to categorize spiritual disciplines, which are regular exercises that strengthen our faith. Spiritual disciplines are the stretching, sprints, pace runs, and hill drills of the Christian life.\nRichard Foster, who wrote the seminal Celebration of Discipline, places these disciplines into three buckets: inward (meditation, prayer, fasting, study), outward (simplicity, solitude, submission, service), and corporate (confession, worship, guidance, celebration). \nAs I read through today’s Scriptures, passages that show us how to give thanks, the actions of gratitude overlapped with many of the spiritual disciplines I’d studied: praise (Ezra 3:11), simplicity (Acts 2:45), corporate worship (Acts 2:46), feasting (Acts 2:46), singing (Ephesians 5:19), prayer (Philippians 4:6; Colossians 4:2). \nGratitude is a daily discipline that must be practiced, like stretching after a long run or racing up and down stairs to strengthen different muscle groups. It is an instruction found throughout the Bible—not a “say please and thank you” sort of direction like you would give a child, but a command to bring gratitude into every sphere of living and every moment of the day: “Rejoice in the Lord always. I will say it again: Rejoice!” (Philippians 4:4).\nAnd so, we give thanks in practice, with actions: with praise, worship, feasting, singing, and prayer. We give thanks inwardly, outwardly, and corporately. How we give thanks reflects the One to whom we give thanks. He is an active, engaged, intimate, and corporate Father. To Him be all glory, and thanksgiving, forever. \n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day4.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Matthew 15:35-37, Luke 10:21-24, John 11:39-44, Luke 22:14-20",
        "devo_title": "When Jesus Gave Thanks",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Matthew 15:35-37, Luke 10:21-24, John 11:39-44, Luke 22:14-20\nOne of my pastors often quotes the Heidelberg Catechism before we receive communion: “As assuredly as I receive from the hands of the minister, and taste with my mouth the bread and cup of the Lord, as certain signs of the body and blood of Christ.” When the bread crumbles in my mouth and the wine washes it down, I think, This is how sure I am that Christ is who He says He is. For a chronic doubter like me, it has been a grace to view communion in this way. \nI often think of the disciples at that first communion, when Jesus took the bread, gave thanks for it, broke it, and gave it to them, saying what must have been cryptic words to the disciples, who didn’t have the advantage of hindsight we do. For them, this seemed an ordinary Passover meal. They didn’t yet know that their Father had been foretelling the story of their Messiah every year for generations. \nThere was another meal where Jesus took bread, gave thanks before breaking it and giving it to many, with so many leftovers they filled seven basketfuls (Matthew 15:35–37). Jesus was preaching the gospel in this meal, too, a foretaste of the last supper to come. He was showing them how breaking bread would never be the same again—not because the bread was extraordinary, but because the Blesser of it was. \nIn both meals, Jesus was showing His disciples that broken things aren’t the end of the story. He was essentially saying: I give thanks for the breaking about to come, because I know there is a bounty to follow you can’t even imagine. \nWhen you next take communion, I encourage you to feel the breaking of the bread in your mouth, to taste every crumb. And I encourage you to thank your Father, as Jesus did, knowing this mere meal points to a gospel more real than you can imagine, and a feast more bountiful than you could ever supply on your own. \n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day5.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 100:1-3",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nLet the whole earth shout triumphantly to God!\nServe the LORD with gladness;\ncome before him with joyful songs.\nAcknowledge that the LORD is God.\nHe made us, and we are his—\nhis people, the sheep of his pasture.\nPsalm 100:1–3\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day6.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 107:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse points us towards God’s faithful love as the reason for our gratitude. \nLet them give thanks to the LORD\nfor his faithful love\nand his wondrous works for all humanity.\nPsalm 107:8\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/4-GiveThanks-1.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 95:1-7, Luke 15:1-10, Luke 17:11-19, Colossians 1:9-14",
        "devo_title": "Give Thanks in Joy",
        "devo_summary": "\nBY Claire Gibson\n\nScripture Reading: Psalm 95:1-7, Luke 15:1-10, Luke 17:11-19, Colossians 1:9-14\nWhile we wait in the zoo parking lot, my son sits contentedly in his carseat, looking out the window. I watch countless minivans pull in. Women unload their children and strollers and other well-used zoo gear. Eventually, my friend pulls up in her own minivan, and we join the procession, pushing strollers toward the entrance. As we walk, I can see my son’s bare feet sticking out just beyond the shade of the stroller canopy. They are happy feet—slightly tanned, with little flecks of dirt caught under his toenails. \nFor years, this scene would have sent me home sobbing, because there was a time when barrenness felt all-encompassing. But as I look around, it hits me: he’s home. The adoption is nearly final now. I really am a mother. The wait is finally over. It’s a moment that makes me want to stop and dance. I want to stop everyone and tell them all the ways God has been faithful to me, to my husband, to our new son. \nSeasons of joy can feel rare in this life, but when they come, God invites us to throw a party, to celebrate His goodness. Jesus’s parables are full of parties! Have you ever noticed this? Over and over again, fattened calves are slaughtered, invitations are sent out, banquet tables are set. Jesus calls us into a joyful, hopeful, peace-that-passes-understanding kind of living that turns the music way up. He invites me to celebrate, because praise brings me into His presence. And He wants to be with me.\nLife is full of valleys. But it is essential to remember that valleys are made of two mountains. We may reap in tears, but joy will come. God doesn’t tell us when, but He does promise that He will restore all the years the locusts ate (Joel 2:25). And when that happens, let us not hide our joy away for fear of being boastful. The same God who mourns with us in the valley will be ready to dance with us on the mountaintop. \nPerhaps you don’t feel like you have the resources to praise God right now. That’s okay. God’s Word says we ought to “give thanks in everything; for this is God’s will for you in Christ Jesus” (1 Thessalonians 5:18). Such a command might seem like a burden during a season when prayers seem to go unanswered, but it is really an invitation to freedom. Even when walking through a deep valley, we can be confident a mountain is coming. We can praise God despite our current circumstances because He is good and He does not forsake us. \nThis kind of praise is counter-cultural to the world we live in. It’s not intuitive. Praising like this requires practice. Partying and celebrating like this requires practice. It’s a practice of remembering that God is always with us. “Let us enter his presence with thanksgiving; let us shout triumphantly to him in song” (Psalm 95:2).\nThat day in the zoo parking lot woke me up. For years, I’d missed out on God’s parties. Thanksgiving is available to me at all times—whether things are good or bad, whether my heart is aching or singing. And as I walked through the zoo, listening to the animals lift their voices to their Creator, I tried to do the same. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day8.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 31:7-24, Isaiah 35:9-10, Jeremiah 31:25, Romans 15:13, James 1:2-4, 1 Peter 4:12-19",
        "devo_title": "Give Thanks in Sorrow and Suffering",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 31:7-24, Isaiah 35:9-10, Jeremiah 31:25, Romans 15:13, James 1:2-4, 1 Peter 4:12-19\nI live in the heart of Missouri wine country. Weâ€™re not quite Napa Valley, but we do have grape vineyards as far as the eye can see. Each year, at our Grape and Fall Festival, we roll up our pant legs and step into giant vats of grapes, just like in my favorite episode of I Love Lucy. As the grape pulp squishes between our toes, juice runs out of spigots to be made into wine. It’s a process I enjoy during our annual town festival but struggle to embrace the rest of the year. \nLife hands us plenty of sour grapes doesn’t it? I’m sure I’m not alone in feeling perpetually squeezed and squashed. We can all empathize with the psalmist who wrote,\n“Be gracious to me, LORD,\nbecause I am in distress;\nmy eyes are worn out from frustration-\nmy whole being as well. Indeed, my life is consumed with grief\nand my years with groaning;\nmy strength has failed\nbecause of my iniquity,\nand my bones waste away” (Psalm 31:9-10). \nAnd yet, God calls us to face suffering with “abundant hope” (Romans 15:13), to “count it all joy” (James 1:2). Instead of pouting, wilting, or wailing in the face of sorrow, God asks us to”rejoice” (1 Peter 4:13).\nHow can this be?\nBecause He is already distilling our sour grapes into new wine. Because He promises to “satisfy the weary sou” – replenish it (Jeremiah 31:25). Redemption was purchased at the cross and will be finished when Christ returns for us. On that day, we will gather together for the marriage supper of the Lamb and raise our glasses to the God who has who redeemed our souls and our suffering. The pain that seems so palpable now, will become but a fading memory.\nAs we await that day, we can rejoice and be glad because God’s love is faithful. We can trust Him because He has seen our affliction and knows the troubles of our souls, and His response to our suffering is to offer us freedom that can only be found in Him (Psalm 31:7-8). Sure, we can drop our heads and keep staring at the hurt. But we can also choose to respond with thanksgiving instead, knowing that every sorrow is something God has already started to transform. \n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day9.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Ecclesiastes 5:18-20, Genesis 2:4-9, Genesis 2:15, Nehemiah 2:11-18, Psalm 90:17, Acts 20:35, Colossians 3:17",
        "devo_title": "Give Thanks in Work",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Ecclesiastes 5:18-20, Genesis 2:4-9, Genesis 2:15, Nehemiah 2:11-18, Psalm 90:17, Acts 20:35, Colossians 3:17\nEven before the fall, we were created to work (Genesis 2:15). And while it feels good to sleep in on occasion, I believe we all can agree on the immense satisfaction that comes from work. Many of our proudest moments come from a job well done. (I’m looking at you, summer garden strawberries.)\nThough we were created for work, the work we have to do is not always work we love. Because of the curse, we will sometimes work really hard and see nothing for our efforts. (I mean, I planted fifty watermelon seeds and not one watermelon. I’m sure it could happen to anyone. No big deal.) For our work to be profitable, the Lord must redeem it and bless it. When everything comes together, we get to do work that we love, work that yields a good result and is blessed by the Lord. I think that’s everyone’s dream.\nHow do we achieve this dream of perfect work? What can we do to get the Lord to “establish the work of our hands”? (Psalm 90:17). Here’s the tricky bit. We can’t. The favor of the Lord looks different at different times, and wealth and success are not necessarily measures of His favor. Our task is to keep working with a good heart, even when the circumstances are far from perfect.\nThe greatest work of all is the work of our salvation. That work has already been done by Christ-all our work is secondary to His. So we work from a place of thankfulness and obedience, knowing that the greatest work is already complete.\nNehemiah worked from a place of trust and thanksgiving (Nehemiah 2:17-18). He didn’t know that one of the gates he rebuilt would mark the spot where Jesus would one day enter Jerusalem, riding on a donkey as the people shouted “Hosanna!” (Matthew 21:1-11). We don’t always know precisely what work we are called to do or for what purpose; I find that I rarely know. But we do know we are called to do good work, and that we are called to continue our work faithfully. We work and hope because the greatest work has already been done for us.\nWhether you feel you are engaged in the greatest calling of your life, every day singing with purpose, or if you are planting seeds in a garden with little hope that they will sprout, you can echo with Paul: “Whatever you do, in word or in deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him” (Colossians 3:17).\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelorâ€™s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day10.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Numbers 6:22-27, Exodus 20:8-11, Micah 4:1-5, Luke 10:38-42, John 14:27, Hebrews 4:9-11",
        "devo_title": "Give Thanks in Rest",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Numbers 6:22-27, Exodus 20:8-11, Micah 4:1-5, Luke 10:38-42, John 14:27, Hebrews 4:9-11\nI’m the person who makes an itinerary for vacation. I resist the urge to print or laminate anything, but I almost always create a list. I do it, partly to get the most fun out of a trip, and partly because I feel awful when I don’t accomplish things. Even on vacation, I feel the need to be “productive.”\nThat is why I am shaken by Jesus’s words, “I do not give to you as the world gives” (John 14:27). Lately, I’ve been noticing that what the world gives me isn’t worth what it wants in return. The world asks me to hand over my time, energy, and talents in return for a tiny piece of a fading empire. And the world is never satisfied. When I give her my best, even sacrificing my health and desires, her admiration lasts but mere moments. She always wants more from me.\nEarly on in life, I learned to chase what the world could provide. I became a planner and an achiever. I found my worth in accomplishments, however fleeting the reward. I forgot how to be still. But the lesson I’ve been learning is that I will never find peace in the way of the world.\nAre you like me? Have you believed the lie of the world, that it will give you happiness if you just try harder? The message of Jesus is completely contrary to the message of the world. While the world promises happiness it will never deliver, Jesus pledges peace from His Spirit. While the world asks us to scramble like rats on a wheel, our Father God asks us to stop and rest.\nWe all want joy and peace, but few of us listen to the Lord’s guidance on how to get it. From the very beginning of time, God clearly commanded men and women to rest. Six days the Lord labored, and on the seventh, He rested (Exodus 20:11). He instructed His people to do the same, blessing the Sabbath day. Of all the Ten Commandments, I think our culture downplays this one the most.\nEven within Christian culture, we can confuse our worth with our work. Serving others is honorable, but when you can’t stop for even a day, you are listening to the voice of the world.\nThe almighty Creator didn’t need to rest from His work because He was weak, tired, or spent, and yet He chose to do just that. As bearers of His image, our souls were created to mirror the Lord in all things, including rest. God allows us—even commands us—to rest.\nThe world is a lousy gift giver. No matter what it offers us, what we really need can be found in the arms of the Father. God calls us into the rhythm He established at the formation of all things. It’s a rhythm good for our souls. The Son of God invites us to Himself, saying, “Come to me, all of you who are weary and burdened, and I will give you rest” (Matthew 11:28). Let’s give thanks today for Christ’s restful way that leads to peace.\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day111.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 23:1-6, 1 Chronicles 29:10-13, Deuteronomy 6:10-15, Haggai 1:2-6, Philippians 4:12",
        "devo_title": "Give Thanks in Plenty and in Want",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 23:1-6, 1 Chronicles 29:10-13, Deuteronomy 6:10-15, Haggai 1:2-6, Philippians 4:12\nSaying thank you is something we learn to do almost as soon as we can speak. We’re taught to thank a person for things like passing the salt, blessing us after we sneeze, or holding a door open for us. The absence of a thank-you in those circumstances will most likely draw disapproving looks, and your parents’ skills in raising a decent human being will be severely questioned.\n\nThere’s an unwritten rule in our culture that when someone does something kind for us, we owe them something in return. From the time we’re little kids, we’re conditioned to offer thanks when we experience good at the hand of another. And it logically follows that the not-so-good things don’t deserve our thanks. We’re not taught to offer thanks when a stranger stumbles into us on the street, let alone when a friend offends us. And why should we say thanks? We feel slighted, and now they owe us. It seems so simple: Good things deserve our gratitude. Bad things deserve our righteous indignation—or stale indifference at best. Makes sense, right?\nWhen I read Paul’s words to the Philippians, I have one eyebrow raised in defiance. Of course Paul, arguably the greatest missionary of all time, has “learned the secret of being content” (Philippians 4:12). How am I, a regular girl with a regular life, supposed to get in on that secret to contentment? I fill my mind with “evidence” to prove that I should be excused from being content in every situation: unanswered prayers, a dry bank account, and broken relationships top the list of reasons I might be excused.\nAnd then, of course, I’m confronted with my sin once again. The Holy Spirit has a way of knocking me off my feet and onto my knees in the gentlest way. (This can leave me simultaneously exasperated and grateful, if I’m honest.) As I consider what it means to give thanks and be content in all things, I see hidden in my heart an attitude that tells me I deserve every good thing coming my way. Conversely, whenever I consider myself in a season of lack, I can start to believe God owes me for my inconvenience.\nYikes.\nWhen I actually take a minute to examine my life through the lens of the gospel, it becomes awfully clear who owes who in my relationship with God. Here’s a hint: it’s me. It’s always me. Because even in times of struggle or hardship, the fact remains that each breath I breathe is a mercy of the living God. In times of abundance and plenty, I’m still dependent on Him—nothing I have is of my own strength or ability.\nEverything in Paul’s life was laid before the Father, everything was offered in service. And so whatever he was forced to endure was nothing compared to the glory of a life poured out in obedience to God. That’s the secret to contentment: it’s all about God, not me. From Him, through Him, and to Him are all things. To Him be glory forever!\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day12.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "1 Chronicles 29:11–13",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n11 Yours, LORD, is the greatness and the power and the glory and the splendor and the majesty, for everything in the heavens and on earth belongs to you. Yours, LORD, is the kingdom, and you are exalted as head over all. 12 Riches and honor come from you, and you are the ruler of everything. Power and might are in your hand, and it is in your hand to make great and to give strength to all. 13 Now therefore, our God, we give you thanks and praise your glorious name.\n1 Chronicles 29:11–13\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day13.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 31:7-8a",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a reminder that we can give thanks in everything because God sees and knows our troubles.\nI will rejoice and be glad in your faithful love\nbecause you have seen my affliction.\nYou know the troubles of my soul\nand have not handed me over to the enemy.\nPsalm 31:7-8a\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/4-GiveThanks-2.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 94:12-15, Psalm 119:62, Proverbs 4:1-9, Ezekiel 33:7-15, Luke 17:3-4 ",
        "devo_title": "Give Thanks for God’s Discipline",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 94:12-15, Psalm 119:62, Proverbs 4:1-9, Ezekiel 33:7-15, Luke 17:3-4 \nFor the past five or six months, I’ve struggled with an insomnia of sorts. If I take a sleeping aid, I fall asleep quickly—but then wake in the middle of the night, wide-eyed and alert. If I don’t take a sleeping aid, I lay in bed for hours with my mind racing. I should put a little notebook at my bedside where I can jot down all the brilliant ideas I’ve had as my husband and pup snore softly in the darkness of our room. I would probably be more productive in the morning, armed with a list of midnight solutions.\nAlong with those sleepless moments of clarity, though, there have been painful realizations about my character and personality—things I’m less likely to want to collect in a bedside notebook. Areas of my heart where fear, guilt, or shame arise. Places I’d rather the Lord not see or address in my thought-patterns or ruminations. I feel my frailty in those night-time hours, far more than I feel them the following morning.\nDavid, too, knew the vulnerability of the night and of God’s discipline to him in it.\n“I rise at midnight to thank you\nfor your righteous judgments.”\n– Psalm 119:62\nIn sleeplessness, David—the one after own God’s heart, whom God relentlessly pursued for His purposes—thanked God for His righteous judgments. He thanked God for keeping His promise to deal with sin, to not overlook it. The fact that God disciplined David for his sin and it kept David awake at night, shows God to be attentive to sin and to His children who wrestle with it.\nJesus Christ has taken our punishment in full, the recompense for our sin. But the pressing discipline of God, shaping and forming us more in His likeness, is the promise of the Father to all His children (Hebrews 12:6). In Psalm 94, David speaks again of the Lord’s discipline, describing it as a “relief from troubled times” because “the administration of [His] justice will again be righteous, and all the upight in heart will follow it” (vv.13.15). And so by pressing in to God’s discipline, instead of away from it, we will gain His wisdom and understanding—“a garland of favor” on our heads, a “crown of beauty” (Proverbs 4:1–7).\nI don’t know when those moments of restlessness and conviction happen for you, when you see the discipline of God as both painful and good, difficult and righteous. Maybe it’s when you’re up late into the dark morning hours. Or perhaps when you are confronted with a difficult situation or person. Or maybe it happens when you’re simply bored or sad, withdrawing just enough to finally be still and listen.\nI can choose to be thankful for God’s attentiveness as He reveals my heart to me, or I can continue to run from His discipline. But I want be like David, instead—intentional with my waking moments and grateful to God that He never sleeps or slumbers through my life (Psalm 121:4). He is always with with me, ready to awaken me to His righteous judgments, which are always for my good and His glory.\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day15.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Luke 7:36-50, Ephesians 2:4-10, 2 Corinthians 4:7-15",
        "devo_title": "Give Thanks for Mercy",
        "devo_summary": "\nBY Claire Gibson\n\nScripture Reading: Luke 7:36-50, Ephesians 2:4-10,  2 Corinthians 4:7-15\nWhen was the last time you kissed someone’s feet? When was the last time that you had enough tears to wash… anything?\nThis story in Luke 7 exists to show us a genuine response to God’s overwhelming mercy. I wonder what commotion this woman’s weeping must have made at the Pharisees’ table. Imagine her there on the floor, openly weeping in front of strangers. She disregards their disapproval and makes a radical display of devotion. Jesus bends down, looks her in the eyes and holds her hand. Then He wipes the tears from her face and tells her the truth: Her weeping is not in vain. Her sins are forgiven. She came in weeping, but can go out rejoicing.\nMeanwhile, the hosting Pharisee does not ask who she is, what she’s doing, or why she’s doing it. He doesn’t provide her a seat at the table. He assumes that since he knows about her past, he knows everything about her future too. He talks about her, but doesn’t care for her. He judges her by what she’s done, not by what God will do for her. He’s misses the miracle. But when Jesus looks upon this weeping woman, He sees the beauty in her sacrifice and in her heart. When Jesus sees her, He offers her abundant mercy and a new identity.\nThis is our God! When I humble myself before Him, He forgives everything and puts my feet on a whole new path. When Jesus explains His parable of the creditor with two debtors to the Pharisee, He says, “Her many sins have been forgiven; that is why she loved much. But the one who is forgiven little, loves little” (Luke 7:47–48).\nThis woman isn’t a worse sinner—she’s a better seer. Unlike the Pharisee, she sees her sin for what it is. She knows her debts and doesn’t try to minimize them. Rather than trying to hide her mistakes, she grieves openly for how she’s failed. In using the parable, Jesus is inviting the Pharisee to see his sin with a clearer vision, to see that the molehill of sin in his heart is actually a mountain. Right perspective on the magnitude of sin leads to a radical posture of gratitude toward God.\nJesus isn’t saying we need to sin more in order to love Him more. He’s inviting us to see the evil of our sin without mitigation. Only after taking a brutally honest look at ourselves will we be able to appreciate the merciful, caring, forgiving gaze of our Savior. He lovingly looks us in the eyes and gently wipes away our tears. He sets our feet on new paths. May we focus on that change today and, with grateful hearts, thank Him for all He’s done for us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day16.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Habakkuk 3:17-19, Matthew 6:25-34, John 6:4-14, 1 Peter 5:6-7",
        "devo_title": "Give Thanks in Anxiety",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Habakkuk 3:17-19, Matthew 6:25-34, John 6:4-14, 1 Peter 5:6-7\nThinking back over the course of my life, I can’t remember a time when anxiety hasn’t been present. As an anxious kid, I used to stay up at all hours of the night, terrified that our house was going to burn down. Though wildfires aren’t normally a concern in Alabama, where I grew up, the fear of fire fed my anxiety throughout my childhood and shifted into other worries as I got older.\nWhen I started driving, I worried about whether or not I’d closed the garage door after pulling out of the driveway. When I moved into my own apartment, I worried about whether I’d locked the door, or left the stovetop on, or—Oh my goodness, did I unplug my curling iron, or is it going to be sitting too close to that hand towel and burn the whole building down?\nYou get the idea.\nThe simplicity of the heading from today’s reading in Matthew 6 grabbed my attention and made me pause. “The Cure for Anxiety,” huh? If there is one, I sure haven’t found it, I thought. After so much time in therapy, I’d tried and failed to do the seemingly impossible: cure my anxiety.\nI don’t know about you, but over the years, I’ve been taught that if I can just conjure up more faith, just pray more, the anxiety will go away. For a long time, I thought I was a “bad Christian” because I couldn’t just “let go and let God,” like all the inspirational quotes on Pinterest told me to.\nGiving thanks in the midst of anxiety isn’t about a cure for worry or a band-aid for the bullet hole of thoughts spiralling out of control. It’s about recognizing the majesty, sovereignty, and power of the God we serve. This is what Jesus says to us about our anxiety:\n“Therefore I tell you: Don’t worry about your life, what you will eat or what you will drink; or about your body, what you will wear. Isn’t life more than food and the body more than clothing? Consider the birds of the sky: They don’t sow or reap or gather into barns, yet your heavenly Father feeds them. Aren’t you worth more than they?” (Matthew 6:25–26).\nAs someone dealing with an anxiety disorder on a day-to-day basis, I know that if I take a minute to step back, place my feet firmly on the ground, and take a deep breath, I will find a great deal of comfort in these verses. There is comfort in the knowledge I serve a God who loves me and knows me more intimately than I could ever imagine—He knows exactly what I need (v.32). And so, even when my circumstances feel overwhelming, I can look to the God who sees me and calls me His own, and I can celebrate Him and the peace His salvation brings me (Habakkuk 3:18).\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of cozy sweaters, ugly dogs, and the Oxford comma.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day17.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Isaiah 40:27-31, Luke 2:25-36, Romans 8:18-28",
        "devo_title": "Give Thanks in Waiting",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Isaiah 40:27-31, Luke 2:25-36, Romans 8:18-28\nJust wait on God.\nEasier said than done, right?\nIn Isaiah 40, I see a promise-making God, who has existed forever, created everything, knows—literally— everything. If I were a betting woman, I’d put every dollar in my bank account on any promise that the God with those qualifications made. With a résumé that stacked, I would be making the safest bet in the universe. All power belongs to God, and He’s promised to share it with us. In verse 31, there’s a promise for those who wait on the Lord:\n“But those who trust in the LORD will find new strength. \nThey will soar high on wings like eagles. \nThey will run and not grow weary. \nThey will walk and not faint” (Isaiah 40:31, NLT).\nGod has promised to strengthen His people while they wait through the power of His Spirit. I’ve experienced the fatigue that comes from continuing to hope in the Lord—trusting in His promises, but failing to see their tangible manifestation. And while weariness will come, I can testify that the Holy Spirit has always provided me with the supernatural strength to endure.\nSimeon is an exceptional example of the Holy Spirit’s power to increase a person’s capacity for waiting. Scripture tells us God had made Simeon a promise: he would not see death before seeing the Lord’s Messiah (Luke 2:25–26). By the Spirit, Simeon was imparted with the supernatural strength, patience, and faith to believe God’s promise—the promise that was fulfilled in the Christ child resting in Simeon’s aged arms. Still, I wonder if he ever became weary as he hoped for Israel’s consolation. Imagine the overwhelming joy in his heart when he realized the long-awaited Messiah had finally come!\nIn Romans 8, the apostle Paul reminds us that our hope and expectation shouldn’t be reserved for this present world, in what we can see and touch. For “hope that is seen is not hope, because who hopes for what he sees? Now if we hope for what we do not see, we eagerly wait for it with patience” (vv.24–25). These words written by the apostle Paul were meant to encourage persecuted Christians living in Rome—to redirect their hope and longing to the promise of the world to come, where the kingdom of God reigns without limit or exception. May God use Paul’s words to do the same in you and in me.\nBelievers everywhere, along with all the rest of creation, are waiting with eager expectation for the redemption of all things (vv.22–24). When Christ returns, every wrong will be made right and every tear will be wiped away. There will be no hunger or thirst, no war, depression, or despair. Our hearts may grow weary with the state of this world, but we can rejoice while waiting for the glory of its redemption (and the fullness of our own!), because God’s strength gives us power to wait. Thanks be to God.\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship. She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary. Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day13.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "1 Thessalonians 5:12-28, Psalm 105:1-6, Micah 6:8, Colossians 3:12-16",
        "devo_title": "In Everything, Give Thanks",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Thessalonians 5:12-28, Psalm 105:1-6, Micah 6:8, Colossians 3:12-16\nThis summer we drove from Tennessee to California in a shuttle bus. My one caveat as we planned the trip: I can’t handle this while pregnant! But two weeks into our travels, I sat down in the back of the bus as we bumped along the highway through Fargo, North Dakota, and started doing some figuring, resulting in the words, “Husband! Stop the bus!”\nAn eighty-eight-cent pregnancy test told us I was pregnant. So there we were, in the middle of the country—just as far from home as we were from our vacation destination—hearts full of joy with the best secret. It wasn’t what we’d planned, but we’ve found it’s so easy to be thankful for good surprises.\nThere are so many things that do not go as planned. For me, these unexpected circumstances have often been of the pregnancy-related variety. Here’s the thing: growing our family has never gone as we’d planned.\nI imagine you’ve experienced this too. The college you planned on going to wasn’t the one you actually attended. Your high school sweetheart ended up marrying someone else. You entered into a six-month-long interview process but didn’t land the job. You had far less time with a parent or a child than you ever could have imagined. We’ve all experienced a change of plans, a change of expectations. Still, somehow, in the midst of things swerving left when we were expecting them to turn right, we’re called to give thanks:\n“Rejoice always, pray constantly, give thanks in everything; \nfor this is God’s will for you in Christ Jesus” (1 Thessalonians 5:16–18).\nIf we are to rejoice always, that means our rejoicing cannot be dependant upon our circumstances. If we are praying constantly, that means we ought to be praying even when we feel that things are going well, like we’ve got everything under control. If we are giving thanks in everything, that means we’re thankful not just on Thanksgiving Day, but also when things don’t go the way we had planned.\nBut how? How can we give thanks in all circumstances? How can our thankfulness be ongoing? It’s far too easy to slip into a lazy, lip-service kind of thanksgiving. Or to read 1 Thessalonians 5 and feel the pressure to give thanks in spite of what’s happening. But we aren’t only called to give thanks in spite of what’s happening; we’re called to give thanks because of our God—because this is His will for us in Christ Jesus.\nThe foundation of a life of thanksgiving is seeing God for who He is. It is keeping our eyes fixed on Christ. When He is front and center, there is always abundant reason for thanksgiving. No circumstance or surprise, whether welcome or scary, is able to separate us from the love of God in Christ Jesus.\nSo let us give thanks to the Lord and call on His name. Let us sing to Him, praising and proclaiming His goodness. Let us honor and seek Him above all else—because, regardless of our circumstances, our God is always worthy of our gratitude (Psalm 105:1–5).\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day19.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "Psalm 105:1-6",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 105:1-6\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nGive thanks to the LORD, call on his name;\nproclaim his deeds among the peoples.\nSing to him, sing praise to him;\ntell about all his wondrous works!\nHonor his holy name;\nlet the hearts of those who seek the Lord rejoice.\nSeek the Lord and his strength;\nseek his face always.\nRemember the wondrous works he has done,\nhis wonders, and the judgments he has pronounced,[a]\nyou offspring of Abraham his servant,\nJacob’s descendants—his chosen ones.\n—Psalm 105:1–6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/SRT-GiveThanks-Instagram-Day20-300x300.jpg"
    },
    {
        "book_title": "Give Thanks",
        "devo_passages": "1 Thessalonians 5:16–18",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the Give Thanks reading plan.\nRejoice always, pray constantly, give thanks in everything; for this is God’s will for you in Christ Jesus. \n— 1 Thessalonians 5:16–18\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/4-GiveThanks-3-169x300.jpg"
    },

{
    "book_title": "Holding Tight to Permanent",
    "devo_passages": "1 Corinthians 13",
    "devo_title": "She Is Me",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: 1 Corinthians 13\nShe is me.\nShe is you.\nShe wants faith, hope, and love.\nShe wants help and healing.\nShe wants to hear and be heard, to see and be seen.\nShe wants things set right.\nShe wants to know what is true—not partly true, or sometimes true, or almost true. She wants to see Truth itself, face to face.\nBut here, now, these things are all cloudy. Hope is tinged with hurt. Faith is shaded by doubt. Lesser, broken things masquerade as love.\nReal love is the God who became flesh—a living, feeling human being. He is God with us, rescuing the dying, calling the sinners, and embracing those who are wasting away. Real hope is the God who came to set things right. He came to set the cloudy mirror aside for good so we can see Him, face to face. Real Truth is the Word that created the world, the truth that never ceases to be true. Counterfeits no longer interest her; she is looking for the realest thing. This is why she reads.\nShe reads Truth to find Jesus.\nAnd He is there, on every page, greater than her triumphs and shame, vaster than her needs and her pain. Those are real, to be certain. But they are the partial, the passing away. Jesus—and Jesus alone—is the Perfect, the Permanent.\nThe Truth does not magically erase her suffering or cure her disappointment. It does not negate her struggle or invalidate her sorrow. It does something even better—it leads her into relationship with the One who made her and makes her new, the One who is greater than all of these. The Truth brings her face to face with the God who has never stopped loving His children, who has never failed to do what He says He will do. The Truth is love in black and white—a love that does not change, even when her Bible is closed.\nOne day the cloudy mirror will be gone. One day face-to-face is the only way she will see.\nUntil then, she reads Truth—not just for answers or equations, help or how-tos. She reads Truth to find the perfect and permanent One. She reads Truth because she needs Jesus.\nThe above is an excerpt from the introduction of the book She Reads Truth: Holding Tight to Permanent in a World That’s Passing Away, written by Raechel Myers and Amanda Bible Williams. Find She Reads Truth, the book, on Amazon or anywhere books are sold.\n\n*affiliate link used\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-Book16-instagram1s.jpg"
},
{
    "book_title": "Holding Tight to Permanent",
    "devo_passages": "Hebrews 11, Psalm 107:1-9",
    "devo_title": "The Truest Truth",
    "devo_summary": "\nBY Raechel Myers\n\nText: Hebrews 11:1-40, Psalm 107:1-9\nMy family fell apart after school on a Wednesday afternoon. That Sunday, in a new town, I woke up in a sleeping bag on a stranger’s floor. My mom, sister, and I went to a new church. And even though I hadn’t exactly met Jesus yet, this was the day I met my Boaz. My lowercase-r redeemer in more than a lot of ways.\nI can’t bring to memory much about that Sunday morning. I remember the 1st grade Sunday school room with tables pushed together and metal folding chairs around them in the musty basement of an old, new-to-me, church. I remember our very tall teacher and his small, kind wife and the salt-and-pepper hair on both of their heads. They tried their best to keep a room full of enthusiastic seven-year-olds quiet. Most of all, I remember the wild blue eyes and curly blonde hair of the most unruly little boy I’d ever seen. He was the ringleader of the noisy bunch, and he fascinated me.\nThat image of Blue Eyes standing on his chair and waving his arms in excitement over who-knows-what will forever be burned in my memory as the moment I met my future husband. Of course, I didn’t know it at the time. I probably thought I was meeting my nemesis. Everything I loved about order was the opposite of him. He was loud, and I felt quiet. Everyone was looking at him, and I’m not sure anyone even noticed me. I didn’t know it that seven-year-old Sunday morning, but Blue Eyes would never stop being a part of my life from that moment on.\nThere is truth (our present circumstance), and there is truer truth (the history of God’s unwavering, faithful, covenant relationship with His people). Call it the “grand scheme of things” if you like, but I believe we make a big mistake when we trust God only based on what He’s done for us today, or even in our own lifetime.\nIf a telescope zooms our gaze in on one particular thing, God’s Word is like a wide angle lens that shouts, “Remember! God is THIS BIG! He is a God of the big-picture!” When we’re busy dialing in on legitimately important things like jobs and health and deadlines, it can do us a lot of good to remember what God did at creation, and what He promised Abraham. Remember how He kept His hand on Joseph, bringing Israel into Egypt and eventual slavery, then delivering them from slavery at the hand of Moses. All the while He promised on every page that an even bigger plan was unfolding!\nThis is what the Bible does. This is why we read Truth.\nIt’s okay to study God’s hand in our present circumstances. It’s good and appropriate to move that telescope around to see what other people are dealing with too. But opening God’s Word and studying His character is like lifting our eyes from the viewfinder long enough to remember that the God who calls us His people has been hanging the stars in the heavens since time began. \nJust as He was faithful then, He will be faithful now.\nThe above is an excerpt from Chapter 1 of the book She Reads Truth: Holding Tight to Permanent in a World That’s Passing Away, written by Raechel Myers and Amanda Bible Williams. Find She Reads Truth, the book, on Amazon or anywhere books are sold.\n\n *affiliate link used\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-Book16-instagram2s.jpg"
},
{
    "book_title": "Holding Tight to Permanent",
    "devo_passages": "Hosea 2:14-23, 2 Corinthians 1:19-22",
    "devo_title": "Permission Granted",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Hosea 2:14-23, 2 Corinthians 1:19-22\nI’ve been a believer in Jesus since I was five years old.\nWe were standing toward the front of our United Methodist chapel, singing from a hymnbook in the pews, my mom and my brother and me. I don’t remember what preceded the moment, but I remember feeling sure that Jesus was real. And I remember feeling sure that I wanted to serve Him. So I closed my eyes and held out my hands, palms up, like I was holding a serving tray. It was exhilarating.\nThis was my version of Moses’ “Here I am” (Exod. 3:4). This was childlike faith in its uncomplicated beauty.\nAs I grew, my faith grew too. We attended church regularly, and I was as involved as I could be. I went to Sunday school and Bible studies and summer youth trips. I read the Bible outside of church too. I began to journal my prayers. But even as I became more sure of who God was, I became less sure of who I was in relation to Him. The little girl who stood unabashedly before God, eager hands ready to serve, became a teenager who hid like Mother Eve beneath fig leaves of shame.\nIt was no longer Moses’ “Here I am” that I echoed in my heart. It was also his disbelief: “Who am I that I should go?” Or, as was more accurate to my line of thinking at the time: who am I that I am worth loving?\nThe fullness of the gospel had saved me, but I only seemed to remember half of it.\nI knew I needed to be forgiven, but I couldn’t believe I was.\nI knew God’s love was deep, but I thought my sin was deeper.\nI knew Christ accepted me, but I didn’t imagine He’d accepted all of me.\nI was a work in process, and I assumed the work was mine to complete. I was a well-intentioned mess, and I thought the mess was mine to clean up.\nBut guess what? That wasn’t Truth. God never said I have to clean myself up before I come to Him, to get it right before I trust in Him. He never said I could not or would not be a work in process. Search for these commands in the Bible, and you will come up short.\nIn fact, God says the opposite.\nThe Bible is full of in-process people, those whom Christ pursued and loved exactly as they were, well-intentioned messes like me. Like you. If we need permission to be in process, we can look to Scripture.\nI am the woman at the well, taken aback that this man would dare to be seen with me.\nI am Zaccheus, standing at a distance and hoping to catch a glimpse of the Messiah.\nI am Peter, promising I would never deny Him and then turning around to do exactly that.\nI am Peter, weeping when I meet Jesus’ eyes and realize that I have failed and failed big, again.\nI am Martha, running around trying to guarantee my worth and everyone else’s happiness.\nI am Mary, collapsing at His feet because I am so desperate for His presence.\nI am the adulterous woman, standing guilty for all the world to see.\nI am the bleeding woman, utterly incapable of healing what ails me.\nI am a mess, in process, just like all of them. Looking through its pages, I see pieces of me all through God’s Book.\nIn God’s Word I’m reminded that I don’t secure my standing before Him by any guarantees I make, or even those I manage to keep. I am secure because He holds me in the safety of His covenant, the same covenant He has kept for generations past and will keep for generations to come.\nThe above is an excerpt from Chapter 3 of the book She Reads Truth: Holding Tight to Permanent in a World That’s Passing Away, written by Raechel Myers and Amanda Bible Williams. Find She Reads Truth, the book, on Amazon or anywhere books are sold.\n\n*affiliate link used\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-Book16-instagram3s.jpg"
},
{
    "book_title": "Holding Tight to Permanent",
    "devo_passages": "1 Samuel 2:1-2, Isaiah 40:3-8, 1 Thessalonians 5:16-24",
    "devo_title": "Oxygen",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: 1 Samuel 2:1-2, Isaiah 40:3-8, 1 Thessalonians 5:16-24\nThere was a time not long ago, a season I’ve described in these pages, when anxiety and false expectations covered me like a weighted blanket. As if the oxygen had been sucked out of every room, I couldn’t catch my breath. Then, slowly, the blanket began to lift. Inch by inch it lifted and the air rushed in—when my family loved me anyway, when the doctor understood, when the church held us up, when the long winter finally gave way to spring— until one day I could breathe again. Not the shallow gasps I’d become used to, but deep, lungs-full, eyes-clear breaths. It felt like coming back to life.\nThat heavy quilt of circumstance was real and it was stifling, but the gospel was always true, even when the heaviness covered me.\nThe gospel is not only for the moment Christ calls us to repent and follow Him. It is for every moment before and every moment after.\nIt is for our times of joy and fervor, and our times of doubt and despair.\nIt is for the day we stand basking in the bright light of hope, and the day we hide, head in hands, in the dark corners of our fear.\nIt is for the hour that just passed and the hour to come, the situation we just stepped out of and the one we’re walking into.\nWe need it every minute. The gospel is our oxygen.\nBut, here in our temporary home, the gospel can seem intangible and hard to hang on to. So where do we turn when the heavy blanket is closing in, when we’re in the dark, gasping for air?\nWe turn to God’s Word.\nWhen we turn its pages and take in its Truth, the very breath of God fills our lungs, our heart, our mind, our soul. Whether we come to Him doubting, praising, weeping, laughing, His Word is for us and it is true. In this ever-fading world, God’s Word never fades. We can approach it in any condition, under any circumstance, and IT IS STILL TRUE.\nWhen our will is weak, God’s Word is true.\nWhen our faith is fragile, God’s Word is true.\nWhen our hearts are heavy, God’s Word is true.\nWhen we wonder if we even believe it, God’s Word is true.\nThe gospel is permanent, even when our belief buckles under the world’s weight.\nThe gospel is the reason we can take Paul seriously when he writes, “Rejoice always! Pray constantly. Give thanks in everything” (1 Thess. 5:16–18). It is the reason we can put away our faith formulas and walk side by side with the One who wrote faith into our stories and has promised to finish what He started. It is the reason a girl who’s made promises to God and broken them all can wake up each new day and invite hundreds of thousands of women to read Truth—the truth about the promise God has made to them, and even to her, and how He has kept and still keeps it, every day.\nI am basking in the bright light of hope today, but that weighted blanket may be waiting in the wings. Maybe you’re under it now. Jesus promised His disciples they’d have trouble, and we’re guaranteed to have it too (John 16:33; 1 Pet. 4:12).\nDarkness and death are weighty, and our emotions, our actions, even our beliefs may bend at their pressure. But our God does not. Even under the blanket, we can echo the prayer of Hannah:\nThere is no one holy like the Lord.\nThere is no one besides You!\nAnd there is no rock like our God (1 Sam. 2:2).\nLet your chest rise and fall today with the knowledge that the gospel is true. It is oxygen, available every moment of every day, and you can breathe it in. \nThe above is an excerpt from Chapter 8 of the book She Reads Truth: Holding Tight to Permanent in a World That’s Passing Away, written by Raechel Myers and Amanda Bible Williams. Find She Reads Truth, the book, on Amazon or anywhere books are sold.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-Book16-instagram4s.jpg"
},
{
    "book_title": "Holding Tight to Permanent",
    "devo_passages": "Luke 12:4-7, John 3:16-17, 1 Peter 1:3-9",
    "devo_title": "He Won’t Let Go",
    "devo_summary": "\nBY Raechel Myers\n\nText: Luke 12:4-7, John 3:16-17, 1 Peter 1:3-9\nWe took our kids to Disney World for spring break this year.\nSince we believe ourselves to be the “go big, just once” type of Disney-goers, rather than the “go briefly and often” type, we booked seven days of park-hopping magic, determined to experience every inch of every park at least twice. Ultimate Disney satisfaction. And, as it turns out, exhaustion.\nDisney World is a crowded place. With the spring break crowds added to the mix, we quickly discovered a natural human reflex we called the “Disney Grasp.” By hour six of day five, somewhere between Splash Mountain and Casey’s Corner, Oliver registered a polite complaint, “Mom, I don’t like the way you’re holding my hand. It’s just kind of straight and floppy—I need you to squeeze your fingers around mine.”\nThis would have been a darling request in any other setting, but his hand was sweaty, and my fingers were tired and a little stiff from five days straight of hand holding (punctuated, of course, by the thrill of waving freely in the breeze on a fun rollercoaster ride for three minutes every three hours). Oliver wanted me to squeeze with meaning, and at that moment, all I really wanted was to find a quiet place and not be touched or talked to for just a minute.\nOf course, I complied. He didn’t want to hold my limp-fish hand and I wanted him to feel secure. I would continue to forget his preferred squeeze-level, however, and he would have to reach across his body and wrap my fingers back around his every hour or so for the rest of our trip. He knew my hand was tired, and I knew he wanted to be held tight, and so I thanked him for reminding me and readjusted my grip.\nParent-child relationships can be beautiful examples of how we relate with God. But when it comes to the realities of permanent and passing away, even the most enduring love of a parent cannot hold up. I love my son like crazy, and it is my job to keep him safe, but my hand eventually gives way. I get tired and I forget to hold him tight.\nIt’s not that way with God.\nBecause everything in this world is fragile, there is no real-life metaphor for holding tight to something that is actually secure. We hold out of fear, we grip out of anxiety or prevention, and we eventually lose our grip every time. But because the gospel of Jesus Christ is permanent, it is not subject to the same shortcomings of anything that is passing away.\nHear that. The gospel is not passing away.\nGod does not let go.\nThe very nature of the gospel is different than anything else around us. Scripture calls our gospel inheritance “a living hope.” Not a dying hope. The apostle Peter describes it as, “imperishable, undefiled, and unfading, kept in heaven for you.” And the hope of the not-passing-away gospel is literally being “guarded” by God Himself (1 Peter 1:3–5).\nGuarded in heaven by God’s own power. No wonder He tells us not to fear. No wonder He promises we can stake our lives on His Truth. This is why God told Abram, “Fear not, Abram: I am thy shield, and thy exceeding great reward.” It’s why the angel of the Lord said to Mary, “Fear not, for behold, I bring you good news of great joy that will be for all the people” (Luke 2:10, emphasis mine).\nThe gospel is good news. It is not scary news.\nThe gospel calls us to hold tight. But it also reminds us that we are already being held.\nThe above is an excerpt from Chapter 9 of the book She Reads Truth: Holding Tight to Permanent in a World That’s Passing Away, written by Raechel Myers and Amanda Bible Williams. Find She Reads Truth, the book, on Amazon or anywhere books are sold.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-Book16-instagram5s.jpg"
},
{
    "book_title": "Holding Tight to Permanent",
    "devo_passages": "Hebrews 11:13-16",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nThese all died in faith without having received the promises, but they saw them from a distance, greeted them, and confessed that they were foreigners and temporary residents on the earth. Now those who say such things make it clear that they are seeking a homeland. If they were thinking about where they came from, they would have had an opportunity to return. But they now desire a better place—a heavenly one. Therefore God is not ashamed to be called their God, for He has prepared a city for them.\n– Hebrews 11:13-16\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-Book16-instagram6s.jpg"
},
{
    "book_title": "Holding Tight to Permanent",
    "devo_passages": "Isaiah 40:8",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nThis week, let’s memorize together this verse about the permanence of God and His Word: \nThe grass withers, the flowers fade,\nbut the word of our God remains forever.\n– Isaiah 40:8\nWe want to be a community that is intentional about Scripture memorization. Will you join us? \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/4-Book16.jpg"
}
    
]