[{
    "book_title": "Countdown to Acts",
    "devo_passages": "Genesis 3:8-19, John 20:30-31, Galatians 2:1-9",
    "devo_title": "Introduction to the Book of Acts",
    "devo_summary": "\nBY She Reads Truth\n\nText: Genesis 3:8-19, John 20:30-31, Galatians 2:1-9\nIn anticipation of the ‘Acts of the Apostles’ reading plan—the She Reads Truth summer study beginning on June 6—we’ll spend this week in ‘Countdown to Acts’, a 5-day introduction establishing the historical and geographical context of the book. Read along with us as we set the stage with the people and places significant to the beginning of the early church. ‘Countdown to Acts’ is also available free on the She Reads Truth app. \nThe narrative arc of the Bible is told in essentially three movements:\n1.     The Old Testament: the story of our creation and fall, and of God’s promise to redeem His people.\n2.     The Gospels: the story of God’s promise fulfilled through Christ’s life, death, and resurrection. \n3.     The Book of Acts: the story of Jesus’ impact on the world as His followers took the gospel message to Jerusalem, Judea, and Samaria, and to the ends of the earth. (The only narrative portion of the New Testament not covered in Acts is John’s imprisonment and revelation on the island of Patmos.)\nThe book of Acts is not the end of God’s story, but rather the beginning of how the church found its way around the world and down through time to the places where we live and worship today.\nAuthor: Though the book of Acts specifies no author, earliest records attribute the book to Luke, who also wrote the Gospel bearing his name. Luke’s name appears three times in Paul’s prison letters (Col. 4:14; 2 Tim. 4:11; Phml. 1:24), indicating he was one of Paul’s traveling companions. Colossians 4:14 also identifies Luke as a doctor, which is supported by the way Luke uses specific medical language (e.g. Acts 28:8).\nDate: Both the Gospel of Luke and the book of Acts are believed to have been written at the same time, during the early to mid 60s, likely during Paul’s imprisonment in Rome. The events in Acts take place after the death of Christ in AD 33 and conclude in AD 62.\nTheme: The book of Acts emphasizes the work of God through the Holy Spirit in the lives of people who devoted themselves to Jesus Christ—especially Paul, as he led the Gentile missionary endeavor. The Christian church was built, city by city, through the dynamic power of the Holy Spirit working through God’s chosen vessels.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/s29-5.30-Instagram_Acts.jpg"
},
{
    "book_title": "Countdown to Acts",
    "devo_passages": "Colossians 3:1-17",
    "devo_title": "People Groups in Acts",
    "devo_summary": "\nBY She Reads Truth\n\nText: Colossians 3:1-17\nOne of the most beautiful outcomes of the spread of the gospel is how the redeeming work of Jesus Christ unifies people across lines of ethnicity, gender, and class. \nActs was written during a time when people were more divided than perhaps any other era in history. But the gospel of Jesus Christ unified those who were separated by culture, race, and social standing. For those living in first century Rome, this unity was not only beautiful, it was astonishing. Acts repeatedly calls this to our attention by identifying people not just by name, but by their people group, to show us how the gospel unifies them.\nHere is a brief overview of the key people groups named in Acts:\nJews / Hebrews / Israelites: Descendants of Abraham, and inheritors of God’s covenant. Devoted to the Law given to Moses at Mount Sinai (Genesis 17).\nGentiles: Literally, “the nations,” or everyone who was not Jewish. Romans, Greeks, and “barbarians” were regarded by most Israelites as “unclean” (Acts 10:45, 13:48, 14:4-7).\nGod-Fearers: Gentiles who worshipped Israel’s God but had not converted to Judaism, and did not adhere to the Jewish laws about food or circumcision (Acts 13:16, 13:26).\nRomans: Roman citizens protected by Roman law; had legal rights in the Roman Empire. Citizenship could be obtained by birth, and a ruling of law (Acts 22:25-29).\nGreeks: People born in Greece, or Greek-speaking people living in the eastern part of the Roman Empire (John 7:35).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/s30-5.31-Instagram_Acts.jpg"
},
{
    "book_title": "Countdown to Acts",
    "devo_passages": "Acts 23:11, Romans 1:8-17, John 12:44-50",
    "devo_title": "Places in Acts",
    "devo_summary": "\nBY She Reads Truth\n\nText: Acts 23:11, Romans 1:8-17, John 12:44-50\nIn the Great Commission, Jesus said His followers would be His witnesses “in Jerusalem, in all Judea and Samaria, and to the ends of the earth” (Acts 1:8).\nIn those days, many considered the Roman Empire to reach to the ends of the earth. In that sense, the progression Jesus described is precisely what we see happen in the book of Acts as the gospel spreads from Jerusalem, Judea, and Samaria to the ends of the Roman Empire. Since that time, the gospel has traveled around the globe many times over.\nIn terms of our present-day geography, here are some key places where the events of Acts took place:\nJerusalem: Roughly the same city as the one established during King David’s reign. As Israel’s capital city, Jerusalem is the heart of Jewish history and culture.\nJudea: The southern half of present day Israel—stretching from the Jordan River and Dead Sea west to the Mediterranean Sea, and from Gaza and the Red Sea north to Tel Aviv. It became a Roman province in 6 AD.\nSamaria: The northern half of present-day Israel, reaching from the Jordan River west to the Mediterranean Sea. Samaria was home to descendants of the Israelites who intermarried with their Babylonian captors during exile. These “Samaritans” were shunned by many traditional Jews.\nAsia Minor: The region of Paul’s 1st Missionary Journey—modern-day Turkey and Syria. Asia Minor included the regions of Phrygia, Pisidia, Galatia, Cappadocia, and Cilicia, and the cities of Derbe, Lystra, Ephesus, Colossae, Miletus, Philadelphia, and Antioch.\nMacedonia and Achaia: The regions of Paul’s 2nd and 3rd Missionary Journeys—modern-day Romania, Serbia, Bulgaria, Macedonia, and Greece. The regions of Macedonia and Achaia included the cities of Thessalonica, Philippi, Berea, Athens, and Corinth.\nRome, Sicily, and Malta: The same as today. Sicily and Malta are the two islands just off the toe of Italy’s “boot.” Rome was the power center and heart of the vast Roman Empire.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/s31-6.1-Instagram_Acts.jpg"
},
{
    "book_title": "Countdown to Acts",
    "devo_passages": "Romans 13:1, John 11:45-53, Acts 28:17-28",
    "devo_title": "Israel Under Roman Rule",
    "devo_summary": "\nBY She Reads Truth\n\nText: Romans 13:1, John 11:45-53, Acts 28:17-28\nThroughout the book of Acts, Israel was under Roman rule, which had been the case since Rome wrested the region from Syria in 64 BC. During the New Testament era, the Roman Empire ruled most of the known world.\nLegend tells us that Rome was founded by Romulus and Remus in 753 BC. The first seven kings of Rome increased the size of the kingdom by conquering neighboring territories. But eventually, a tyrannical king named Tarquinius Superbus drove the people to revolt. After this uprising, Rome became a republic which gave her citizens a voice in political and national affairs. As a republic, Rome grew even more powerful, reaching well beyond the borders of Italy into Africa, Asia, and Europe.\nAs anyone who has ever read Shakespeare knows, Roman leadership became increasingly unstable as the Empire grew larger. Ambition, paranoia, distrust, betrayal, and a lust for power made it very difficult for anyone to govern with stability for any length of time. Positions of authority in Rome had a high turnover rate due to assassinations, promotions, demotions, and transfers of power.\nBy the time Rome took occupation of Israel, the Empire was large, but spread thin. Israel’s location was strategic. It lay at the crossroads between Europe, Asia, and Africa. Ruling Israel meant Rome would be able to move freely between the continents.\nThe Jews were defined by their worship, their temple practices, and their history as followers of one God, and one God only—Jehovah. Rome knew that devotion like this was hard to extinguish, so they reckoned it would be politically wise to leverage Israel’s religious zeal as motivation to live at peace with their occupiers. Rome arranged a compromise. Israel could continue to practice their monotheistic religion so long as they obeyed Roman rule, paid their taxes, and kept the peace.\nThis was a shrewd psychological move. Under this arrangement, many in Israel came to see their right to worship God as a privilege that was now granted to them by Caesar, who could take it away if they fell out of line. We see this on display during the Triumphal Entry, when the Jewish religious leaders pleaded with Jesus to tell those laying down their palms and coats to stop referring to Him as a king. If Roman authorities heard this was happening, they might have shut down the Passover celebration (Luke 19:37-40).\nUnder Roman law, Jews were given certain rights that made the arrangement more palatable. For example, they were excused from military service and from ever having to appear in court on the Sabbath. By the time we come to the book of Acts, the dealings between Jews and Romans were predominantly positive.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/s32-6.2-Instagram_Acts.jpg"
},
{
    "book_title": "Countdown to Acts",
    "devo_passages": "Mark 12:17, 1 Timothy 2:1-2, 1 Peter 2:17, Isaiah 9:6-7",
    "devo_title": "Christianity in Rome",
    "devo_summary": "\nBY She Reads Truth\n\nText: Mark 12:17, 1 Timothy 2:1-2, 1 Peter 2:17, Isaiah 9:6-7\nChristianity was born in the Roman Empire. The book of Acts tells about how the message of Christ spread throughout the Roman world by way, not only of missionary journeys, but also by word of mouth from people whose lives had been transformed by the gospel.\nThe message of Christ spread quickly, and the number of those who believed grew to a size that caught Rome’s attention. Early on, the Roman Empire regarded Christianity as a sect of Judaism, which explains why Rome tended to treat conflicts between Jews and Christians in Acts as internal matters (Acts 18:12-17).\nEarly Christians did not oppose Roman authority. Jesus taught His followers to pay their taxes (Mark 12:17). Paul and the other apostles taught that Christians should honor the government so long as Roman authorities didn’t forbid them from following Christ (1 Tim. 2:1-2, 1 Pet. 2:17). Because of this, early Roman persecution of Christians was more the exception than the rule.\nThere were, however, a few notable tumultuous periods. For example, shortly after Jesus’ birth, Herod the Great, in his zeal to kill the one born “King of the Jews,” slaughtered all Hebrew male children under age two (Matt. 2:13-16). Later, in 64 AD, Emperor Nero blamed the great fire of Rome on Christians. It may have been during Nero’s persecution when both Paul and Peter lost their lives.\nChristianity spread throughout the Roman Empire and, according to Romans 15:28, a Christian church existed in the city of Rome itself as early as 50 AD—less than 20 years after the death and resurrection of Christ. It is fascinating to consider how the Roman occupation of Israel—something most Israelites viewed as an unfortunate hardship—would end up setting the table for the gospel to spread from Jerusalem, Judea, and Samaria to the ends of the earth.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/s33-6.3-Instagram_Acts.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 1:1-22, Exodus 2:1-22, Acts 7:23-29",
    "devo_title": "God Raises Up a Deliverer",
    "devo_summary": "\nBY Missy Fuller\n\nText: Exodus 1:1-22, Exodus 2:1-22, Acts 7:23-29\nA malicious villain, an endearing protagonist, an impossible circumstance, and an unsuspecting hero—these are some of the elements we’ve come to expect from a good story. But for me, the best part of a story is a great rescue—because in every great rescue, there’s a moment of great faith. It’s the moment when it seems there’s no way out, like the villain is going to have his way. \nOf course, I also dread those moments because they’re suspenseful, terrifying, and sometimes brutal. The protagonist comes to a point where she has to depend on something greater than herself, to have faith that a deliverer will come to her rescue.\nThe Israelites had reached that point. Enslaved by the Egyptians for 400 years, they had been subjected to harsh labor and treated ruthlessly. And if that wasn’t enough, their children were being murdered! The darkness and oppression surrounding Israel during their time in Egypt is unfathomable.\nGod had promised to make them into a great nation and to bless all the nations of the world through them (Genesis 12:1-3). But how was this going to happen when they were enslaved? \nEnter Moses, a man whose life was marked by the Lord from birth (Exodus 2:1-10). God chose this man to deliver Israel, and He gave him a desire to protect them. But Moses was a complicated, imperfect, temperamental man who once killed an Egyptian he saw beating an Israelite. In a panic, he fled the scene and headed for Midian, where he saved seven young women from some ill-intended shepherds. See? Complicated. When God opened Moses’ eyes to the oppression of his people, his heart was moved to defend them, however imperfectly (Exodus 2:11-17).”\nMoses was God’s chosen deliverer, born to save the Israelites. In him, God continued to fulfill His promise to bless all nations of the world through Abraham’s offspring. Israel’s deliverance through Moses pointed directly to our coming deliverance through Christ.\nBoth Moses and Jesus were born under an edict of death, as both Pharaoh and Herod ordered the murder of all male children under two (Exodus 1:22, Matthew 2:16). God called Moses and the Israelites out of slavery in Egypt, and He called Jesus up out of Egypt after Herod’s death (Exodus 3,14; Matthew 2:19-21). The Israelites did not initially recognize Moses as their deliverer, just as the people didn’t understand that Christ had come to deliver them from sin and death (Acts 7:25, Matthew 12:38-40).\nEvery deliverer in the Old Testament, including Moses, foreshadowed our ultimate Deliverer, Jesus Christ. And every act of deliverance in our past is a promise from the Lord to also deliver our future.\nFriends, our deliverance—from whatever it may be—is already in the works. Just as the Lord had a greater purpose for Israel’s oppression (Genesis 15:13-16), He has a greater purpose for our suffering, too. Deliverance might not look like we expect, and might not come exactly when we hope, but it is coming. Even when we can’t see God working, when we feel like He no longer sees us, He’s working for our deliverance (Isaiah 64:1-4).\nAs we study the life of Moses together, let us be reminded of the deliverance we already have in Christ Jesus. May our eyes be opened to the way the Lord is working on our behalf, right now, in whatever our circumstances may be. \nLet’s trust His past faithfulness for our future deliverance. May this be for us a moment of great faith in our own rescue story.\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram1s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 2:23-25, Exodus 3:1-22, Mark 12:18-27",
    "devo_title": "Moses and the Burning Bush",
    "devo_summary": "\nBY Annie Downs\n\nText: Exodus 2:23-25, Exodus 3:1-22, Mark 12:18-27\nIt’s all about the details, right? It’s the difference between getting to church at 11:00am and 11:10am. Or getting on I-75 South instead of I-75 North—just a small detail that landed me in the wrong state.\nBut it’s also in the details of a sunset, or a marriage proposal, or the secret ingredient of the best meal you’ve ever eaten. (IT WAS THE SAFFRON!) The details make all the difference.\nThey say the devil is in the details, but more often than not, I find that God is there, in the tiniest of details, waiting for us to notice Him. It happens ALL the time in the Bible, when a small detail changes everything.\nThis particular story of Moses has one of those tiny details I’ve overlooked for years. I grew up in the church, and I’ve known the story of the burning bush for as long as I can remember. I can picture it on the flannel graph: the multi-colored flames in the corner, Moses facing it, shepherd stick in hand, and shoes off to the side, because—as it says in Exodus 3:5—he was standing on holy ground.\nBut go back to Exodus 3:4, just one little phrase before. There’s this one tiny detail that changed the whole story for me.\n“When the Lord saw that he had gone over to look, God called to him from within the bush, ‘Moses! Moses!’” (Exodus 3:4).\nIt wasn’t until Moses noticed the bush on fire that God spoke out of it.\nGod wasn’t calling Him like you call the kids in from the playground. The bush wasn’t yelling out Moses’ name like he was the next contestant on a gameshow. It was when Moses noticed—when he went over to look—that God spoke to him.\nLook around you. What are the little moments, the details, the things God is waiting for you notice? What’s your burning bush?\nA neighbor?\nA place of worship?\nA sunrise?\nA blog post?\nA church you’ve wanted to visit?\nA restaurant you’ve always wanted to try?\nI often go walking at Radnor Lake here in Nashville. I walk the same path every day, the one that starts on the right and loops around the lake. About halfway through, there’s a little sign with an arrow pointing to another path: Ganier Ridge. I’ve seen it lots of times, but I’ve always just kept on walking—even though it caught my eye more and more each time I passed it.\nOne Saturday, I finally quit ignoring that little nudge and turned up that path. It was hard and steep, and it only got steeper as I climbed. WHY AM I DOING THIS? I thought, as a podcast about loving your city well played in my ears.\nAt the apex of the climb is a clearing, and when I reached it I paused by a bench to catch my breath. And then I saw it: the entire Nashville skyline, right there in my view. There’s the city I love, I thought, as the podcast reminded me that God places people in their cities on purpose.\nHe wanted me to hear it while I was seeing it. Once I noticed the “burning bush,” and walked toward it, He spoke to me. It wasn’t a huge deal, but it mattered to my heart.\nWhat is the thing God is using to get your attention? I bet it’s different from the things He uses to grab mine—but that’s okay, because it’s meant for you, not me.That’s where God wants to talk to you. That’s where He has something just for you, if you’ll turn and notice and listen.\nTHAT’S your burning bush.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram2s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 4:1-17, Hebrews 5:1-6",
    "devo_title": "God Equips Moses",
    "devo_summary": "\nBY Rebekah Lyons\n\nText: Exodus 4:1-17, Hebrews 5:1-6\nI love Moses. He’s such a beautiful picture of needing everything God offers. \nAnd I love reading about Moses’ first encounter with the God of the universe, burning in a bush. The dialogue between them makes me laugh because Moses’ reluctance is so relatable to me. His objections remind me of my own.\nGod: Go to Pharaoh so that you can bring my people out of Egypt.\nMoses: What? Who, me?!\nGod: I will be with you.\nMoses: What if they ask who sent me?\nGod: I Am has sent you.\nMoses: What if they don’t believe me?\nGod: I’ll give you the power to perform signs and wonders in My Name.\nMoses: But I’m not good with words.\nThis is where I can imagine God saying slowly and firmly, “Moses, who made your mouth? Go! I’ll help you speak, and I’ll tell you what to say” (Exodus 4:1-13, my paraphrase).\nIt’s easy to read about Moses’ doubt and think, This is God speaking to you! Don’t you trust Him? After all, even God Himself was angry with Moses (Exodus 4:14). But then I think of all the times I’ve determined God must have confused His plans for me with His plans for someone else. I’ve offered up plenty of, You’ve got the wrong girl! I can’t do this! Just look at my mess…  \nI often wonder what God is thinking as He listens to my fears and protests of never-enough-ness. The writer of Hebrews offers us some insight into this:\n“For every high priest taken from men is appointed in service to God for the people, to offer both gifts and sacrifices for sins… No one takes this honor on himself; instead, a person is called by God, just as Aaron was” (Hebrews 5:1,4).\nGod does the choosing and the assigning—not us. He calls us, and He equips us. There’s no need to run from His calling, to deny it, or wish it away. Because “the God of peace, who brought up from the dead our Lord Jesus” will also “equip [us] with all that is good to do His will, working in us what is pleasing in His sight, through Jesus Christ” (Hebrews 13:20, 21).\nJesus breathes His power through our frailty in ways we can’t imagine. It’s because we have our own weaknesses that we’re able to love others well, to deal gently with those we encounter (Hebrews 5:2). In fact, this is the only thing we can boast in: His power is made perfect and on full display in our never-enough-ness. When we are weak, we are actually made strong in Christ Jesus (2 Corinthians 12:9-10). \nWhoa. The secret to strength is weakness.\nGrasping this has been a game-changer for me. I used to think my shortcomings disqualified me from serving Him. But I’ve learned that when I admit my inadequacy, I invite God’s power in to strengthen me. This is fertile soil for surrender. Surrender says, The calling You’ve laid before me is too great. I cannot fathom it. Still, I will obey. I will trust that You go before me.\nWhen God equips us, He also strengthens us. And in that strength, we realize that we, the weak ones, have been a part of God’s plan all along. \nSo if you’re feeling not-enough today, take heart. The God who was faithful to equip Moses and used him to deliver the Israelites, will surely strengthen and provide for us as well.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram3s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 4:18-31, Exodus 5:1-23, Exodus 6:1-13",
    "devo_title": "Israel Prepares to Leave Egypt",
    "devo_summary": "\nBY Guest Writer\n\nText: Exodus 4:18-31, Exodus 5:1-23, Exodus 6:1-13\nWhen was the last time you had one of those days where things seemed to go from bad to worse?\nMy most recent one started with a phone call from my mother. She called to tell me my grandmother had only a few hours left to live. I immediately picked up my laptop, abandoned my latte, and headed out of the coffee shop, rushing to get home and start packing. I’d driven to the edge of the parking lot when a passerby mimed for me to roll down the car window.\n“Your tire,” he said. “You know it’s flat?”\n“Yeah,” I lied, heartbroken. “I know.”\nThat evening, my grandmother passed away. It was sudden. Shocking. The older I get, the more I brace myself for times like these. When it rains, they say it pours. And when things are hard, it’s possible they’re about to get a whole lot harder.\nThings were bad for the Israelites: enslaved, baking bricks in the hot sun, suffering from ridicule, racism, and genocide. The news Moses brought was like salve to the their ears. Hearing that the Lord saw and remembered them, had seen their misery and was concerned about them, they bowed down and worshiped Him (Exodus 4:31). But little did they know, things were about to go from bad to worse.\nThe Lord’s plan was coming into fruition, though it wasn’t all rosy. The signs “I AM” gave Moses included blood and snakes and leprosy. And as Moses opened his mouth to speak, he watched Pharaoh’s grip tighten around the necks of the Israelites, the people he’d been sent to save.\nCan you imagine? The situation was so ridiculous—so absolutely fraught with hatred—I wonder if any of the Israelites had to laugh in the midst of their tears. They were already slaves, already broken, ridiculed, and beaten. And now, this? No straw? Forcing a slave to gather his own straw was like asking a construction worker to make his own boards.\nThe rug was being pulled out from under the Israelites, and let’s be clear: God was doing the pulling—not because He was cruel or cold-hearted or enjoyed watching them suffer. He did it because He loved the Israelites too much to leave them in slavery.\nAfter living under Pharaoh’s oppression for so long, enslavement had started to feel normal. It had become the everyday rhythm of the Israelites’ lives. They had forgotten what it means to be free. So God’s first step in freeing them was to make slavery even more unbearable. In His mercy, He lifted the veil from their eyes and made it clear: there was no future for them in Egypt.\nGod does the same for us. His concern and love for us dictate that He use all means necessary to wake us out of the acceptance of our own slavery—to comparison and greed, lust and selfishness and joylessness—whatever it may be. In His mercy, God refuses to let us bear it any longer.\nHere’s a hard truth: God’s mercy does not require His treatment of us to be comfortable or safe (Deuteronomy 8:2-3). But in the midst of our pain, God’s plan is still good and His promises remain true. He will deliver us. He will free us. He will redeem us (Exodus 6:6). And come what may, He promises to be with us (Isaiah 43:2).\n“I have told you these things so that in me you may have peace. In this world you will have trouble. But take heart! I have overcome the world.”\n-John 16:33\n\nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, The Christian Science Monitor, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram4s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Genesis 1:1, Exodus 7:1-25, Exodus 10:21-29, Psalm 105:27-36",
    "devo_title": "Moses and the Ten Plagues",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Genesis 1:1, Exodus 7:1-25, Exodus 10:21-29, Psalm 105:27-36\n“I will pass through the land of Egypt on that night and strike every firstborn male in the land of Egypt, both man and beast. I am Yahweh; I will execute judgments against all the gods of Egypt.”\n—Exodus 12:12\nI thought about Egypt a lot as a kid—though growing up on the Great Lakes, I was about as far from the Nile as you can get. Our house had an attic with a low ceiling and one dim light, and I was afraid to poke my head inside because I was sure I would see the Anubis. Have you ever seen a drawing of this creature? It’s a man, with the head of a jackal. For me, there’s nothing so terrifying as a man’s figure walking upright wearing the head of a jackal. Why did the Egyptians have to put animal heads on their gods?\nThe pantheon of false Egyptian gods was a terrifying mix of half-human, half-sacred animals;  because in the absence of the one true God, we can only invent gods in our own image, or in the image of things we see around us. False gods are just imitations of the natural world. The Egyptians created supermen, but that’s all they were: imagined concoctions of everyday things elevated to the rank of deity. \nEach major aspect of Egyptian life was tied to a specific god. For example, Hapi was the god of the Nile River. The welcome seasons of flooding and the dreaded seasons of drought were linked to the the vagrancies of his changing moods.\nMoses would have known all about Egyptian gods. (Maybe there was an attic somewhere in his childhood too—a place where he feared seeing the spectre of the Anubis!) And Moses, like all children raised in Egypt, would have seen the Nile’s waters turning to blood as a blow struck specifically against the god of the Nile (Exodus 7:20). \nEach plague targeted one of the gods from the Egyptian pantheon and, one by one, Pharoah watched the pillars of his power turn to ash. This pattern fulfills a specific promise that God made through Moses to Israel and Pharaoh: \n“I will surely pass through all the land of Egypt and on every one of the gods of Egypt I will execute judgment: for I am the Lord God over the whole of the earth” (Exodus 12:12).\nIn spite of this, Pharaoh’s heart was hardened, and he waffled about whether or not he should let Israel go. In his indecision he ignored this truth that Moses already knew: there is but one God, and He is God over all the earth (Exodus 10:8). He is present and sovereign throughout history, and He will not be mocked (Galatians 6:7). \nPharaoh never learned this lesson, but the Egyptian people did. Their awe of the one true God inspired them to press their gold and jewels into the hands of their Hebrew slaves departing for the Red Sea.\nWhen reading about the plagues, it’s easy to see them as an assault on the Egyptians and Pharaoh himself. While that’s partly true, the central point was to destroy the idolatry of the false gods. One by one, God chipped away at their false authority. The words, “Let my people go!” not only meant freedom from slavery, but freedom from idolatry.*\nWe don’t have to live in fear of supermen with jackal heads or fertile women with frog faces. There is only one God, and He is good. In His great goodness, He not only frees us from bondage, but He also unmasks the gods and powers of this world. History is filled with this resounding declaration: Every knee shall bow, and every tongue confess that Jesus Christ is Lord (Romans 14:11).\n\n*George Grant. “The God’s of Egypt and the Exodus”, 2015.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram5s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Romans 11:6",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nText: Romans 11:6\nGrace days are for catching up and being still. As we read about the life of Moses in Scripture, let’s pause to meditate on the sufficiency of Jesus Christ as beautifully reflected in the hymn “Rock of Ages.”\nRead, hum, or sing the words of the second verse of this old hymn, and rest in the saving grace of Christ’s atonement.\nNot the labors of my hands\ncan fulfill thy law’s demands;\ncould my zeal no respite know,\ncould my tears forever flow,\nall for sin could not atone;\nthou must save, and thou alone.\nfrom “Rock of Ages”\nAugustus Toplady, 1776 \n____\nNow if by grace, then it is not by works; otherwise grace ceases to be grace.\n-Romans 11:6\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram6s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 14:14",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nThis week we’ve chosen a reminder that God is God and we are not. It is God who wins the battles:\n“The Lord will fight for you; you must be quiet.”\n-Exodus 14:14\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/4-Moses1.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 11:1-10, Exodus 12:14-42, Hebrews 11:23-28, Psalm 105:37,Psalm 105:38",
    "devo_title": "The Exodus",
    "devo_summary": "\nBY Guest Writer\n\nText: Exodus 11:1-10, Exodus 12:14-42, Hebrews 11:23-28, Psalm 105:37,38\nTheir deliverance was coming. \nCenturies earlier God had promised to bring His people out of captivity. And now that promise was beginning to unfold. But freedom for the Israelites would come in a most unusual way—by faith in the blood of a Passover lamb.\nImagine how absurd those instructions detailed in Exodus 12 must have seemed to the Israelites who had been enslaved for 400 years. Slaves feasting together as a family? Dressing to travel? Preparing to leave in haste the cruel bondage of their Egyptian slave camp?\nEven the possibility of freedom would have seemed ludicrous. After generations of captivity, far more than the Israelites’ physical bodies were enslaved. Their souls had become shackled with hopelessness. \nBut as each plague unfolded, their lack of faith came face to face with the faithfulness of their covenant-keeping God—the One who had promised not only to bring them out of captivity, but to judge the nation that had oppressed them (Genesis 15:13-14). Judgment was falling upon Egypt because of their unbelief. \nBut wait. Weren’t the Israelites also guilty of unbelief?  Sure, they were the descendants of Abraham, Isaac, and Jacob. But hadn’t they failed to believe that God would do what He’d promised to do?  \nYes, the Israelites deserved judgment, too (Exodus 6:9). And so do we. \nWe’ve all walked in unbelief. We’ve all gone our own way and are deserving of God’s judgment for our sin (Isaiah 53:6). And that judgment is always death (Romans 6:23). But in spite of our sin, God has never left us without hope!\n“The blood on the houses where you are staying will be a distinguishing mark for you; when I see the blood, I will pass over you. No plague will be among you to destroy you when I strike the land of Egypt.”\n-Exodus 12:12-13\nThe Israelites were delivered from the judgment of God by faith in the blood of a Passover lamb (Hebrews 11:28). Judgment could not fall upon the household marked with blood, because it had already fallen on the lamb. \nBut despite their obedience, no animal sacrifice would ever truly be sufficient to cover the Israelites’ sin—or ours. “For it is impossible for the blood of bulls and goats to take away sins” (Hebrews 10:4). Not until Calvary, when all the sins and all the sacrifices for all time were placed on Jesus, would our sin be put to death (1 Peter 3:18).   \nThanks be to God, our Deliverer has come! The judgment for our sin has fallen upon Christ. Now, when the Father looks on us He sees Jesus, whose blood covers all our sin and reconciles us to God, making us “holy, faultless, and blameless before Him” (1 Corinthians 5:7; Colossians 1:22). \nThe Lamb of God was slaughtered on our behalf. Surely He is worthy of our worship, our adoration, our praise—our everything (Revelation 5:12).\n“To him who loves us and has freed us from our sins by his blood and made us a kingdom, priests to his God and Father, to him be glory and dominion forever and ever. Amen.”\n– Revelation 1:5-6\n\nCarrie Gaul is a biblical correspondent for Revive Our Hearts. She and her husband Dennis have two married children and are enjoying grandchildren. Carrie has a deep love for God’s Word and a passion to see women grow in ever-increasing intimacy with Jesus through the study and application of His Word.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram8s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 13:17-22, Exodus 14:1-31, Psalm 77:14-20",
    "devo_title": "Crossing the Red Sea",
    "devo_summary": "\nBY Andrea Lucado\n\nText: Exodus 13:17-22, Exodus 14:1-31, Psalm 77:14-20\nIn college, I worked at a summer camp that had a massive ropes course. Every once in a while, I was put on “zip line duty.” The zip line was at the very end of the ropes course. It was the fun part that came after climbing and wiggling and jumping and leaning on your partner through a somewhat rigorous series of obstacles, all beneath the hot Texas sun.\nThough the campers had tested their harnesses and carabineers to the extreme by the time they reached me at the zip line, they were often afraid to jump off the platform. It was my job to reassure them.\n“Don’t be afraid,” I’d say, “Look back there at that obstacle course you just did. Did you fall? Did your equipment fail you?”\n“No,” they’d whisper.\n“So why do you think it will this time?”\nThough I was confident on the zip line that summer, I am not always so confident in the face of scary things. I understand how easy it is to forget God’s steady hand and His faithfulness.\nI forget how He’s brought me safely through the obstacles behind me when I’m staring down the big, seemingly insurmountable one sitting right in front of me.\nWhen God parted the Red Sea in Exodus 14, His people had been through a series of events in which they witnessed God’s power and protection: plagues, the first Passover, and finally, delivery from Egypt. But then, just as they thought they were home free, Pharaoh’s army was chasing them.\nForgetting God’s power and protection in their past, they protested, “What have you done to us by bringing us out of Egypt? … It would have been better for us to serve Egyptians than to die in the wilderness” (Exodus 14:11-12).\nBut Moses, who trusted in the God who had promised to deliver them, reassured the Israelites, “Don’t be afraid. Stand firm and see the Lord’s salvation will provide for you today” (Exodus 14:13).\nAnd the Lord did provide. He parted the water. He carved a path in dry land for His people to walk through. And once they were safely across, He crashed the waters back together, destroying Egypt’s entire army, bringing glory to His name by protecting His people. “When Israel saw the great power that the Lord used against the Egyptians, the people feared the Lord and believed in Him” (Exodus 14:31).\nOur lives are marked with similar Red Sea moments—times when God carried us through an obstacle we deemed insurmountable. Each time He does this, our faith is deepened and our view of God and His goodness and power is broadened.\nThese are the times we ought to remember when we’re standing on the platform, knees shaking, palms sweating. Like the Israelites with Egypt hot on their trail, we stare at the expanse of the valley before us, doubting how or even if God will bring us through this time.\nAt camp, almost every kid eventually attempted the zip line. After I reminded them about the strength of the cables and counted to three multiple times, down they went. The more they did it, the more they trusted, and the less afraid they were.\nIf you’re standing on a platform today, instead of focusing on the fear in front of you, look back and remember the path behind you. When has God parted the sea in your past? When has He made a way when there seemed to be no way?\nRemember, ours is a God “who works wonders” (Psalm 77:14). Even the sea obeys Him. Trust that the One who provided for you yesterday will provide for you today.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram9s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 15:22-27, Exodus 16:1-36, Exodus 17:1-7, 1 Corinthians 10:1-13, Psalm 105:40-42",
    "devo_title": "God Establishes a Nation through Moses",
    "devo_summary": "\nBY Kaitlin Wernet\n\nText: Exodus 15:22-27, Exodus 16:1-36, Exodus 17:1-7, 1 Corinthians 10:1-13, Psalm 105:40-42 \n“EVERYBODY OUTSIDE,” I yelled, losing all of my carefully collected cool babysitter points in one fell swoop. The freckled brother and sister looked defeated, realizing their plan to convince me to let them sleep in the refrigerator doors had misfired.\nWe stood in the backyard with grass up to our ankles, my feet the only ones remaining still.\nThe girl’s pigtails twirled as she spread her arms and began spinning around and around in a circle. “Topsy turvy!” the boy squealed in delight, joining his sister until their knees buckled and hit the ground, their heads continuing to spin. They laughed at the dizzy, dark spots in their vision, and stood up to begin again. “You too!” they gestured.\nI obliged, joining in for the sake of the thank-goodness-we’re-over-the-refrigerator incident. My arms, double the span of theirs, flung wide as I twirled around, my ponytail flapping in the wind. My knees buckled, and I stared into the same dizzy, dark spots. But it wasn’t very fun, and I didn’t want to do it again. Although it had been years since I’d worn pigtails and found joy in my own topsy turvy-ing, the resulting feeling felt strangely familiar. It was disorienting, unknown and scary, much like the wilderness.\nI experience the same dizziness when I’m tossed by fear, pushed by doubt, and wrangled by sin, so I thrash for control. The Israelites did something similar, asking questions they hoped would domesticate the wild:\n“What are we to drink?” (Exodus 15: 24).\n“What is it?” (Exodus 16:15).\n“Why did you do this?” (Exodus 17:3).\n“Is the Lord among us or not?” (Exodus 17:7).\nWith no response in sight, they continued to spin aimlessly, dizzied spots masking their eyes.\nAs I sat in the grass watching the kids continue to twirl, I was reminded of a trick I’d learned in ballet as a little girl—spotting. In order to prevent dizziness, you choose a still object to fix your eyes on. With every turn of the pirouette, your head whips around to find your focal point, and you remain upright and dizzy-free. Reminded of this trick from childhood, I stood up, determined to try one more time. This time I glued my eyes to a nearby birdhouse as my body rotated again and again. It worked!\nMoses must have known this trick, too. While the Israelites continued to whirl in the wilderness, Moses kept His eyes fixed on one thing—God. With each unsettling turn of circumstances, Moses’ knees never buckled. God’s provision kept Moses standing firm by turning water from bitter to sweet (Exodus 15:25), raining manna from heaven (Exodus 16:4), and providing drinking water from the rock of Christ (Exodus 17:6).\nMoses’ determination was to remain upright in God’s promises, and he was used to fulfill the biggest one of them all—God’s holy promise to Abraham (Psalm 105:42). God established an entire nation of descendants through Moses!\nFriend, do you feel dizzied by the wilderness? Today, let’s try fixing our eyes on God’s presence. Let’s choose to trade the unsteady dark spots for the clarity of His faithfulness. May our spinning be steadied by His almighty hand. Amen.\nHere are the questions of the\nwilderness, “What!” “Where!”\n“How?” Faith has a brief but\ncomprehensive answer to all\nthe three, namely, God!\n–Charles Henry Mackintosh\n\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram10s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 17:8-16, Exodus 18:1-27, Proverbs 19:20",
    "devo_title": "Moses and Jethro",
    "devo_summary": "\nBY Vivian Mabuni\n\nText: Exodus 17:8-16, Exodus 18:1-27, Proverbs 19:20\nLife as a young mom had left me exhausted and exasperated. My hair was forever in a ponytail, and I rarely snagged a shower. Variations of snot, food, and crusted drool had taken up residence on the sleeves and shoulders of my shirts. The hope of ever again going to the bathroom in peace—alone and with the door closed—had become a distant memory.\nI was in the throes of a whole new world, just trying to keep the littles alive and fed. And I was struggling to connect with God. The loss of that connection gnawed away at me, and left me with a deep sense of guilt. The days of long, uninterrupted Bible study and prayer now seemed long gone, and I missed them. \nMy friend Prisca has three grown sons, and her youngest was once part of our on-campus college ministry. He was mentored by my husband throughout his college years, and so we got to know him well, witnessing firsthand how he lived out his faith—grounded, humble, secure, and wildly generous.\nI grew to admire and appreciate the role his parents played in raising him, and in particular his mom. I can clearly remember one of our first meals together in their home. Prisca listened with warmth and understanding as my tears rolled down and words tumbled out. I shared both the struggles and joys of new motherhood, and confessed my shame in not feeling connected to God during such a challenging season of life.\nJethro knew Moses was in a difficult season. He knew well the call God had on Moses’ life and how his son-in-law’s heart longed to serve God and minister to His people. But he could also see the unsustainability of how Moses was going about his life. He took the time to listen to Moses and observe his situation, before offering wise counsel (Exodus 18:13-16).\n“‘What you’re doing is not good,’ Moses’ father-in-law said to him. ‘You will certainly wear out both yourself and these people who are with you, because the task is too heavy for you. You can’t do it alone.’”\n-Exodus 18:17-18\nI fully expected Prisca, an amazingly godly woman, to admonish me about the importance of God’s Word and how I needed to rise earlier and work harder to protect my time with God. But instead, Prisca touched my arm and with a joyful laugh, shared, “You know, these are busy, challenging years you’re in, but it won’t always be like this. I remember going grocery shopping by myself once, when I was where you are. I just stopped and stared at the oranges for a long, long time…”\nPrisca’s words were like a sweet balm seeping into the deeper parts of my soul, bringing relief and, honestly, surprise. Her words of grace met my depleted body and soul exactly where I needed them. They encouraged me to stop striving and rest in order to keep from burning out. To stop trying to do it all on my own. She assured me that in my surrender, God would show me new ways of connecting with Him.\nWe all need a Jethro in our lives. We need someone who will patiently build our trust by observing and listening without judgment. We need people to seek out our hearts, instead of quickly offering unsolicited advice. And should we be blessed with such a friend, may we learn from their wisdom and heed their advice.\n“Listen to advice and accept instruction, that you may gain wisdom in the future.”\n-Proverbs 19:20\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram11s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 19:1-25, Exodus 20:1-21, John 1:14-18",
    "devo_title": "Moses at Mount Sinai",
    "devo_summary": "\nBY Raechel Myers\n\nText: Exodus 19:1-25, Exodus 20:1-21, John 1:14-18\nNo whining.\nPass with care.\nNo shirt, no shoes, no service.\nIf mama ain’t happy, ain’t nobody happy.\nFrom the moment we were old enough to scoot across the floor, a list of rules has governed our lives. We have dress codes and curfews and traffic laws. We wait our turn in line at the coffee shop and always wear our seat belts.\nIf we sat down and started talking, I bet we could go on for hours listing rules that guide every bit of how we go about our days.\nBut when God gave the Law, He didn’t give 10,000 commandments. He gave only ten.\nWhy only ten? Why these ten? In light of grace and freedom in the New Testament, what place does the Old Testament law have in our lives today?\nAlmost as if he knew we would be asking these questions, John Calvin wrote what would later be known as the “Threefold Use of the Law,” in order to show the importance of the Ten Commandments in the Christian life.\n#1: The Law acts as a mirror, reflecting the perfect righteousness of God and in contrast, the reality of human sinfulness. \nIf we are honest, it doesn’t take 1,000 laws to reveal our sin nature. We may be able to keep a commandment or two for the span of the day, but none of us can keep them all. Even stopping at ten, the Law effectively illuminates my utter sinfulness.\n#2: The Law’s second job is to restrain evil. The Law can’t change our hearts (which is why we are willing to speed until we see red and blue lights in the rearview mirror). Even so, the law can inhibit lawlessness and protect the righteous from the unjust.\n#3: The Law gives us a revelation of what is pleasing to God. The Law serves as a guide to good works for believers.\nWhen we look at the ten specific commandments God handed down to Moses, we see that He covered all of the bases. Laws 1 through 4 address the relationship between God and man. Laws 5 through 10 address how people relate to each other. When you get down to it, every nook and cranny of our sin can fall into one of these ten categories. Willing to compromise for your dream job? Check out commandment number two. Jealous of your neighbor’s house? That violates number ten. See what I mean?\nThe purpose of the Law is not to create an impossible checklist, but rather to show us what matters to God while also making our need for Him clear. \nFriends, the Law is good news because it undergirds the message of justice and extravagant mercy Christ came to give. Thanks be to Him.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram12s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "1 Corinthians 2:2",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nText: 1 Corinthians 2:2\nGrace days are for catching up and being still. As we read about the life of Moses in Scripture, let’s pause to meditate on the sufficiency of Jesus Christ as beautifully reflected in the hymn “Rock of Ages.”\nRead, hum, or sing the words of the third verse of this old hymn, and rest in the saving grace of Christ’s atonement for our sins, and His fulfillment of the law.\nNothing in my hand I bring,\nsimply to the cross I cling;\nnaked, come to thee for dress;\nhelpless, look to thee for grace;\nfoul, I to the fountain fly;\nwash me, Savior, or I die.\nfrom “Rock of Ages”\nAugustus Toplady, 1776 \n____\nFor I decided to know nothing among you except Jesus Christ and him crucified.\n1 Corinthians 2:2 ESV\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram13s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "John 1:16-17",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.\nThis week we’ve chosen two verses from John that underscore the relationship between the old covenant and the new covenant:\n Indeed, we have all received grace after grace from His fullness,\nfor the law was given through Moses, grace and truth came through Jesus Christ.\n-John 1:16-17\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/4-Moses2.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 32:1-35, Malachi 4:1-6",
    "devo_title": "Moses and the Golden Calf",
    "devo_summary": "\nBY Guest Writer\n\nText: Exodus 32:1-35, Malachi 4:1-6\nHave you ever come to a crossroads in life and earnestly sought the voice of God—only to eventually give up on hearing from Him and take your best guess at which direction to go?\nTake it from me: it’s not a great strategy. I’ve jumped into jobs, relationships, and commitments of all kinds when God might’ve been calling me elsewhere. It’s caused pain for others and myself.\nYou could say I’m not a patient person, but I think the root of the problem goes even deeper than that. I’ve jumped into jobs rather than waiting on the Lord because I’ve idolized work as a source of purpose and security. I’ve jumped into relationships because I’ve idolized people as a source of comfort and love. I’ve made all sorts of decisions apart from God because I’ve idolized myself, believing I’m fit to rule my own life.\nJust like the Israelites, we make idols because we lack faith in God. Our fallen hearts doubt He is good, mighty, and always present with us. Believing He is absent, we are all too happy to place ourselves upon the throne that belongs to God alone.\nIn Exodus 32, we see the Israelites do just that. When Moses was slow to come back down from the mountain, they quickly lost their faith. They believed that if Moses was absent, then God must be, too.\nKeep in mind, God had just rescued the Israelites from enslavement in Egypt. They’d watched Him send plague after plague to free them (Exodus 7-11), and pillars of cloud and fire to lead them in the wilderness (Exodus 13:21). He’d parted the Red Sea, giving them dry ground to flee from their enemy (Exodus 14:15-31). He’d even provided manna from heaven to nourish them, and drinking water from a rock to refresh them (Exodus 16; 17:1-7).\nAfter seeing God work so powerfully on their behalf, it’s hard to believe the Israelites’ hearts were so easily turned that they would worship a golden calf. It’s easy to judge them for their lack of faith. But the Israelites’ story should lead us to examine our own hearts.\nHave you ever seen God work a miracle, whether big or small, in your life or in the lives of those you love? Mountaintop miracles renew our fervor for the Lord, making it easier for us to praise Him. But what happens when, a month or two later, we find ourselves in a valley, feeling very far away from the miracles on the mountain? In those moments of desperation, do we turn to God for comfort and guidance, or do we assume He is absent? Do we doubt His goodness, like the Israelites did, and turn to something or someone else entirely?\nIdols don’t always present themselves in the form of a golden calf. In truth, we can make an idol out of anything—even relatively innocent things, like wise counsel from a friend. Or practicing spiritual disciplines like prayer and fasting, which can become idols if we begin to obsess over them instead seeking and worshiping the Lord. God has given us good desires for relationships, work, discipline, and beauty—but these desires are meant to point us toward God and the eternal life to come, not be an end in themselves.\nGod is jealous for our undivided and devoted worship (Exodus 34:14), and He knows that worshiping anything other than Him will only lead to heartbreak. He alone can satisfy the desires of our hearts. By His grace, may our hearts learn to solely direct our worship to the Father, Son, and the Holy Spirit.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. Jesus dramatically changed her life in high school, giving her a heart for those who don’t yet know the love of Christ. On any given weekend you’re likely to find Katie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram15s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 33:1-23, John 1:14, Matthew 17:1-5",
    "devo_title": "Israel Departs from Sinai",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Exodus 33:1-23, John 1:14, Matthew 17:1-5\nDo you ever wonder what people think when they meet you? When I leave a conversation, does everybody quietly give me a slow clap and gratefully nod their heads? Or do they all sigh with relief and laugh, relieved that the crazy lady has moved on?\nWhat do people see when they see me? They might notice my grouchy exhaustion and my giant orange sweater (again). But what I want others to see is my loving attention, my interested eyes, and my empathy for them.\nI’ve often thought of what it looks like to be a Christian. It’s not being nice at the grocery store or letting other drivers cut me off graciously—it’s not those little things. It’s one big thing: we look like Christians because of the presence and glory of God. How can that be? What exactly is the presence and glory of God?\nConsider our prayers inviting God’s presence to meet us in worship: God’s presence isn’t simply a warm and euphoric feeling. In the Bible we read that the presence of God came with claps of thunder (Job 37:4, 2 Samuel 22:14) and made people cry out in fear (Jeremiah 5:22;  Job 23:13-16). Even the fading marks of God’s presence shining on Moses’ face prompted the Israelites to tremble and plead with Moses to cover up the awesome and terrifying glow of God’s presence (Exodus 34:29-35). In the Bible, it seems that everyone who encounters the presence of God or His angels hits the deck with fear.\nBut instead of demanding that we cower from His holy presence, God mysteriously invites us to not be afraid. God invites us to come close (Genesis 26:24; Luke 1:20). The glory of God changes us.\nSo what does the mark of God’s presence with us look like?\nA Life led by the Spirit. Moses and Israel actually looked to a pillar of flame to follow God. Without flame in the sky, we still have His never-ending promises.\nA Spirit of Humility: God calls us to follow where He leads, even if He leads us into the wilderness. Seek Him. Honor Him. He can be trusted.\nIdentity in Him: He knows us by name, just as He knew Moses by name. He defines who we are. Our confidence comes from Christ alone.\nA Spirit of Security: Just as Moses was hidden in the cleft of the rock, God shields us from a glory that would kill us if we saw it without filter. God shows compassion on us in our weakness, and keeps us safe. We don’t have to live in fear.\nA Spirit of Worship: The presence of God invites us to proclaim the name of Yahweh. We direct our adoration to Him. He alone deserves our worship.\nDelight in Christ: When Jesus was baptized, the Father called Him beloved Son. He takes delight in Christ. God’s presence invites us to delight in Christ also. The mark of God’s presence is love of Christ.\nWithout His presence, we have none of these things; we cannot manufacture them. To venture forth in anything without the blessings of God is fearfully futile, because His gracious favor is our only security.\nMay the God who “became flesh and took up residence among us” shine His light on our faces (John 1:14). May we reflect His goodness and mercy. When people look at us, may they see the glow of God’s glory.\n\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram16s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Exodus 34:1-35, Exodus 40:34-38, 2 Corinthians 3:7-18",
    "devo_title": "The Glory of God",
    "devo_summary": "\nBY Guest Writer\n\nText: Exodus 34:1-35, Exodus 40:34-38, 2 Corinthians 3:7-18  \nIt was late afternoon as I boarded the non-stop flight back to Nashville, anxious to get home after a week in unfamiliar territory.\nThe plane settled into a rhythm, and I leaned my head back and glanced out the window. In an instant, I was captivated. We were flying above what looked like an ocean of clouds. Colors of the sunset sprayed one side of the world in a hundred shades of pink and orange. It was so mesmerizing I could barely blink. I wanted to see more. I wanted to stretch the window wide so I could experience the fullness of the sky’s beauty. It was too vast for me to capture from my limited viewpoint.\nAs I sat back and closed my eyes, vibrant colors remained etched in my mind. I was in awe of the wonder and glory of God. But as wondrous as these images and experiences may be, they are only glimpses of Him, evidence of His infinite greatness, which is far too big for us to fully comprehend (Isaiah 55:9).\nI can’t begin to imagine how Moses felt as the glory of God radiated from a cloud above the mountain where he stood. Beckoned by the Lord Himself, Israel’s leader obediently approached with nothing but blank tablets in his hands—new tablets to replace ones shattered in the wake of Israel’s idolatry (Exodus 34:1-3; 32:19). God, in an overwhelming display of mercy, offered them a clean slate (Exodus 32:33). He remained faithful to His covenant and led His people to the land of promise, by His glory and grace.\nAs the weight of pure holiness hovered above Moses, God declared the power of His name. Scripture tells us, “Moses immediately bowed down to the ground and worshiped” (Exodus 34:8). He lingered there in God’s presence for 40 days.\nLike the moon reflecting the brilliance of the sun, Moses’ face soaked up the radiance of God’s light until a visible glow permeated his countenance. He’d seen only a glimpse of God’s glory, but descended that mountain more certain than ever of Yahweh’s flawless character and covenant love.\nFrom a mountain to a sacred tent, God’s glory remained near as the Israelites wandered in the wilderness. Time and time again, Moses approached the Lord as Israel’s advocate then stood before a trembling nation as God’s mouthpiece. Moses led the people faithfully, but he was powerless to save them. He spoke to God on their behalf, but he could never close the gap that separated them from God’s presence. While Moses played an integral role in redemptive history, the story was always bigger than him (Hebrews 3:3).\nWe know the rest of the story.\nIn Christ, the glory of God came down and dwelt among us (John 1:14). The veil that once darkened our eyes was torn away by the power of redemption (Hebrews 10:19-22). Jesus is the greater Advocate, the One who stood in our place and offered Himself as our substitute. Wrapped in eternal light, He now stands before the Father on our behalf and covers us with the radiance of His righteousness.\n“The Son is the radiance of God’s glory and the exact expression of His nature, sustaining all things by His powerful word. After making purification for sins, He sat down at the right hand of the Majesty on high.”\n-Hebrews 1:3\n\n\nWritten By Ali Claxton \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram17s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Numbers 21:4-9, John 3:1-21",
    "devo_title": "Moses and the Bronze Serpent",
    "devo_summary": "\nBY Guest Writer\n\nText: Numbers 21:4-9, John 3:1-21\nWhen we know what to look for, we can find Bible teachers everywhere.\nFor example, the next time you see an ambulance, look for the blue symbol of a snake wrapped around a pole. Perhaps, like many of us, snakes (and ambulances) give you the heebie jeebies and your eyes naturally want to look away. But pay attention, friend. That obscure little symbol is preaching the gospel.\nSmack dab in the middle of the Exodus epic, we find a strange little story. As the Israelites moved from Egypt toward the Promised Land, they developed a chronic grumbling problem. Despite repeated warnings and punishment for complaining against God and Moses (Numbers 11:1, 14:2), God’s people continued to bellyache. God’s judgment for this sin is found in Numbers 21:6:\n“Then the Lord sent poisonous snakes among the people, and they bit them so that many Israelites died.”\nThe fact that God takes sin so seriously makes me squirm like a snake myself. When I see that He won’t skip judgment for those offenses I’d call “inconsequential”—like grumbling—I squirm even more. But God’s judgment and mercy are inseparable. When you see judgment in His Word, or feel it in your own life, look deeper. Once flipped over, we see that God’s infinite mercy is on the other side of that coin.\n“Then the Lord said to Moses, ‘Make a snake image and mount it on a pole. When anyone who is bitten looks at it, he will recover.’ So Moses made a bronze snake and mounted it on a pole. Whenever someone was bitten, and he looked at the bronze snake, he recovered.’”\n-Numbers 21:8-9\nGod delivered judgment, but then He delivered mercy. This wasn’t back-peddling or flip-flopping. It was His divine nature on full display. Because He is holy, He must deal with our sin. Because He is love, He chooses to offer us mercy. \nWhen the grumbling Israelites looked to the bronze serpent held high on a pole, they were saved from the punishment they deserved. Mercifully, God used the emblem of His judgment to draw His people back to Himself. That’s good news for them that points to even better news for us.\n“Just as Moses lifted up the snake in the wilderness, so the Son of Man must be lifted up, so that everyone who believes in Him will have eternal life.”\n-John 3:14-15\nDon’t miss this—it’s too wonderful!\nThe Israelites looked to a snake on a pole for healing from poisonous venom.\nWe look to the Savior on the cross to heal us from the poison of sin.\nThey were given an injunction against immediate physical death.\nWe’re saved from spiritual death, and granted eternal life instead.  \nI doubt the Israelites wanted to fix their eyes on a bronze snake while actual snakes were striking at their heels. But God needed them to look hard at His judgment so they could receive His mercy.\nLike the snake-bitten Israelites, we’re sinners deserving of God’s judgment. It’s tempting to look away from that truth. But, look! His mercy is easy to spot. God uses the cross, the emblem of His judgment, to draw us back to Himself.\nBecause of our sin, the cross was necessary. That’s judgment. Yet, from the cross, Jesus took the punishment we deserve, and in His mercy, He overcame the Snake and death once and for all (Hebrews 2:14). What mercy!\nLook past God’s servant Moses, and see the God who delivers both righteous judgment and loving mercy. Look past the snake on the pole and see the Savior on the cross.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram18s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Deuteronomy 32:48-52, Deuteronomy 33:1-29, Deuteronomy 34:1-12",
    "devo_title": "God Buries Moses",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Deuteronomy 32:48-52, Deuteronomy 33:1-29, Deuteronomy 34:1-12\nDriving in the van, we talked about prosaic adult things in the front, while the children rattled around in the back. I was telling my husband about a memory-building chart I’d seen in college, and they were playing “touched you last.” But later that morning, sitting next to my journal-obsessed nine-year-old, I looked over and saw a transcript of our conversation and a rendering of the chart I’d described.\nSimultaneously surprised, delighted, and a little alarmed, I remembered how important we are to her. Right now, she is interested in everything we say and do. Objects, places, and ideas all hold special significance for my daughter if she hears that I love them.\nIt’s a weighty thing to be so adored by someone, to be so intimately and lovingly observed. God invited Moses into intimacy. When Moses was born, “he was beautiful in God’s sight” (Acts 7:20). God knew and watched Moses from the beginning, and He called Moses into a close and special journey with Him. Unlike my daughter, God wasn’t simply eavesdropping on Moses; He was giving Moses the unimaginable gift of His loving attention.\nGod’s attention seems so unfathomable to me. Why would the Almighty bother to attend to my nail-biting hesitations, or even my wedding day? His is a love so big, we cannot even fathom it.\nGod loves His people so much that He actually invites us into a relationship with Him. There are few places in history where we have such a beautiful record of God’s tender and patient encounters with men. From the day of his birth, Moses enjoyed God’s special favor and blessing, and this close relationship between God and Moses continued to Moses’ final day.\nBecause of his sin at the waters of Meribah, Moses was not allowed to enter the Promised Land (Numbers 20:11). But even in the midst of this heartbreaking judgment, God showed favor to Moses and allowed him a glimpse of His promised home for Israel.\nGod’s favor doesn’t look like what we’d expect it to. The blessing of God isn’t limited by our ideas of good living. When I pray for His blessing and favor, in my heart, I’m often just asking for things to go my way. But the glory of God’s blessing is not circumstantial at all—the blessing is intimacy with God Himself.\nMoses’ life was a whirlwind of disappointments and triumphs, but regardless of what was going on in the tents and on the desert plain, God was with him. The final scene of Moses’ life is private and tender: God buries him in a secret place. He was God’s man.\nMay we long for this kind of intimacy with God. May “He who spoke to Moses” be our ever-present help in trouble, the shield that protects us. For “indeed He loves His people” (Deuteronomy 33:3), and he is our dwelling place, let us desire nothing more than to draw near to Him and see His face (Deuteronomy 33:27).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram19s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Romans 8:1",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nGrace days are for catching up and being still. As we read about the life of Moses in Scripture, let’s pause to meditate on the sufficiency of Jesus Christ as beautifully reflected in the hymn “Rock of Ages.” \nRead, hum, or sing the words of the fourth verse of this old hymn, and rest in the truth of Christ’s deep love for us.\nWhile I draw this fleeting breath,\nwhen mine eyes shall close in death,\nwhen I soar to worlds unknown,\nsee thee on thy judgment throne,\nRock of Ages, cleft for me,\nlet me hide myself in thee.  \nfrom “Rock of Ages”\nAugustus Toplady, 1776 \n____\nTherefore, no condemnation now exists for those in Christ Jesus…\n-Romans 8:1\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/SRT-Moses-Instagram20s.jpg"
},
{
    "book_title": "The Life of Moses",
    "devo_passages": "Psalm 105:45",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nThis week we’ve chosen a reminder that God works faithfully for the good of His people:  \nAll this happened\nso that they might keep His statutes\nand obey His instructions.\nHallelujah!\n-Psalm 105:45\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/4-Moses3.jpg"
},
        {
            "book_title": "Attributes of God",
            "devo_passages": "Deuteronomy 10:14-17, Psalm 145:3-7, Isaiah 40:9-25, John 1:1-5, Revelation 22:13",
            "devo_title": "God Is God",
            "devo_summary": "\nBY She Reads Truth\n\nGod is the Creator and Sustainer of all things, both visible and invisible. He is infinite, eternal, and unfathomable, yet He reveals Himself to us through the universe He made and His infallible Word. \nWhatever we think of when we think about God is, at the very least, incomplete. He is infinite, but our imaginations are limited. He is unfathomable, so our thoughts cannot plumb the depths. He is the Creator of everything, yet we are constrained by metaphors that come from the created world. The very idea that we might classify or categorize God is laughable. He cannot be tamed or studied. He is beyond our reach and beyond our understanding. \nAnd yet we can know Him. He has graciously entered our world, time and time again, so that we might be His children and His true image-bearers. He was in the garden with Adam and Eve. He spoke to Noah, Abraham, and Moses. His presence filled the tabernacle and, later, the temple. He put on flesh and became one of us. And He has gifted His Spirit to His people, in order that we might know Him more intimately still. “The LORD had his heart set on your fathers and loved them. He chose their descendants after them—he chose you out of all the peoples, as it is today” (Deuteronomy 10:15). \nWe can know God because He has chosen to be known. He is all-powerful, all-knowing, and all-present. He is loving and just, merciful and good, and a thousand other things beside. “For the LORD your God is the God of gods and Lord of lords, the great, mighty, and awe-inspiring God” (v.17). Theologians have made many a complicated list of God’s attributes, filling thick volumes on shelves that occupy the libraries of this world. But those books amount to what we can know about God. We have been given an opportunity to go much deeper than that. We have been invited to love Him and be loved by Him—to know Him in a way that defies our limited capacity for knowledge and understanding and, in so doing, bring Him glory.\nWhatever measure of knowledge we have about God is granted to us so that we might worship Him, not merely as admirers from afar but as dearly loved children. \n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day1.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Numbers 23:19, Psalm 102:25-28, Job 23:8-14, Malachi 3:1-6, Hebrews 6:13-19, Hebrews 13:8, James 1:16-18",
            "devo_title": "God Is Immutable",
            "devo_summary": "\nBY She Reads Truth\n\nGod is unchanging in His being. His character and will are constant.\nAs humans, we speak the language of change. We are always seeking the next, the better, the unknown. Even if we prefer to hold change at an arm’s length, it is inevitable. The seasons shift, the stars fall, our numbered hairs fall out, and our hearts undergo the only constant we know—change.\nThe book of Ecclesiastes contains this famous refrain, charged with the impatience, discomfort, and hopefulness of our ever-changing lives:\nThere is an occasion for everything,\nand a time for every activity under heaven:\na time to give birth and a time to die;\na time to plant and a time to uproot (3:1–2).\nWe live our lives seemingly anchored to little more than change itself. And yet Scripture beckons us to drop our anchor and hold fast to the One who never changes.\nOur God is unchangeable because He is perfect. Nothing can be added or taken away from Him. Everything He does is consistent with who He is. God’s promises are the same, and His ability to keep them will never waver. In Malachi 3, God tells His people: “Because I, the LORD, have not changed, you descendants of Jacob have not been destroyed” (v.6). In short, God’s immutability means we can count on Him, no matter what.\nJob, whose life changed in dramatic and painful ways, knew God to be always true to His character. “He is unchangeable, who can oppose him?” he asked (Job 23:13). Job staked his hope—his life—on his belief that God will always be who He declares Himself to be and do what He says He will do.\nJob’s hope is our hope.\nComplete, unchangeable, perfect—this is our God. As the ancient doxology “Gloria Patri” declares:\nGlory to the Father and to the Son\nand to the Holy Spirit;\nas it was in the beginning is now\nand will be forever. Amen.\n\nEdited language of first paragraph on 2/5. Thanks for keeping us on our toes, Shes! \n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day2.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "1 Kings 8:22-29, Psalm 139:7-12, Jeremiah 23:23-24, Matthew 28:18-20, Acts 17:24-28",
            "devo_title": "God Is Omnipresent",
            "devo_summary": "\nBY She Reads Truth\n\nGod is present everywhere in His creation but also above and beyond it. This remained true even as Jesus entered our world as a man and remains true as the Holy Spirit takes up residence within believers.\nThe Bible can be described as the story of God’s presence with His people. From walks in the garden with Adam and Eve to the incarnation to the gift of His Spirit at Pentecost, God was there. But the presence of God is not limited to any one location or situation.\nUsing a series of rhetorical questions, God outlines the all-encompassing nature of His omnipresence through the prophet Jeremiah:\n“Am I a God who is only near… and not a God who is far away? Can a person hide in secret places where I cannot see him?… Do I not fill the heavens and the earth?” (Jr 23:23–24).\nThese verses not only show that God is both near and far, filling the heavens and the earth, but that He is always with us. There is no escaping His presence. At first, we might find this truth unsettling, but when we understand God’s heart toward His people, we can find it comforting. We echo the words of the psalmist: “But as for me, God’s presence is my good” (Psalm 73:28).\nGod’s omnipresence means He sees us, knows us, is with us, and will never leave us. It’s a very practical truth because the greater our awareness of His presence, the more we live with a healthy fear of the Lord. We think twice before giving in to temptation, knowing our sins are not secret. We learn to go through our day with God, abiding in Him moment by moment. We find it a natural thing to pray constantly (1 Thessalonians 5:17), because He is always right there with us.\nUpon completing His earthly ministry, and before ascending to heaven, Jesus promised His disciples He would send the Holy Spirit to them. His last words in the Gospel of Matthew are, “I am with you always, to the end of the age” (28:20). We experience Jesus’s constant presence through His Spirit, who lives in all believers. And one day, when Jesus returns, we will see Him not just with eyes of faith, but “face to face” (1 Corinthians 13:12).\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day3.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "1 Chronicles 28:4-9, Job 28:20-28, Psalm 139:1-6, 16-18, Isaiah 46:9-11, Matthew 10:26-30, 1 John 3:18-20",
            "devo_title": "God Is Omniscient",
            "devo_summary": "\nBY She Reads Truth\n\nGod knows everything—past, present, and future—and nothing takes Him by surprise.\nWhen we stumble and sin, it helps to remember that God is merciful. When we recognize that we have, once again, turned aside to idols of our own making, there are Scriptures that declare God’s faithfulness in spite of our frailty. And when we have been burned by some injustice—life-shattering or trivial—we can thank our Savior for being a righteous Judge who promises to set all things right in the end. Reflecting on God’s attributes can bring us peace in the midst of struggles. But there is one that can leave us feeling exposed: God’s omniscience.\nBecause He is all-knowing, there is nothing hidden from God’s sight—nothing in waking life or even in our imaginations. There is no event in the past, present, or future that takes Him by surprise. The entire universe is an open book.\nThis kind of knowledge in anyone else’s hands would be a dangerous weapon. It would be appropriate to live in a constant state of fear. But God’s omniscience is coupled with His other attributes. To be known by God, then, is to be valued and loved. None of us are here by mistake. He wants to know us. And that’s a very good thing; within each of us is a desire to be known.\nWe all want to be fully known and understood, and then to be fully loved. Of course, we too often conclude in our hearts we are unloveable. After all, we how we’ve done wrong and missed the mark, how easily we’ve given in to temptation. Our hearts condemn us daily. But “God is greater than our hearts, and he knows all things” (1 John 3:20).\nOn the day of Solomon’s coronation, David told his son, “The LORD searches every heart and understands the intention of every thought” (1 Chronicles 28:9). In these words, there is a warning, but there is also grace. True, there is no hiding from God. But there also isn’t anyone who could possibly know us better. Because Jesus dealt with our sin on the cross, purifying us as a bride for her husband, God’s omniscience is not reason to fear blanket condemnation; instead, it’s an invitation to true intimacy with our Maker.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day4.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Genesis 18:9-14, Psalm 33:6-9, Jeremiah 32:26-27, Mark 4:35-41, 1 Corinthians 15:20-28, Jude 1:24-25",
            "devo_title": "God Is Omnipotent",
            "devo_summary": "\nBY She Reads Truth\n\nGod has unlimited power over all things at all times. However, He does not act contrary to His nature.\n“Is anything too difficult for the Lord?”\nThis question has a clear, straightforward answer: No. Nothing is impossible with God. His omnipotence, His all-powerfulness, is perhaps one of the first things we learn about Him. It can also be a spiritual stumbling block for human understanding, in things both trivial and serious.\nAlong these lines, you may have heard some form of this brain-teaser: “If God can do all things, is it possible for God to create a rock that is too big for Him to lift?” It’s a question that suspends normal logic in an attempt to stump us, but as C. S. Lewis reminds us in his book The Problem of Pain, “Nonsense remains nonsense, even when we talk it about God.”\nIn more serious matters—in times of grief, struggle, and loss—we wonder, Where is God in the midst of my pain? How could He let this happen? Like the disciples, we cry out, “Don’t you care…?” (Mark 4:38). We echo Martha’s sentiments from John 11, saying, “Master, if only you had been here…” (v.21). When we read these stories, we see them met with near-immediate fixes at the hand of Jesus. But we also know that God does not always stop the storm or raise the dead when we think He should. If God is able to do all things, why doesn’t He “fix” all things, already? Why let hard things happen in the first place?\nGod holds power over all things, governs all things, and by Him all things hold together (Colossians 1:17). And that power, that impenetrable grip on the cosmos, sustains us through every wind and wave that comes our way, whether or not we remain on our feet. In time, we begin to understand His omnipotence in light of His other attributes. God can do anything, but He does not act against His own character or nature: His goodness and justice, His mercy and love.\nWhile His omnipotence is a certain terror to those who oppose Him, it is a resounding comfort to His children; God is good and promises good to those who love Him. Nothing is impossible for Him, and nothing can prevent Him from achieving His good will.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day5.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "1 John 3:20",
            "devo_title": "Grace Day",
            "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor God is greater than our hearts, and he knows all things.\n—1 John 3:20\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day6.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Psalm 145:3",
            "devo_title": "Weekly Truth",
            "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for this reading plan.\nThe LORD is great and is highly praised;\nhis greatness is unsearchable.\n—Psalm 145:3\n\n \n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/4-AttributesOfGod1.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Exodus 34:29-35, 2 Corinthians 3:7-18, John 14:15-21, Hebrews 1:1-4",
            "devo_title": "God Is Personal",
            "devo_summary": "\nBY She Reads Truth\n\nGod is a triune personal being who enters into a covenant relationship with His people, both individually and corporately.\nOur finite, human minds will never truly understand the vastness of God’s glory, nor the fullness of His character. When we consider His infinite greatness, it can be difficult to remember that while He is incomprehensibly grand, He is also personal and relational. He is Immanuel, “God with us” (Matthew 1:23).\nWe see this in Exodus 34, when God met with Moses on Mount Sinai. Moses came down from the mountain and found he had to conceal his face with a veil in order to speak with the Israelites. He “did not realize that the skin of his face shone” (v.29) after talking with God—that it was reflecting the radiance of God’s glory and frightening his fellow Israelites. And so, whenever Moses met with God, he would remove the veil, but then put it back on when speaking with God’s people.\nIn 2 Corinthians 3, Paul writes that the sacrifice of Christ and the ministry of the Holy Spirit have changed the nature of our relationship with God. We can now gaze upon the glory of God with unveiled faces, just as if we were staring into a mirror (v.18). While Moses was the mediator between God and His people, we now have Christ, the “radiance of God’s glory and the exact expression of his nature” (Hebrews 1:3) as our Mediator. Because of Christ, we can enter into relationship with God both corporately as His Church and as individuals. Even more, we have received a Counselor, the Holy Spirit, to remain with us at all times.\nOur relationship with God is rooted in His glory and expressed in His immanence. God is present with us, deeply invested and active in each of our lives. He is a personal God. He relates to us, loves us, and cherishes us. Rather than being distant, inaccessible and detached, He has drawn near to us so that we might draw near to Him. By grace, He dwells among us, and by that same grace, He invites us into His presence.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day8.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Leviticus 20:23-26, Isaiah 6:1-7, Hebrews 7:26-28, 1 Peter 1:14-16, Revelation 4:8-11",
            "devo_title": "God Is Holy",
            "devo_summary": "\nBY She Reads Truth\n\nGod is perfect, pure, and undefiled. He does not sin.\nAs God’s image-bearers, we’re called to reflect His holiness. God says, “You are to be holy to me because I, the LORD, am holy” (Leviticus 20:26). It is a seemingly impossible task. We have all been stained by sin and bear on our backs the weight of a sinful nature. Try as we might, we all “fall short of the glory of God” (Romans 3:23).\nWhen confronted with God’s holiness in the heavenly throne room, Isaiah’s response was nothing short of terror: “Woe is me for I am ruined because I am a man of unclean lips” (Isaiah 6:5). That’s how stark the contrast is between God’s perfect, holy nature and our utter lack of holiness. It’s not even close.\nTo be holy is to be set apart, uncommon, and raised up. God is all of these things, and we are not. But His response to Isaiah’s woeful plea was not to leave Isaiah ruined before the throne. Instead, He extended mercy and made atonement for Isaiah’s sin (Isaiah 6:6–7). God, in His perfection, has made a way for His people to be holy, for nothing is impossible with Him (Luke 1:37).\nBecause of Jesus’s sacrifice for us on the cross, all things are being made new (Revelation 21:5). We have been given God’s Spirit to walk with Him and practice holiness daily. Someday, all who know Christ will be perfected in Him. On that day, we will reflect God’s holiness to all creation, just as God designed it to be from the beginning.\nIn the meantime, God has given us the righteousness of His Son, making us holy in His sight. We are now set apart as His “holy nation” (1 Peter 2:9) and a temple for His Spirit. The holy presence of God that once made Isaiah tremble lives inside of believers. Our hope in Christ is so sure that God already regards us as people who no longer fall short, who have become holy, just as He is holy.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day9.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Psalm 103:11-14, Hosea 11:1-9, John 3:16-17, Romans 5:8, Ephesians 3:14-19, 1 John 4:7-21",
            "devo_title": "God Is Loving",
            "devo_summary": "\nBY She Reads Truth\n\nGod is self-giving, showing mercy and grace toward all creation, especially toward His people.\n“God is love” (1 John 4:16). He is always loving—even when He disciplines, even when He judges. It’s who He is. And this divine love is infinite, meaning it is bigger than we could ever imagine, even if we had a thousand lifetimes with which to ponder it. If we were to taste a full dose of God’s love, it would knock us, quite literally, out of our socks. We would be unable to stand in the presence of such passion.\nWe were made for God’s love, so it shouldn’t surprise us that the enemy of God’s people chooses to sow doubt at this critical place in our souls. Concerning the forbidden fruit in the garden, the serpent told Eve, “God knows that when you eat it your eyes will be opened and you will be like God, knowing good and evil” (Genesis 3:5). In other words, we believe the lie that God is somehow holding out on us, that He does not really love us. It worked with Adam and Eve, and the devil has been using this same tactic ever since.\nWe tend to filter what the Bible tells us about the love of God through our experience of love with people who, like us, love imperfectly. The Bible gives us a definition of love in 1 John, imploring us to not define love on our own terms, through our own broken experiences, but instead to see love from heaven’s perspective: “Love consists in this: not that we loved God, but that he loved us and sent his Son to be the atoning sacrifice for our sins” (1 John 4:10).\nEverything God does is loving. But His love is most clearly seen on the cross, because God’s love is sacrificial. He gives Himself for the good of those whom He loves. His love for us is true. There are holes in the hands of our Savior to prove it (John 20:27). Those holes are evidence of God’s love, declaring loudly that He does not withhold a single good thing from us, no matter what the enemy may try to tell us.\n\n \n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day10.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Exodus 34:5-7, Psalm 146:5-9, John 5:19-30, Romans 2:1-11, Revelation 20:11-12",
            "devo_title": "God Is Just",
            "devo_summary": "\nBY She Reads Truth\n\nGod is righteous. He is the standard for all that is just and fair.\nWe are often unsure what to make of our just God. But His righteousness can and should be cause for celebration, a source of immense comfort in a world where earthly justice falls short.\nWe ache for justice when we experience the ramifications of sin, both on a personal and a systemic scale. When something we love is violated, wounded, or broken, we don’t respond with indifference—we cry out, demanding accountability. If we, with our limited perspective, are so affected by injustice, how much more does God demand justice when His standard of what is good is not upheld?\nGod loves more deeply and thoroughly than we could ever imagine. He loves perfectly. When proclaiming Himself to Moses, God says He is “a compassionate and gracious God, slow to anger and abounding in faithful love and truth, maintaining faithful love to a thousand generations, forgiving iniquity, rebellion, and sin. But he will not leave the guilty unpunished” (Exodus 34:6–7).\nGod’s understanding of guilt is also perfect, because He is all-knowing, holy, and infinite. He has no statute of limitations. He is not swayed by false testimony or inconclusive evidence. He is the perfect witness, who searches and knows every heart, every intention, every action (Job 28:24; Psalm 69:5). He is “faithful forever, executing justice for the exploited,” even when our lives are not long enough to see it (Psalm 146:7).\nUnlike what we experience from one another on earth, God is not faulty or vindictive. He does not overlook sin, nor does He demand more than what is just. This is good news, because we are not only victims of sin and injustice; we are also perpetrators. And yet the steep price our guilt demands is a price Christ already paid on the cross. And “if we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness” (1 John 1:9).\nJesus tells us He has been given the right to pass judgment, and that He gives life to those who hear His Word and believe it (John 5:24). Our just Judge is also our Savior. He alone can mend the brokenhearted and offer hope to the unrighteous.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day11.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "1 Chronicles 16:34-36, Psalm 119:57-68, Matthew 7:7-11, Romans 8:28, Revelation 21:1-7",
            "devo_title": "God Is Good",
            "devo_summary": "\nBY She Reads Truth\n\nGod is the standard of beauty, faithfulness, kindness, and truth. He is the source of all goodness.\nTo say God is great is to focus on His power: He speaks creation into existence, makes the skies thunder and rain, and sets the planets in their orbits. But to say God is good is different; it is not just another way of recognizing His power. The goodness of God speaks to His personal character—who He is in relationship to us. In all ways and in all things, God is good. He is never absent, disinterested, careless, ill-tempered, petty, spiteful, or mean. He is set apart from all evil and does what is right, faithful, kind, and true. Always.\nTrue goodness is defined by who God is. He doesn’t just do good—He is good. In Psalm 119:68, the psalmist prays, “You are good and you do what is good; teach me your statutes.” The key to understanding the goodness of God is learning who He is through His Word. If we don’t learn His statutes, we will bring our own definitions and impose them on God. And when He doesn’t do what we think He should, we will accuse Him of failing to be “good” by our own standards—not His.\nIn His goodness, God gives us what we need and withholds what we do not. If we ask for bread, He will not give us a harmful serpent or a useless stone, He will give us what we need (Luke 11:11; Matthew 7:9). The God who withholds no good thing is the same God who gives no bad thing. Sometimes we don’t realize that we ask God for stones and serpents. When we ask God to give us things that are useless or harmful, the good Father refuses. As sure as He will not give a serpent when His children ask for fish, neither will He give them a serpent when His children unwittingly ask for one.\nYes, God is great, but He is also good. All the time and in all things. He does good because He is good.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day12.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "1 Chronicles 16:34–36",
            "devo_title": "Grace Day",
            "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n34 Give thanks to the LORD, for he is good;\nhis faithful love endures forever.\n35 And say: “Save us, God of our salvation;\ngather us and rescue us from the nations\nso that we may give thanks to your holy name\nand rejoice in your praise.\n36 Blessed be the LORD God of Israel\nfrom everlasting to everlasting.”\nThen all the people said, “Amen” and “Praise the LORD.”\n1 Chronicles 16:34–36\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-AOG-Instagram-Day13.jpg"
        },
        {
            "book_title": "Attributes of God",
            "devo_passages": "Isaiah 40:25",
            "devo_title": "Weekly Truth",
            "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we are memorizing a reminder from Scripture that there is no one like God.\n“To whom will you compare me, or who is my equal?” asks the Holy One.\n—Isaiah 40:25\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/4-AttributesOfGod2.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Exodus 3:7-16, Exodus 34:1-9, Psalm 15:1-5, Isaiah 42:5-9, John 8:58",
            "devo_title": "Yahweh",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nYahweh\nYHWH (Hebrew)\nScripture Reading: Exodus 3:7-16, Exodus 34:1-9, Psalm 15:1-5, Isaiah 42:5-9, John 8:58\nDescription\nYahweh is a profoundly holy name, but it is also unmistakably personal. Yahweh is distinct from other names of God because it is self-revealed. It is the intimate, covenantal, relational name of God. Modern English translations of the Bible often use small capital letters for YHWH.\nWhen Moses asks God for His name in Exodus 3, God reveals Himself as “I Am Who I Am,” and then calls Himself Yahweh. In Exodus 34, He again proclaims His name as He describes His character to Moses. His name is a core part of the covenantal promise He makes with Moses—Yahweh will always be who He is.\nEmphasis\nThe name God gives Himself, highlighting His covenantal and relational nature\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram1.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Genesis 1:1-5, Job 37:5-13, Psalm 42:1-11, Isaiah 43:10-13",
            "devo_title": "God",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nGod\nElohim, El  (Hebrew)\nScripture Reading: Genesis 1:1-5, Job 37:5-13, Psalm 42:1-11, Isaiah 43:10-13\nDescription\nElohim is the first name used for God in the Bible. It appears in the opening verse of Scripture: “In the beginning God created the heavens and the earth” (Gn 1:1). The Israelites adapted the name Elohim from El, an ancient word for “god,” to refer to the one true God. This name emphasizes His greatness and majesty over all creation and all other gods. Throughout Scripture this name is paired with descriptive words to distinguish God and His character from pagan gods (e.g., El Olam, “everlasting God,” El Roi, “God who sees,” and El Rahum, “merciful God”). Elohim is a reminder that the one true God is distinctly powerful.\nEmphasis\nGod’s unmatched power and majesty\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram2.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Genesis 15:1-6, Exodus 4:10-16, Deuteronomy 10:17-21, Matthew 14:22-32, John 20:24-29, 1 Corinthians 8:5-6, Revelation 17:14",
            "devo_title": "Lord",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nLord\nAdonay (Hebrew), Kurios (Greek)\nScripture Reading: Genesis 15:1-6, Exodus 4:10-16, Deuteronomy 10:17-21, Matthew 14:22-32, John 20:24-29, 1 Corinthians 8:5-6, Revelation 17:14\nDescription\nIn the Old Testament, adonay, or “lord,” was a common way to refer to God. It comes from the word used to describe human masters who ruled over servants. The Israelites used it verbally instead of pronouncing the name Yahweh, and it communicated their reverence for the Holy God of Israel as their ruler and ultimate authority. Adonay is a reminder that we serve a holy, sovereign God who is Lord over all.\nKurios, or “lord” in the New Testament, was used to show respect to people with authority like emperors or masters. It is used to describe both God the Father and Jesus the Son in the New Testament. When followers of Jesus called Him “lord,” they showed Him honor. In Paul’s letters, he used the word as a title for the risen Jesus. “Lord Jesus Christ” became a primary way to refer to Him, implying He shared the authority of the God of Israel. Kurios is a powerful name of honor for Jesus. \nEmphasis\nA title of honor, respecting the authority and ruling power of God\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram3.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Isaiah 7:13-17, Matthew 1:18-25, Matthew 28:19-20, John 1:10-18, Revelation 21:3",
            "devo_title": "God With Us",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nGod With Us\nImmanuel (Hebrew), Immanuel (Greek)\nScripture Reading: Isaiah 7:13-17, Matthew 1:18-25, Matthew 28:19-20, John 1:10-18, Revelation 21:3\nDescription\nThe name Immanuel, or “God is with us,” appears in the book of Isaiah in key prophecies predicting the coming of the Messiah. The name carries a sense of nearness, including intimate knowledge of the needs, struggles, and hopes of humanity. When Isaiah prophesies about the virgin birth, he says that her child will be called Immanuel. This is not a proper name as much as it is a description of what the Messiah would be like. \nIn Matthew, an angel tells Joseph to name the child Jesus, because “He will save His people from their sins” (Mt 1:23). This name describes what Immanuel would do. Together, the names Immanuel and Jesus mean “God will be with His people and He will save them from their sins.” God saves His people and is close to them.\nEmphasis\nGod’s nearness to and presence with His people\nReflection\nWhat does this name teach me about God?\n\n ",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram4.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Psalm 78:40-43, Psalm 89:15-18, Isaiah 41:12-20, Revelation 4:1-8",
            "devo_title": "Holy One",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nHoly One\nQadosh (Hebrew)\nScripture Reading: Psalm 78:40-43, Psalm 89:15-18, Isaiah 41:12-20, Revelation 4:1-8\nDescription\nThe Hebrew word qadosh is translated “set apart as holy.” It can be used in a general sense to describe places, objects, and people who have been set apart for religious purposes. But as a name, Qadosh, or “Holy One,” describes God as one who is set apart from His creation, from all pagan gods, and from everything else because of His perfection. This name works like a double-edged sword: it reminds us that God is perfectly holy in every way, and it reminds us that we are not. The distinction of being the Holy One belongs to Him alone. This name exalts God above all others in His holiness.\nEmphasis\nThe righteousness and holiness of God\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram5.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "1 Corinthians 8:5-6",
            "devo_title": "Grace Day",
            "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor even if there are so-called gods, whether in heaven or on earth—as there are many “gods” and many “lords”— yet for us there is one God, the Father. All things are from him, and we exist for him. And there is one Lord, Jesus Christ. All things are through him, and we exist through him.\n-1 Corinthians 8:5-6\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram6.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Isaiah 42:8",
            "devo_title": "Weekly Truth",
            "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for this reading plan, which powerfully summarizes the supremacy of God’s name. \n“I am the LORD. That is my name,\nand I will not give my glory to another\nor my praise to idols.”\n–Isaiah 42:8\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/4-NamesOfGod-1.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "1 Samuel 1:1-11, 2 Samuel 7:22-29, Psalm 80:4-7, Amos 5:14-15, Haggai 2:6-9, Malachi 1:11-14, Luke 2:13-14",
            "devo_title": "Lord of Armies",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nLord of Armies\nYahweh Tsebaoth, Yahweh Elohim Tsebaoth, Elohim Tsebaoth (Hebrew)\nScripture Reading: 1 Samuel 1:1-11, 2 Samuel 7:22-29, Psalm 80:4-7, Amos 5:14-15, Haggai 2:6-9, Malachi 1:11-14, Luke 2:13-14\nDescription\nThe Hebrew root word tsaba, or “a gathering of people,” is frequently used in the Bible to describe armies preparing for war. When paired with the name of God in Yahweh Tsebaoth, it reveres Him as being over hosts of angelic armies who gather in His name and serve at His command. All creation is subject to the LORD of Armies. “LORD of Hosts,” “God of Armies,” and “LORD God of Armies” are versions of this name.\n“LORD of Armies” most frequently appears in the Minor Prophets, especially in Malachi, where almost half of the verses in the book contain this name in some form. During the time of the prophets, the people of God were living in exile in Babylon. They faced daily reminders of the presence and power of the enemy armies keeping them in captivity. They called out to God as the LORD of Armies, whose vast angelic armies could deliver them from trouble. LORD of Armies is a name that assures us of the power of our mighty God. \nEmphasis\nThe security, power, and strength of God in the face of His enemies\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram8.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Numbers 11:24-30, Psalm 51:10-13, John 4:19-24, John 14:15-26, Acts 2:1-4, Acts 10:44-48",
            "devo_title": "Spirit",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nSpirit\nRuach (Hebrew), Pneuma (Greek)\nScripture Reading: Numbers 11:24-30, Psalm 51:10-13, John 4:19-24, John 14:15-26, Acts 2:1-4, Acts 10:44-48\nDescription\nThe Old Testament contains many references to ruach, the Spirit of the Lord, which was the manifestation of God’s presence on earth. The New Testament uses pneuma for the Holy Spirit, the third person of the Trinity.\nIn John 4, Jesus tells the woman at the well that God is spirit. He was referring to the time, which has now come, when the Spirit of the Lord would no longer reside in temples built by human hands. Instead, the Holy Spirit dwells inside those who believe in Jesus.\nEmphasis\nThe non-incarnate, or non-physical, presence of God on earth\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram9.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Genesis 14:17-20, 2 Kings 19:14-18, Psalm 91:1-16, Jeremiah 10:10-11, Hosea 1:10, 1 Timothy 4:10",
            "devo_title": "Living God & God Most High",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nLiving God & God Most High\nElohim Chay, El Elyon (Hebrew)\nScripture Reading: Genesis 14:17-20, 2 Kings 19:14-18, Psalm 91:1-16, Jeremiah 10:10-11, Hosea 1:10, 1 Timothy 4:10\nDescription\nElohim Chay, “Living God,” and El Elyon, “God Most High,” are two of the most frequently used names for God in the Old Testament. The name Elohim was paired with adjectives that describe the God of Israel. These two names, though different, are related. They are used to emphasize the unique nature of God: He is alive and greater than all others.\nThe very notion of a living God distinguished Elohim from idols constructed of wood or iron. The Israelite God was—and is—living and active in and among His people. Similarly, the name “God Most High” elevates the God of Israel over all other gods. These names are reminders that God is active and superior to all other objects of worship. \nEmphasis\nGod’s superiority over all other gods and idols\nReflection\nWhat do these names teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram10.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Genesis 17:1-8, Exodus 6:2-5, 2 Corinthians 6:14-18, Revelation 11:16-19",
            "devo_title": "God Almighty",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nGod Almighty\nEl Shadday (Hebrew)\nScripture Reading: Genesis 17:1-8, Exodus 6:2-5, 2 Corinthians 6:14-18, Revelation 11:16-19\nDescription\nEl Shadday, or “God Almighty,” is a name God uses to describe Himself throughout the Old Testament. He appears to Abraham in Genesis 17 with the greeting, “I am God Almighty.” Then God makes a covenant with Abraham, promising to make him the father of a great nation, even though Abraham was old and his wife was barren. God offered His name, God Almighty, as the guarantee of this improbable promise. Bound up in God’s covenant promise to Abraham is the Lord’s proclamation of His power. \nThe name God Almighty also appears frequently in the book of Job to emphasize God’s power over all things. El Shadday is a powerful, impressive name for our God.  \nEmphasis\nGod’s power over all things\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram11.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Deuteronomy 33:26-29, 2 Samuel 22:1-3, Psalm 18:1-3, Psalm 71:1-8, Isaiah 25:1-5",
            "devo_title": "Refuge & Fortress",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nRefuge & Fortress\nMachseh, Metsudah (Hebrew)\nScripture Reading: Deuteronomy 33:26-29, 2 Samuel 22:1-3, Psalm 18:1-3, Psalm 71:1-8, Isaiah 25:1-5\nDescription\nWhen God’s people claim He is their refuge or fortress, they are saying He is a safe place in times of trouble. He will take care of them and protect them. King David uses “refuge” frequently to refer to God—a telling admission from the powerful, mighty king of all Israel who led victorious armies into battle. This name of God uses the image of finding safety and rest in a city or fortress to communicate the security God’s people have in Him. \nEmphasis\nGod’s protection from external threats\nReflection\nWhat do these names teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram12.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Hosea 1:10",
            "devo_title": "Grace Day",
            "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nYet the number of the Israelites\nwill be like the sand of the sea,\nwhich cannot be measured or counted.\nAnd in the place where they were told:\nYou are not my people,\nthey will be called: Sons of the living God.\n-Hosea 1:10\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram13.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Isaiah 25:1",
            "devo_title": "Weekly Truth",
            "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse illustrates that God’s revelation of Himself leads us to worship Him.  \nLORD, you are my God;\nI will exalt you. I will praise your name,\nfor you have accomplished wonders,\nplans formed long ago, with perfect faithfulness.\n-Isaiah 25:1\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/4-NamesOfGod-2.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Exodus 20:4-6, Exodus 34:10-16, Deuteronomy 4:23-24, Joshua 24:14-20, Nahum 1:1-6, 1 Corinthians 10:14-22",
            "devo_title": "Jealous God",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nJealous God\nEl Qanna (Hebrew)\nScripture Reading: Exodus 20:4-6, Exodus 34:10-16, Deuteronomy 4:23-24, Joshua 24:14-20, Nahum 1:1-6, 1 Corinthians 10:14-22\nDescription\nGod called Himself a “jealous God” in Exodus 20 when He spoke to Moses at Mount Sinai. This name reminds us that God does not take lightly nor tolerate our wandering hearts. He alone is worthy of our worship and praise, and He will not share it with another.\nScripture presents God as jealous for His deity, His sovereignty, and His glory. Throughout the Old Testament, God uses this name to emphasize that He alone is God, and He alone is holy and worthy of our worship. \nEmphasis\nGod’s right to be the only object of worship\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram15.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Psalm 23:1-6, Ezekiel 34:11-16, John 10:11-18, Hebrews 13:20-21, 1 Peter 2:22-25",
            "devo_title": "Shepherd",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nShepherd\nRo’i (Hebrew), Ro’eh (Hebrew), Poimen (Greek)\nScripture Reading: Psalm 23:1-6, Ezekiel 34:11-16, John 10:11-18, Hebrews 13:20-21, 1 Peter 2:22-25\nDescription\nIn Psalm 23, David writes of the Lord as a shepherd: He leads His sheep to calm pasture to eat, He leads them to water to drink, He keeps them on the right path, and He uses His rod to and staff to protect them. In John 10, Jesus calls Himself “the Good Shepherd.” He outlines His similar responsibilities: He lays down His life to protect His sheep, He gathers His sheep, and He speaks over His sheep. When He takes the name “Shepherd,” it doesn’t just reveal His role as our protective, sacrificial caretaker, it also reveals our role to remain loyal and dependent upon Him.\nEmphasis\nGod as our provider and caretaker\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram16.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Deuteronomy 32:1-6, Psalm 68:4-6, Jeremiah 3:19–22, Mark 14:35-36, Romans 8:14-17, Galatians 4:1-7",
            "devo_title": "Father",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nFather\nAb (Hebrew), Pater (Greek) \nScripture Reading: Deuteronomy 32:1-6, Psalm 68:4-6, Jeremiah 3:19–22, Mark 14:35-36, Romans 8:14-17, Galatians 4:1-7\nDescription\nWhen Jesus taught His disciples to pray, He told them to address God as “our Father” (Mt 6:9). When He prayed in the Garden of Gethsemane before His arrest, trial, and crucifixion, Jesus cried out, “Abba, Father,” using personal and relational names for God (Mk 14:36). Abba is an Aramaic word, from the Hebrew Ab, for “father.” Pater is the Greek word used for “father.” \nThese are deeply familial names when used to address God. Belief brings us into a close yet respectful relationship with God, the holy Creator of all things. Father is a reverential yet personal name for God. \nEmphasis\nThe personal, familial, and intimate name for God\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram17.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Psalm 2:1-3, Isaiah 61:1-11, Matthew 16:13-20, Luke 24:18-27, John 10:24-25, John 11:25-27",
            "devo_title": "Messiah",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nMessiah\nMashiach (Hebrew), Christos (Greek)\nScripture Reading: Psalm 2:1-3, Isaiah 61:1-11, Matthew 16:13-20, Luke 24:18-27, John 10:24-25, John 11:25-27\nDescription\nThe Hebrew word mashiach, or “messiah,” was used to refer to the promised savior of God’s people. The word mashiach was translated into the Greek as christos, which is translated into English as “Christ.” “Messiah” and “Christ” are two titles that describe Jesus as the anointed, or chosen, one of Israel. \nThe word mashiach was used to describe someone who was anointed for a particular calling. In Scripture, people called to serve as prophets, priests, and kings were anointed with oil to ceremonially set them apart for their particular work. Jesus perfectly fulfilled all three of these roles for His people through His life, death, and resurrection. He is the chosen and anointed one who perfectly fulfilled His calling as the savior of God’s people.\nEmphasis\nGod’s chosen and anointed one\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram18.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "John 14:12-14, Acts 4:5-12, Romans 10:8-13, Philippians 2:5-11, Revelation 1:4-8",
            "devo_title": "Jesus",
            "devo_summary": "\nBY She Reads Truth\n\nIn this Names of God reading plan, we are learning more about God by studying the names given to Him in Scripture. Rather than having our writers share their own reflections on these passages, we’ve instead provided research-rich content to aid in your study of each day’s featured name of God, including the background of the name(s), a brief explanation of the character of God emphasized by the name(s), and a reflection question to help you dig deeper into the text. \n//\nJesus\nYeshua (Hebrew), Iesous (Greek)\nScripture Reading: John 14:12-14, Acts 4:5-12, Romans 10:8-13, Philippians 2:5-11, Revelation 1:4-8\nDescription\nThe Hebrew name Yeshua, or “Jesus,” means “Yahweh saves.” It is a shortened version of the Hebrew name Yehoshu’a, or “Joshua.” Jesus, a common name in the first century AD, was the human name the Lord was given on earth. Mary and Joseph obediently gave the child this name because an angel of the Lord visited Joseph in a dream and told him, “you are to name him Jesus, because he will save his people from their sins” (Mt 1:21). \nScripture often combines the name Jesus with the Greek word for messiah, Christos, or “Christ.” The name “Jesus Christ” joins the two names in order to recognize Jesus as the anointed Savior. The New Testament keeps Jesus’s human name and His designation as the Christ linked after the resurrection, emphasizing that He remains fully man and fully God with all authority in heaven and on earth. \nEmphasis\nThe name of the incarnate Son of God\nReflection\nWhat does this name teach me about God?\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram19.jpg"
        },
        {
            "book_title": "Names of God",
            "devo_passages": "Deuteronomy 32:3–4",
            "devo_title": "Grace Day",
            "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor I will proclaim the LORD’s name.\nDeclare the greatness of our God!\nThe Rock—his work is perfect;\nall his ways are just.\nA faithful God, without bias,\nhe is righteous and true.\n-Deuteronomy 32:3–4\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-NamesOfGod-instagram20.jpg"
        }
    ]