[
    {
    "book_title": "Psalms of Rest",
    "devo_passages": "Psalm 23:1-6",
    "devo_title": "The Lord Is My Shepherd",
    "devo_summary": "\nBY She Reads Truth\n\nPsalm 23 speaks to my heart—green pastures, quiet waters, right paths. I am an outdoorsy person by nature. I’d much rather get lost in the woods, alone with my thoughts, the trees, and the breeze, than be in any city. So, as I read these familiar verses, I want to go outside, to be witness to the goodness and beauty of the natural world. It also occurs to me that I have something in common with sheep—we can both get lost without hardly trying.\nSome years ago, I read about a Merino sheep in New Zealand named Shrek. He had wandered away from his flock and his shepherd and gotten lost. For six years, he lived in nearby caves, eating what he could find and avoiding the shearer’s blade. When Shrek was finally found, his wool weighed sixty pounds, and the raw weight of twenty men’s suits on his back was threatening his life. He had trouble walking, and his breathing was labored. He needed his shepherd. So do we. \nShepherds take care of sheep—plural—but in this psalm, the relationship is between one sheep and his Shepherd. It’s personal, much more intimate. “The LORD is my shepherd” (v.1, emphasis mine). These words are from David, but I can’t help but read them as my own. I think we were meant to, each one of us. The Lord is my Shepherd. He guides me, provides for me, protects me from my enemies. \nI don’t need to worry. “I have what I need” (v.1). I don’t need to struggle or strive. “He lets me lie down in green pastures” (v.2). Weariness does not have the final say. “He renews my life.” And I won’t ever get lost. (Not really, anyway.) “He leads me along the right paths for his name’s sake” (v.3). It is only because the Shepherd is so good that I can be still and rest, that I can have true peace. \nI could be happy for eternity being a beloved lamb of the Good Shepherd, but Psalm 23 doesn’t leave us as sheep. A shift occurs in verse 5. David begins to address God directly—the song becomes a prayer of thanksgiving. Not only that, but the pastoral imagery is replaced by a banquet scene. You and I have become honored guests of the King. \nThe table is set, and though my enemies might rage just outside, none of that matters (v.5). I am in the house of my Maker, the One who knows me and loves me better than anyone else. But the best part? I’m not just a guest. I get to stay in His presence forever—”as long as I live” (v.6), though the Hebrew phrase that’s been translated doesn’t limit this time to my natural lifespan. It has all come full circle—”I have what I need,” because I have the One I was created to know and love. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-PsalmsOfRest-Instagram-1-1024x1024.jpg"
},
{
    "book_title": "Psalms of Rest",
    "devo_passages": "Psalm 46:1-11",
    "devo_title": "The LORD of Armies Is With Us",
    "devo_summary": "\nBY She Reads Truth\n\nWhen I was a kid, I used to be terrified that our house was going to burn down. I would lie awake in my bed, certain that at any moment I would see smoke coming from under my door, a raging fire just down the hallway ready to engulf my entire family, destroying everything in its wake. Before bed, I would ask my parents to close all the doors (to keep the fire from getting into our rooms) and make sure the oven was off, and every so often, I’d ask them to check our smoke detectors—just in case one was malfunctioning. My parents would do all of these things, lovingly reminding me that I was safe, that nothing was going to happen to me. And they would pray with me, inviting me to bring my fears and uncertainties to God, the One who protects me and strengthens me. \nThis psalm refers to God as the “LORD of Armies.” This name for God appears most often in the Minor Prophets, both before and after Judah’s exile into Babylon. The lives of God’s people were full of fear and uncertainty, and they were constantly reminded of the power their enemies held over them. Referring to God as the LORD of Armies reminded them of His ability to keep them from harm. \nThis whole psalm is a reminder of God’s unmatched power. The psalmist writes of God’s ability to provide calm and order in the midst of total chaos. The first stanza speaks of God’s protection from the natural elements, the second of God’s protection from other nations, and the third of God’s protection from fighting and wars. In every stanza, the psalmist reminds us that God is with us—that He is our refuge, that the LORD of Armies is our stronghold. How can we not bow down in praise of such a powerful God? With a God like this on our side, fighting for us, watching over us, our fears don’t stand a chance. \nThese days, I’m not as scared of my house burning down as I used to be. My fears are more concerned with uncertainty about the future and my need to control things. So although I am not a nation at war, I can still find rest in the fact that the LORD of Armies is with me. He is a refuge for my weary soul, a place of comfort in the midst of chaos. His power is stronger than even the most terrifying of armies, His love deeper than any raging sea. He is strong, He is good, and He will not let me go, even in the fiercest battle.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-PsalmsOfRest-Instagram-2-1024x1024.jpg"
},
{
    "book_title": "Psalms of Rest",
    "devo_passages": "Psalm 91:1-16",
    "devo_title": "The Lord Is My Refuge",
    "devo_summary": "\nBY She Reads Truth\n\nI grew up afraid. \nThunder, lightning, roller coasters, car crashes, plane crashes, tornadoes—loud, violent, terrifying scenarios that kept me up at night, or in the guidance counselor’s office at school any time it stormed. I was afraid of loud things, things that threatened to crash into my life and take away someone or something I loved. I would read Bible verses that promised me safety, plucked out of the psalms and taped on my bathroom mirror in college—-verses like these from Psalm 91: “Because you have made the LORD—my refuge, the Most High—your dwelling place, no harm will come to you” (vv.9–10).\nThat’s a formula I tend to like, because it gives me the perception of control; I make the Lord my “refuge,” and no harm will come to me. But many years of walking quietly in sadness with people I love have taught me there is no equation to prevent suffering. Sometimes storms enter our lives quickly like thunderclouds from the west. Sometimes they sneak in, just as the sun rises quietly in the east. But always, they come, just as they came for our Savior, Jesus Christ. When the devil tempts Jesus in the wilderness, the enemy quotes Psalm 91: “He will give his angels orders concerning you, to protect you, and they will support you with their hands, so that you will not strike your foot against a stone” (Luke 4:10–11).\nIn their book, The Songs of Jesus, Tim and Kathy Keller wrote: “The devil wants us to think that God’s promises have failed if he lets us suffer. But the psalm later clarifies that God will save us ‘in trouble’ and not from it.” In other words, we do not need a refuge from the quiet, the sadness, brokenness, and pain; we need a refuge from the storm that is inevitably coming (John 16:33). Suffering was sewn into our existence at the fall, but Psalm 91 shouts into the rushing wind: \n“The one who lives under the protection of the Most High dwells in the shadow of the Almighty.  I will say concerning the LORD, who is my refuge and my fortress …  His faithfulness will be a protective shield” (vv.1–2,4).\nI am thankful for the whole of Scripture, and for the ways it quiets my soul on the hardest of days. The riches of Psalm 91 are vast, with so many metaphors and names for God, calling us backward and forward through the Old and New Testaments. It does so beautifully what the whole of Scripture does: it paints a picture of our hopeless existence apart from God, and it beckons us into the fullness of life in relationship with Him. A life that, though marked with suffering, is ultimately guaranteed and secured by the personhood and work of Jesus Christ. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-PsalmsOfRest-Instagram-3-1024x1024.jpg"
},
{
    "book_title": "Psalms of Rest",
    "devo_passages": "Psalm 92:1-15",
    "devo_title": "The Lord Is Just",
    "devo_summary": "\nBY She Reads Truth\n\nOn Saturday afternoons in autumn, one of my favorite things to do is find a hearty stew recipe, throw open the windows, and stream a great playlist of folk music. I once heard someone say that beauty will save the world. I don’t know if this is true, but I fully believe that savoring the beauty in life attunes our attention to God’s goodness. It can help alleviate the darkness pressing in around us by offering a parting of the clouds—a heightened glimpse of light and hope. I can’t speak for anyone else, but I know my life can always use an extra reminder that God is working behind the scenes.\nPsalm 92 is said to be a song for the Sabbath. It’s a declaration of God’s justice (v.15) and His faithful love both in the morning and at night (v.2). We need songs like this, songs of Scripture, to bury inside us and remind us what’s true. This way, on an afternoon that doesn’t feel very beautiful, we can sing the song that declares God is just and advocating on our behalf for the rightness of all things. When we meditate on these songs, our hope is restored. And we can find rest again.\nIn this psalm, we see a lot of interesting metaphors drawn from the natural world to describe the characteristics of the righteous person. Though the wicked “sprout like grass” (v.7), the righteous will thrive like “a palm tree” or a “cedar tree in Lebanon” (v.12). The righteous are planted in the Lord like roots of a tree and will live a fruitful life, becoming “healthy and green” (vv.13–14). These arborous metaphors symbolize—and prophesy about—the vibrancy of life hidden in Christ and the nourishment He gives us, just like water and sunshine to a plant. As we pursue a life of righteousness, our legacy becomes this anthem of God’s faithfulness, declaring “the LORD is just; he is my rock” (v.15). \nI love how many layers are woven into this psalm. At first glance, we’re told it’s a song to accompany our Sabbath rest. But in reading the lines of verse, we detect the heartbeat behind it: a desire for all things to be made right. The only reason to declare God as “just” is if you’ve been touched by injustice and, by doing so, participate in an act of rebellion against it.\nYou’ve probably heard the truism: “All shall be well, and all manner of things shall be well.” It was Julian of Norwich who first said it. She was an English woman who lived a solitary life devoted to God during the Middle Ages. Psalm 92 is the undercurrent to her words. They look ahead to a time when the fullness of God’s justice will have its reign on earth, even as we usher in kingdom wholeness today. \nWe can find true rest in the knowledge that God is just; there is “no unrighteousness in Him” (v.15). But He also chooses to partner with us in confronting the injustices of the world. Oh Lord, Your kingdom come, Your will be done, on earth as it is in heaven. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-PsalmsOfRest-Instagram-4-1024x1024.jpg"
},
{
    "book_title": "Psalms of Rest",
    "devo_passages": "Psalm 145:1-21",
    "devo_title": "The Lord Is Near All Who Call Out to Him",
    "devo_summary": "\nBY She Reads Truth\n\nRemember and proclaim. \nThroughout Scripture, we are instructed to recall the ways God has acted on our behalf, and to share those stories of triumph and truth with others, with the next generation of believers (Psalm 145:4). The Israelites’ exodus out of slavery from Egypt? Remember and proclaim (Psalm 105:1–5). The taking of the eucharist? An act of remembering Christ’s life, death, and resurrection—all on our behalf—and proclaiming the infinite gift and power in them for those who believe in the risen Jesus (1 Corinthians 11:23–26). \nSo it is in today’s reading of Psalm 145, “a hymn of praise,” attributed to King David, who determines to “exalt, “bless,” and “praise [God’s] name forever and ever” (vv.1–2). Not only will he declare God’s praises, but from one generation to the next, God’s works and acts, His character, power, and righteousness, will be declared (vv.3–5). But in order for that to happen, God’s “awe-inspiring acts” and faithful love must first be remembered. \nThere is power in saying something out loud, in speaking truth to ourselves and to one another. Researchers in the worlds of education and psychology call this “the production effect.” Studies have shown that memory is improved by literally speaking aloud what we’re reading, thinking, and studying. The actual retrieval and recall of both past and new experiences, and the relaying of them to someone else further works to etch our experiences and knowledge into our minds. In short, if you really want to remember something, tell someone else about it. It’s incredible to think that God would design us this way, to further draw us into community to speak truth to one another (Ephesians 5:19–20).\nThe Hebrew word for “remember” is zakar, and it encompasses more than simply “thinking” or knowledge—it implies action. And in Hebrew tradition, practicing faith in present circumstances and exhibiting hope for the future requires that you remember God’s faithfulness in the past. What better way to remind ourselves of God’s power and steadfast love than to share our experiences with God with someone else? In looking back at God’s “great goodness and righteousness” in our own lives and in the lives of those we read about in Scripture, we are reminded that He provides what we need “at the proper time” and “[satisfies] the desire of every living thing” (vv.15–16).\nVerse 20 tells us when we call out to God, He is near. However, His nearness is in no way dependent upon our crying out to Him. No, He is always near, always present. When we draw near to Him, He draws near to us (James 4:8). He does not need an invitation to come to us, but in our calling out to Him, we remember that He is, in fact, a very real and present help (Psalm 46:1). Our mighty, compassionate God is delighted to be in our midst now and always (Zephaniah 3:17; Matthew 28:20). Sometimes we forget this truth, and sometimes we struggle to believe it’s true. Either way, God does not change.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-PsalmsOfRest-Instagram-5-1024x1024.jpg"
},
{
    "book_title": "Psalms of Rest",
    "devo_passages": "Matthew 11:28",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“Come to me, all of you who are weary and burdened, and I will give you rest.”  —Matthew 11:28\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-PsalmsOfRest-Instagram-6-1024x1024.jpg"
},
{
    "book_title": "Psalms of Rest",
    "devo_passages": "Psalm 46:10",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse that expresses God’s heart for his people to rest in His sovereignty. \n“Be still, and know that I am God.”  —Psalm 46:10 ESV\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/11/SRT-PsalmsOfRest-Lockscreen-7-576x1024.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 145:1-21",
    "devo_title": "A Prayer Praising God’s Greatness",
    "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Psalm 145:1-21\nPrayer is a startling invitation—one that, after 30 years of following Jesus, I still struggle to accept. \n“Call to me and I will answer you and tell you great and incomprehensible things you do not know,” the Lord says to His people in Jeremiah 33:3. The book of Hebrews urges the Christ follower to “approach the throne of grace with boldness” (4:16), and Paul tells the Philippians not to worry about anything, but instead to petition God in prayer (4:6). Perhaps most astonishing of all, Jesus Himself instructs His disciples, “Whenever you pray, say, Father…” (Luke 11:2). \nCall out to God. Go boldly to the throne. Ask instead of worry. Talk to God as your Father. \nThis is the invitation. But what do we say? How do we find the words to pray? \nPrayer, like everything else in the Christian life, is a practice learned over time. When it comes to learning the language of prayer, there is no better classroom than the Psalms. The book of Psalms was the hymn and prayer book for the people of God before the days of Jesus. God’s people have been praying these writings, and using them to shape their own prayers, ever since. \nTake Psalm 145, for example. This hymn written thousands of years ago by the shepherd-king David teaches me how to express praise to a God who is magnificent beyond words. I often fumble at the beginning of my prayers, unsure how to address this Being who is so holy and so wholly other. But this psalm puts words to God’s greatness, giving me vocabulary to praise the Lord’s “splendor and glorious majesty” and declare His “awe-inspiring acts” (vv.5–6). It reminds me of the power of speaking back to God the immutable aspects of His character: He is “gracious and compassionate, slow to anger and great in faithful love” (v.8); He is “good to everyone” and “gracious in all His actions” (vv. 9,13). It gives me the scaffolding on which to build my own song of prayer to the Lord who is “near to all who call out to him, all who call out to him with integrity” (v.18).\nIn this three-week Psalms for Prayer reading plan, we’ll read fifteen psalms that cover a range of topics, from glorifying God, to praying for our personal concerns, to lifting up the needs of this world. Some of these psalms are worded as prayers offered directly to God; others act as prompts to inspire prayer. All are given to us in God’s complete, inerrant Word. The God to whom David wrote this ancient psalm is the same God you and I pray to today. His Word not only teaches us who He is; it teaches us how to commune with Him in prayer.\nMay God use our time in these psalms to reveal to us more of His character. May He draw us into a daily and ongoing conversation with Him, and may His Word teach us to express our hearts to Him in prayer.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day1-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 104:1-35",
    "devo_title": "A Prayer Celebrating God’s Creation",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 104:1-35\nI think children often imagine themselves as the center of all things, even the weather. And I think there’s something commendable about their curiosity, how they can attune their hearts and minds to what surrounds them. Psalm 104 gives me the impression that this is a God-inspired curiosity. Here, the psalmist wills his own soul to consider the beauty and majesty of God, and in doing so, his soul is moved to worship our Creator and admire His creation. \nHow countless are your works, Lord!\nIn wisdom you have made them all;\nthe earth is full of your creatures (v.24).\nIn truth, it is the Creator who is at the center of creation. God’s glory is revealed in what He has made: in the intricate and majestic beauty of His creation surrounding us. His artistic display is also wrapped up in His very essence, His radiant splendor, and His steadfast character. He wears His creation like a garment and commands it masterfully, setting up the edges between water and land, day and night. His boundaries are loving and lavish. Every green leaf and delicate creek seems full to the brim, right up to the edge of wherever He has ordered it to stop.  \nGod Himself takes pleasure in His own creation because it is an expression of His glory, and as His image-bearers, we too, ought to delight in what He has created (vv.31,33). And just as He is everlasting, His works will never cease to praise Him. “He established the earth on its foundations; it will never be shaken” (Isaiah 40:28; Psalm 104:5).\nHe wraps Himself in the beauty of creation because He is the holy, nourishing, life-giving presence inside the beautiful cup of creation. His Son Jesus was poured out for us that we may be filled with the finest provision of all—our salvation (Isaiah 53; 1 Corinthians 11). When we take communion, we remember with all our senses that He is our nourishment, that He alone gives abundant life. He alone sustains us, forgives us, and makes us new.\n In this mystery, we are planted on this earth, given an address, and we also find ourselves wrapped in the beauty of His creation—from the moment we walk out our front door in the morning to feel the fresh air on our faces and hear the birds singing their morning song. Even this is His provision for us, just as we are nourished daily by His Holy Spirit, feed on His Word, and walk in His presence. \nOur God makes Himself known to us in the song of creation and has demonstrated His splendor in every wild beast, in the sound the thunder, in the messages of the wind, and in the blue sky canopy above us. In all of this and more, from start to finish, my heart sings out in celebration with the psalmist to say, “Bless the Lord, O my soul! Praise the Lord!” (v.35).\n\nSandra McCracken is a singer, songwriter, and producer from Nashville, TN. Over the course of ten critically acclaimed studio albums, Sandra has developed a body of work that encompasses hook-driven melodic pop, No Depression-style Americana, contemporary recastings of classic hymns, and even children’s music as part of the Nashville alt-folk super-group Rain For Roots. Her newest album, Songs from the Valley, was released this spring.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day2-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 77:1-20",
    "devo_title": "A Prayer for When God Seems Silent",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 77:1-20\nI got the call on a Tuesday. The son we were going to graft into our family through adoption was now staying with his biological family, to be raised by his grandmother. I had already packed a bag for the hospital. We were less than a week away from his due date, and now, there was no due date in sight.\nIt’s hard to describe the pain of that moment. Four years of infertility. Months of adoption preparation. All the finances invested in growing our family disappeared in an instant, but that paled in comparison to watching our future go up in smoke. The little boy I’d pictured standing between my husband and me, with this dark skin and curled hair, was gone. The thoughts kept pounding at the place between my eyes: I’ll never know what he looks like. I’ll never even know his name.\nI’ll be honest: in the moments after that call, I didn’t open up the psalms. Instead, I walked upstairs to the little nursery we’d yet to complete and grabbed the handmade quilt my mother’s best friend had made for the boy. It was meant to warm him as he slept, but now I buried my face in it and wept. I screamed. No one was home but me, and so I let myself go—until my throat quivered and the cries sounded eerily like that of a child wailing for its mother. \nThe Message translation of Psalm 77 says, “I yell out to my God, I yell with all my might, I yell at the top of my lungs… my life was an open wound that wouldn’t heal” (vv. 1-2). I know what that feels like. I’d guess many of us do. But how often do we give ourselves permission to yell and cry out like this? How often do we express our sorrow and the fullness of our pain? Not often. \nIn an effort to bypass our grief—in fear that God’s silence will be too much to bear—I believe many of us never ask the questions the psalmist so brutally lays down: Where are you, God? Have you forgotten me completely? I thought you were supposed to be compassionate. But this doesn’t feel like compassion.\nInstead, we try to end the pain as quickly as possible, either through secular comfort (read: retail therapy) or spiritual practices (read: small groups, counseling, meditation, and yes, sometimes even Bible reading). But Psalm 77 shows us that we can bring our raw emotion to God. We can ask our honest questions without fear. We can scream at the top of our lungs, and God will still listen.\nBut the psalmist does not stop with his questions. He asks them, and then he gets up off the floor. It is essential that we bring our honest selves to God, in all our brokenness. But it is just as essential that we are honest about who God is to us. In a place of pain, truth is a hard pill to swallow. But it is the medicine we need most. We need to remember that all His ways are good, even in the midst of our sorrow and pain. The Message translation of the psalm goes on to say:\nOnce again I’ll go over what God has done, lay out on the table the ancient wonders;\nI’ll ponder all the things you’ve accomplished, and give a long, loving look at your acts (vv. 11-12).\nI have a history full of examples to pick from to remember God’s character. After all, the psalmist didn’t know Moses and Aaron—he wasn’t present when God parted the Red Sea—but he praised God for it anyway. Jesus hasn’t ended my sickness, but the stories of when He walked on earth prove that He is our Healer. The ancient wonders remind me of the truth: my current circumstances do not outweigh God’s eternal promises.\nThis is the rhythm of faith. Yell out, and then remember.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day3-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 119:1-32",
    "devo_title": "A Prayer Celebrating God’s Word",
    "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Psalm 119:1-32\nWhen we lived in town, I would occasionally notice an uncanny quiet in the house, and then realize that one of my little boys had escaped. Every Thursday was trash pick up, and the siren song of the garbage truck often proves too strong for the will of toddler boys. Racing after a child who is wandering down the street—myself dressed only in my best approximation of “this will do”—is a harrowing experience. Since we’ve moved out to the country, my fellas are still entranced by all classes of trucks, but now they line up at the fence and shout their admiration from a safe distance.\nYou read what makes all the difference, though, right? It’s the fence. In town, all of Franklin, Tennessee, was open to us; it was just a matter of how far we wanted to walk. There was nothing to stop us. But the kids had to stay close to the house. Out in the country, while we only have two acres (my dream come true), they are allowed to enjoy every inch of those acres. The boundary of the fence gives them huge freedom. As long as they stay inside the fence, they are safe.\nThere is such a joyful freedom in boundaries. Psalm 119 celebrates the gift of God’s law by extolling the beauty and truth of God’s Word. In fact, that’s the primary focus of this psalm—celebrating God’s law and the boundaries it gives. And it’s given as prayer, which means this psalm is a treasure for teaching us how to pray prayers which delight in surrendering to God’s Word and will. God’s law hems in our lives so that when we are lured by garbage trucks, or whatever delights the world has to offer, we can see exactly how we are to respond. There is such safety in knowing where the lines are, instead of huddling close to the house, unsure of how far we can go. \nThroughout this psalm, we encounter a series of refrains—“teach me your decrees,” “I love your law,” “I will not forget your law”—which spill out like shouts of joy. The psalmist is so captivated by the goodness of God’s law, that he cannot help but declare it. He sings of God’s law as if were the very air he breathed. God’s law is the law of love, the law of liberty, the law of life. May we find our delight in his degrees! May it frame our every thought, our every breath. \nR.C. Sproul calls the law the “school of righteousness.” Within this school, we learn what pleases God and what offends Him. What a severe joy and a mercy it is to have God’s law, to know where to set our sights, where our boundaries lie, and enjoy the wide freedom within His gates.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day4-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 27:1-14",
    "devo_title": "A Prayer When Battling Anxiety",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 27:1-14\nPerhaps you’ve heard it said that in a storm, any harbor will do. When the tidal waves of life threaten to capsize our little ships, we will look anywhere for respite, often seeking shelter in places that cannot ultimately protect us. Age has alerted me to an alarming truth: the waters of life are almost always choppy. Smooth-sailing days are rare in a world as broken as ours.\nHere in Psalm 27, we see David sending out the distress signal. He is looking for a lighthouse to point him toward shore. He starts with a pep talk, saying, “The LORD is my light and my salvation; whom shall I fear?” (v. 1). But the answer to his question must have made his knees wobble. I can imagine him now, penning words of praise with one hand, while anxiously chewing his fingernails on the other.\nThrough the storm of his own anxiety, he saw an army positioned to take him out. In David’s case, this army may have been literal, but we all know how it feels to be surrounded, hard pressed on every side (2 Corinthians 4:8). We see serious threats against our hearts and homes every day. But we can’t fight our fears by convincing ourselves there’s nothing to be afraid of. There is! The list of rational fears is so significant, there’s not a bucket of sand big enough for us to bury our heads and fully hide from the threat.\nRecently, in my own life, physical, relational, and emotional forces collided to create the perfect storm. Many of my worst fears were realized, and my anxiety that there was more to come left me frantically searching for safe harbor. As all other life rafts sunk around me, I finally clung to God’s Word. As His truth anchored me, I found myself locking eyes with the disciples when they faced the storm.\n“And they woke him and said to him, ‘Teacher, do you not care that we are perishing?’ And he awoke and rebuked the wind and said to the sea, ‘Peace! Be still!’ And the wind ceased, and there was a great calm. He said to them, ‘Why are you so afraid? Have you still no faith?’ And they were filled with great fear and said to one another, ‘Who then is this, that even the wind and the sea obey him?’” (Mark 4:38-41 ESV, emphasis mine).\nAny hope that we can calm the storms of life on our own is misplaced. We cannot. But we will find ourselves buoyed when we look for the One no storm can stand against. Ultimately, the disciples clung to the same truths that David did—the same truths that you and I can cling to:\nGod is faithful.\nHis care is relentless.\nHis promises are true.\nHis presence is the only place where our fears truly subside.\nOur hope is not that the day of trouble will not come, because it will. But our God will see us through. No calamity can untether us from God and His Word. Never. When anxiety twists our stomach in knots, when we look around and see an army of threats, not just any harbor will do. But this one will:\nThe Lord is good, a stronghold in the day of trouble; he knows those who take refuge in him (Nahum 1:7).\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day5-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Luke 11:2-4",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe said to them, “Whenever you pray, say,\n\nFather,\nyour name be honored as holy.\nYour kingdom come.\nGive us each day our daily bread.\nAnd forgive us our sins,\nfor we ourselves also forgive everyone\nin debt to us.\nAnd do not bring us into temptation.”\n—Luke 11:2-4\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day6-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 27:7-8",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verses for this reading plan. \nLORD, hear my voice when I call;\nbe gracious to me and answer me.\nMy heart says this about you:\n“Seek his face.”\nLORD, I will seek your face.\n—Psalm 27:7-8\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/4-PsalmsForPrayer-1-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 86:1-17",
    "devo_title": "A Prayer in Times of Sorrow",
    "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Psalm 86:1-17\nThere was a season of my life when it seemed like weeping willows were suddenly sprouting on every corner. At the time, I had just taken up a new habit of running and can remember having to duck my head and step carefully on the trails so as to not tangle my feet on their branches. An artist like DaVinci or Monet probably would have been inspired by their presence. Unfortunately, I’m not the kind of girl who thinks poetically about things like pollen. I’m more prone to believe the trees are just standing in my way.\nThat’s exactly how I feel about sorrow—it had better stay in its own lane. I wish my experience with sorrow was only as extensive as a good cry at the end of a sad movie. But the truth is my shoulders have been crushed by the weight of grief, leaving me to feel like a weeping willow: arms fallen, exasperated, feeble. I’ve tried not to give myself over to the weight of my sadness for fear I won’t be able to stand back up again.\nIt’s easy to see why we call them “weeping” willow trees. They were first given their name because of the way rain falls from their branches resembling tear drops. However, they grow best near water, able to absorb large quantities of water during floods. In fact, when strategically planted beside ponds, they can even help to prevent ground erosion. And in a way, our sorrow is like that too. Avoiding it may appear to be the best survival tactic, but taking it in and then bringing it honestly before God is one way He strengthens and grows us.\nProtect my life, for I am faithful (Psalm 86:2).\nI used to think weeping willows looked like crippling sorrow, the kind you never fully recover from. They seemed to be consistently sad, their branches swaying on the ground in the wind. Yet, now I wonder if the posture of a weeping willow tree isn’t so much a picture of what sorrow does to us, as it is an image of what we’re to do with our sorrow. Heads bowed in submission to the Lord, we can expose the depth of our sadness to Him without hesitation.\nAll the nations you have made will come and bow down before you, Lord, and will honor your name (v. 9).\nDespite their appearance, weeping willows are one of the fastest growing trees around, gaining 8 to 10 feet per year. This rapid growth may be one of the reasons they have a relatively short life span. But to me, somehow this signifies the promised end of our sorrow. While the layers of sadness that fill us here on earth are many, joy is our eternal posture.\nLord, give strength to your servant (v. 16).\nSorrow stretches us in ways we probably wouldn’t ever choose for ourselves, but it strengthens us all the same. Deep sorrow makes way for great joy. By His grace, may we embrace the sorrow that seems to stand in our way, allowing it to remind us of God’s kindness, of how He strengthens, comforts, protects, and renews us. In this way, our hope and joy are not far off and distant, but present with us each and every day, just as He is. Amen.\nBring joy to your servant’s life, because I appeal to you, Lord (v. 4).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day8-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 6:1-10",
    "devo_title": "A Prayer for Mercy",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 6:1-10\nWhen I was a high school senior, I audited an upper-level English literature course at a local college. The professor assigned two novels, both of which were written in 18th-century English, and extremely hard for this 18-year-old to decipher. Luckily, the professor explained each reading at length, and though much of that course has disappeared from my memory, I’ll never forget a quote from George Eliot’s Middlemarch. For some reason, it implanted itself in my mind, and I doubt it will ever leave. It reads:\n“If we had a keen vision and feeling of all ordinary human life, it would be like hearing the grass grow and the squirrel’s heart beat, and we should die of that roar which lies on the other side of silence.” \nWhat I take from that quote is this: If we could hear “all ordinary human life” it would be deafening. Can you imagine hearing everything? From the simple growth of the grass all around us, to the cries of children in the night from hunger, to the millions upon millions of groans that go up to the Lord each moment? I cannot fathom the sound.\nThat’s why, when it comes to Psalm 6, I know I’m on holy ground. \nI don’t know for certain what left David so shaken that he wore himself out with groaning—although, there are plenty of scenarios to choose from in 1 and 2 Samuel. His best friend’s father was trying to kill him. He had to hide away in enemy territory for decades. The only men who went with him were desperate, indebted criminals (1 Samuel 22:2). In many ways, he was alone in the world.\nI don’t know exactly why David wrote this psalm, and I don’t know how you’ll relate to it, either. Perhaps the imagery of crying nightly against your pillow is no imagery at all. Perhaps that’s your reality. Marriages falter under the weight of years of sorrow. Children defy our expectations and hopes. Relationships plunder our hearts, leaving us to clean up the wreckage. Even the best, most hopeful times of our lives, leave us wondering what lurks around the next corner. \nIf your eyes are open, if your heart is beating, you know that life is full of perpetual ache. Like George Eliot said, if we could hear it all, “we should die of that roar.” But here is the beautiful thing about our God: He hears every single prayer. He catches our tears in His bottle (Psalm 56:8). And though we are unable to bear the weight of that much sorrow, He can. And He has (Isaiah 53:3-4).\nAfter reading the seven preceding verses about grief, I love the final three in this psalm, how the idea of hope emerges from them. I can imagine David writing them, taking a deep, post-cry breath—you know the kind. Maybe it’s still shaky. But it fills your lungs with oxygen and enables you to sit up straight and wipe the tears from your eyes. David rises to face his fears, not because his circumstances have changed, but because he is confident that the Lord has heard his weeping, and accepts his prayer (Psalm 6:9).\nWhatever tears you are shedding today, rest in confidence that the Lord hears you clearly. He knows you, accepts you in Christ, wants to commune with you, and longs to be gracious to you, even in the darkest hours (Isaiah 30:18).\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day9-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 23:1-6",
    "devo_title": "A Prayer for Comfort",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 23:1-6\nHave you ever had everything you’ve ever wanted, yet still felt unhappy? I have. At the time, I was fully aware that most people would take one look at my life and suggest that I had everything I needed, but somehow it didn’t feel like enough. It wasn’t that I was ungrateful for what I had, I just wanted—longed for—something more, something else. \nI will never forget that morning when I woke up, looked around my bedroom and burst into tears. I was married to a wonderful man. I was the mom of four healthy, happy daughters. I had friends and family that loved me, and although our lifestyle was not lavish with shopping sprees and shiny things, we were able to live on a single income—just one of the many answered prayers that had filled that season of my life. And in that moment, right outside my closed bedroom door, I could hear my husband of six years, giggling and enjoying an easy morning with our girls—more answered prayers.\n\nSo why was I crying? I felt empty and alone, and I felt guilty about both. Although my tears were streaming from a place of discontent, they were also layered with the guilt from the reality of those feelings. I was ashamed to acknowledge that answered prayers had landed me in one of the most uncomfortable seasons of my life. It seemed as if all I had prayed for was still not enough to fill me up and grant me what I thought it might deliver. It was in this very moment that God reminded me of what I was desperately seeking. It was a void His presence alone could fill. \nI wasn’t looking, but He found me. I wasn’t asking, but He gave me more in a moment than I would have ever asked. I was reminded of these words:\nThe Lord is my shepherd, I lack nothing (Psalm 23:1).\nAs simple as they are, these words penetrated my soul and began to take up new real estate in my heart. God had answered many of my prayers, yet I’d failed to realize that His promises do not always arrive on smooth paths. But regardless of circumstances, He does promise to provide His comfort the way a good shepherd does—with a little pulling, prodding, and nudging in the direction He knows is best. The shepherd’s presence is everything to his sheep. \nIn the same way, in God’s presence, we need nothing more, nothing but Him. He provides and protects, and His love fills us up to overflowing. When we look to anyone or anything else but Him, we will always be left unsatisfied and wanting. Our Good Shepherd knows exactly what we need—when to get up and when to lie down and rest. He calls us to turn our focus toward Him, to be reminded that His presence is enough. He alone supplies all the guidance, provision, and comfort we will ever need.\n\nWynter Pitts is the founder of For Girls Like You, a resource ministry for both tween girls and their parents. The mother of four girls herself, Wynter’s mission is to empower and equip women of all ages in becoming who God created them to be, and to support parents in raising strong Christ followers. She is the author of several books, including You’re God’s Girl Devotional and She Is Yours: Trusting God As You Raise the Girl He Gave You.  Wynter, her husband Jonathan, and their daughters (ages 7-13) live in Dallas, Texas. Follow her on Instagram @forgirlslikeyou.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day10-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 51:1-19",
    "devo_title": "A Prayer for Forgiveness",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 51:1-19\nSelf-awareness. It’s a funny thing—you either have it or you don’t. And if you don’t, it usually takes a pretty embarrassing situation to make you aware that you are not self-aware. \nFor instance, have you ever been in a crowded room, talking to a group of friends, telling a fantastic story, having the time of your life, when you realize everyone in the room has quieted down because your enthusiastic voice has filled the entire space, distracting everyone from their own personal conversations and— \nNo? Just me? Cool. \nMy point is this: Self-awareness can be hard to come by. And when it “comes by,” it can be… uncomfortable. \nDavid wrote Psalm 51 after being hurled into self-awareness by the prophet Nathan. David had just slept with Bathsheba, gotten her pregnant, and ultimately, had Bathsheba’s husband killed to cover up what he’d done. And somehow, it wasn’t until Nathan confronted him that David was brought to his knees over his sin. Boom. Crippling self-awareness. This is the context for David writing in verse 3, “For I recognize my rebellion; it haunts me day and night.” \nAwareness of our sin in the presence of a holy God can be an unbearable weight. How could we ever measure up? It’s impossible!\nThat’s why I’m glad David isn’t only writing out of an awareness of himself and his own brokenness. His self-awareness is accompanied by an acute “God-awareness.” He knows the God he’s approaching. He comes before God as a man in the wrong, but with an expectation that this holy God, who eternally exists in unapproachable light and holiness, also removes sin, erases blame, and restores joy to those who love Him. He is a God who unwaveringly desires to have David in good standing with Him.\nI don’t know about you, but being confronted with the awareness of my own sin can be an oppressively cruel experience. Not only am I made aware of how far away I am from the holiness of God (and that distance is light years!), I often compound that feeling by hurling insults at myself, heaping on guilt and shame. I stand before myself as judge, jury, and accuser, certain that God could never accept me or approve of me because I’m just not good enough. And I wouldn’t be wrong. I’m not good enough. I never will be. I could never meet up to the standards of the holiness of God on my own. \nBut here’s the good news: God knows that. And He’s made a way for those who love Him to have access to Him in order to receive His forgiveness, which He freely extends through Christ. This is the God we serve. \nSo when I come before God, humbly aware of my sin, I don’t have to abuse myself, bowing beneath the weight of self-hatred and defeat. I can approach Him boldly and with confidence because, just like David, I have a “God-awareness.” I know the God I come before, and He silences the accusations, dismisses the guilt, and loves me out of my shame. Not only that, but every time I approach Him in humility and expectation, He makes me more like Him.\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day11-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 55:1-23",
    "devo_title": "A Prayer for Justice to Prevail Over Evil",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 55:1-23\nI locked myself in the closet and tried to pray despite my bleary eyes and knocking knees. I simply couldn’t face the day. It was too hard, too painful. There was no resolve to muster, no bootstraps big enough to pull myself up by. When I read Psalm 55, I wonder if, perhaps, the psalmist penned it from a similar place.\nThis is one of the things I love most about the Word of God. It is not sanitized, polished up to a high shine, and put on display. The Bible does not stick to feel-good mantras or platitudes that make us all smile and nod. There is grit between the pages because, let’s face it, there is grit in all our lives. \nThe psalmist opens this passage begging to be heard. There’s no swagger oozing from the tip of his pen. No pretty, religious language found in these verses. He is desperate. His need to hear from the Lord is visceral. \n“Listen to me!”\n“Don’t tune me out.”\n“Do You hear me?”\n“ANSWER ME!”\nHis gut-level honesty makes me want to stand up and cheer. \nBecause there are days I can’t start my prayers neat and tidy. There are moments when my need is so great, and my heart is so tied up in knots, I can’t get much past the lump in my throat. There are times when, if I’m not sure He’s listening, I don’t know how to find the strength to go on. If I could see myself in these moments, I imagine I might look something like Hannah, crying out to God, so wrought with despair that I look drunk or crazy (1 Samuel 1:9-18). \nBut God heard the cry of Hannah. He heard the psalmist’s plea. And when we are restless, in anguish, afraid and trembling and horrified, or fighting the urge to take flight (Psalm 55:2,4-6), He hears us too. It seems desperation is a prayer language of its own.\nIt was a medical crisis that sent me to the closet that day. It was betrayal by a dear friend that sent the psalmist reeling here, to writing this psalm. Whether it’s the horror of what you see on the news, or the pain of a personal crisis, cry out! The Lord is listening. He doesn’t need us to get the words right, or ask us to wait until we calm down to come before the throne. We can bring Him our snotty noses and ugly cries. He alone can transform them into peace and joy. \nIt was in the closet of desperation that I learned this: God is my provider, supernaturally changing my circumstances. And He is also my sustainer, supernaturally carrying me through those circumstances. Both are grace. Perhaps that’s why the psalmist made this declaration, even before his circumstances had shifted: \n“Cast your burden on the LORD, and He will sustain you” (v.22). \nWhen we hurl our burdens at Christ’s throne, without attempting to wrap them up in pretty bows, we find He is more than able to carry them. Today, whatever our circumstances, whatever is happening in the world around us, we can bring our desperation as an offering of faith, trusting He will get us through. His will, His love, and His justice will prevail.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day12-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "1 John 5:14-15",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nThis is the confidence we have before him: If we ask anything according to his will, he hears us. And if we know that he hears whatever we ask, we know that we have what we have asked of him.\n—1 John 5:14-15\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day13-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 86:5",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it,  we carry the gospel with us wherever we go.\nThis week’s verse reminds us of God’s kindness, mercy, and love.\nFor you, Lord, are kind and ready to forgive,\nabounding in faithful love to all who call on you.\n—Psalm 86:5\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/4-PsalmsForPrayer-2-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 143:1-12",
    "devo_title": "A Prayer for Guidance",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 143:1-12\nA few years ago my husband and I were in the middle of an agonizing time of decision-making. He was unemployed, we had a mortgage to pay, we were in the midst of a difficult season where we felt alone as a brand new married couple in a new city, new church, and new job for me. On top of all that, there were some peripheral difficulties clouding our judgment. It was one of those times in life where I felt completely alone and as though any decision we might make would have catastrophic results. Our circumstances weren’t even at their worst yet, but even at that point, we felt paralyzed in the midst of indecision. No direction seemed right or good or sufficient or joyful or enough for anyone else, let alone us. \nIt was in the midst of this indecision that one of us read these words from pastor and author Scotty Smith: \n\nGrant us peace as we make important decisions. Some of us are facing career changes, church choices, economic challenges, and health issues. Free us from the foolish notion that there is only one right choice to make. Actually, there is only one right God to trust, and that is you. Lead us, as we lean on you, Father.\n\nThis quote nudged something in us both, and it is the same nudging I feel when I read Psalm 143:8:\nLet me hear in the morning of your steadfast love,\nfor in you I trust.\nMake me know the way I should go,\nfor to you I lift up my soul.\nSo often we are duped into believing there is only one right decision in front of us. When the way seems cloudy, as it often does, we can find ourselves paralyzed with the fear that we’ll make the wrong decision. But this psalm of David shows us the way. It is a compass for directional purposes: Let me hear your steadfast love. In you I trust. To you I lift up my soul. \nWhere do I look when I don’t know where to look? To Him. To His love, His trustworthiness, His help. It is the only place my soul will find rest, the only trustworthy place, and the only love that will not let me go. \nWhat decisions are you facing today? What needs to be done or said or moved or broken or taken up? What opinions or thoughts or fears or refrains are you replaying over and over again in your mind? What closed doors or open doors do you see? Now, lift up your eyes, lift up your soul, and see your Maker, your God, your friend, your Savior. If He is your truest north, and serving Him, being loved by Him, and obeying Him is your greatest good, then take a step. Then another. And another. We may never know the direction life is taking us, but we can know the God who keeps us and guides us on the way He is leading us.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day15-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 142:1-7",
    "devo_title": "A Prayer for Help in Trouble",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 142:1-7\nWe are not a people fond of showcasing our flaws and failures. So much of our society is meant to elevate our best selves. But no matter how long we drink from the fountain of “you have what it takes” ideology, our frailty remains a bitter pill that cannot be swallowed. \nThen we open our Bibles and see an entirely different approach. Prayer is not the place for pep talks or public relations. Unlike social media posts, the purpose of prayer is not to put ourselves in the best light and convince God we are good so that He will respond. Rather, prayer is the place where we admit we are weak and needy, an invitation to confess we are utterly lost in the face of trouble without the sovereign hand of God. \nDavid didn’t write Psalm 142 from his palace, surrounded by adoring fans. This isn’t a psalm penned after a military victory or personal triumph. This psalm is a prayer, written from a cave, a crude place of refuge, by a man on the run. \nIt’s not clear if these words were penned from the cave of Adullam or En-gedi, two places we find David hiding as he fled from the paranoia of King Saul (1 Samuel 22, 1 Samuel 24). In both circumstances his leader and mentor had vowed to kill him and had the resources and resolve to carry it out. David was a sitting duck who knew he could not defend himself. His enemies were armed and dangerous and David had nothing but desperation. Remarkably, he didn’t try to spin the story. When trouble surrounded him and pressed his back up against the cave wall, David declared his frailty to the Lord: \nListen to my cry,\nfor I am very weak.\nRescue me from those who pursue me,\nfor they are too strong for me.\n—Psalm 142:6\nPerhaps one of the reasons why God described David as “a man after my heart” was David’s willingness to own up to his desperation for God’s help (Acts 13:22). I read through God’s Word and cannot help but see a pattern: God is near in our trouble. \nWhen faced with a battle he was too weak to win, Jehoshaphat declared, “We do not know what to do, but our eyes are on you” and God secured the victory (2 Chronicles 20:12). \nDaniel was powerless to shut the lions’ mouths, so he “implored God” to do it for him. God did (Daniel 6:11). \nPaul begged the Lord to take away his weakness. In response the Spirit reminded him, “My grace is sufficient for you, for my power is made perfect in weakness” (2 Corinthians 12:9).  \nWeakness is power because in our weakness, we are made strong by God. In the age of spin, I need to be reminded that even weak faith is productive, even feeble prayers are answered (Matthew 17:20). Prayer is an invitation to come as we really are and hear from the God who loves us anyway. \nWe each have our own enemies to face and battles we cannot win. Sure, we could try to puff ourselves up with false bravado, but the illusion of our strength is easily exposed. There is an alternative to sinking into despair and defeat. When this world brings trouble to our doorstep, we can look to the Lord for comfort and wait with open hands to receive His strength.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day16-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 146:1-10",
    "devo_title": "A Prayer of Adoration",
    "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Psalm 146:1-10\nEverything I need to know about earthly adoration, I learned from my middle school musical theater class. First, we learned through experience. What else is a brace-faced preteen supposed to feel upon receiving a standing ovation for her impeccably off-key version of Oliver! The Musical’s “Food Glorious Food”? For all I knew, applause and attention meant the same thing as adoration.\nThen, we learned from the music. One of the delightfully cheesy and romantic tunes that stands out the most is Aretha Franklin’s “I Say A Little Prayer,” which is also included on the soundtrack for the film My Best Friend’s Wedding, starring a young Julia Roberts. Perhaps you remember the chorus:\nForever, forever, you’ll stay in my heart\nAnd I will love you\nForever and ever, we never will part\nOh, how I’ll love you\nTogether, together, that’s how it must be\nTo live without you\nWould only be a heartbreak for me.\nThese were lyrics that made even prepubescent girls swoon. During rehearsals, we’d stand squished on the risers, divided into altos and sopranos, as our choral director clapped the rhythms and contorted his face into exaggerated expressions, commanding us to annunciate! “FOR-EV-ER, FOR-EV-ER,” he would chant.\nIt’s no coincidence that this is what we long for. We want the affection we receive to be sure, and the praise we give to remain warranted—not just one-time applause. Commitment and adoration go hand in hand, and with God, we get both.\nHere is where the romantic comedy cliches and the middle school dramatics stop. Adoration is not intended to be a general concept that God calls for early on and then forgets about. Rather, adoration is something we see carried throughout the psalms as a rhythmic refrain to God’s presence and nearness to us. Psalm 146 recalls reasons for adoring God: He frees prisoners, opens the eyes of the blind, raises up the oppressed, loves the righteous, and protects resident aliens. \nAdoration is the response we give to our God who is good and faithful in all things. It is the deep abiding love that only comes from the safety of a covenant made by a promise-keeping God who loves His children. It is His reason for choosing us, and our reason for returning to Him. He wants to adore us as His own for eternity, and because of that, we get to return and enjoy His love forever.\nGod remains faithful forever. (FOR-EV-ER!) His kingdom and promises and love for us will stand firm into eternity. May we learn to love and adore Him in return.\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day17-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 84:1-12",
    "devo_title": "A Prayer for the Church",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 84:1-12\nI learned how to drive on the interstate that we took to get to church every Sunday. My parents forced me to drive on that busy road because they knew I would have to drive it many, many times over the next few years while I lived in Birmingham. My family was in that building every time the doors were open. Sunday school, Sunday morning worship, Sunday evening worship, Wednesday evening Bible class—you name it, we were there sitting on the front row. \nWhile I was growing up, church always felt a little bit like something I had to check off a to-do list. I never spent the night at friends’ houses on Saturday night because I had to go to church in the morning. I would always rush home from sports practices on Wednesdays so I could make it to youth group on time. I loved church, yes, but it never felt like the kind of church the psalmist is describing in Psalm 84.\nWhen I was in college, I spent a semester in Santiago, Chile, and for three months, I didn’t go to church, not really. I didn’t speak much Spanish at the time, and so when I did attend church there, I spent more time and energy trying to translate the sermon in my head than just worshiping. While I was in Chile, church began to take on a completely different meaning than it did when I was a child.\nOver the course of a few months, the idea of “church” shifted to “Church.” The distinction of the capital “C” allowed me to view the Church as a larger being, as something other than just the place I went to worship. The Church is so much more than the small box in which I’d stowed my idea of our local church. It is family, community, a safe place to worship and experience the presence of our God.\nEven a sparrow finds a home,\nand a swallow, a nest for herself\nwhere she places her young—\nnear your altars, LORD of Armies,\nmy King and my God.\nHow happy are those who reside in your house,\nwho praise you continually.    Selah.\n—Psalm 84:3-4\n Let us use Psalm 84 as a means of pleading with God for what we want His Kingdom to look like here, now. May we be a people and a Church that reside in the house of our Lord, a people who praise Him continually. May we allow the Church to be a safe place for outsiders, a home for those who are lost, and a family for the broken. And may we pray for the Church be a place that bridges the gap between heaven and earth, where we meet with our God and enjoy His presence together, as a community.\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of good books, ugly dogs, and the Oxford comma. \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day18-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 2:1-12",
    "devo_title": "A Prayer Celebrating the Gift of Jesus",
    "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Psalm 2:1-12\nI like to be the first one awake at my house. However, I don’t like to set an alarm clock because of my dedication to the mysterious idea of sleep cycles. So instead, I play a pillow-cushioned game of Russian roulette every morning. When my body needs more sleep, I let the old girl sleep. But sometimes it all works out so that I have this gorgeous window of time—typing, planning, organizing—setting the stage for the day ahead before anyone else is awake.\nOne morning I was up at 5 a.m., feeling strong. I filled my arms full of things I wanted to carry into the kitchen: cups from last night, my phone, a clipboard, my little portable speaker, and a few rolls of washi tape ringed around my thumb. Juggling all of this in the dark, I preemptively nudged my phone to start playing some quiet piano music, because it usually takes a while to load. \nBut here are a couple things I didn’t know: First, my phone was already linked to the portable speaker. And second, everything was set at full volume. (Oh, and one thing you didn’t know: there were nine other people, too, sleeping nearby.) So in the pre-dawn light, on my way to some quiet, productive time in the kitchen, I found myself in the middle of the house, my arms uncomfortably full, clutching a speaker that was inexplicably bellowing the climax from Handel’s Messiah: “WOR-THY IS THE LAMB, THAT WAS SLAIN!”\nI circled around like a toy car, fumbling to turn the music off in the dark, and somehow succeeded in making the volume louder still—probably because my eyes were mostly squinted shut from laughing. And since you can’t shush a speaker, it took me a while to get quiet again.\nI think we sometimes want to keep Jesus in a little quiet box too. The title of today’s reading is “A Prayer Celebrating the Gift of Jesus,” and honestly, I’d expected to be writing about a sweet Christmas baby Jesus as our joy to the world. But this psalm is about the almighty dominion of Christ. He did come as a baby, yes, but He is also the omnipotent King of kings.\nThe psalmist calls us to “serve the Lord with reverential awe, and rejoice with trembling” (Psalm 2:11). He is a God we cannot control and cannot fully comprehend. Our proper response is to worship Him. It’s easier to think of Jesus as our pocket-sized best friend, but we need to remember that He rules and reigns the cosmos. He is a paradox, making His love for us all the more potent. We must pay Him homage, for He is our King, and all who take refuge in Him are happy.\nThis paradox is a beautiful and central tenet of our faith: “kiss the Son, lest He be angry” (v.12). Our God comes low to love mankind, but He remains just and unchanging, righteous and holy. We are sloppy and funny and sneaky. His love for His wishy-washy creation is so wonderful, but it doesn’t change who He is; who He has always been—the King of all creation. So we worship at the feet of this mystery we cannot control. And we celebrate the gift of Jesus, both as a baby and as King.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day19-1.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Philippians 4:6-7",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nDon’t worry about anything, but in everything, through prayer and petition with thanksgiving, present your requests to God. And the peace of God, which surpasses all understanding, will guard your hearts and minds in Christ Jesus.\n—Philippians 4:6-7\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/SRT-PsalmsForPrayer-Shareimage-Day20.jpg"
},
{
    "book_title": "Psalms for Prayer",
    "devo_passages": "Psalm 143:8",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it,  we carry the gospel with us wherever we go.\nThis week’s verse reminds us to go to God first when we need help.\nLet me experience\nyour faithful love in the morning,\nfor I trust in you.\nReveal to me the way I should go\nbecause I appeal to you.\n—Psalm 143:8\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n ",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/4-PsalmsForPrayer-3-1.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 120:1-7",
    "devo_title": "The First Step: Repentance",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 120\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we’ll dig into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n\n//\nPsalm 120 (CSB)\nA CRY FOR TRUTH AND PEACE\nA song of ascents.\n1 In my distress I called to the LORD,\nand he answered me.\n2 “LORD, rescue me from lying lips\nand a deceitful tongue.”\n3 What will he give you,\nand what will he do to you,\nyou deceitful tongue?\n4 A warrior’s sharp arrows\nwith burning charcoal!\n5 What misery that I have stayed in Meshech,\nthat I have lived among the tents of Kedar!\n6 I have dwelt too long\nwith those who hate peace.\n7 I am for peace; but when I speak,\nthey are for war.\n//\nA Leaving Song\nThe pilgrim-disciple laments her culture of dishonesty and hostility, and leaves for the holy city of Jerusalem. This song was sung with an eye toward the goal: worship on God’s holy hill. It is the song of a person who is stirred to leave a broken world in search of a place where peace reigns.\nDissatisfaction with the brokenness of our world is an essential component to a pilgrim’s journey. It stirs us to get up from where we are and seek a better way. We aren’t called simply to flee from the lies of our culture. We are called to flee to God.\nReflect\n1. Do you know any other leaving songs? What are they about? What do you want to be delivered from? What do you want to leave? Why?\n2. The pilgrim-disciple prays to be delivered from lies. What are the lies that most often have your ear? Do you struggle to recognize the lies you are told? What lies do you tell to paint yourself in a better light? Why do you think we do this?\n3. What does it mean to flee to God? In what ways do you practice, or in what ways can you begin to practice, fleeing to God?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day1s.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 121:1-8",
    "devo_title": "Trust in God as Our Protector",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 121\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 121 (CSB)\nTHE LORD OUR PROTECTOR\nA song of ascents.\n 1 I lift my eyes toward the mountains.\nWhere will my help come from?\n2 My help comes from the LORD,\nthe Maker of heaven and earth.\n3 He will not allow your foot to slip;\nyour Protector will not slumber.\n4 Indeed, the Protector of Israel\ndoes not slumber or sleep.\n 5 The LORD protects you;\nthe LORD is a shelter right by your side.\n6 The sun will not strike you by day\nor the moon by night.\n 7 The LORD will protect you from all harm;\nhe will protect your life.\n8 The LORD will protect your coming and going\nboth now and forever.\n//\nA Song of Providence\nThis is a song for the anxious and afraid. When all the voices of fear and accusation come rushing in, the pilgrim-disciple remembers that her help comes from the One who governs heaven and earth.\nOur Helper is also our Keeper. The One who watches over us does not sleep. The One who guards our souls cannot be moved. The God who paints the fields with wildflowers and tends to the sparrows is the same God who cares for us.\n \nReflect\n1. Where do you feel you need God’s help most right now? What are you thinking about as you read this song?\n2. Is it easy or difficult for you to accept that God is able to help you? Why?\n3. Which statements in this psalm encourage you most? Why? In what ways has God already shown that He has done everything described in this psalm?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day2s.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 122:1-9",
    "devo_title": "The Structure of a Worshiping Life",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 122\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 122 (CSB)\nA PRAYER FOR JERUSALEM\nA song of ascents. Of David.\n 1 I rejoiced with those who said to me,\n“Let us go to the house of the LORD.”\n2 Our feet were standing\nwithin your gates, Jerusalem —\n 3 Jerusalem, built as a city should be,\nsolidly united,\n4 where the tribes, the LORD’s tribes, go up\nto give thanks to the name of the LORD.\n(This is an ordinance for Israel.)\n5 There, thrones for judgment are placed,\nthrones of the house of David.\n 6 Pray for the well-being of Jerusalem:\n“May those who love you be secure;\n7 may there be peace within your walls,\nsecurity within your fortresses.”\n8 Because of my brothers and friends,\nI will say, “May peace be in you.”\n9 Because of the house of the LORD our God,\nI will pursue your prosperity.\n//\nAn Arriving Song\nThe pilgrim-disciple enters Jerusalem and blesses the Lord for the city’s beauty and for the sense that she belongs there.\nThis is a song about moving toward the love of God in worship, which speaks to the core truth in all of us that we are made for worship. But the focus here is not on personal worship only. This song celebrates the beauty of the rhythm of worshiping God alongside others in an ongoing way.\nReflect\n1. We are all worshipers. What do you worship? To what do you give your time? In what do you place your hope?\n2. This psalm calls people to worship together. What is the value of gathering with other people to worship God together? What do we gain by worshiping with others that we would not have on our own?\n3. Scripture calls us to steady, regular worship—to return to the same places and meditate on the same truths over and over. What is the value of doing this?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day3s.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 123:1-4",
    "devo_title": "Longing for the Nearness of God",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 123\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 123 (CSB)\nLOOKING FOR GOD’S FAVOR\nA song of ascents.\n 1 I lift my eyes to you,\nthe one enthroned in heaven.\n2 Like a servant’s eyes on his master’s hand,\nlike a servant girl’s eyes on her mistress’s hand,\nso our eyes are on the LORD our God\nuntil he shows us favor.\n 3 Show us favor, LORD, show us favor,\nfor we’ve had more than enough contempt.\n4 We’ve had more than enough\nscorn from the arrogant\nand contempt from the proud.\n//\nA Song About Who We Are\nThe pilgrim-disciple meditates on who she is to God, and who God is to her.\nWho gets to tell us who we are? Many voices will try to answer that question for us. For the pilgrim-disciple, our Maker is the only one who has that right. Our goal in life is to grow in our understanding of who God is and who we are in our relationship with Him.\nReflect\n1. This psalm promotes enthusiastic obedience to God’s commands. The servant watches for the master’s hand to beckon. Why does it make sense to desire the instruction of the Lord? Why should we be eager to hear His commands?\n2. This psalm asks God for mercy. What are some specific things we are asking for when we ask God to show us mercy? What sorts of things must we be willing to surrender when we ask God for mercy?\n3. We cannot know all there is to know about God, but God has revealed Himself in part. What has God made known to us about Himself? What has He revealed about who we are?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day4s.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 124:1-8",
    "devo_title": "Our Protection Comes from the Lord",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 124\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 124 (CSB)\nTHE LORD IS ON OUR SIDE\nA song of ascents. Of David.\n 1 If the LORD had not been on our side —\nlet Israel say —\n2 If the LORD had not been on our side\nwhen people attacked us,\n3 then they would have swallowed us alive\nin their burning anger against us.\n4 Then the water would have engulfed us;\nthe torrent would have swept over us;\n5 the raging water would have swept over us.\n 6 Blessed be the LORD,\nwho has not let us be ripped apart by their teeth.\n7 We have escaped like a bird from the hunter’s net;\nthe net is torn, and we have escaped.\n8 Our help is in the name of the LORD,\nthe Maker of heaven and earth.\n//\nA Song of Rescue\nDanger takes on many forms, both externally and internally.\nIsrael’s story is full of danger—warring with neighboring armies who wanted to destroy them, and fighting against the temptation to follow after other gods. The pilgrim-disciple confesses that, had it not been for God, all of Israel would have been consumed by enemies, dragons, and floods. This song calls us to to deal honestly with our need for rescue, and to make this part of our worship as we praise God for His mercy and grace.\nReflect\n1. When was the last time danger snuck up on you or surprised you? What are some of the real dangers you face externally right now? Internally?\n2. This psalm describes danger as a dragon that swoops in to swallow us alive. How does this song respond to the danger? What would happen if God opted not to rescue you? What would become of you if God left you as He found you?\n3. From what does God rescue us? How does God rescue us? See Ephesians 2:1-7.\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day5s.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Isaiah 2:3",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n“Come, let us go up to the mountain of the LORD,\nto the house of the God of Jacob.\nHe will teach us about his ways\nso that we may walk in his paths.”\nFor instruction will go out of Zion\nand the word of the LORD from Jerusalem.\n– Isaiah 2:3\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day6s.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 121:1-2",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nFor this study of the Psalms of Ascent, we will memorize the 121st psalm together, a few verses at a time. The first two verses direct our eyes to the true source of our help: God alone.\nI lift my eyes toward the mountains.\nWhere will my help come from?\nMy help comes from the LORD,\nthe Maker of heaven and earth.\n– Psalm 121:1-2\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/4-POA-1.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 125:1-5",
    "devo_title": "The Christian Is Secure in God’s Care",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 125\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 125 (CSB)\nISRAEL’S STABILITY\nA song of ascents.\n 1 Those who trust in the LORD are like Mount Zion.\nIt cannot be shaken; it remains forever.\n2 The mountains surround Jerusalem\nand the LORD surrounds his people,\nboth now and forever.\n3 The scepter of the wicked will not remain\nover the land allotted to the righteous,\nso that the righteous will not apply their hands to injustice.\n4 Do what is good, LORD, to the good,\nto those whose hearts are upright.\n5 But as for those who turn aside to crooked ways,\nthe LORD will banish them with the evildoers.\n Peace be with Israel.\n//\nA Song of Belonging\nThe pilgrim-disciple sings of our security in God’s care. The Lord holds His scepter, and no one can wrest it from His hand.\nThis is a humble song because it acknowledges the truth that our hope is secure—not because we are strong, but because God is. But in this song, we also confess that we need God’s intervention to keep us and hold us. We are likely to take up the scepter of wickedness and govern our own lives in evil, self-serving ways if He doesn’t stay our hand.\nReflect\n1. Do you worry about ruining your life by making a wrong decision or committing a particular transgression? How fragile or stable do you think your own life is? Why?\n2. What does it mean for God to be our King? How does His rule govern the world we live in? How does He govern us as individuals?\n3. In what ways do you need God to intervene in your life and govern you? In what ways has He already done this for you?\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day8s.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 126:1-6",
    "devo_title": "Sowing in Tears, Reaping in Joy",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 126\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 126 (CSB)\nZION’S RESTORATION\nA song of ascents.\n 1 When the LORD restored the fortunes of Zion,\nwe were like those who dream.\n2 Our mouths were filled with laughter then,\nand our tongues with shouts of joy.\nThen they said among the nations,\n“The LORD has done great things for them.”\n3 The LORD had done great things for us;\nwe were joyful.\n 4 Restore our fortunes, LORD,\nlike watercourses in the Negev.\n5 Those who sow in tears\nwill reap with shouts of joy.\n6 Though one goes along weeping,\ncarrying the bag of seed,\nhe will surely come back with shouts of joy,\ncarrying his sheaves.\n//\nA Song of Sorrow and Joy\nIt is a sign of emotional maturity to be able to feel more than one thing at a time. The pilgrim-disciple in this song is walking through a sad season, but she remembers with joy a time the Lord restored Israel’s fortunes. It was like a dream, and she longs for the Lord to do it again.\nWe may go out weeping today, sowing our seeds in tears, but there is a harvest of joy we shall reap for all eternity. For now, we live in the tension.\nReflect\n1. Name a time in your life when you were filled with the joy described in Psalm 126:2. What made your season of joy so happy?\n2. Name a time in your life when you were filled with the sorrow described in Psalm 126:5-6. What made that season so hard? Do you mask pain? If so, how and why?\n3. What has God done to assure us that our eternal destiny is one filled with joy? How do we live in the tension between grieving painful times and living in the joy of Christ?\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day9.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 127:1-5",
    "devo_title": "The Lord Builds and Protects",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 127\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 127 (CSB)\nTHE BLESSING OF THE LORD\nA song of ascents. Of Solomon.\n 1 Unless the LORD builds a house,\nits builders labor over it in vain;\nunless the LORD watches over a city,\nthe watchman stays alert in vain.\n2 In vain you get up early and stay up late,\nworking hard to have enough food—\nyes, he gives sleep to the one he loves.\n3 Sons are indeed a heritage from the LORD,|\noffspring, a reward.\n4 Like arrows in the hand of a warrior\nare the sons born in one’s youth.\n5 Happy is the man who has filled his quiver with them.\nThey will never be put to shame\nwhen they speak with their enemies at the city gate.\n//\nA Song About the Builder and Protector\nThe pilgrim-disciple sings of how God is both the builder and protector of everything sacred—from our work to our families.\nEveryone is trying to build something and protect something. Ultimately, behind many of our attempts to build and protect lies a deep-seated need to be in control. When the need to control grips you, take that to the Lord. Unless He frees you, you will not be free.\nReflect\n1. What are you trying to build or protect? Why? How do you go about it? What does this reveal about how you see God and how you see yourself?\n2. What do you do when fear confronts you? What would the people closest to you say you do when you feel the need to gain control? How effective are your methods?\n3. Read Philippians 4:6 and Proverbs 3:5-8. What should we do when worry or fear comes over us? How do you respond to Psalm 127:2?\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day10.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 128:1-6",
    "devo_title": "The Happiness of the Straight Road",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 128\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 128 (CSB)\nBLESSINGS FOR THOSE WHO FEAR GOD\nA song of ascents.\n 1 How happy is everyone who fears the LORD,\nwho walks in his ways!\n2 You will surely eat\nwhat your hands have worked for.\nYou will be happy,\nand it will go well for you.\n3 Your wife will be like a fruitful vine\nwithin your house,\nyour children, like young olive trees\naround your table.\n4 In this very way\nthe man who fears the LORD\nwill be blessed.\n 5 May the LORD bless you from Zion,\nso that you will see the prosperity of Jerusalem\nall the days of your life\n6 and will see your children’s children!\nPeace be with Israel.\n//\nA Happy Song\nThe pilgrim-disciple sings a happy song about how living according to the wisdom of God brings joy, peace, and prosperity.\nWe all want these blessings in life—the confidence that our work matters, that our home is a happy place, and that what we leave behind will continue to affect change long after we’re gone. We are not passive in this process. This song calls us to work diligently, to love self-sacrificially, and to train the children in our lives to know and walk with God. We don’t just think about God; we live in response to His Word to us. Obedience is a path to joy.\nReflect\n1. This happy song celebrates prosperity. What sort of prosperity helps us know and love God better? What sort of prosperity makes it hard to know and love God? What sort of prosperity does this psalm value, and how do we obtain the “blessedness” described here?\n2. Why is obedience to God’s commands a path to joy? Do you believe it is? Where do you struggle to accept this idea? Why?\n3. On what basis do we have hope for receiving God’s eternal blessings? What are those blessings?\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day11.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 129:1-8",
    "devo_title": "Patience and Perseverance",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 129\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 129 (CSB)\nPROTECTION OF THE OPPRESSED\nA song of ascents.\n 1 Since my youth they have often attacked me —\nlet Israel say —\n2 Since my youth they have often attacked me,\nbut they have not prevailed against me.\n3 Plowmen plowed over my back;\nthey made their furrows long.\n4 The LORD is righteous;\nhe has cut the ropes of the wicked.\n 5 Let all who hate Zion\nbe driven back in disgrace.\n6 Let them be like grass on the rooftops,\nwhich withers before it grows up\n7 and can’t even fill the hands of the reaper\nor the arms of the one who binds sheaves.\n8 Then none who pass by will say,\n“May the LORD’s blessing be on you.\nWe bless you in the name of the LORD.”\n//\nA Song of War\nThe pilgrim-disciple asks the Lord to bring a reckoning to evil and evildoers, to smite the wicked “far as the curse is found.”\nIt is appropriate to desire a reckoning for evil. We should want evil eradicated from the world and we should ask God to do it—not simply because we loathe how bad it can be, but because there is something even higher we want: peace. Jesus broke the curse by taking our sin upon Himself, giving us that peace.\nReflect\n1. What questions come to mind when you read verses in the Bible calling for God to put the wicked to shame? Why do you think God gave us a psalm like this?\n2. Are you offended by the evil around you? What is the war-song in your heart? What do you want the Lord to banish from this world? Why?\n3. How do we apply a psalm like this to our own hearts? Where do you see the seeds of wickedness bearing unwanted fruit in your own life? How does God tell us He has dealt with the evil in us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day12.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Ephesians 1:3-6",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n“Blessed is the God and Father of our Lord Jesus Christ, who has blessed us with every spiritual blessing in the heavens in Christ. For he chose us in him, before the foundation of the world, to be holy and blameless in love before him. He predestined us to be adopted as sons through Jesus Christ for himself, according to the good pleasure of his will, to the praise of his glorious grace that he lavished on us in the Beloved One.”\n—Ephesians 1:3-6\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day13.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 121:3-4",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nFor this study of the Psalms of Ascent, we are memorizing the 121st psalm together, a few verses at a time. The second pair of verses remind us that God is always present and always protecting.\nHe will not allow your foot to slip;\nyour Protector will not slumber.\nIndeed, the Protector of Israel\ndoes not slumber or sleep.\n– Psalm 121:3-4\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/4-POA-2.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 130:1-8",
    "devo_title": "The Active Discipline of Hope",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 130\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 130 (CSB)\nAWAITING REDEMPTION\nA song of ascents.\n 1 Out of the depths I call to you, LORD!\n2 Lord, listen to my voice;\nlet your ears be attentive\nto my cry for help.\n 3 LORD, if you kept an account of iniquities,\nLord, who could stand?\n4 But with you there is forgiveness,\nso that you may be revered.\n 5 I wait for the LORD; I wait\nand put my hope in his word.\n6 I wait for the Lord\nmore than watchmen for the morning —\nmore than watchmen for the morning.\n 7 Israel, put your hope in the LORD.\nFor there is faithful love with the LORD,\nand with him is redemption in abundance.\n8 And he will redeem Israel\nfrom all its iniquities.\n//\nA Song of Hope\nThe pilgrim-disciple cries out from the depths, placing her hope in God’s forgiving love.\nThis is a song of repentance for not trusting in the forgiveness God offers. If God were to hold our sin against us, we could not enter into His presence. But God’s mercy beckons us to come to Him. The God who forgives is to be revered and trusted. We depend on God, and in Christ He gives us everything we need to know Him and worship Him without fear.\nReflect\n1. The opening verse of this psalm has an urgency to it. The pilgrim-disciple is asking the Lord to hear her cries for mercy. What is typically your most urgent prayer? Why?\n2. Do you believe your sin makes it so that, apart from God’s mercy, you could not stand before Him? Do you believe He shows mercy and forgives? Why or why not?\n3. This is a corporate song—one believers would sing together. What impact would it have on a community if every member believed they needed God’s mercy, and trusted that God gives it? In what ways do you add strength to your community by believing in the mercy and forgiveness we have in Christ?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day15.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 131:1-3",
    "devo_title": "The Quiet Confidence of Faith",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 131\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 131 (CSB)\nA CHILDLIKE SPIRIT\nA song of ascents. Of David.\n 1 LORD, my heart is not proud;\nmy eyes are not haughty.\nI do not get involved with things\ntoo great or too wondrous for me.\n2 Instead, I have calmed and quieted my soul\nlike a weaned child with its mother;\nmy soul is like a weaned child.\n 3 Israel, put your hope in the LORD,\nboth now and forever.\n//\nA Song About the Gift of Limits\nThe pilgrim-disciple acknowledges that while she is a person with limits, she also has a place among God’s people.\nWe do not have to justify our worth or earn our place before God. When we grasp this, we begin to trust that growing comfortable with our sense of place is part of God’s good gift to us. This frees us to not only be at peace with our limitations, but to actually extol their virtues.\nReflect\n1.In your experience, what does the world say must be true about you for you to have worth?\n2. Why do you think God gives us limits? What are some of yours?\n3. What are some of the values of having limitations? How do your limits help you?\n\n ",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day16.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 132:1-18",
    "devo_title": "A Memory of the Past and a Hope for Future Glory",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 132\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 132 (CSB)\nDAVID AND ZION CHOSEN\nA song of ascents.\n 1 LORD, remember David\nand all the hardships he endured,\n2 and how he swore an oath to the LORD,\nmaking a vow to the Mighty One of Jacob:\n3 “I will not enter my house\nor get into my bed,\n4 I will not allow my eyes to sleep\nor my eyelids to slumber\n5 until I find a place for the LORD,\na dwelling for the Mighty One of Jacob.”\n 6 We heard of the ark in Ephrathah;\nwe found it in the fields of Jaar.\n7 Let us go to his dwelling place;\nlet us worship at his footstool.\n8 Rise up, LORD, come to your resting place,\nyou and your powerful ark.\n9 May your priests be clothed with righteousness,\nand may your faithful people shout for joy.\n10 For the sake of your servant David,\ndo not reject your anointed one.\n11 The LORD swore an oath to David,\na promise he will not abandon:\n“I will set one of your offspring\non your throne.\n12 If your sons keep my covenant\nand my decrees that I will teach them,\ntheir sons will also sit on your throne forever.”\n13 For the LORD has chosen Zion;\nhe has desired it for his home:\n14 “This is my resting place forever;\nI will make my home here\nbecause I have desired it.\n15 I will abundantly bless its food;\nI will satisfy its needy with bread.\n16 I will clothe its priests with salvation,\nand its faithful people will shout for joy.\n17 There I will make a horn grow for David;\nI have prepared a lamp for my anointed one.\n18 I will clothe his enemies with shame,\nbut the crown he wears will be glorious.”\n//\nA Song of Nostalgia and Future Glory\nThe pilgrim-disciple remembers when her people knew better days. But rather than return to a remembered past, she looks forward to a better future glory.\nIn the first half of this song (vv.1-10), God’s people cry out for God to repeat something He did before, about which they hold idealized memories. In the second half (vv.11-18), God beckons them to lift their eyes from the romantic fog of nostalgia and stop wishing for the past. Our security does not lie in a bygone era, but in an ongoing relationship with an eternal God.\nReflect\n1. Are there any seasons in your past you wish you could return to? Why?\n2. In his essay “The Weight of Glory,” C. S. Lewis describes nostalgia as “only the scent of a flower we have not found, the echo of a tune we have not heard, news from a country we have never yet visited.” When we long to go back to a remembered time, or when we look forward to better days, what are we ultimately longing for?\n3. In what ways do our desires for a better time help us worship God?\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day17.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 133:1-3",
    "devo_title": "The Sweetness and Rarity of True Community",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 133\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 133 (CSB)\nLIVING IN HARMONY\nA song of ascents. Of David.\n 1 How good and pleasant it is\nwhen brothers live together in harmony!\n2 It is like fine oil on the head,\nrunning down on the beard,\nrunning down Aaron’s beard\nonto his robes.\n3 It is like the dew of Hermon\nfalling on the mountains of Zion.\nFor there the LORD has appointed the blessing —\nlife forevermore.\n//\n\nThe pilgrim-disciple celebrates how good it is when her brothers and sisters dwell together in unity, meaning it is rich and pleasurable.\nThere are two kinds of pleasure: the kind we seek only for ourselves and the kind we seek as a part of belonging to a community. This second kind requires vulnerability and intimacy, trust and the laying down of self. Finding unity with others takes work as well as risk. It is something we celebrate because it is both rare and good.\nReflect\n1. Is there someone from your past or present with whom you need to pursue reconciliation—someone you need to move toward in love? In what ways do you “behold how unpleasant it is” to dwell in disunity?\n2. What are some of the best ways you can actively pursue Christian community? Why is it important to cultivate spiritual friendships?\n3. This psalm describes our unity with one another as something that carries over into eternity. How does regarding our spiritual friendships as eternal relationships help us love each other? Forgive each other? Respect each other?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day18.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 134:1-3",
    "devo_title": "Eternal Blessedness",
    "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Psalm 134\nThe Christian life is a climb—a journey of constant growth, sacrifice, and trusting God for what we cannot see. As Eugene Peterson said, we are pilgrims, but we are also disciples—always moving and always learning. The Psalms of Ascent (Psalms 120-134) were sung by worshipers as they made the journey up to Jerusalem for the annual feasts. In this 3-week reading plan, we are digging into these traveling songs with the help of short summary essays and thoughtful, reflective questions for each psalm. Take your pack on your shoulder and walk with us as we pursue God together.\n//\nPsalm 134 (CSB)\nCALL TO EVENING WORSHIP\nA song of ascents.\n 1 Now bless the LORD,\nall you servants of the LORD\nwho stand in the LORD’s house at night!\n2 Lift up your hands in the holy place\nand bless the LORD!\n 3 May the LORD,\nMaker of heaven and earth,\nbless you from Zion.\n//\nA Song of Invitation to Bless the Lord\nThe pilgrim-disciple invites the other pilgrim-disciples—people whose lives are a journey, but not without a guide—to bless the Lord, lifting holy hands in praise together.\nThis song is an invitation to bless God—to worship with one voice. We have come from all kinds of places, through all sorts of experiences, trials, joys, and sufferings, but we’re here now. Hear the invitation. Worship the Lord.\nReflect\n1. How do you most often respond to invitations? Do you typically say yes or no when you’re invited to something unfamiliar? Why?\n2. Where in your life are you looking at God’s instruction, like this invitation to worship, and wondering if it is really what you need? What fatherly commands has He given you that you turn away either because you don’t like them or don’t understand them?\n3. What would it look like for you to say yes to the invitation offered in Psalm 134? Where and when should a person respond to this call to worship?\n\n ",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day19.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Hebrews 13:12-16",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n ”Therefore, Jesus also suffered outside the gate, so that he might sanctify the people by his own blood. Let us then go to him outside the camp, bearing his disgrace. For we do not have an enduring city here; instead, we seek the one to come. Therefore, through him let us continually offer up to God a sacrifice of praise, that is, the fruit of lips that confess his name. Don’t neglect to do what is good and to share, for God is pleased with such sacrifices.”\n– Hebrews 13:12-16\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/SRT-POA-Instagram-Day20.jpg"
},
{
    "book_title": "Songs for the Road: The Psalms of Ascent",
    "devo_passages": "Psalm 121:5-8",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nFor this study of the Psalms of Ascent, we’ve been memorizing the 121st psalm together, a few verses at a time. The last four verses affirm the Lord’s promise to be our shelter, protecting us from harm.  \nThe LORD protects you;\nthe LORD is a shelter right by your side.\nThe sun will not strike you by day\nor the moon by night.\nThe LORD will protect you from all harm;\nhe will protect your life.\nThe LORD will protect your coming and going\nboth now and forever.\n– Psalm 121:5-8\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/4-POA-3.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 100",
    "devo_title": "You Are God",
    "devo_summary": "\nBY She Reads Truth\n\nIn this 2-week reading plan, we will assume a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we will offer a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. May He use His Word to turn our hearts toward Him.\n \nPsalm 100\nBe Thankful\nA psalm of thanksgiving.\nShout triumphantly to the Lord, all the earth.\nServe the Lord with gladness;\ncome before Him with joyful songs.\nAcknowledge that Yahweh is God.\nHe made us, and we are His —\nHis people, the sheep of His pasture.\nEnter His gates with thanksgiving\nand His courts with praise.\nGive thanks to Him and praise His name.\nFor Yahweh is good, and His love is eternal;\nHis faithfulness endures through all generations.\nDig deeper:\nOur God is good and His love is eternal. Let’s follow David’s lead in Psalm 100 by humbling ourselves in gratitude before the Lord. Complete the song of praise below with your own words of thanks.\nShout triumphantly to the Lord, all the earth.\nServe the Lord with gladness;\ncome before Him with joyful songs.\n_______________________________________\n(Go ahead! Shout out or write down a triumphant praise!)\nAcknowledge that Yahweh is God.\nHe made us, and we are His —\nHis people, the sheep of His pasture.\n_______________________________________\n(Celebrate who God is and who we are to Him.)\nEnter His gates with thanksgiving\nand His courts with praise.\nGive thanks to Him and praise His name.\n_______________________________________\n(Give thanks to God and praise His name.)\nFor Yahweh is good, and His love is eternal;\nHis faithfulness endures through all generations.\n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram1.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 19:1-14",
    "devo_title": "Your Instruction is Perfect",
    "devo_summary": "\nBY She Reads Truth\n\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\nPsalm 19\nThe Witness of Creation and Scripture\nFor the choir director. A Davidic psalm.\nThe heavens declare the glory of God,\nand the sky proclaims the work of His hands.\nDay after day they pour out speech;\nnight after night they communicate knowledge.\nThere is no speech; there are no words;\ntheir voice is not heard.\nTheir message has gone out to all the earth,\nand their words to the ends of the world.\nIn the heavens He has pitched a tent for the sun.\nIt is like a groom coming from the bridal chamber;\nit rejoices like an athlete running a course.\nIt rises from one end of the heavens\nand circles to their other end;\nnothing is hidden from its heat.\nThe instruction of the Lord is perfect,\nrenewing one’s life;\nthe testimony of the Lord is trustworthy,\nmaking the inexperienced wise.\nThe precepts of the Lord are right,\nmaking the heart glad;\nthe command of the Lord is radiant,\nmaking the eyes light up.\nThe fear of the Lord is pure,\nenduring forever;\nthe ordinances of the Lord are reliable\nand altogether righteous.\nThey are more desirable than gold—\nthan an abundance of pure gold;\nand sweeter than honey,\nwhich comes from the honeycomb.\nIn addition, Your servant is warned by them;\nthere is great reward in keeping them.\nWho perceives his unintentional sins?\nCleanse me from my hidden faults.\nMoreover, keep Your servant from willful sins;\ndo not let them rule over me.\nThen I will be innocent\nand cleansed from blatant rebellion.\nMay the words of my mouth\nand the meditation of my heart\nbe acceptable to You,\nLord, my rock and my Redeemer.\nDig Deeper:\nGod’s Word is true and complete! As you engage with verses 12-14, give thanks to God for His perfect Word that leads us to confession and repentance, restores us, and makes our hearts glad. Fill in the blanks as you pray the prayer below.\nWho perceives my unintentional sins?\nCleanse me from _______________________.\nMoreover, keep me from _______________________.\nDo not let them rule over me.\nThen I will be innocent and cleansed from blatant rebellion.\nMay the words of my mouth and the meditation of my heart be acceptable to You, Lord, my rock and my Redeemer.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram2-1.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 34:1-22",
    "devo_title": "You Hear & Deliver",
    "devo_summary": "\nBY She Reads Truth\n\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\nPsalm 34\nThe Lord Delivers the Righteous\nConcerning David, when he pretended to be insane in the presence of Abimelech, who drove him out, and he departed.\nI will praise the Lord at all times;\nHis praise will always be on my lips.\nI will boast in the Lord;\nthe humble will hear and be glad.\nProclaim Yahweh’s greatness with me;\nlet us exalt His name together.\nI sought the Lord, and He answered me\nand delivered me from all my fears.\nThose who look to Him are radiant with joy;\ntheir faces will never be ashamed.\nThis poor man cried, and the Lord heard him\nand saved him from all his troubles.\nThe Angel of the Lord encamps\naround those who fear Him, and rescues them.\nTaste and see that the Lord is good.\nHow happy is the man who takes refuge in Him!\nYou who are His holy ones, fear Yahweh,\nfor those who fear Him lack nothing.\nYoung lions lack food and go hungry,\nbut those who seek the Lord\nwill not lack any good thing.\nCome, children, listen to me;\nI will teach you the fear of the Lord.\nWho is the man who delights in life,\nloving a long life to enjoy what is good?\nKeep your tongue from evil\nand your lips from deceitful speech.\nTurn away from evil and do what is good;\nseek peace and pursue it.\nThe eyes of the Lord are on the righteous,\nand His ears are open to their cry for help.\nThe face of the Lord is set\nagainst those who do what is evil,\nto erase all memory of them from the earth.\nThe righteous cry out, and the Lord hears,\nand delivers them from all their troubles.\nThe Lord is near the brokenhearted;\nHe saves those crushed in spirit.\nMany adversities come to the one who is righteous,\nbut the Lord delivers him from them all.\nHe protects all his bones;\nnot one of them is broken.\nEvil brings death to the wicked,\nand those who hate the righteous will be punished.\nThe Lord redeems the life of His servants,\nand all who take refuge in Him will not be punished.\nDig Deeper:\nThe Lord hears and delivers us! Psalm 34 is full of God’s gracious gifts to David and to us—like a treasure hunt of promises. Using the verse number clues below, make a list of how God cares for His children. \nGod’s gracious gifts to me!\nverse 4:  He answers me\nverse 4:  He delivers me\nverse 5:  _____________________\nverse 6:  _____________________\nverse 7:  _____________________\nverses 9-10:  __________________\nverse 15:  ____________________\nverse 18:  ____________________\nverse 20:  ____________________\nverse 22:  ____________________\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram3.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 40:1-17",
    "devo_title": "You Put a New Song in My Mouth",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 40:1-17\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 40\nThanksgiving and a Cry for Help\nFor the choir director. A Davidic psalm.\nI waited patiently for the Lord,\nand He turned to me and heard my cry for help.\nHe brought me up from a desolate pit,\nout of the muddy clay,\nand set my feet on a rock,\nmaking my steps secure.\nHe put a new song in my mouth,\na hymn of praise to our God.\nMany will see and fear\nand put their trust in the Lord.\nHow happy is the man\nwho has put his trust in the Lord\nand has not turned to the proud\nor to those who run after lies!\nLord my God, You have done many things—\nYour wonderful works and Your plans for us;\nnone can compare with You.\nIf I were to report and speak of them,\nthey are more than can be told.\nYou do not delight in sacrifice and offering;\nYou open my ears to listen.\nYou do not ask for a whole burnt offering or a sin offering.\nThen I said, “See, I have come;\nit is written about me in the volume of the scroll.\nI delight to do Your will, my God;\nYour instruction lives within me.”\nI proclaim righteousness in the great assembly;\nsee, I do not keep my mouth closed—\nas You know, Lord.\nI did not hide Your righteousness in my heart;\nI spoke about Your faithfulness and salvation;\nI did not conceal Your constant love and truth\nfrom the great assembly.\nLord, do not withhold Your compassion from me;\nYour constant love and truth will always guard me.\nFor troubles without number have surrounded me;\nmy sins have overtaken me; I am unable to see.\nThey are more than the hairs of my head,\nand my courage leaves me.\nLord, be pleased to deliver me;\nhurry to help me, Lord.\nLet those who seek to take my life\nbe disgraced and confounded.\nLet those who wish me harm\nbe driven back and humiliated.\nLet those who say to me, “Aha, aha!”\nbe horrified because of their shame.\nLet all who seek You rejoice and be glad in You;\nlet those who love Your salvation continually say,\n“The Lord is great!”\nI am afflicted and needy;\nthe Lord thinks of me.\nYou are my helper and my deliverer;\nmy God, do not delay.\nDig Deeper:\nThe Lord rescues us! He turns our cries for help into hymns of praise. Use the prompts below to reflect honestly on life’s dark valleys, giving thanks to God that He thinks of you.\n1. When have you been in a desolate pit?\n2. How did the Lord set your feet on a rock?\n3. Are you in a desolate pit right now?\n4. What has the Lord promised to do?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram4.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 66:1-20",
    "devo_title": "Your Works Are Awe-Inspiring",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 66:1-20\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 66\nPraise for God’s Mighty Acts\nFor the choir director. A song. A psalm.\nShout joyfully to God, all the earth!\nSing about the glory of His name;\nmake His praise glorious.\nSay to God, “How awe-inspiring are Your works!\nYour enemies will cringe before You\nbecause of Your great strength.\nAll the earth will worship You\nand sing praise to You.\nThey will sing praise to Your name.” Selah\nCome and see the wonders of God;\nHis acts for humanity are awe-inspiring.\nHe turned the sea into dry land,\nand they crossed the river on foot.\nThere we rejoiced in Him.\nHe rules forever by His might;\nHe keeps His eye on the nations.\nThe rebellious should not exalt themselves.Selah\nPraise our God, you peoples;\nlet the sound of His praise be heard.\nHe keeps us alive\nand does not allow our feet to slip.\nFor You, God, tested us;\nYou refined us as silver is refined.\nYou lured us into a trap;\nYou placed burdens on our backs.\nYou let men ride over our heads;\nwe went through fire and water,\nbut You brought us out to abundance.\nI will enter Your house with burnt offerings;\nI will pay You my vows\nthat my lips promised\nand my mouth spoke during my distress.\nI will offer You fattened sheep as burnt offerings,\nwith the fragrant smoke of rams;\nI will sacrifice oxen with goats. Selah\nCome and listen, all who fear God,\nand I will tell what He has done for me.\nI cried out to Him with my mouth,\nand praise was on my tongue.\nIf I had been aware of malice in my heart,\nthe Lord would not have listened.\nHowever, God has listened;\nHe has paid attention to the sound of my prayer.\nMay God be praised!\nHe has not turned away my prayer\nor turned His faithful love from me.\nDig Deeper:\nSing about the glory of our God! The author of Psalm 66 gives thanks to God by proclaiming His mighty deeds—even those which he calls tests from the Lord—and praising God for His awe-inspiring goodness and might. Let’s do the same today.  \nCome and listen, all who fear God,\nand I will tell what He has done for me!\n(make a list in your study journal and/or share in the comments)\n_________________________\n_________________________\n_________________________\n_________________________\n_________________________\n_________________________\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram5.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "1 Thessalonians 5:16-18",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nText: 1 Thessalonians 5:16-18\nRejoice always!\nPray constantly.\nGive thanks in everything,\nfor this is God’s will for you in Christ Jesus.\n-1 Thessalonians 5:16-18\nGratitude is not just an emotion. Rejoicing is not a passive pursuit. The Bible instructs us to declare God’s goodness in every circumstance! We are to pray, seek, and give thanks with an expectant, joyful heart. THIS is God’s will for us. \nHis love for you is steadfast, no matter the path you’re walking.\nHis promises hold fast, even when your world is crumbling.\nIn everything, He is good. In everything give thanks.\nGratitude List\nLet’s actively thank our good God today.\nI will give thanks in…\n\nthis joyful thing:\nthis suffering:\nthis certainty:\nthis stress:\nthis injustice:\nthis sorrow:\nthis plenty:\nthis want:\nthis wandering:\nthis waiting:\n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram6.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 118:1",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 118:1\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a reminder of our reason for thankfulness:\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\n-Psalm 118:1\n Write this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/4-Psalm-118-1.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 98:1-9",
    "devo_title": "You Have Made Your Victory Known",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 98:1-9\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\nPsalm 98\nPraise the King\nA psalm.\nSing a new song to the Lord,\nfor He has performed wonders;\nHis right hand and holy arm\nhave won Him victory.\nThe Lord has made His victory known;\nHe has revealed His righteousness\nin the sight of the nations.\nHe has remembered His love\nand faithfulness to the house of Israel;\nall the ends of the earth\nhave seen our God’s victory.\nShout to the Lord, all the earth;\nbe jubilant, shout for joy, and sing.\nSing to the Lord with the lyre,\nwith the lyre and melodious song.\nWith trumpets and the blast of the ram’s horn\nshout triumphantly\nin the presence of the Lord, our King.\nLet the sea and all that fills it,\nthe world and those who live in it, resound.\nLet the rivers clap their hands;\nlet the mountains shout together for joy\nbefore the Lord,\nfor He is coming to judge the earth.\nHe will judge the world righteously\nand the peoples fairly.\nDig Deeper:\nOur God is forevermore victorious! In Psalm 98, the Israelites declared that “all the ends of the earth have seen our God’s victory”—and they joined loudly in the chorus of praise. Let’s do the same as we work through the text below.\n1. Look at verses 1-3. Why were the Israelites singing a song to the Lord?\n2. Now look at verses 7-9. Why should we sing a song to the Lord?\n3. Why did the Israelites celebrate their victory with so much noise?\n4. How can we celebrate the Lord’s victory?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram8.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 103:1-22",
    "devo_title": "You Have Compassion on Your Children",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 103:1-22\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God.\n \nPsalm 103\nThe Forgiving God\nDavidic.\nMy soul, praise Yahweh,\nand all that is within me, praise His holy name.\nMy soul, praise the Lord,\nand do not forget all His benefits.\nHe forgives all your sin;\nHe heals all your diseases.\nHe redeems your life from the Pit;\nHe crowns you with faithful love and compassion.\nHe satisfies you with goodness;\nyour youth is renewed like the eagle.\nThe Lord executes acts of righteousness\nand justice for all the oppressed.\nHe revealed His ways to Moses,\nHis deeds to the people of Israel.\nThe Lord is compassionate and gracious,\nslow to anger and rich in faithful love.\nHe will not always accuse us\nor be angry forever.\nHe has not dealt with us as our sins deserve\nor repaid us according to our offenses.\nFor as high as the heavens are above the earth,\nso great is His faithful love\ntoward those who fear Him.\nAs far as the east is from the west,\nso far has He removed\nour transgressions from us.\nAs a father has compassion on his children,\nso the Lord has compassion on those who fear Him.\nFor He knows what we are made of,\nremembering that we are dust.\nAs for man, his days are like grass—\nhe blooms like a flower of the field;\nwhen the wind passes over it, it vanishes,\nand its place is no longer known.\nBut from eternity to eternity\nthe Lord’s faithful love is toward those who fear Him,\nand His righteousness toward the grandchildren\nof those who keep His covenant,\nwho remember to observe His precepts.\nThe Lord has established His throne in heaven,\nand His kingdom rules over all.\nPraise the Lord,\nall His angels of great strength,\nwho do His word,\nobedient to His command.\nPraise the Lord, all His armies,\nHis servants who do His will.\nPraise the Lord, all His works\nin all the places where He rules.\nMy soul, praise Yahweh!\nDig Deeper:\nMay we forget not the Lord’s benefits! The faithful love and compassion God showed to David is true for us too. Read verses 3-5 again, and record God’s goodness to you by writing specific mercies in the blanks below.\nHe forgives _________;\nHe heals ____________.\nHe redeems __________;\nHe crowns me with __________.\nHe satisfies me with __________.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram9.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 118:1-29",
    "devo_title": "You Are Steadfast",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 118:1-29\nn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 118\nThanksgiving for Victory\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\nLet Israel say,\n“His faithful love endures forever.”\nLet the house of Aaron say,\n“His faithful love endures forever.”\nLet those who fear the Lord say,\n“His faithful love endures forever.”\nI called to the Lord in distress;\nthe Lord answered me\nand put me in a spacious place.\nThe Lord is for me; I will not be afraid.\nWhat can man do to me?\nThe Lord is my helper,\nTherefore, I will look in triumph on those who hate me.\nIt is better to take refuge in the Lord\nthan to trust in man.\nIt is better to take refuge in the Lord\nthan to trust in nobles.\nAll the nations surrounded me;\nin the name of Yahweh I destroyed them.\nThey surrounded me, yes, they surrounded me;\nin the name of Yahweh I destroyed them.\nThey surrounded me like bees;\nthey were extinguished like a fire among thorns;\nin the name of Yahweh I destroyed them.\nYou pushed me hard to make me fall,\nbut the Lord helped me.\nThe Lord is my strength and my song;\nHe has become my salvation.\nThere are shouts of joy and victory\nin the tents of the righteous:\n“The Lord’s right hand performs valiantly!\nThe Lord’s right hand is raised.\nThe Lord’s right hand performs valiantly!”\nI will not die, but I will live\nand proclaim what the Lord has done.\nThe Lord disciplined me severely\nbut did not give me over to death.\nOpen the gates of righteousness for me;\nI will enter through them\nand give thanks to the Lord.\nThis is the gate of the Lord;\nthe righteous will enter through it.\nI will give thanks to You\nbecause You have answered me\nand have become my salvation.\nThe stone that the builders rejected\nhas become the cornerstone.\nThis came from the Lord;\nit is wonderful in our eyes.\nThis is the day the Lord has made;\nlet us rejoice and be glad in it.\nLord, save us!\nLord, please grant us success!\nHe who comes in the name\nof the Lord is blessed.\nFrom the house of the Lord we bless you.\nThe Lord is God and has given us light.\nBind the festival sacrifice with cords\nto the horns of the altar.\nYou are my God, and I will give You thanks.\nYou are my God; I will exalt You.\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\nDig Deeper:\nOur circumstances change, but God and His faithful love remain unchanged. Use the structure of verses 1-9 in David’s psalm to write a personal song of thanks to God. Contrast the unique details of your changing life with God’s unchanging truth.\nGive thanks to the Lord, for He is good;\nHis faithful love endures forever.\nLet ____________ say,\n“His faithful love endures forever.”\nLet the house of ____________ say,\n“His faithful love endures forever.”\nLet those who fear the Lord say,\n“His faithful love endures forever.”\nI called to the Lord in________________;\nthe Lord answered me\nand ______________________________.\nThe Lord is for me; I will not be afraid.\nWhat can man do to me?\nThe Lord is my helper,\nTherefore, _________________________.\nIt is better to take refuge in the Lord\nthan to_____________________________.\nIt is better to take refuge in the Lord\nthan to ____________________________.\n(adapted from verses 1-9)\nThe details change. God remains the same.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram10.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 136:1-26",
    "devo_title": "Your Love Is Eternal",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 136:1-26\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 136\nGod’s Love Is Eternal\nGive thanks to the Lord, for He is good.\nHis love is eternal.\nGive thanks to the God of gods.\nHis love is eternal.\nGive thanks to the Lord of lords.\nHis love is eternal.\nHe alone does great wonders.\nHis love is eternal.\nHe made the heavens skillfully.\nHis love is eternal.\nHe spread the land on the waters.\nHis love is eternal.\nHe made the great lights:\nHis love is eternal.\nthe sun to rule by day,\nHis love is eternal.\nthe moon and stars to rule by night.\nHis love is eternal.\nHe struck the firstborn of the Egyptians.\nHis love is eternal.\nand brought Israel out from among them\nHis love is eternal.\nwith a strong hand and outstretched arm.\nHis love is eternal.\nHe divided the Red Sea\nHis love is eternal.\nand led Israel through,\nHis love is eternal.\nbut hurled Pharaoh and his army into the Red Sea.\nHis love is eternal.\nHe led His people in the wilderness.\nHis love is eternal.\nHe struck down great kings.\nHis love is eternal.\nand slaughtered famous kings—\nHis love is eternal.\nSihon king of the Amorites.\nHis love is eternal.\nand Og king of Bashan—\nHis love is eternal.\nand gave their land as an inheritance,\nHis love is eternal.\nan inheritance to Israel His servant.\nHis love is eternal.\nHe remembered us in our humiliation.\nHis love is eternal.\nand rescued us from our foes.\nHis love is eternal.\nHe gives food to every creature.\nHis love is eternal.\nGive thanks to the God of heaven!\nHis love is eternal.\nDig Deeper:\nHe alone does great wonders! Write your own “His love is eternal” psalm to God. List who God is and what He has done in your life. Make the details specific and personal. Let it be a song to Him.\nHe changes the seasons.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nHe ______________________.\nHis love is eternal.\nGive thanks to the God of Heaven!\nHis love is eternal.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram11.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Psalm 139:1-24",
    "devo_title": "You Hem Me In",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 139:1-24\nIn this 2-week reading plan, we are assuming a posture of thanksgiving before the Lord by meditating on ten Psalms of Gratitude. Rather than provide a written response to each Psalm, we have offered a simple yet meaningful activity designed to help us recall God’s mercies to us and through time. So grab a journal, and let’s create our own songs of thanksgiving to God. \nPsalm 139\nThe All-Knowing, Ever-Present God\nFor the choir director. A Davidic psalm.\nLord, You have searched me and known me.\nYou know when I sit down and when I stand up;\nYou understand my thoughts from far away.\nYou observe my travels and my rest;\nYou are aware of all my ways.\nBefore a word is on my tongue,\nYou know all about it, Lord.\nYou have encircled me;\nYou have placed Your hand on me.\nThis extraordinary knowledge is beyond me.\nIt is lofty; I am unable to reach it.\nWhere can I go to escape Your Spirit?\nWhere can I flee from Your presence?\nIf I go up to heaven, You are there;\nif I make my bed in Sheol, You are there.\nIf I live at the eastern horizon\nor settle at the western limits,\neven there Your hand will lead me;\nYour right hand will hold on to me.\nIf I say, “Surely the darkness will hide me,\nand the light around me will be night”—\neven the darkness is not dark to You.\nThe night shines like the day;\ndarkness and light are alike to You.\nFor it was You who created my inward parts;\nYou knit me together in my mother’s womb.\nI will praise You\nbecause I have been remarkably and wonderfully made.\nYour works are wonderful,\nand I know this very well.\nMy bones were not hidden from You\nwhen I was made in secret,\nwhen I was formed in the depths of the earth.\nYour eyes saw me when I was formless;\nall my days were written in Your book and planned\nbefore a single one of them began.\nGod, how difficult Your thoughts are\nfor me to comprehend;\nhow vast their sum is!\nIf I counted them,\nthey would outnumber the grains of sand;\nwhen I wake up, I am still with You.\nGod, if only You would kill the wicked—\nyou bloodthirsty men, stay away from me—\nwho invoke You deceitfully.\nYour enemies swear by You falsely.\nLord, don’t I hate those who hate You,\nand detest those who rebel against You?\nI hate them with extreme hatred;\nI consider them my enemies.\nSearch me, God, and know my heart;\ntest me and know my concerns.\nSee if there is any offensive way in me;\nlead me in the everlasting way.\nDig Deeper:\nWhat a privilege to know the God who knows us! Use the questions below to meditate on Psalm 139, giving thanks for the Almighty God who knows His children through and through.\n1. How does God know us? (verses 1-6)\n2. How does God go with us? (verses 7-12)\n3. How does God create us? (verses 13-16)\n4. Does God’s knowledge of us require any action on our part? (verses 17-24)\n5. What does this teach me about the character of God?\n6. Notice how verse 23 parallels verse 1. Why does David ask God to do what he knows God has already done?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram12.jpg"
},
{
    "book_title": "Psalms of Gratitude",
    "devo_passages": "Revelation 7:12",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nText: Revelation 7:12\nAs we wrap up this time of thanksgiving to the Lord by reflecting on Psalms of Gratitude from His Word, let’s spend today meditating on this powerful verse from the book of Revelation. \nMay our prayers of thanks to God bring Him blessing and glory and honor forever and ever. Amen. \nAmen! Blessing and glory and wisdom\nand thanksgiving and honor\nand power and strength\nbe to our God forever and ever. Amen.\n-Revelation 7:12\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/SRT-POG-instagram13.jpg"
}
]