[
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 1:1-2, Romans 1:7, 2 Corinthians 1:1, 1 John 3:1-2",
        "devo_title": "Greetings To The Saints at Colossae",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Colossians 1:1-2, Romans 1:7, 2 Corinthians 1:1, 1 John 3:1-2\nThere’s a monster in my closet named Anxiety. He’s been hanging around for about five years now, long enough that his presence no longer surprises me but not quite long enough for me to predict exactly when he’ll burst out the door, let alone what it will take to put him back in.\nHe appeared a few days ago when my husband and I were talking about a big, vague possibility that tore my stomach in knots for reasons I couldn’t quite identify. Anxiety kicked open the closet door and came out roaring, taunting me and tossing out lies faster than I could dodge them. My husband started taking aim at those lie grenades, knocking them out of the sky, one by one. He told me true things until I started to hear them, and eventually, Anxiety went sulking back to his closet and closed the door, defeated.\nLies are toxic. The only sure antidote is Truth.\nThe people in the newly-founded church at Colossae were under fire. They were a Christ-believing, gospel-professing people in a world that refuted the basic tenets of their faith. They worshipped God in a society that worshipped angels; they believed Jesus was the Son of God in a culture that believed all flesh and matter were evil. In the midst of a lie-shouting world, the church struggled to hold fast to faith and grow in the gospel. Sound familiar?\nPaul, from prison, put pen to paper to speak truth into the hearts and minds of this church family he had never met, but nevertheless held close at heart. His letter to the Colossian believers is a gospel antidote—an injection of truth to counter the heresy that confronted them.\nTo catch Paul’s vision and heart for this short, heartfelt letter, let’s take a moment to digest the opening verses:\n“To the saints in Christ at Colossae…”\nStraightaway, Paul identifies his audience, and boldly so. The word “saints” is no haphazardly applied label— this is gospel truth! The believers at Colossae were holy and set apart before God in Christ Jesus. (And friends, if we are in Christ, this bold label applies to us too! See Romans 8:16-17.)\n“…who are faithful brothers.”\nAs he often did, Paul used familial terms to reiterate his relationship to the men and women of the church, as well as their relationship to one another. The Body of Christ is created to live and serve with one another, modeling the gospel in how we love. [And don’t let the “brothers” throw you; Paul may have addressed his letter to the men in the room, but his sentiments applied to the women too! Remember how he appealed to Euodia and Syntyche in his letter to the Philippians (Phil. 4:2-3)? Our brother Paul was mindful of his sisters. We are all one in Christ Jesus (Galatians 3:28).]\n“Grace to you…”\nIf anyone knows the boundlessness of grace, it was the apostle Paul (1 Timothy 1:15). Grace was the foundation of the Colossians’ faith—and it’s ours too. Paul consistently reminds us in his letters of this incredible truth: When it comes to grace, we can’t have too much, and we will always have enough.\n“…and peace from God our Father.”\nA prison cell is not the place you’d expect to find peace. Yet, Paul not only displayed peace, he prayed peace for his brothers and sisters. Paul knew the false teaching the Colossians were fighting, and he knew the fight was not easy. But he also knew where true peace comes from (John 14:27). As he begins this letter of bold truth and unabashed gospel teaching, Paul sends “peace from God our Father,” demonstrating his sincere love for his fellow believers.\nAs we prepare to read this letter together over the course of the next two weeks, let’s join Paul in pushing back the lies by giving thanks for what is true. Let’s give thanks to God for our fully undeserved, yet fully secure, standing in Christ Jesus, and for our place in this broad, beautiful family of faith. Let’s remember God’s grace, accepting a fresh dose of it anew and resting in the peace that is ours from God our Father.\nLet’s ask the Lord to prepare our hearts to hear the good news of the gospel once again. It is the truth that defeats all the lies, the only antidote for our ailing souls. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram1.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 1:3-14, Psalm 1:1-3, Matthew 24:14, Ephesians 1:7-8",
        "devo_title": "Walk Worthy",
        "devo_summary": "\nBY Missy Fuller\n\nMy obsession with lists runs deep. I’ve never understood how some of you can live without them. How do you keep track of all those to-dos? More importantly, how can you resist the satisfaction of making a list just to cross off all the things you’ve already accomplished?! It’s a mystery to me. \nLists give me a sense of structure and focus—a bit of clarity in an otherwise confusing and chaotic world. If you ask me, Paul was a list guy too. For starters, he lists all the reasons he and Timothy are thankful for the church in Colossae:\nThey had love for God’s people (v. 4).\nThey received the gospel (v. 4-5).\nThe gospel in them was bearing fruit in the world (v. 5).\nThey recognized God’s grace in the truth (v. 6).\nTalk about encouraging! Who doesn’t love a list like that?\nBut Paul’s list-making tendencies move on to an even more profound purpose: he sets the tone for the rest of his letter to the Colossians by spelling out his specific prayer for them as a church. Look at this brief but powerful list Paul prays for the Colossians in this short passage:\nThat they would grow in the knowledge of God (v. 10).\nThat they would endure by Christ’s power (v. 11).\nThat they would have patience by Christ’s strength (v. 11).\nThat they would give thanks to God the Father (v. 12).\nWhy does Paul ask these things for his brothers and sisters at Colossae? The answer is in verse 10: “so that you may walk worthy of the Lord, fully pleasing to Him.”\nWorthy. That’s a heavy word. I don’t know about you, but I have a difficult time seeing myself as worthy of lots of things, let alone the God of the universe. The harder I try to earn my worthiness, the more I seem to become aware of my shortcomings. When I rely on my own strength and strive to live worthy of my God, I fall flat on my face. Perhaps you, like me, see this calling from Paul in Colossians 1:10-12 and start looking for ways to check the boxes to worthiness. It’s difficult to turn our focus away from doing all the “right things” when it’s spelled out for us like this. It’s tangible, like our to-do lists, and we like to see our progress and accomplishments as we work through these things.\nBut there is only one thing that makes us worthy of the Lord: faith in Jesus. We can’t obey the call to walk worthy without remembering where our worthiness comes from.\nGalatians 3:13 promises this: “Christ redeemed us from the curse of the Law.” We no longer live under the checklist curse, having to follow every letter and check every box in order to please God. As we grow in our love for Him and our understanding of His love for us, our focus gradually shifts from our attempts at making ourselves worthy, to giving thanks for a Savior who has redeemed us and made us worthy.\nBefore we close our Bibles today, let’s look at one more list. In Colossians 1:12, Paul reminds us of the incredible blessings we have as followers of Christ:\nWe share in Christ’s inheritance.\nWe are rescued from darkness.\nWe are welcomed into Christ’s Kingdom.\nAnd we have received redemption from sin and death!\nNow, that is a list we can all get excited about. It is the list that has been fully checked off by Jesus on our behalf, and none of our shortcomings can subtract from it. May we cling to Him today, trusting that we are worthy because of His saving work in us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram2.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 1:15-23, 1 Corinthians 8:5-6, Jude 1:24-25",
        "devo_title": "Through Him and For Him",
        "devo_summary": "\nBY Debbie Eaton\n\nEvery Tuesday I meet my mentor for a walk in the woods, where a dry dirt path meanders through pine and California oak trees. Wild flowers change with the season and dry shrubbery reminds us of the drought. The path takes us to a picnic bench with a stunning backdrop of the Cleveland National Forest, majestic mountains reaching to the sky. \nThere we sit for an hour, in deep conversation about God. Recently our dialogue was directed by this multi-part question: Who do you believe God is? Who or what has influenced that belief? Is that belief true?\nIn all honesty, our conversation made me realize how easy it is to be influenced by the world’s view of God. Culture can all too easily distract and misguide us unless we know, really know, who God is by reading His Word and believing its truth (Colossians 2:7).\nPaul knew well the need to understand the truth of who Christ is, and he emphasized this vital truth as he evangelized and ministered the good news of redemption to others. At the time of this particular writing Paul was in prison, likely in Rome. A man named Epaphras, who is believed to be the founder and leader of the Colossian church, visited Paul and requested his help in dealing with the false teaching confronting the church. Having never been to Colossae himself, Paul wrote this compelling letter. It includes, in verses 15-20, a hymn thought to have been sung by the very early church—a statement of faith exalting the supremacy of Christ in both creation and redemption.\nAccording to God’s Word—and this old hymn of the church as “sung” here by Paul— this is who Christ is:\nHe is the image of the invisible God.\nHe is the firstborn over all creation.\nHe is the creator of everything in heaven and on earth.\nHe is before all things.\nHe is the One who holds all things together.\nHe is the head of the church.\nHe is the beginning.\nHe is the One in whom all the fullness of God dwells.\nHe is the reconciler of all things.\nHe is the ultimate peacemaker.\nTake a moment to soak in these words today. Go back and read Colossians 1:15-20, and give thanks for a Savior who is indeed all these incredible things. Read these verses silently, shout them aloud, or even sing them with joy! Ask God for fresh eyes to see the divine nature of Christ.\nHe is the one who created you and called you, who holds all things together even now, even today. He is the beginning and the end. He is the loving God who took on flesh and made peace with His children through the blood of His cross.\nPaul’s hymn of adoration is a reminder for us today that Christ is alive! He is alive and present in our world, in our community, and in us, that we may be rescued, redeemed, and resurrected in new life. Who Christ is does not change, no matter the view from where we sit today. May these beautiful words from Paul’s letter direct our hearts to worship Him.\n…yet for us there is one God, the Father.\nAll things are from Him,\nand we exist for Him.\nAnd there is one Lord, Jesus Christ.\nAll things are through Him,\nand we exist through Him.\n-1 Corinthians 8:6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram3.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 1:24-2:7, 2 Timothy 1:8-10, 1 Corinthians 15:10, Isaiah 11:1-2",
        "devo_title": "A Holy Calling",
        "devo_summary": "\nBY Vivian Mabuni\n\nSituated right near the bathroom, our side of the dorm floor drew high traffic. The sound of laughter competed with the high whizzing of the blow dryers. Bits of conversation could be overheard each time the door squeaked open. Constant commotion filled the halls, day and night.\nThis particular Friday afternoon an abnormal hush permeated the hallways. My roommate, like the rest of the girls on the floor, had left for the weekend. My door was left open out of habit. I paced back and forth inside the room, talking under my breath, and glanced up from my notes when I heard a knock. Kimberly, from down the hall, popped her head in and asked, “Hey! What are you doing?”\n“Oh, I’m just practicing for a talk I’m giving tomorrow on training people how to communicate about their relationship with God. Wanna listen and give me some feedback?”\nI tried not to look surprised when she nodded and plopped down on my bed. I invited all the girls on my floor to our dorm Bible study every week, but Kimberly never showed interest.\nI was just a young college girl, still learning the depth of the gospel, but even then I knew I played a part in a holy calling: “to make God’s message fully known” (Colossians 1:25).\nAs I went through the presentation, Kimberly smiled and nodded, playing the part of supportive, interested listener. I finally reached the part explaining two circle diagrams. One circle had Christ on the throne inside the life and self surrendered to Christ. The other had self on the throne and Christ outside the life.\n“Which circle best represents your life, Kimberly?” She pointed to the circle with Christ outside.\n“Which circle would you like to represent your life?” She pointed to the circle with Christ on the throne.\nAt that point I put down my notes. “Kimberly, really, you’ve been so great listening and paying attention and all. You don’t need to pretend about the circles.”\nBut Kimberly wasn’t pretending. She wanted to know Christ, and I had the joy of introducing her to Him. We talked for a bit more and then, with tears in both our eyes, we prayed together as she surrendered her life to Jesus and joined God’s family. And the hallways around the dorm floor filled with angels celebrating new life (Luke 15:10)!\nLike Paul, our holy calling is to make the gospel known wherever we are, to proclaim Jesus—not empty doctrine, not some moral or ethical code (Colossians 1:28, 1 Corinthians 2:2). Paul’s letter to the Colossian Christians is infused with rich language focused solely on the person and work of Jesus Christ. Note how many times “in Christ” occurs in today’s reading. In Him are hidden all the treasures of wisdom and knowledge (v. 2:3). We are to walk in Him (v. 2:6), be rooted and built up in Him (v. 2:7). The focus and source of life is found in Jesus.\nAs believers, new and seasoned alike, we have the privilege of proclaiming Christ to those around us, to help them grow in their understanding of Him. Whether the dorm floor or workplace, neighborhood or soccer field, we are placed there by God to point others to Him (Acts 17:26)! He is our holy calling.\n\nMay we faithfully proclaim Him, so that others might see Christ in us, “the hope of glory” (Colossians 1:27).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram4.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 2:8-15, Matthew 15:1-9, Romans 7:4",
        "devo_title": "He Made You Alive",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Colossians 2:8-15, Matthew 15:1-9, Romans 7:4\nHave you ever seen a throw pillow with something like “sticky baseboards and messy laundry means you really love your family” embroidered on it? That kind of talk really burns my buttons. I like to think there is a direct correlation between clean floors and a well-loved family. I feel this so strongly, I have tried to enforce daily cleaning chores. \nEVERYONE MUST CLEAN, I declare, and start drilling my six-year-olds on sanitation protocols and urging my four-year-old to truly attend to the crumbs under the chair legs. By the time the house is clean, my oldest is a griefy mess and my long-suffering husband wishes I could have just let well enough alone. I am a ridiculous Faires-Pharisee about the whole thing. (My last name is Faires. Sometimes the pun is a little too close for comfort.)\nWhen all is said and done, my house is very clean, doggone it. But my people are all wilted and miserable. In my passion to love my family by working together and making our home clean, I can totally miss the point of loving my family. I get all turned around and fixated on the sticky floors and the messy laundry instead of the people. Clean floors are so awesome, but in getting there, I lose sight of why we clean floors in the first place—for people.\nThe folks in Colossae were missing the point too. It’s so easy to do. They were fixated on checking off their boxes on their salvation to-do list. Those guys couldn’t let go of their idea of how salvation ought to be achieved—through the law. So instead of looking up from their busy law-attending to see the true freedom given through Christ, they created more and more rules for themselves.\nThe Colossians believed their salvation was incomplete without a little extra action on their part. In effect, they were saying, Christ did a great job and all, sure, but we still need to hustle and bustle to complete the salvation package. But this is not only exhausting, it’s heresy (Galatians 2:16).\nPaul said we are complete in Christ. Christ erased the certificate of debt (Colossians 2:14). We can’t erase our own debt, but Christ wiped away everyone’s outstanding balance in one fell stroke. We couldn’t pay our own debt because we were dead in our trespasses.\nWe can’t climb out of our own graves by trying really hard—we are dead. Jesus quotes the prophet Isaiah in Matthew 15:8 when he reminds us:\n“These people honor Me with their lips, but their heart is far from Me. They worship Me in vain, teaching as doctrines the commands of men.”\nWhat simultaneous censure and freedom is found in these words! Don’t worry, Christ has already fulfilled the law for you. So keep your britches on and don’t go out and create your own pseudo rules for salvation.\nTherefore, my brothers, you also were put to death in relation to the law through the crucified body of the Messiah, so that you may belong to another—to Him who was raised from the dead—that we may bear fruit for God.\n– Romans 7:4\nGimme that embroidered on a pillow!\n \n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram5.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 2:6-7",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nWe can all use a grace day, can’t we? Take this day as an opportunity to catch up, pray, and just rest in the presence of the Lord. Pray the scripture below for a specific woman in your life and for yourself.\nTherefore, as you have received Christ Jesus the Lord, walk in Him, rooted and built up in Him and established in the faith, just as you were taught, overflowing with gratitude.\n-Colossians 2:6-7\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram6.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 1:17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a powerful reminder of God’s sovereignty:\nHe is before all things, and by Him all things hold together. \n-Colossians 1:17\n\nWrite this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/4-Colossians-1-17.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 2:16-23, Romans 14:1-23, Hebrews 8:1-6, Hebrews 10:1-10",
        "devo_title": "Shadow vs. Substance",
        "devo_summary": "\nBY Sarah Matheny\n\nText: Colossians 2:16-23, Romans 14:1-23, Hebrews 8:1-6, Hebrews 10:1-10\nI’ve heard it takes 21 days to make a new habit stick. In theory, after three weeks of going through the paces, whatever habit you’re trying to adopt will finally stick. The shadow of who you want to be, in 21 days, will have been fully eclipsed by a new, truer you—a sugar quitter, a regular exerciser, or one of those responsible individuals who skips the Netflix binge-watching and goes to bed early. In theory.\nThe tricky part—which anyone attempting such goals will tell you—is getting through those 21 days without quitting. Keep in mind, this is coming from the woman who has twice caved during 30-day sugar detoxes to cookie dough ice cream and peanut butter cups (days 8 and 11, respectively).\nIn an effort to maintain consistency, we easily-tempted humans utilize all sorts of “self-help” tools of various rules and rituals, not to mention accountability via hashtags online, social media check-ins, wellness apps, and maybe even real live community groups. While these things can be useful in getting us closer to our goal, we also run the risk of making them our sole and supreme focus.\n\nThough Paul certainly isn’t referring to quitting sugar in these words to the Colossians, he is speaking to the danger of being so lost in religion and ritual and how-tos that we never truly taste the goodness of God. He is preaching against asceticism, a severe, man-imposed self-discipline that serves as self-serving checkmarks rather than true submission to God (Colossians 2:22-23).\nPaul feared Christians in Colossae were becoming more occupied with these acts of “merit” than with the living Christ Himself.\nFriends, don’t we do our own version of these empty acts today? Take my daughter, for example, making “breakfast” in her play kitchen and then gnawing on a plastic waffle. Are we tasting the real thing or just going through the paces? Are we doing spiritual things because they’re “good,” or are we doing them out of love for Christ?\nThese “virtuous” disciplines, as Paul writes, are simply a shadow. The substance is Jesus (Colossians 2:7). When we buy into these practices apart from the person of Christ, we undervalue God’s grace, presuming that He needs our righteousness. He doesn’t. Christ is perfectly righteous, and we can only find our fullness in Him. In love, He calls us to live in a way that is good and holy and right—not out of fear of losing our salvation, but out of our adoration of Him.  \n\nA full life in Jesus doesn’t mean 21 days of going through the paces, making a prideful display of spiritual acts we think will make us more holy. We can’t be satisfied with the shadow, not when we have the Savior. The gospel offers real fullness in Christ, freely given. And believe me, friends, nothing tastes sweeter (Psalm 119:103-104).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram8.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 3:1-17, John 11:25, Philippians 3:12-16, Romans 6:1-14",
        "devo_title": "The Christian Life",
        "devo_summary": "\nBY Ellie Holcomb\n\nText:  Colossians 3:1-17, John 11:25, Philippians 3:12-16, Romans 6:1-14\nTruth? I’m sitting in my bedroom writing this morning, and it looks like a bomb went off in here. I have yet to unpack from three different trips we’ve taken this month, the laundry basket was long ago lost under the mountain of dirty clothes that have piled up, and my desk is littered with mail I haven’t read, invitations I haven’t RSVP’d to, and about 30-50 post-it notes my two- year-old drew on yesterday while she was “working.”\nThe state of my bedroom matches the state of my heart. It’s a mess in there. I’m looking at a “to-do” list of things left undone and the mess around me, and all the lies are coming. “You are terrible at life. You’re worthless. You can’t get anything right.” I feel stressed, anxious, overwhelmed, and sleep-deprived, and looking at the state of my heart and my bedroom makes my shoulders tight. I am also grieving some brokenness in the lives of dear friends, and the weight of it all feels like too much this morning.\nWhen I’m overwhelmed like this, I revert back to my old friends Shame and Fear, and the company they keep with me is terrible. But then I read this:\nSet your minds on what is above, not on what is on the earth.\n– Colossians 3:2\nAnd I’m reminded of something my pastor told us a few years ago: “For every look you take at yourself, take ten looks at Jesus.”\nI remember practicing this years ago with our small group. We would sit around and share what life was throwing at us, and for each struggle, we would move our eyes together from the trial to the cross—to the promises God has given and the life He’s called us to live. The practice was and is transformative.\nThis morning, as I turn my mind from the mess both around and inside of me to the face of Jesus, something is shifting. I’m remembering His love and how He covers me even when I make a mess of things (Colossians 3:3). I’m remembering that He is a God who is not afraid of our messes but who enters right into the middle of them.\nI’m remembering that I am no longer a slave to sin (Romans 6:6), and that He’s called me to something better. I may struggle with the same junk over and over again, but each time I struggle is an opportunity to draw near to Jesus. Each struggle is an opportunity to put off the old self and take hold of that which Jesus has already taken hold of for me (Colossians 3:5-11, Philippians 3:12).\nToday I’m sitting here in this room, remembering that you and I have a beautiful invitation to a new life in Christ. As we put off all our sin, we get to put on His love—and His love looks good on everybody (Colossians 3:12-14)! I’m remembering that I get to choose how I think. I can choose to let the “peace of the Messiah” control my heart rather than fear and shame. And I can choose to be thankful, even when life breaks my heart and doesn’t turn out like I wish it would. In light of what Jesus has done for all of us on the cross, there is always a reason for thanksgiving.\nMost of all, I’m remembering that I am “dearly loved,” and that changes everything (Colossians 3:12). So sisters, instead of just focusing on ourselves today—on what we’ve done or left undone, on how we ache, or on how we wish things were different than they are— let’s turn our eyes, over and over again, to the One who knows and loves us best.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram9.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 3:18-4:1, Matthew 6:33, Ephesians 5:22-6:9",
        "devo_title": "Whatever You Do",
        "devo_summary": "\nBY Guest Writer\n\nText: Colossians 3:18-4:1, Matthew 6:33, Ephesians 5:22-6:9\nIt’s been a rough week in the Bethke household.\nMy husband has had some extremely long work days, and we’ve hardly seen him. Then he got sick. Then I got sick. And now we’re packing to leave home for a month, baby girl in tow.\nI’m overwhelmed. I feel drained and in need of a break. And if I’m completely honest with you, which I’d like to be, today I have had a terrible attitude. The inside of my heart looks a little like this:\nBut I’m exhausted too! Can’t I have a nap? Can’t someone make ME soup? I know somebody has to keep the ship sailing, but why does it always have to be meeeee?\nTerrible, right?!\nBut, do you know what? God knows my heart, even on my terrible days. He knows your heart too. And He knows relationships are messy because, the fact is, we’re messy. And so, through Paul’s letter, the Father gently lays out Colossians 3 for us, telling us what actions to put off and what actions to put on. Then, in Colossians 3:18-4:1, Paul gets into the nitty gritty of certain relationships. Husbands and wives. Parents and children. Masters and slaves. (We get the distinct sense this list of two-party relationships could go on.)\nHe sums up these diverse relationships with this:\nWhatever you do, work heartily, as for the Lord and not for men, knowing that from the Lord you will receive the inheritance as your reward. You are serving the Lord Christ.\n-Colossians 3:23-24\nRelationships can be tough for everyone. We feel forgotten, misunderstood, and underappreciated. We try hard to please and we get caught up in comparisons. We can feel brought down, discouraged, frustrated, angry—we can feel a lot of things.\nBut in the quiet, the Lord whispers to us, My child, I know you. And I love you. Do all that you do, FOR ME (Psalm 139:1, Romans 8:38-39, Colossians 3:23).\nWhen we take our eye off Jesus, we put them onto ourselves and those around us. But true love, hope, and joy don’t come from ourselves or others—they come from our Savior! We can find joy in difficult moments, relationships, and circumstances because God is the only One we need to please, and we can rest in His unending love and grace. We don’t have to earn His love; He freely is pouring it out on us every moment of every day (Romans 5:5).\nMy friend, you are not forgotten. You are seen (Psalm 139:2).\nYou are not underappreciated. You are greatly rejoiced over (Zephaniah 3:17).\nYou are understood. God made you who you are (Psalm 139:13-14).\nThe gospel should be the fuel of all our relationships, in the joyful moments and the tough moments. The messy moments will happen but, like us, they are not beyond Christ’s redemptive reach. When we keep our eyes on Jesus— remembering that He is the one we serve when we love others— the perspective and attitudes of our hearts will be laced with the grace of Christ.\nMay we do all things for Him and for Him alone.\n“But seek first the kingdom of God and His righteousness, and all these things will be provided for you.”\n-Matthew 6:33\n \nAlyssa Joy Bethke is a lover of people, adventure, sunshine, and coffee. Wife to her best friend— author, speaker, and spoken word artist Jefferson Bethke— and mom to their sweet baby girl Kinsley, Alyssa serves alongside her husband to share the message of God’s lavish grace. Alyssa is the author of Spoken For: Embracing Who You Are and Whose You Are.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram10.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 4:2-6, Psalm 145:18-19, Philippians 4:6-7, Matthew 5:16",
        "devo_title": "Seasoned With Salt",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Colossians 4:2-6, Psalm 145:18-19, Philippians 4:6-7, Matthew 5:16\nIf you want to experience heartache and hope in the same breath, read the “Missed Connections” section of Craigslist.\nThis regret-ridden virtual message board, similar to a milk carton ad for “missing persons,” contains the pleas of locals who cannot shake the weight of a missed opportunity. They lay awake at night, deciding that if different words (or words at all, for that matter) had been spoken to the girl across the room or the boy at the bus stop, they would be together frolicking in daffodils, tasting wedding cakes, or binge-watching Netflix. (A girl can dream, right?)\nA few years ago, I might have been tempted to post my own message to that guy across the crowded room:\nTo the boy in my favorite coffee shop who asked if I was a football fan,\nI said no because I was trying to play it cool. I’ve never missed a game.\nAlso, I just found out you happen to be our new quarterback. Let’s get married.\nIt’s just so embarrassing to feel misunderstood, isn’t it? But even worse, we can’t leave it alone. Our unquenchable need to be seen and heard curls its fists, marching backward and demanding another chance to be acknowledged. Vowing to only curate attractive qualities and pleasing viewpoints from then on, we rest assured people will treasure our perspectives forever. They don’t.\nAnd yet it is our clumsy, shaky voices that are chosen to communicate something so precious: the gospel. This call is so high and so important that I immediately fear it. If my words are jumbled and my speech begins to stutter, can I cause someone to bypass an encounter with Christ?\nAs Paul wraps up his letter to the Colossians, he addresses these concerns, advising them to “act wisely toward outsiders, making the most of the time” (Colossians 4:5). He continues, “Your speech should always be gracious, seasoned with salt, so that you may know how you should answer each person” (Colossians 4:6).\nBefore our insecurities rise again, let’s focus in on the interesting way Paul uses the word “salt” here, because it changes everything. Friends, he’s talking about grace! Our job is simply to allow others to taste the salt of grace. We are side-by-side consumers of God’s provision, sharing plates with those around us.\nSalt causes thirst. God’s Word doesn’t need our PR efforts. Its mere mention causes sin to salivate for grace. Our job is not to concoct our own savory presentation of the gospel; every ingredient was chosen to feed our own innate hunger. Instead, our task is to speak words from our personal thirst, pointing to the source of Living Water (John 7:37-39).\nSalt is a preservative. Grace goes before and behind us, allowing even our faultiest efforts to proclaim His glory. Because of this, we don’t need to focus on results and reactions, but on the surety of God’s control. We can share generously and graciously from a sound-minded spirit.\nGod does not need us to share the good news, but He chooses us as His vessels of grace. As sharers of the gospel, our job description is less about defending our stance and more about gluing our eyes to His posture.\nMay the salt of grace season all of our encounters today, and may we be thankful for our God who never misses a connection. Amen. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram11.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 4:7-18, Romans 15:30-33, Philippians 1:3-7",
        "devo_title": "Final Greetings",
        "devo_summary": "\nBY Raechel Myers\n\nText: Colossians 4:7-18, Romans 15:30-33, Philippians 1:3-7\nI like to think of the final greetings in Paul’s letters as the “say hello to your mother for me” section. He opens with his typical “grace and peace,” follows with some thanksgiving and prayer, then gets down to business. By the end, he often zeroes in on some very specific housekeeping matters before he closes.\nHave you noticed this pattern, too?\n\nGrace & peace.\nI’m thankful for you. I pray for you.\nDo not forsake the true-true-true gospel.\nBut really, don’t forget what being a Christ follower means and what it doesn’t mean.\nBe good to each other.\nSay hi to so-and-so for me. (Or, put more accurately: When you bump into these people, listen to what they say and take care of them. Oh, and this person says hello!)\nAlso, this really is me sending this note. (Paul often dictated his letters, then signed them with his own hand at the end.)\n\nIt’s the housekeeping piece at the end that, though often overlooked, contains some of the most interesting little details of Paul’s letters. He’s naming names. Arranging meetings. Making sure people are looking out for each other. He’s caring for the church as a whole—the body of Christ.\nFor fun (and because there is always something to learn!), let’s take a closer look at the people Paul mentions. What is so important about these folks, anyway?\nTychicus was a native of Asia Minor who delivered this letter to Colossae, as well as the letter to the church in Ephesus and Paul’s personal letter to Philemon. (Isn’t it so cool that God used Tychicus as a courier for some of the most important mail in Christendom?)\nOnesimus may be my personal favorite. He was Philemon’s slave, but when he escaped to Rome he met Paul and then Jesus. (The book of Philemon is a super-quick, super-compelling letter from Paul to Philemon, calling in a big favor: he asks Philemon to take Onesimus back, not as a slave, but as a brother in Christ.)\nAristarchus was from Thessalonica. He joined Paul on his journey and gave his life and freedom so that others may know Christ.\nMark actually had a bit of a reputation because he bailed on Paul early on, which caused a falling out between Paul and Barnabas (Acts 13:13, 15:39). As Mark matured spiritually, he returned to work alongside Paul, who instructed the church to welcome Mark back.\nEpaphras was from Colossae, too. Colossians 4:12 says he “contended” for the Church in his prayers. The Greek word for “contend” here means “to fight for.” (Isn’t it good to remember that one of the best ways we can fight for Christ’s church is by praying for her?)\nLuke was, of course, the author of the Gospel that bears his name, as well as the book of Acts. It seems Luke stayed with Paul throughout his imprisonment, aiding in the ministry of the gospel.\nDemas has sort of a bummer of a story. He deserted Paul because “he loved this present world” (2 Timothy 4:10). (Man, I hate how painfully close-to-home Demas’ two-second story feels.)\nNympha was a Christian woman who had a lot of money and hosted the church in her home. She gave what she had for the gospel.\nFinally, Paul charges Archippus (possibly the son of Philemon) to pay attention to the ministry he has received in the Lord, so that he may accomplish it (Colossians 4:17).\nYou guys. That is a lot of people. None of them were perfect, yet Paul intentionally and affectionately included them by name in his letter. Among this web of individuals and cities, there was a lot of brokenness, disappointment, and even betrayal.\nDoes it help you to see that the church then looked a lot like the church does today? It was full of flawed people who needed to forgive and be forgiven. They forgot the true gospel was for them and for each other. There was real hurt and genuine restoration.\nAs we close out this series of letters from Paul to the early church, let’s pay attention to how wildly relevant even his final greetings are to us as the church today.\nRestoration among believers is still possible.\nFighting for the church sometimes just means praying for her.\nThe temptation to love this present world isn’t a new one.\nAnd best of all? The truth of the gospel hasn’t budged one bit.\nIt was true for Paul and his friends then. And it is true for you and for me today. Thanks be to God!\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/srt-colossians_dayimage111-100x100-c-center.jpeg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Philippians 1:3-6",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nText: Philippians 1:3-6\nWe can all use a grace day, can’t we? Take this day as an opportunity to catch up, pray, and just rest in the presence of the Lord. Pray the scripture below for a specific woman in your life and for yourself.\nI give thanks to my God for every remembrance of you, always praying with joy for all of you in my every prayer, because of your partnership in the gospel from the first day until now. I am sure of this, that He who started a good work in you will carry it on to completion until the day of Christ Jesus.\n-Philippians 1:3-6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/SRT-Colossians-instagram13.jpg"
    },
    {
        "book_title": "Colossians",
        "devo_passages": "Colossians 3:12",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nText: Colossians 3:12\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a reminder to put on the garments of Christ:\nTherefore, as God’s chosen people, holy and dearly loved, clothe yourselves with compassion, kindness, humility, gentleness and patience.\n-Colossians 3:12\n\nWrite this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/10/4-Colossians-3-12.jpg"
    }
]