[
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 1:1-14, 2 Samuel 7:12-15, John 1:1-5, 2 Corinthians 4:4-6",
        "devo_title": "The Nature of the Son",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Hebrews 1:1-14, 2 Samuel 7:12-15, John 1:1-5, 2 Corinthians 4:4-6\nHave you ever tried to understand something completely new? As a senior in college I enrolled in a sculpture class—while majoring in German. I understand words, but I do not understand shapes. Trying to sculpt a three-dimensional representation of the human head turned out to be the only collegiate task that could reliably make me cry. I could not comprehend how to shape the turn of a lip or the curve of a nose. The rest of the class would talk about differing angles or closing one eye while looking at the model, but it was an impenetrable mystery to me.\nThe writer of Hebrews is trying to explain something completely different to an audience of Jewish Christians who were already being persecuted for their faith. Though they were believers, the concept of Jesus as Messiah was something would have been difficult to imagine until about 70 years prior, when Jesus was born. Some knew He was the Savior, although what that meant to them varied and was still largely misunderstood. The author is still trying to introduce us to this nearly incomprehensible concept: the God-Man. Without talking down to the reader, he explains clearly, from the very beginning, the nature of this strange and wonderful person who is both God and man.\nIn the first chapter of Hebrews, the writer essentially asks the question, What is the nature of the Son? and what’s more, Why does the nature of the Son matter? \nFirst, the Son replaces the prophets and fulfills their prophecies. He is both the radiance of God’s glory and the exact expression of God’s nature. Worthy of all worship, He is superior to the angels and remains the same forever (Hebrews 1:3–11). Indeed, God “has spoken to us by his Son” and “has appointed him heir of all things and made the universe through him” (vv.1–2). \nHow awesome is Christ, the Son! And yet this very Christ, the creator and sustainer of the world, is also the One who purifies us from our sin by His own sacrifice. He speaks directly to us and acts on our behalf—the same God whom all the fiery angels serve! Both the new covenant and the eternal priesthood of Christ are the unfathomable gift of God to a sinful people in need of a Savior.\nWithout Christ there is an overwhelming barrier between us and God, between our sinfulness and His holiness. But in Christ we find an even more overwhelming answer. We cannot comprehend the greatness of His glory or the awesomeness of His majesty, yet in Christ we are made daughters and heirs of His kingdom, having been washed clean by His blood.\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day1-1.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 2:1-9, Psalm 8:1-9, 1 Corinthians 15:50-57",
        "devo_title": "Jesus and Humanity",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 2:1-9, Psalm 8:1-9, 1 Corinthians 15:50-57\nConjunction junction, what’s your function? \nHooking up words and phrases and clauses… \nThere is a real chance that the beloved Schoolhouse Rock song will now be stuck in your head all day, or if you’re lucky, maybe it won’t. But today’s passage in Hebrews starts with a verse containing the conjunctive adverb, “therefore” (the CSB translates it “for this reason”), so a little grammar ditty may help remind us what exactly a conjunction is and, well, how it functions. \nLike a regular conjunction (such as “and” or “but”), a conjunctive adverb connects two words or clauses; however, it also shows the relationship between two ideas. Therefore, the author of Hebrews must be trying to draw a connection for us between two related thoughts. While we can assume the writer didn’t set out to begin the chapter this way (chapters weren’t added to the Bible until the 1200s), we can look back to the preceding chapter to see what the first idea is.\nIn chapter 1, the author establishes that Jesus is the Son of God, and that He is superior to the angels in authority, as Creator, and in His role as the author of our salvation. In chapter 2, we read that because Jesus is superior to the angels, believers should hold tight to their belief in Him (v.1). That while He is superior to everything and everyone we could ever imagine, He is also the God who remembers us and cares for us (v.6). \nAt the time of this letter, the original audience of Hebrews was in danger of walking away from their faith. They were persecuted, misunderstood, and targeted for their belief in Jesus Christ. And so the author is writing a book-long defense of believing in Jesus, beginning with this one conjunctive adverb: therefore or\nbecause.\nBecause Jesus is superior to the angels…\nBecause His gospel is better than the Law given to Moses…\nBecause Jesus is co-equal with God, but also because He became fully man…\nBecause of His signs and wonders and miracles…\nBecause everything is subjected under His feet…\nBecause of His suffering and death—\nListen! Don’t drift away. \nThe temptation to drift away was not just a concern for this audience of Jewish Christians; it is real for all of us, all of the time. From the ancient believers who found themselves facing death or being treated as outcasts because of their faith, to modern-day believers like us who struggle to believe for a myriad reasons, this passage in Hebrews reminds us that our faith is anchored in the person and work of Jesus. \nAll of Hebrews sings this song: Jesus is who He said He was, and He is who God promised He would be. Therefore, we believe.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing, and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day2.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 2:10-18, Hebrews 3:1-6, Genesis 12:1-3, Acts 10:34-43",
        "devo_title": "Greater than Moses",
        "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Hebrews 2:10-18, Hebrews 3:1-6, Genesis 12:1-3, Acts 10:34-43\nI fell in love with our old farmhouse before I knew I already loved its builder. We’d just made an offer on the place and were giving my husband’s family a tour when his grandpa (affectionately known to us as Papaw) said, “I remember when I built this house.” \nWe bumped into each other at the base of our oak staircase banister as if someone had just pulled an invisible emergency break, bringing the tour to an abrupt stop.\n“You built this house?” we asked, astounded. \nOur home was built long before either of us was born. Papaw was a much younger man then, running his own contractor business. We’d picked out our house online and made an offer on the spot without even considering who had laid the foundation so many years before. The idea that we had chosen a home carefully constructed by a man who chose to love us was a precious dose of unexpected grace.  \nPapaw is gone now and we are blessed to remember him every time we run our hands down the banister he installed, shuffle our socked feet across the hardwood floors he laid, or gaze out the large picture window he set into place. Our house is more sacred to us because of whose hands swung the hammer that put it together. \nIn today’s passages, the writer of Hebrews is asking his readers to lift their eyes off of Moses and onto the Greater One. We might not fixate so much on the greatness of Moses these days, but we do tend to treasure the wrong prize. A cosmic shift occurs in our souls when we acknowledge that everything we love and treasure ultimately belongs to God. It all matters because He matters so much. “Now every house is built by someone, but the one who built everything is God” (Hebrews 3:4). \nThis circles back and underscores a thought from the second chapter of Hebrews. We find it sandwiched between two commas, yet it deserves its own exclamation point: “For it was fitting that he, for whom and by whom all things exist, is bringing so many sons to glory…” (v.10). \nWe hear it in the words of Colossians 1: “For everything was created by him, in heaven and on earth, the visible and the invisible, whether thrones or dominions or rulers or authorities—all things have been created through him and for him” (v.16). \nAnd we see it again in the first chapter of John’s Gospel. It reads: “All things were created through him, and apart from him not one thing was created that has been created” (v.3). \nIt’s tempting to think we’re the ones buildings something here: We’re building a family. We’re building a career. We’re building a home. But all of these things are God’s handiwork; they are already His. He crafted it long ago—every beam, every person, every bloom. \nJust like the Hebrews, we tend to elevate the message over the Messiah, the prophet over the High Priest, the creation above the Creator. But Scripture pulls an invisible emergency break on this tour of our pride. How much better it is to trust in the Builder than in the building (Hebrews 2:13). Our lives become more precious and our hands more open when we acknowledge that it’s all His—made by Him and for Him, and given to us to enjoy as His beloved children. \n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day3.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 3:7-19, John 3:16-21, Romans 11:1-6",
        "devo_title": "Warning Against Unbelief",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Hebrews 3:7-19, John 3:16-21, Romans 11:1-6\nHands down, my favorite day of the year during elementary school was field day. On field day, each class wore matching t-shirts and competed in outdoor events like the 100-yard dash, Red Rover, and the ultimate team challenge: tug-of-war.\nI always felt a rush of nerves as my class stepped up to the rope to compete against the other classes in our grade. I was tall and lanky, not the strongest kid, but I knew none of that mattered in tug-of-war, because it took everyone’s strength to win, not just mine. And when I got tired, I could loosen my grip knowing my classmates would pick up the slack.\nOur passage today points to this type of teamwork—not in the context of field day, of course, but in the context of faith and the community effort it so often requires.\nWe can assume some individuals from the community addressed in Hebrews had been loosening their grip on their faith, swaying toward unbelief, the type of unbelief that leads to rebellion against God. The writer warns, “Watch out, brothers and sisters, so that there won’t be in any of you an evil, unbelieving heart that turns away from the living God” (Hebrews 3:12).\nAs God’s people, we have a long history of this type of unbelief. From the Israelites wandering in the desert, to the early church addressed here in Hebrews, to Christians today—our tendency is to believe in ourselves and our own way over God and His. Fortunately, the writer of Hebrews provides a strategy to guard ourselves against unbelief: \n“But encourage each other daily, while it is still called today,\nso that none of you is hardened by sin’s deception” (v.13).\nIn other words, if you want to stay away from unbelief, stay together.\nThe more I walk this road of faith, the more I realize how corporate the practice of faith must be if we are going to maintain it. The very nature of our faith is communal. We serve a triune God who from the beginning has been committed to communing with us. So much so, that He came to be with us in human form through the person of Jesus Christ, who then died so that we might commune with God for eternity.\nWe are not meant to believe alone. I think this is why the writer of Hebrews so earnestly warns against unbelief, and then in the same breath reminds us to encourage one another. When I am on the brink of unbelief, it is always community that pulls me back to the truth of the gospel. If I’d had to face the other team alone, I surely would have abandoned the rope long ago. But knowing I have others there who have strength when I don’t has provided the encouragement I’ve needed to stay in the game.  \nThis is why I find this passage so hopeful. Just as much as it is a warning against unbelief, it is also a reminder that we don’t have to go up against unbelief alone. Because our Messiah is our companion, we have companionship with each other.\n\nAndrea Lucado is a freelance writer, Texas native, and the author of the memoir English Lessons: The Crooked Path of Growing Toward Faith. When she is not conducting interviews or writing stories, you can find Andrea laughing with friends at a coffee shop or creating yet another nearly edible baking creation in her kitchen. One of these days she’ll get the recipe right. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day4.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 4:1-13, Psalm 95:7-11, 1 Peter 1:3-5",
        "devo_title": "The Promised Rest",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 4:1-13, Psalm 95:7-11, 1 Peter 1:3-5\nThe promised rest.\nIn today’s busy culture, especially in the United States, that phrase seems too good to be true. I tend to crave rest in different ways, depending on the season I’m in. When I was in college, running myself ragged, I would have given anything for a quick cat nap during the day, but now I just long for a solid eight hours of sleep at night. \nThe kind of rest described in Hebrews chapter 4 is not the nap our bodies beg for after a busy day. God invited the Israelites into His rest, into the Sabbath, when they were wandering in the wilderness. However, they rebelled and did not enter into His rest because of their disobedient, discontented hearts. We are offered this same rest; it is promised to us because of Christ’s sacrifice on the cross. But the full Sabbath, the truest rest promised to us by God, will not occur until we are face to face with our Maker in eternity. \nIn the meantime, of course, God gives us a Sabbath each week—a day to rest, reconnect with God, and recenter our lives around Him. But if I’m honest, a real Sabbath feels unattainable to me today. Maybe the busyness our culture has come to call “normal” speaks to our true priorities. Or maybe we’re just looking at the Sabbath through the wrong lens. \nWhat if practicing the Sabbath includes sinking our teeth into the things that provide us with a taste of heaven? What if it’s savoring the morning light as it streams through our curtains, or relishing the feeling of propping our feet up on the coffee table after a long day of work? What if rest comes in cherishing moments of laughter and tears with the people around us who pull us closer to Jesus? What if we were to breathe all of this in as it happens, thanking God for these things in the moment, with the knowledge that our ultimate rest—our eternal salvation—is secure in Christ?\nThe true rest we long for will not fully come this side of heaven. The author of Hebrews tells us “a Sabbath rest remains for God’s people” (4:9). He encourages us to “make every effort to enter that rest” (v.11). The price has already been paid by Jesus. The “effort” we now make is to remain in Him as He remains in us (John 15:4). So we continue the work He’s given us to do, living in the tension that the kingdom of God is here and now, but also still to come and greater than we can imagine. We keep leaning in to God for strength as He builds His kingdom through us. And we find Sabbath rest where we are, in the presence of God Most High.\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of cozy sweaters, ugly dogs, and the Oxford comma. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day5.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "2 Corinthians 4:5–6",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor we are not proclaiming ourselves but Jesus Christ as Lord, and ourselves as your servants for Jesus’s sake. For God who said, “Let light shine out of darkness,” has shone in our hearts to give the light of the knowledge of God’s glory in the face of Jesus Christ.\n-2 Corinthians 4:5–6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day6.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 1:3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse about the relationship between God the Father and Jesus the Son. \nThe Son is the radiance of God’s glory and the exact expression of his nature, sustaining all things by his powerful word.\n-Hebrews 1:3\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/4-Hebrews-1.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 4:14-16, Hebrews 5:1-10, Psalm 110:1-7, Matthew 4:1-11",
        "devo_title": "Our Great High Priest",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 4:14-16, Hebrews 5:1-10, Psalm 110:1-7, Matthew 4:1-11\nI used to think I had to sacrifice a lot of things in order for God to love me. \nI have this vivid memory from my high school youth group. At one particular meeting, we listened to one of the “stars” of our youth group give a testimony about how he believed God was calling him to quit baseball and give all his time and energy to God. So he quit. His choice to make a big sacrifice was glorified and applauded. And I wondered, What is God calling me to sacrifice? What do I have to give up for Him to love me? What would be enough?\nOof.\nIt took me years to identify how traumatic that message was for me. Though I don’t aim to judge one person’s actions and how they follow the promptings of the Spirit, the glamorization of that choice was embedded in my mind. I lived in fear that if I didn’t sacrifice the things I loved to do or wear or make or buy, then I wasn’t doing enough for God. I thought He would punish me instead.\nAnd so I walked around afraid that God was going to take everything and everyone I loved away from me. I began to see my relationship with Him as a give-and-take where He only took, and I only gave. I didn’t know that is literally the opposite of what the Bible tells us.\nI didn’t understand that what I owe to God is more than I could ever give. I didn’t understand that “sacrificing” wouldn’t make me a better Christian. In fact, it wouldn’t make me a Christian at all. I didn’t understand that the debt I owe to God is because of my sin, and that Jesus is the only One who could pay it. Without Jesus, I was—and I am—helpless to stand before God.\nThe truth is God does require something for the payment of our sins, because His is a perfect justice. But thankfully, the balance of His mercy does not rest on me. It rests solely on Jesus, who “became the source of eternal salvation to all who obey him” (Hebrews 5:9).\nThe closing verse of Edward Mote’s classic hymn, “My Hope is Built on Nothing Less,” says: Oh, may I then in Him be found, / dressed in His righteousness alone, / faultless to stand before the throne. Today’s passage from Hebrews beckons us to do the same, to “approach the throne of grace with boldness, so that we may receive mercy and find grace to help us in time of need” (Hebrews 4:16).\nBoldness. Some translations say “with confidence,” which we have only in the security of Christ. We don’t have to approach the throne with fear, with everything we love bundled up to lay on an altar, thinking that what we have to offer is somehow going to be enough to pay for our sin—because it isn’t.\nOnly Jesus is enough.\nJesus is our Great High Priest (v.14). Traditionally, high priests would offer sacrifices to atone for the sins of the people and themselves, because they sinned too. But Jesus’s sinless perfection made His sacrifice the source of eternal salvation for everyone who would ever believe.\nThis is an eternal, unchanging truth: We are not enough. Only Christ’s righteousness allows us to approach God’s throne with confidence, to receive the grace and mercy He offers us. Thanks be to God!\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day8.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 5:11-14, Hebrews 6:1-12, Philippians 3:12-16, 1 Peter 2:1-3",
        "devo_title": "Warning Against Falling Away",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Hebrews 5:11-14, Hebrews 6:1-12, Philippians 3:12-16, 1 Peter 2:1-3\nI feel like I’m a great gal. I go to church (but only when all five of my kids aren’t sick). I read my Bible (unless I am very tired or very busy or extremely lazy). I pray (especially when I have lost my glasses). And I write about Scripture (because it’s my dream job and people pay me to do it). \nOkay, so I’m a great gal with some mixed motives. But here’s the trouble: It’s actually pretty possible to look like a believer, enjoy the fellowship of believers, and even do a lot of the right things externally, but still not touch the heart of the matter. It’s possible to do all of these things without maturing in the faith and truly knowing God. \nAll of these good works may make me think I’m a great gal. They can certainly look like the fruit of the gospel at work in my life. But Scripture tells us our works are dead when we depend on them for our salvation (Romans 3:27–4:5). The author of Hebrews is warning us to stop focusing on such “elementary teaching about Christ and go on to maturity” (Hebrews 6:1).\nNo matter how many orphanages you visit in Haiti, you cannot save yourself. No matter how many women you rescue out of slavery, you cannot rescue yourself. Christ alone saves us. His desire is that we grow in maturity by the Holy Spirit, working out our faith to full assurance, which is only found in Christ (v.11).\nIf we are keeping lists of our own merits, even if just in our heads and hearts, it is a real danger. We cannot work our way to righteousness. But the temptation to rely on our own merits is powerful. The Church is warned about this in no uncertain terms. If we seek after good works more than we desire Christ, we are in grave danger. Beware, lest we fall away and come short of salvation! Only Christ is sufficient to save.\nYet “God is not unjust; he will not forget [our] work and the love [we] demonstrated for his name by serving the saints—and by continuing to serve them” (v.10). When we look to Christ for our salvation, our humble doings flow from gratitude to the One who saves us. We love others because we imitate the One who is love (1 John 4:8). We serve because He is the servant of all. Our good works don’t earn our salvation; they are the result of our salvation, fruit born of the Holy Spirit at work in us (Galatians 5:22–23).\nLet us look beyond the work of our own hands and instead place our hope in Christ’s finished work on the cross. May we hear His call to daily repentance and obedience. And may our works flow out of total thankfulness to God, our Creator and Redeemer.\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day9.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 6:13-20, Hebrews 7:1-10, Genesis 22:15-18, Romans 8:28-30",
        "devo_title": "Inheriting the Promise",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Hebrews 6:13-20, Hebrews 7:1-10, Genesis 22:15-18, Romans 8:28-30\nI discovered my first gray hair this week. Being in my mid-twenties, I’ve always believed this event would unfold naturally and gracefully decades from now, like a badge of honor for a seasoned and experienced woman. It did not happen that way. However, as I sifted through my dark brown strands to find the one that wasn’t, I couldn’t help but think of my grandmother. I’ve never gotten through a conversation with someone who knew Polly without mention of her rare poise, cheeks full of laughter, and of course, her beautiful silver hair.\nThere are some things I inherited right away from my grandmother, like the pearl earrings she’d received on a special anniversary and the cooking tools that still smelled like her house. I inherited her love for music, the same knack for penmanship, and a preference for extra-sour lemonade. And then there are things I didn’t know I’d get from Polly, even after she was gone—things like her fountain pen, which my aunt gave me because I became a writer, and the aforementioned early appearance of gray hairs.\nThere’s something about an inheritance that roots you in a sense of belonging. Or in some cases, you find out there’s been a place for you all along. In Hebrews 6, we find that our inheritance is both current and eternal. It is everything we need, exactly what we’d hoped, and all we never thought to ask for.\nI love how thorough God is in His promises. It’s as if He takes joy in watching His children read His Word and learn His Will, savoring each gift along the way. Two big themes in the book of Hebrews are revelation and redemption, and God’s covenant with His people is what bridges the two.\n“Because God wanted to show his unchangeable purpose even more clearly to the heirs of the promise, he guaranteed it with an oath, so that through two unchangeable things, in which it is impossible for God to lie, we who have fled for refuge might have strong encouragement to seize the hope set before us” (Hebrews 6:17–18). Notice the two unchangeable things here: God’s promise and God’s oath. He wants to make doubly sure we know that our inheritance in Him is true.\nMaybe we don’t realize our inheritance through the way we age or through hand-me-downs in the cupboard, but just like He did for Abraham, God makes sure we know we’ve obtained the promise. He is the only One who can give us the sweetest inheritance of all: Himself. “We have this hope as an anchor for the soul, firm and secure” (Hebrews 6:19). May we continue to hold fast to Him, our hope and our prize. Amen.\n\nKaitlin Wernet is a twenty-something who lives to tell stories with a backbone of hope. Armed with too many exclamation points and not enough goat cheese, she spends her days as a writer and editor in Nashville, TN. With a journalism degree and football-induced stress from the University of South Carolina, Kaitlin is happiest with plane tickets in hand or a kitten in her lap. Thankful to be a “She” who Reads Truth, she can also be found writing more of her favorite words at KaitlinWernet.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day10.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 7:11-28, Genesis 14:18-20, 1 John 2:1",
        "devo_title": "A Superior Priesthood",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 7:11-28, Genesis 14:18-20, 1 John 2:1\nI am raising four boys on a farm full of mud. \nThrough much threatening, cajoling, scrubbing and—okay, I’ll admit it—bribing, I can occasionally get everyone clean. But there isn’t enough soap and water in the universe to ensure that they will stay clean. Most often, we don’t even make it to the car before someone (or everyone) becomes more soiled than spiffed up. \nThe Levitical priests could surely more than feel my pain. Once a year they would go to great lengths to ask the Lord to clean out the record of sin accumulated by His people. After extensive preparations, a priest would enter the most holy place inside the veil to present a sin offering (Leviticus 16:2–34). Verse 30 tells us: “Atonement will be made for you on this day to cleanse you, and you will be clean from all your sins before the LORD.” And so when the priest exited, God’s people were clean. It was a holy scrubbing, but never a permanent one. \nYear after year, the priests would enter the tabernacle to atone for the people’s sins, only to return again a year later. This was not an exercise in futility, but God’s provisional means of covering their sin. It was also an object lesson for generations to come, teaching them that nothing we could ever do—no matter how meticulously planned and executed—to make these “filthy rags” clean. We can scrub and scrub and scrub and the muck of sin will stick to us, making it impossible for us to be in the presence of our holy, holy, holy God (Revelation 4:8).  \nSo we keep scouring, don’t we? Until our hearts and souls feel raw from the effort. We need the reminder that we cannot obtain perfection through human striving. God’s law doesn’t polish us up to a high shine; instead, it exposes every gritty imperfection (v.19). \nThe priests couldn’t keep us clean because they were stained by sin too. We’ve always been the blind leading the blind, the stained scrubbing the stained. We needed someone untarnished by sin to enter the Holy Place on our behalf. “For it was indeed fitting that we should have such a high priest, holy, innocent, unstained, separated from sinners, and exalted above the heavens” (v.26). Christ is the true high priest, and His is the superior priesthood. He is the only permanent solution to our sin problem. His blood alone, shed on the cross, has the power to truly cleanse us. \nThe lyrics of Elisha A. Hoffman’s old gospel hymn, “Are You Washed in the Blood of the Lamb,” sum it up well:\nHave you been to Jesus for the cleansing power?\nAre you washed in the blood of the Lamb?…\nAre your garments spotless?\nAre they white as snow?\nAre you washed in the blood of the Lamb?\nThe gospel of Jesus Christ is an invitation to stop our scrubbing and to bathe in the deluge of grace that flows from the cross. Our perfect Savior made a way for us to be cleansed—permanently. May we fully trust in His grace this hour, and the next, and all the ones to follow.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day11.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 8:1-6, Zechariah 6:12-13, John 10:14-18, Romans 11:33-36, Romans 12:1-2",
        "devo_title": "A Heavenly Priesthood",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 8:1-6, Zechariah 6:12-13, John 10:14-18, Romans 11:33-36, Romans 12:1-2\nIn college, I visited a monastery built on the side of a cliff. To get there, we traveled to a remote location in central China on a bus that swayed along treacherous roads. I refused to look out the window for the majority of the drive because I was certain my gaze would draw us down to the canyon below. But soon enough a series of brown tapered roofs came into focus, hanging from the side of the mountain like an ancient rock climber with a strong grip. \nTo this day, Xuan Kong Monastery—also known as “the Hanging Monastery”—is one of the most interesting places of religious worship I’ve ever visited. Built 1,400 years ago, the walls and floors creaked with every step. My sense of awe may have actually been fear as I walked the narrow hallways, worried that at any moment the whole thing might crumble to the ground.\nNot too long ago, I read through a She Reads Truth study called See the Lord’s Salvation: A Lenten Study of Exodus, where I studied the God-given plans for another remarkable place of worship, one designed to honor God and built by His chosen people, the Israelites. (Go back to this study of Exodus to see the deep and intricate meaning of each detail in those plans.) But no matter how beautiful the tabernacle might have been, it was a human creation, a copy and a shadow of what was in heaven (Hebrews 8:5). Just like the Hanging Monastery in China, the tabernacle was fragile.\nOur churches and pastors and priests today are weak too. The walls creak. The leaders fail. Sometimes it feels like the sanctuaries do nothing more than remind us of our need. If that’s all they do, I’m okay with that. I need a better priest than the best on earth. I need a better temple.\nHere’s what’s amazing. “The true tabernacle set up by the Lord” (v.2) isn’t a destination with walls and nails. It is a communion we have with God in our hearts. For we are God’s temple and the Spirit of God lives in us (1 Corinthians 3:16–17). And Jesus, our High Priest and Good Shepherd, “is the mediator of a better covenant, which has been established on better promises” (Hebrews 8:6). \nJesus is the kind of priest we need in a better sanctuary than we could ever build. He takes us with all our heartsickness, sin, and need, and gives us access to the Father. In that secret room, the one in our spirit, our Father waits, ready to meet with us. \n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day12.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "1 John 2:1",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nMy little children, I am writing you these things so that you may not sin. But if anyone does sin, we have an advocate with the Father—Jesus Christ the righteous one.\n-1 John 2:1\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/SRT-Hebrews-Instagram-Day13.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 4:15",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse summarizes Jesus’s role as our High Priest. \nFor we do not have a high priest who is unable to sympathize with our weaknesses, but one who has been tempted in every way as we are, yet without sin.\n-Hebrews 4:15\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/4-Hebrews-2.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 8:7-13, Jeremiah 31:31-34, Luke 22:14-20",
        "devo_title": "A Superior Covenant",
        "devo_summary": "\nBY She Reads Truth\n\nScripture Reading: Hebrews 8:7-13, Jeremiah 31:31-34, Luke 22:14-20\nCurrent reality often eclipses our future possibilities. It’s hard to imagine things will ever look much different than this, what’s right in front of us today. \nI doubt that even the most imaginative Israelites in Egypt could have fathomed their miraculous escape from slavery across the dry ocean floor (Exodus 13:17–14:31). The disciples huddled together in Jerusalem could not have foreseen the power of Pentecost, even in their wildest dreams. I mean, tongues of fire? Crazy! (Acts 2:3). And when we were slaves to our sin, we could not have comprehend being truly free (Romans 6:17; John 8:36). It seems our God is always moving us toward something better, something brighter—something more than we dare to ask, imagine, or hope for (Ephesians 3:20). \nThose who worshiped under the Old Testament covenant surely could not have grasped all that Jesus would usher in. That a day would dawn when sacrifices of animal blood were no longer required because Christ’s blood was sufficient to atone once and for all. That God’s presence wouldn’t rest between the angel’s wings on the ark of the covenant (Exodus 25:17–22), but would move freely in our hearts. That a time was coming when the law would not be written on slabs of stone, but instead on the hearts and minds of God’s beloved children (Jeremiah 31:33). That the curtain of the tabernacle would be torn in two, making a way for sinners to enter the presence of God (Matthew 27:51). \nYet, here we are, “speaking of a new covenant, [by which] he makes the first one obsolete. And what is becoming obsolete and growing old is ready to vanish away” (Hebrews 8:13). Today, we are the recipients of the avalanche of grace Moses could only dream of. We are free in a way even the Israelites who fled Egypt never knew. Under the new covenant, we have been saved by grace through faith in Jesus Christ. This is a gift from God by which all our wrongdoing is forgiven, our sins never to be remembered again (Ephesians 2:8–9; Hebrews 8:12).\nThe old is gone and the new, superior covenant of grace is better than our wildest hopes. But we are also broken people, still stuck in this broken world and so easily convinced that this is all there is. Yet God is moving us onward, toward something unthinkably good. All that we see is ready to vanish away because our God is making all things new (Revelation 21:1–5).\nMaybe you can’t quite picture it. Perhaps your heart doesn’t dare believe it, but that won’t stop the Lord from delivering it. The best is truly yet to come.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day15.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 9:1-15, Leviticus 16:6-19, 2 Corinthians 1:10",
        "devo_title": "New Covenant Ministry",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 9:1-15, Leviticus 16:6-19, 2 Corinthians 1:10\nMaybe it’s this season of life I’m in where everything seems ridden with uncertainty and doubt, but sometimes it’s hard for me to remember that God is near to me. It’s hard for me to remember that I have access to Him through the Holy Spirit at all times. It’s hard for me to remember that even when I don’t have the words to speak, He still listens.\nUnder the old covenant described in the first part of Hebrews 9, God’s people were unable to communicate with Him directly. While the priests could enter into the first room of the tabernacle to perform their ministry of sacrifices, God’s presence was contained inside the holy of holies of the tabernacle, a place only the high priest could enter but once a year, and only then to provide a sacrifice for himself and God’s people to cover the sins they had committed. \nThe author of Hebrews consistently uses Old Testament references and stories to tell his readers about the better hope they have in Christ. In referencing the old covenant, which they were undoubtedly familiar with, the author is reminding them of the freedom they now have in Christ—freedom to acknowledge God’s nearness and drink in His presence. Christ took the place of the high priest, entering into the most holy place, sacrificing Himself, and cleansing us with His blood (Hebrews 9:11–14). \n“[Christ] is the mediator of a new covenant, so that those who are called might receive the promise of the eternal inheritance, because a death has taken place for redemption from the transgressions committed under the first covenant” (v.15).\nChrist is the Great High Priest, and because of His sacrifice on the cross, God is ever-present with us. We don’t have to rely on a human high priest to go before God on our behalf; Christ does that for us. He looks at us and says that we are His children, His people—that nothing can separate us from His love (Romans 8:38).\nIt’s not always easy to remember that we have instant access to our Father. In situations where we don’t know what to say or pray or do, we feel alone. We forget He is already near to us—nearer than our very breath. But reminders of this new covenant ministry, a ministry we are now an active part of, keep us grounded in the knowledge that God is with us and for us. Always.\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of cozy sweaters, ugly dogs, and the Oxford comma. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day16.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 9:16-28, John 10:10, 2 Timothy 1:8-10",
        "devo_title": "What Forgiveness Requires",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Hebrews 9:16-28, John 10:10, 2 Timothy 1:8-10\nWhat is the cost of forgiveness? \nI can forgive my husband for forgetting to feed the dogs and it costs me nothing. I can forgive someone for hurting my child, but it costs me a little more. I can even forgive the person who has hurt me most in this world, and it still costs me only the decision to forgive, even if I have to make the decision again and again. But what good does my forgiveness render? Certainly peace for me, and possibly some kind of peace for the one I forgive.\nOur forgiveness is vitally important, but there is a greater forgiveness that changes everything. Our forgiveness doesn’t actually yield eternal pardon for the offender, and that’s why it doesn’t cost us much. But in order to actually pay for one transgression of God’s law, someone has to literally die. That’s the deal. The wages of sin is actual death (Romans 6:23). A sacrifice must be made. But the sacrifice has to be totally without sin, so none of us can just valiantly die for our own sins. We need a sinless sacrifice. \nOur forgiveness is only possible because Christ is that sinless sacrifice. \nNow, because sin has been paid for, we have life and joy abundantly. By sacrificing Himself, He has removed our sins (Hebrews 9:26). When Christ comes again, He will come bringing the fulfillment of our salvation: everlasting life in glory.\nThis passage in Hebrews 9 seems to be about establishing the justice and legality of what Christ did. It is delivered in covenantal and transactional terms. Why? It is important to know that what Christ did, He did rightly. He didn’t cut corners, or sweep sin under the rug. He dealt with it fully, fairly, finally. Because of this, we can have great assurance and security in Christ. When Satan attempts to undermine our faith with doubt, we can lean on our righteousness of Christ. His payment for sin is fully sufficient. His grace is greater than all our sin, and nothing can separate us from the love of God in Christ Jesus.\nThe writer of Hebrews further his point with a comparison. The first covenant was also inaugurated with blood (v.18). But all the blood of bulls and goats could not fully satisfy the demands of justice. The blood of animals was sprinkled on the earthly tabernacle and its furnishings. But the blood of Christ, the only perfect and sufficient sacrifice, has purified even the heavenly things (v.23). His payment for our sin has paid our debt from the depths of earth to the heights of heaven.\nForgiveness requires the shedding of blood. And Christ’s blood has been shed for us. \nWhat then can man do to us? What can Satan say to topple such a salvation? Thanks be to God, we are secure in Christ. When Christ returns, we are told, He will come, not to pay a further debt (all our sins have been paid for!), but to bring salvation (v.28). Praise the Lord!\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day17.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 10:1-18, Psalm 40:1-17, 1 Peter 2:24",
        "devo_title": "The Perfect Sacrifice",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 10:1-18, Psalm 40:1-17, 1 Peter 2:24\nTwice, my girlfriends have talked me into running a half marathon. And twice, my knees have revolted. Both times I hobbled across that finish line, I was so ready to be done. But can you imagine if I had decided to just keep running? I surely cannot. Yet, oftentimes in our spiritual lives we keep running a race that’s already been won. We keep thinking that if we just jog another lap, add on a few more miles, somehow we will be more qualified.\nThe thing is, Jesus ran the perfect race and won the final victory for us. With the sacrifice of His life He proclaimed, “It is finished” (John 19:28–30). So why don’t we accept the gift of grace? And if we have accepted it, why don’t we choose to live into it?\nGrace can be difficult to accept. While we all want forgiveness and unconditional love, the world has taught us that forgiveness is not easily won and love always comes with limits. It can be hard to live in the reality of God, in the truth of the gospel. We might picture our heavenly Father like an earthly one, disappointed or angry or withholding. We might think He judges us with a harsh eye. But God’s love is like nothing in this world, and until we open our hearts to His grace we will keep on needlessly trying to prove ourselves.\nUnlike the priests who had to daily return to their work, when Jesus offered His sufficient “sacrifice for sins forever, [He] sat down at the right hand of God” (Hebrews 10:12). He sat down. This symbolized completeness and finality. He didn’t pace around. He didn’t wring His hands. He didn’t find more busywork to do. He sat down at the right hand of His Father.\nChrist’s sacrifice is complete. It was also made “once for all time” (Hebrews 10:10), which means the gospel is always fresh. And because our hearts so easily forget this news that seems too good to be true, we need to be reminded again and again: every morning when we step out of bed, weary from a world we’ve barely woken to, every time we stumble and fall, and every time we believe the lie that we need to somehow earn the love of God. The repeated sacrifices of the old covenant can now be replaced with repeated proclamations of the gospel to ourselves and to our brothers and sisters.\nMaybe God is inviting you to sit down at His feet today—to just be with Him. To soak yourself in Christ’s finished work for you. You are saved, not by your own will or work, but by the perfect blood of Jesus. Rest easy in the presence of your Redeemer.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day18.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 10:19-39, Deuteronomy 32:35-36, Matthew 27:50-54",
        "devo_title": "Warning Against Deliberate Sin",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Hebrews 10:19-39, Deuteronomy 32:35-36, Matthew 27:50-54\nThe universal law of cause and effect says that for every effect there is a cause, and likewise, for every cause there is an effect. Why am I giving you a refresher course in seventh-grade natural science? Because applying this law to our passage today is crucial in understanding hope in light of Christ’s faithfulness to us.\nHebrews 10:23 says, “Let us hold on to the confession of our hope without wavering, since he who promised is faithful.” With “since” being the key word, we can determine that the law of cause and effect applied to this verse would go something like this:\nCause: He who promised is faithful.\nEffect: We hold on to the confession of our hope without wavering.\nWhat if we changed the placement of the word “since” to read, “Since we hold on to the confession of our hope without wavering, he who promised is faithful”? It would entirely change our cause and effect, right?\nCause: We hold on to the confession of our hope without wavering.\nEffect: He who promised is faithful.\nIn the first set of cause-and-effect statements, we hold on to hope because Christ has been faithful to us. In the second, Christ is faithful to us because we hold on to hope.\nIf Christ’s faithfulness to me is contingent upon my hope, I’m in big trouble. My hope is not consistent. It varies from day to day, depending upon my circumstances, the weather, or how much coffee I’ve had. My hope can be high one hour and plummet the next.\nFortunately, Hebrews does not say we hold on to hope because we are a people who are so very good at hoping. It says we hold on to hope because Christ has been faithful. As the verses leading up to this one emphasize, “since we have boldness to enter the sanctuary through the blood of Jesus… and since we have a great high priest over the house of God… let us draw near… Let us hold on to the confession of our hope” (Hebrews 10:19,21–23).\nThe blood of Jesus, our Great High Priest, His faithfulness—this is why we hold on to hope.\nIt has taken me a long time to grasp this idea that living a life of faith is so much more about God’s faithfulness to me than it is my faithfulness to Him. To be honest, I still don’t think I completely get it. If I did, I would have far less anxiety, I would sin far less, and I would have much more hope. I need this reminder as much as the early Church did. When I feel hopeless, I need to repeat the cause again and again:\nSince He…\nSince He…\nSince He…\nHave hope today—not in your ability to hold onto hope, but in Christ’s faithfulness to you. It does not waver. It is the same day in and day out—yesterday, today, and forever. When we rely on His faithfulness alone, our posture toward life will be one of hope and not fear, of trust and not turning away. As the writer said, “We are not those who draw back and are destroyed, but those who have faith and obtain life” (v.39).\n\nAndrea Lucado is a freelance writer, Texas native, and the author of the memoir English Lessons: The Crooked Path of Growing Toward Faith. When she is not conducting interviews or writing stories, you can find Andrea laughing with friends at a coffee shop or creating yet another nearly edible baking creation in her kitchen. One of these days she’ll get the recipe right. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day19.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "John 10:10",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“A thief comes only to steal and kill and destroy. I have come so that they may have life and have it in abundance.”\n-John 10:10\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day20.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 10:14",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis verse is a reminder of the once-and-for-all nature of Jesus’s death and resurrection. \nFor by one offering he has perfected forever those who are sanctified.\n-Hebrews 10:14\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/4-Hebrews-3.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 11:1-16, Psalm 33:6-7, John 1:9-13",
        "devo_title": "Living by Faith",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 11:1-16, Psalm 33:6-7, John 1:9-13\nI recently read a novel by Min Jin Lee called Pachinko. Set in WWII, the story follows an immigrant Korean family that lives in Japan for four generations. The book chronicles their bold acts of faith, fortitude, and survival in the midst of oppression and racial prejudice. I won’t spoil the ending here, but rest assured the ending isn’t what makes the book worth reading. It’s the beginning, middle, and end, all woven together like a symphony. I’ve bought multiple copies, handing them out like candy.\nLikewise, the author of Hebrews recounts a family history. Our family history. Each tale is a marriage of belief and action—basically, faith and verbs. \nBy faith Abel offered.\nBy faith Noah built.\nBy faith Abraham obeyed and went.\nBy faith Sarah received.\nIt’s important to take a moment to really consider what those verbs cost our ancestors. Though Abel’s gift was accepted by God, he was still violently murdered by his brother. Though the ark provided rescue to Noah, he still suffered years of ridicule from his neighbors. Though God kept His promises to Abraham, Abraham still had to walk away from everything he knew and follow God into the desert. As the author of Hebrews says:\n“These all died in faith, without having received the promises, but they saw them from a distance, greeted them, and confessed that they were foreigners and temporary residents on earth. Now those who say such things make it clear that they are seeking a homeland” (Hebrews 11:13–14).\nI think the reason I like Pachinko so much is that it introduces a family seeking a homeland, experiencing rejection in the place where they live. As a Christian, I seek to embrace that same humbleness, embracing the truth that I am a temporary resident here on earth. This is not my final home. For that reason, I can sacrifice it all, including the comfort of home, if that is what God calls me to do. \nThese passages prompt me to ask myself: What are the verbs that God is asking me to act out in my life? Can I boldly trust that He will use those actions for His glory, no matter the cost? No matter the ending?\nOne thing is certain: God never spoils an ending. And He makes promises I can hold on to while I walk through the middle. I am chosen and never forsaken. God will go with me—He always arrives to the scene first, and acts as my rearguard. God promises He will complete the good work He started in me (Philippians 1:6). He promises that nothing will be wasted, but all things will be restored (Revelation 21:4–5). While I take these steps, any tears I shed will be like liquid words and God promises to read and store them all (Psalm 56:8).\nBut this is about more than just me and you. The author of Hebrews says that acts of faith make non-believers turn and watch. In other words, when we put our our faith into action, we create living proof to a dying world that God exists. Our “faith is the reality of what is hoped for, the proof of what is not seen” (Hebrews 11:1).\nThat is no small thing.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day22.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 11:17-40, Luke 13:34-35, James 1:2-4",
        "devo_title": "Legacy of Faith",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Hebrews 11:17-40, Luke 13:34-35, James 1:2-4\nIt was my cab driver in Boston who lead me to the best cannolis I’ve ever had. “Skip the main bakery location downtown,” he suggested. “Walk a few blocks north and you’ll find the exact same thing without the wait.”\nIt was a shop owner in Austin who recommended I visit what I now refer to as “my most favorite bookstore of all time.” You could say I liked it, alright.\nIt was my friend in Chicago who knew precisely which building had the best views of the city skyline, and could tell me the history behind every structure and monument in sight.\nAnd if you visited my city, Nashville, I’d show you the live music venue with a back alley, so you can enter with the locals and avoid the throes of tourists. Oh, and I’d probably already have put in a request for your favorite song to make sure you sing karaoke before the night is over.\nRegardless of where you’re going, everyone knows the best way to find the best tips: ask the locals. Your server at dinner will have more insight than any guidebook you read on the plane, and the friend you’re staying with is guaranteed to keep you from going to the restaurants that didn’t live up to their online reviews.\nBut when it comes to faith, it’s even more important to have a guide. And when it comes to struggle or not knowing where to turn, the best thing to have on your side is someone who’s been through it before you. And that’s exactly what we’re given in Hebrews 11: examples of people who have lived by faith. “Faith is the reality of what is hoped for, the proof of what is not seen” (v.1), and yet, God is gracious enough to fill our eyes with hopeful images of our brothers and sisters who have successfully lived by the words He has promised.\nWe’re reminded of Abel’s sacrifice, Enoch’s protection, Noah’s motivation, Abraham’s obedience, Sarah’s conception, Isaac’s birth, Jacob’s worship, and Moses’s suffering—“all these were approved through their faith” (v. 39). But we’re given these examples not because we’re supposed to be more like each of these human men and women, but because they, too, were afraid. They, too, were unsure and doubtful and wondering if the things they were putting their trust in were actually real. They, too, hoped their faith was more than just wishful thinking.\nInside God’s Word, we get to learn from the locals, those who have gone before us and have seen the goodness and truth of our God in all things. But even better, we see time and time again that their go-to move isn’t to look to their own flesh for answers—it’s to ask their Creator. Their stories invite us to do the same, joining a long, tried-and-true legacy of faith.\nThe stories of God’s people point us to His face. May they continue to do so, and may our own stories be marked by faith as well. \n\nKaitlin Wernet is a twenty-something who lives to tell stories with a backbone of hope. Armed with too many exclamation points and not enough goat cheese, she spends her days as a writer and editor in Nashville, TN. With a journalism degree and football-induced stress from the University of South Carolina, Kaitlin is happiest with plane tickets in hand or a kitten in her lap. Thankful to be a “She” who Reads Truth, she can also be found writing more of her favorite words at KaitlinWernet.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day23.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 12:1-13, Romans 12:18-21, 1 Timothy 2:5-6",
        "devo_title": "The Call to Endurance",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 12:1-13, Romans 12:18-21, 1 Timothy 2:5-6\nJesus invited His followers to take up their crosses and follow Him. From the outset of His ministry, He wanted us to know that the Christian life is not free from struggle. The writer of Hebrews encourages believers to “strengthen your tired hands and weakened knees” (Hebrews 12:12). Tired hands and weakened knees are not the result of a life on cruise control; they are the result of labor, opposition, and striving.\nSome of us may be all too familiar with this reality. Through trial and tribulation, we’ve become well aware that the way of Jesus isn’t always the smoothest path. Still, in times of plenty there is a tendency to brush over the hardships of faith and tough teachings of Scripture. In a comfortable season of life, we might be tempted to believe that our work as a “good Christian” means that God will bless everything we put our hands to. We can forget that walking in the way of Jesus is not without suffering and that, in Jesus, even our suffering has a redemptive purpose. \nListen to this encouragement from Hebrews 12:\n“Endure suffering as discipline: God is dealing with you as sons. For what son is there that a father does not discipline? … Furthermore, we had human fathers discipline us, and we respected them. Shouldn’t we submit even more to the Father of spirits and live? For they disciplined us for a short time based on what seemed good to them, but he does it for our benefit, so that we can share his holiness. No discipline seems enjoyable at the time, but painful. Later on, however, it yields the peaceful fruit of righteousness to those who have been trained by it” (vv.7-11).\nScripture is clear: God uses everything—struggle and hardship included—for the believer’s good (Romans 8:28). When we assume our way should be easy easy, we forget that Jesus promised the opposite (John 16:33). When we see all pain as a problem to avoid, we miss the opportunity to “rejoice in our afflictions, because we know that affliction produces endurance, endurance produces proven character, and proven character produces hope” (Romans 5:3–4). We miss the opportunity to become more like Christ.\nIt’s tempting to go through our places of struggle alone, not wanting God or anyone else to see us at a low point. But when we recognize dark days as an expected part of a life of faith, we can look to the One who has walked this road before. Jesus, our victor and champion, suffered betrayal, persecution, and excruciating death. A “man of sorrows” (Isaiah 53:3), He understands our pain. And He is with us through every hardship when we trust in Him. \nWhen your time of suffering comes, look to Jesus. \n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day24.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 12:14-29, Genesis 4:8-13, Isaiah 62:6-12",
        "devo_title": "Warning Against Rejecting God’s Grace",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Hebrews 12:14-29, Genesis 4:8-13, Isaiah 62:6-12\n“You don’t know what you have until it’s gone.” \nWe’ve all heard this old adage, or perhaps even experienced the painful truth of it at some point in our own lives. But it’s not really a case of not actually knowing what you had, is it? It’s more a matter of not appreciating that thing, that someone, that blessing—until it’s no longer yours. Maybe you never appreciated it because you never imagined a world in which you’d have to live without it.\nSuch is the case with Esau and the oh-so unwise forfeiting of his birthright to his twin brother for the immediate comfort of a home-cooked meal. Whether he truly “despised” his birthright or was merely indifferent to it, Esau did not place great enough importance on his blessing as Isaac’s firstborn son—the blessing that promised both divine protection and authority over other nations (Genesis 25:27–34; 27:29).\nWhile the Christians the writer of Hebrews was addressing weren’t merely fighting off hunger pangs, in the face of severe persecution they were tempted to forego their faith in Christ, exchanging the promises of the new covenant for the supposed comfort and familiarity of the old covenant. And so the writer of the book of Hebrews reminds the readers of what’s at stake, comparing the Israelites’ relationship to God at Mt. Sinai under the old covenant of the law (Exodus 19), with the blessings of salvation in Jesus Christ under the new covenant. \nThe comparison is a stark one. Their encounter with God at Mt. Sinai left the Israelites, and even Moses, shaken to the core (Hebrews 12:18–21). But that’s not the case for the Hebrew Christians, or for anyone whose faith is in Jesus Christ. \n“Instead, [we] have come to Mount Zion, to the city of the living God… to the assembly of the firstborn whose names have been written in heaven, to a Judge, who is God of all… and to Jesus, the mediator of a new covenant…” (vv.22–24).\nThe old covenant instilled a holy fear in the hearts of God’s people, putting a safe distance between them and God’s holiness. But the new covenant has torn away the veil separating us from God. Christ, our perfect Mediator and Judge (1 Timothy 2:5; 2 Timothy 4:8), put on skin and came down to endure the judgment of our sin. He eliminated the distance between God and His people, bringing us squarely into right and redeemed relationship with Him. “Our God is a consuming fire,” and His sacrificial love for us should should incite awe and reverence in our hearts, not indifference (Hebrews 12:29). \nTo know Christ is to be wrapped up in His grace—a hard-won grace that cost us nothing but did not come cheaply. It cost Jesus His life, the agony of bearing the weight of sin for all of humanity for all time and, for the first and only time in history, separation from the Father (Matthew 27:46). The writer of Hebrews is warning readers, cautioning us to not become hardened by persecution or indifferent to Jesus’s sacrifice, to the grace and salvation that can only be found in Him. “Therefore, since we are receiving a kingdom that cannot be shaken, let us be thankful” (Hebrews 12:28).\n\nKara Gause is an editor for She Reads Truth and happily resides in Nashville, Tennessee. She’s married to one swell fella, and mama to a set of delightfully spirited twin girls. Sunsets, snow cones, and cinema are near and dear to her heart, as is anything or anyone who reminds her of God’s goodness.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day25.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 13:1-25, Joshua 1:5-9, Matthew 25:34-40",
        "devo_title": "Benediction and Farewell",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Hebrews 13:1-25, Joshua 1:5-9, Matthew 25:34-40\nAfter thirteen chapters of establishing our great hope and exhorting us to godly living, Hebrews closes with a succinct reminder that all hope comes from Christ who is the “same yesterday, today, and forever” (Hebrews 13:8). The root of all godly living is the person of Christ. He is both our hope and our source of righteousness.\nAt the close of the this book, the author recommends a handful of what Matthew Henry calls “excellent duties”: show love and hospitality, care for the mistreated, honor marriage, eschew the love of money, and be satisfied with what you have. This final exhortation to contentment certainly loosens the reins and makes the other excellent duties easier. If one is content, the love of money can’t tempt and the shine of someone prettier or younger doesn’t lure.\nHave you ever known someone who is truly content? The author of Hebrews points us first and foremost to the example of Christ. But we are also encouraged to watch the fruit of other leaders and, if that fruit is good, imitate their faith. \nThe most contented person I know is Nell. You probably don’t know her; she’s not famous. I met her in college, but she wasn’t the first friend I made. She was quiet and I was so busy making sure everyone knew how much fun I was, I didn’t notice her.\nBut once I did notice her, I couldn’t stop. Nell doesn’t push, she doesn’t demand, even though she has stronger opinions than most. But she loves like a fountain, and she is content. These days she homeschools her six children in a small house by a river. She is teaching them the art of contentment by giving them what they need, but not what they demand. She shows them how to be content by being at peace herself. Instead of chasing the world, she has found that her rooms crowded with love hold the very best the world has to offer her.\nLight your corner of the world, friends—wherever it may be. And if these excellent duties of love and contentment seem impossible, do not fear; they are impossible. This is why the book of Hebrews was written: to point us always back to our need for Christ. He is our helper, “who promises to never leave us or forsake us” (v.5). \nLift your eyes to the eternal glory of Christ, for He is our hope in things both large and small. Any excellence and contentment that flows out of our lives will come from Him. Because of His sanctifying blood, we are made new creatures—creatures capable of hospitality and contentment. Jesus is our hope. He is our strength. And He is the same, yesterday, today, and forever.\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day26.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "1 Timothy 2:5-6",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor there is one God and one mediator between God and humanity, the man Christ Jesus, who gave himself as a ransom for all, a testimony at the proper time.\n-1 Timothy 2:5–6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-Hebrews-Instagram-Day27.jpg"
    },
    {
        "book_title": "Hebrews",
        "devo_passages": "Hebrews 12:1-2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Hebrews.\nLet us run with endurance the race that lies before us, keeping our eyes on Jesus, the source and perfecter of our faith. For the joy that lay before him, he endured the cross, despising the shame, and sat down at the right hand of the throne of God.\n-Hebrews 12:1b-2\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/09/4-Hebrews-4.jpg"
    }
]