[
    {
        "book_title": "Luke",
        "devo_passages": "Luke 1:1-80, 1 Samuel 2:1-10, Jeremiah 23:5-6",
        "devo_title": "The Coming Savior",
        "devo_summary": "\nBY Andrea Lucado\n\nThe older I get, the more wary I am of getting my hopes up. I’d hoped to get the lead in the school play, but I got a secondary role instead. I’d hoped to get into a master’s program, but I didn’t. I’d hoped that relationship would work out, but it ended. Because of this, I have become very good at what I call “hope management.” I never let my hopes get too high. In doing so, when my hopes fall, the landing is softer.\nThis is why I can’t blame Zechariah for questioning the angel Gabriel when he tells him, “Your wife Elizabeth will bear you a son, and you will name him John” (Luke 1:13). Zechariah protests. He was an “old man” and his wife, Elizabeth, “was well along in years.” Although Zechariah was clearly in the midst of a heavenly encounter, his question has undertones of disbelief: “How can I know this?” (v.18).\nThis tells me that Zechariah and Elizabeth had gotten their hopes up about a child before, and Zechariah can’t face the disappointment again. He can’t name another unborn child in expectation, only to have those expectations dashed. But as a result of Zechariah’s unbelief, he is unable to speak until the day his son is born and he sees God’s promise fulfilled.\nMary’s response to Gabriel is different. She is told something equally unbelievable––that she, a virgin, will conceive a child. Gabriel instructs, “You will name him Jesus. He will be great and will be called the Son of the Most High, and the Lord God will give him the throne of his father David. He will reign over the house of Jacob forever, and His kingdom will have no end” (vv.31–33).\nBut Mary’s question is more logistical than it is incredulous: “How can this be?” (v.34). As the CSB Study Bible says, “The difference between Mary’s response… and Zechariah’s is that Mary asked her question not from unbelief but from puzzlement.”\nThe nation of Israel had high hopes for a Savior for generations. I would not blame Mary for containing her hope. But she does the opposite. While Zechariah’s mouth was closed, Mary’s opens in praise: “My soul praises the greatness of the Lord, and my spirit rejoices in God my Savior” (vv.46–47).\nThese words reflect the type of unmanaged, unharnessed hope I want to have in response to the promises of God. Instead of reserving my hope, smothering it, not letting it get too high, I want to hold hope with open hands, believing the Lord will do what He says, that He will make good on His promise to save.\nWhat I have that Mary didn’t at this point in her life is the end of the story. I know God made good on His promise to save. When that is where my hope lies, I cannot be not disappointed, and instead, I can declare:\n“The Mighty One has done great things for me, and His name is holy. \nHis mercy is from generation to generation” (vv.49–50).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day1.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 2:1-52, Isaiah 9:2-7, Galatians 4:4-5",
        "devo_title": "The Birth of Jesus",
        "devo_summary": "\nBY Andrea Lucado\n\nWhat is a book you’ve read again and again? Or perhaps a movie you’ve seen more times than you can count? Or a song you’ve had on repeat for years? Though I’ve read the words of my favorite book or watched the same scene of my favorite movie a dozen times, I often react to it differently depending on the day I’ve had or the season of life I’m in. I may feel a lot of emotion, or I may feel inspired. Other times, I may simply want to listen, watch, and savor the story. Let the words and notes sink in.\nSomething I love about Luke’s narrative of Christ’s birth is the array of responses from those who witnessed the Messiah, either at His birth or soon after. From awe to silence to praising God, I think we can learn as much about the significance of the incarnation from these responses as we can from the details of the birth itself.\nMary’s response to her son’s birth is quiet and contemplative. While the shepherds, after meeting Jesus, ran off and told everyone about what they had seen, Scripture says, “Mary was treasuring up all the things in her heart and meditating on them” (Luke 2:19). She savored the moment, holding it near to her, letting it sink into her heart and mind.\nSimeon, the righteous servant of the Lord, responded to meeting the Messiah by praising God and declaring the mighty works Jesus would do. As he tells Mary, “Indeed, this child is destined to cause the fall and rise of many in Israel” (v.34).\nThen there is Anna, the prophetess. Her response to the Messiah’s arrival was gratitude and, like the shepherds’, to spread the good news: “At that very moment, she came up and began to thank God and to speak about Him to all who were looking forward to the redemption of Jerusalem” (v.38).\nJesus’s birth evoked silent awe, praise, gratitude, and the need to tell everyone about it.\nMost likely, the story of Jesus’s birth is not new for you. You’ve probably read it or heard it told again and again. But I wonder, what is it evoking in you today? Awe, joy, gratitude, praise? Do you want to shout about it from the rooftops like Anna, or do you want to be still and treasure it in your heart, as Mary did? Though our responses will vary, we are united by the reason behind the coming of the Messiah. \n“God sent his Son, born of a woman, born under the law, to redeem those under the law,\nso that we might receive adoption as sons” (Galatians 4:4–5). \nWe are redeemed. We are adopted. We are a part of God’s family. No matter what kind of day you are having or what sort of season you are in—quiet and contemplative or loud and joyful—let the story of Christ’s birth remind you of these truths today.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day2.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 3:1-38, Genesis 3:15, Acts 1:6-8",
        "devo_title": "The Messiah’s Herald",
        "devo_summary": "\nBY Andrea Lucado\n\nFrom what I can tell, John the Baptist was a man to be respected. He spoke with authority. Others came to him to be baptized. They asked him for advice. They called him teacher. Many of them even wondered if he was the Messiah.\nJohn could have told the crowd anything by the Jordan River that day, and the people probably would have followed him, but John used his God-given authority to point them to Christ: \n“I baptize you with water, but one who is more powerful than I am is coming.\nI am not worthy to untie the strap of his sandals.\nHe will baptize you with the Holy Spirit and fire” (Luke 3:16).\nSeveral years ago, I took a trip to Italy with some friends. We visited the Vatican in hopes of seeing the renowned Sistine Chapel, where Michelangelo painted the ceiling. Tourist-friendly signs dotted the Vatican campus with the words “Sistine Chapel” and an arrow pointing in its direction. Or so we thought. Many of the signs simply pointed us to the next sign that said “Sistine Chapel.” We followed sign after sign until we almost gave up.\n“The Sistine Chapel isn’t here!” we declared dramatically. “These signs are lying to us.”\nWe did eventually wind our way to the chapel and see what we had come to see, but only after several detours that took us by other Vatican sites and gift shops.\nAs Christ-followers, we have been given a similar charge as John the Baptist—to be signs pointing toward the coming Christ. And yet, how often do I squander this opportunity? How often do I use my voice to point first to myself, rather than Christ? Speaking with authority, I take friends and loved ones on a detour of my own gospel. I give them all of my advice and all of my opinions when really what they need first is the comfort of Christ, the love of the Savior. \nAt the same time, I have often been a sucker for the signs, looking to others’ authority before Christ’s,  settling for my favorite pastor’s, author’s, or podcaster’s words, rather than allowing Jesus’s life, death, and resurrection to have the final word. \nAs we see in the response to John the Baptist, we are a people quick to worship humans and look for guidance from earthly sources. Many people claim to have authority. Dozens of signs promise to get you where you want to go, but there is only one Christ, only one Lamb of God who takes away the sins of the world—and that is not John the Baptist, but the One to whom he was pointing. \nMay we look to Christ alone as our authority, and may we point others to Him as well, always quick to say, “one who is more powerful than I am is coming.”\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day3.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 4:1-44, Deuteronomy 9:6-11, Psalm 91:1-16",
        "devo_title": "Jesus’s Early Ministry",
        "devo_summary": "\nBY Andrea Lucado\n\nTo begin His public ministry, Jesus returns to His hometown of Nazareth and preaches in the synagogue. His homecoming message is so controversial, the townspeople—the people He had known since He was a child—“drove him out of town, and brought him to the edge of the hill… intending to hurl him over the cliff” (Luke 4:29).\nThe crowd is with Him for the first part of His message, when He quotes the prophet Isaiah, saying He had come to preach the good news and to proclaim the year of the Lord’s favor (vv.18–19). But when He mentions the widow in Sidon whom the prophet Elijah helped, and Naaman, the Syrian whom Elisha healed, the crowd gets upset. These are stories of Gentiles who were shown favor above Israelites.\nThe crowd would have been familiar with these stories, and they would have known their meaning. This good news Jesus was preaching was for everyone, not just the Israelites but the Gentiles also—not a popular opinion among God’s chosen people, as we can see from their response.\nNow, I’ve had some difficult homecomings. I’ve had disagreements with friends and family from time to time, but none of them has ever been so displeased with me that they attempted to hurl me off a cliff.\nIn this passage and elsewhere in Scripture, we see a common response to Jesus: People wanted His miracles, but not His message.\nThe crowd is amazed when He casts out a demon in Capernaum. They bring their sick to Him to be healed. They follow Him around, hoping to see Him perform other miracles. But when Jesus preaches the truth in the synagogue? They want to kill Him.\nJesus’s miracles were amazing, yes, but His message was convicting. People like to be amazed. They don’t like to feel convicted.\nI know, in my own privilege, I often prefer the turns-water-into-wine Jesus over the seeks-justice-for-all Jesus. If Jesus is just a miracle worker, I can sit back and enjoy the show. But if Jesus is first and foremost a justice-seeker, I have to get in the ring and be about His work.\nJesus’s message in the synagogue proves His priority was not to amaze us with His power, but to redeem us—Jews and Gentiles alike—with His blood.\nI can see myself in the Galilean crowd that tried to keep Jesus from leaving so they could witness more healings. I need the reminder Jesus turned and gave them: “It is necessary for me to proclaim the good news about the kingdom of God to the other towns also, because I was sent for this purpose” (v.43).\nThis is our purpose too. May we seek after Christ because we want to do as He did, not watch from the stands. May we remember that Jesus is our Redeemer, not a performer. And while we can stand in awe of His power to heal and cast out demons, may we be most amazed by His power to save.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day4.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 5:1-39, Isaiah 58:6-12, Joel 2:12-17",
        "devo_title": "The First Disciples",
        "devo_summary": "\nBY Andrea Lucado\n\nIntellect and logic would have told Jesus’s first disciples not to follow Him. They hardly knew the guy. They had stable jobs as fishermen and tax collectors. By the world’s logic, they shouldn’t have left steady paychecks to follow a practical stranger! But Jesus told Peter, James, and John, “Don’t be afraid; from now on you will fish for people” (Luke 5:10 NIV). No questions asked. No curiosity expressed at the utter strangeness of this statement. What do you mean, “fish for people”?  The men simply “left everything, and followed him” (v.11).\nIt was the same with Matthew. Jesus hadn’t yet shaken Matthew’s hand before He was inviting the man along, saying, “Follow me!” Matthew’s response? Leaving everything behind, “he got up and began to follow him” (vv.27–28).\nAs a result of the disciples’ responses, they ended up on the adventure of a lifetime. Full of pain and heartache, yes, but oh, how it was worth it.\nWhile reading today’s passage, I found myself feeling jealous of the disciples’ seemingly easy faith—and resonating with the Pharisees’ suspicious and questioning attitude. In some seasons, faith is easy. My heart believes. I see God at work and can faithfully follow. These days, faith is not coming as easily. My head is loud: This isn’t practical! This isn’t logical! Make a better plan for yourself! My heart is afraid: What if this doesn’t work out? What if Jesus was wrong? What if this will all be for nothing? I am uncertain of taking the next step Christ is calling me to. I am wary of the unlit path before me, even with Christ beside me.\nBut what does Jesus say? Don’t be afraid. Follow me.\nPerhaps the disciples’ faith is not the point here, so much as Jesus’s belief in them. He had faith in Peter, James, John, and Matthew, didn’t He? He saw something in them they did not see in themselves, or else He wouldn’t have asked them to follow Him. Maybe when my faith feels weak, I do not need to muster more. Maybe it’s enough to remember I was called. Sometimes faith precedes the step. Sometimes it comes after.\nThe response to Jesus by these first disciples is immediate and whole-hearted. They leave everything behind. They follow Him—not because they are pious or perfect, but because Jesus is worth following. All they know at this point is they want to be near Him. So do I. Let’s surrender our hearts and our heads to Christ today. Let Him lead us on the unlit path. It may have pain and heartache, but oh, my friends, I think it will be worth it.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day5.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Psalm 91:2–4",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nI will say concerning the Lord, who is my refuge and my fortress,\nmy God in whom I trust:\nHe himself will rescue you from the bird trap,\nfrom the destructive plague.\nHe will cover you with his feathers;\nyou will take refuge under his wings.\nHis faithfulness will be a protective shield.\n—Psalm 91:2–4\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day6.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 1:46-47",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize part of Mary’s song of praise in expectation of giving birth to Jesus.\nMy soul praises the greatness of the Lord,\nand my spirit rejoices in God my Savior…\nLuke 1:46–47\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/4-Luke-1.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 6:1-49, 1 Samuel 21:1-6, James 2:1-7",
        "devo_title": "Lord of the Sabbath",
        "devo_summary": "\nBY Rebecca Faires\n\nHave you ever missed the party while it was happening? Looking back, you realized, Oh man, that was it! The magic was happening right in front of me and I didn’t see it! I find myself in this situation again and again. Hiking on a mountain but missing the view on account of stinging flies. Or brushing off my children’s impromptu theatrical performances to keep to my own schedule. I even remember being so caught up in the minutiae of pins, flowers, and curling irons on my sister’s wedding day that I forgot to take in the simple beauty and goodness of my sister transformed into a bride until we found ourselves giggling in the bathroom at her reception.\nWe are all prone to miss the important things. In the moment, it can be tough to even know whether something is vital until it’s too late. The Pharisees are missing a tremendous moment that is right in front of them. Because Christ wasn’t what they expected, they turned off their sense of expectation. But that’s the thing: Christ does not appear as we want Him to. His law, His logic, His person, His actions, even His teaching, do not conform to man’s way of thinking or living. He comes as Lord of the Sabbath, and if we are caught up like the Pharisees in what we imagine that to be, we miss Him as He is.\nIndeed, He is Lord of a kingdom that cuts against the grain of every human inclination. When He calls the twelve, He doesn’t pick from among the great or accomplished. He chooses the lowly, the ordinary, even the despised. When He heals, He does not curry favor with the high and mighty, but heals foreigners and the weak. His Beatitudes and the woes that follow overturn every modern notion of morality, self-esteem, and success. His call not to judge, but to love even our enemies, runs counter to every inclination toward self-justification and vengeance.\nThere are only two foundations: the foundation of Christ or the foundation of man’s natural disposition, which crumbles and fails. Instead of depending on the foundations that we build ourselves, we can stand on the foundation of the Lord of the Sabbath and stand secure. If we’re expecting Christ to be our personal sentimental version of newborn baby Jesus, we are going to miss the majesty and truth of Him as Lord of All.\nHere is the good news: Though we are prone to hypocrisy, to blindness, to judgment and folly, Christ comes to us anyway; He comes, loving His enemies and doing good to those who despise Him. He makes us His, and we can take comfort in this promise: “Everyone who is fully trained will be like his teacher” (Luke 6:40). Christ calls us away from ourselves to Himself, and in so doing, makes us like Himself. “We know that when he appears, we will be like him because we will see him as he is” (1 John 3:2).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day8.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 7:1-50, 1 Kings 17:17-24, Psalm 23:1-6",
        "devo_title": "Much Forgiveness, Much Love",
        "devo_summary": "\nBY Rebecca Faires\n\nThis year, as part of our celebratory Christmas decorations, we set up a fantastic black-and-cream toy train under the tree. Once a day, I would let the kids play with it for a few minutes. They would sit on their tiny knees, leaning forward and exclaiming while the train made its allotted brave journey around the tree several times. Then I’d remind them to turn it off and move on with their day.\nOne of my best friends laughed at me for this, saying, “You’re limiting their Christmas magic so you don’t have to spend money on replacement batteries?!” Yeah, I guess I do tend to be a little parsimonious when it comes to… well, everything. Some of us are miserly with our resources. Maybe you are a bit freer with your spending; we’re all different. But if I had an alabaster jar filled with perfume I would reluctantly parse it out over many years, and I’d be hard-pressed to slop it all out in one afternoon over a stranger.\nWhether you are free or tight with resources, it’s important to know when it’s time to set aside your personal inclinations. Otherwise, we are like the Pharisee who invited Jesus to his house but held back on the hospitality. If the Pharisee had realized Who was sitting at his table, and what debt of gratitude he owed Him, would he have been so close-fisted in his actions? And centuries later, knowing Jesus’s purpose and intent, would we have washed His feet and offered Him a kiss? Unless we are aware of our great debt of love, it’s hard to remember who we are and what we are called to do.\nWhen we realize how much we have received—how much we have been forgiven—then everything comes into perspective. We too often hold back pieces of our lives for ourselves, because we fail to see how greatly we have been forgiven. If we were to comprehend the full abundance of God’s forgiveness, how could we hold back anything from Him? In Him we have received all things, beyond what we could ask or imagine.\nLike the woman in Luke 7, we who have been forgiven much can appreciate the depth of Christ’s love. The more we see our need of Him, the more opportunity we have for gratefulness and love for His deep forgiveness. He doesn’t speak of the woman’s shame, only of her love.\nIn John’s vision of heaven, the twenty-four elders cast their crowns at the feet of Christ, crying out: “Our Lord and God, you are worthy to receive glory and honor and power!” (Revelation 4:11). Everything changes because of who Christ is. By His sacrifice, He has given us abundant forgiveness and overwhelming love. He calls us to live our lives in thankfulness—and when we remember who He is and what He has done, how can we keep from falling at His feet in grateful love?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day9.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 8:1-56, Psalm 107:28-32, Acts 28:25-28",
        "devo_title": "Parables and Miracles",
        "devo_summary": "\nBY Rebecca Faires\n\nJesus used parables to teach both the crowds and His disciples. Typically, He first spoke the parable in the hearing of all, and then in private explained it to His disciples. But even the disciples were curious about this, and so they asked Jesus, “Why are you speaking to them in parables?” (Matthew 13:10).\nIt’s a funny thought. Why would Jesus want to make things more complicated? Isn’t the kingdom of heaven a sufficiently difficult idea to grasp without riddles? And isn’t it hard enough to comprehend what it means that Jesus is the Messiah, even when explained in plain Aramaic?\nYes! And here’s Jesus’s fascinating response, “Because the secrets of the kingdom of heaven have been given for you to know, but it has not been given to them” (v.11). What?! The disciples got secrets that everyone else didn’t get? But wait, there’s more. Jesus continued, “For whoever has, more will be given to him, and he will have more than enough; but whoever does not have, even what he has will be taken away from him. That is why I speak to them in parables, because looking they do not see, and hearing they do not listen or understand” (vv.12–13).\nThey think they understand, but they don’t. Now when we read Jesus’s parable of the sower and see the Word fall on unfruitful ground, we can see what He’s talking about. Some hearts are hard, and some hearts are not ready.\nChrist’s Word was at the center of His ministry. His Word is valuable—His Word is life—and not everyone understood it. We stand at a wonderful time in history because now we, like His disciples, get to be taken aside to hear Him explain His own Word. The messianic mystery is made even more understandable for us than it was for the disciples because we have access to the entirety of Scripture.\nLike the disciples, we need Christ to interpret His Word. Without the illuminating work of the Holy Spirit, we are like those who have eyes yet see not, and have ears yet hear not. Apart from Christ, we are unfit soil and will bear no fruit.\nLike the disciples, we are to listen attentively and carefully, seeking to know more. We are not to clutter our hearts with the vain loves and cares of this world. “Therefore, take care how you listen” (Luke 8:18). The light of the world has come to reveal all things, and in His light, nothing remains hidden. So let us look to the Lord and ask Him to give us eyes to see, ears to hear, and hearts to believe (Acts 28:27).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day10.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 9:1-27, Acts 13:44-52, Romans 10:1-15",
        "devo_title": "Take Up Your Cross",
        "devo_summary": "\nBY Rebecca Faires\n\nIn the quiet following the large-scale, miraculous feeding of the five thousand, Jesus asked His disciples, “Who do the crowds say that I am?… Who do you say that I am?” (Luke 9:20).\nEveryone had their own version of who Jesus was. Many, like Herod, were curious but perplexed. Others believed Him to be Elijah, a prophet of old, or a resurrected John the Baptist. And I can’t blame them, because even with all the prophecy and typology in the Old Testament, no one had ever seen the Messiah. Jesus as Messiah was a completely new kind of being.\nBut good old Peter jumps right in with the correct Sunday-school answer: “God’s Messiah.” Bam! Atta boy, Peter. But even Peter’s confession was revealed to him, not by flesh and blood, but by the heavenly Father (Matthew 16:17). Even Peter needed help sorting out the right answer.\nAnd who is God’s Messiah? What does this designation mean? The true Messiah would be the One who would suffer and die for the sins of God’s people, and after three days rise again, though not even Peter had understood that much. The Messiah was not merely one of the prophets, or Elijah, or John. He was the One for whom John prepared the way in the wilderness. We have the advantage of history on our side, knowing that Jesus did suffer, die, and rise again. And we can use that advantage to answer with Peter, “You are God’s Messiah.”\nWhat should we do with this information? Right away Jesus follows Peter’s confession with: “If anyone wants to follow after me, let him deny himself, take up his cross daily, and follow me” (Luke 9:23). Since I don’t have a physical, wooden cross handy, I can’t help but wonder, What does it means to “take up your cross”? Jesus laid aside His glory to bear the cross to Calvary; this was His greatest act of self-denial and obedience to the Father. It is self-denial for the glory of God.\nIn the same way, He calls us to set aside our own wills and be fully devoted to the Father’s will. Here’s the sticking point: This is the hardest thing on earth to do. I love doing my own will. It’s my favorite thing. And Jesus specifies that taking up one’s cross is a daily action. With the apostle Paul, our response to the risen Messiah is to die to ourselves daily (1 Corinthians 15:31). So every day, we are called to do the absolute hardest thing in the world—die to ourselves and set aside what we want.\nWe’re all like Peter; we can blurt out Sunday-school answers, but the very next minute, we need someone to say to us: “Get behind me Satan!” (Matthew 16:23). We aren’t able to set aside our own will so easily. So how do we take up our cross? We simply take up Christ. We fall at the beautiful feet of the One who has brought us the good news of the gospel (Romans 10:15). We cling to Him, leaning on His perfect righteousness, day after day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day11.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 9:28-62, Exodus 34:29-35, 2 Corinthians 3:18",
        "devo_title": "In His Name",
        "devo_summary": "\nBY Rebecca Faires\n\nHave you ever watched kids wait for the bus? Our kids wait at the end of a long driveway, and somehow that distance makes them think they are surely out of my eyeshot. They imagine themselves in a Lord of the Flies world, where no adult can see them, and a child would willingly bludgeon his brother for fruit snacks. They act like the bus stop is a land of limbo where perfect impunity reigns supreme. But our driveway is just not that long.\nDrinking my coffee, I watch from the window as my own children frantically blow through a punch list of morning offenses. They are in such a hurry to let it all hang out before they find themselves under the next authority: Miss Pitt, the bus driver. She will brook no nonsense in a moving vehicle. The world is a sinful place, though, and Miss Pitt isn’t always looking in her giant rearview mirror, telling them to sit back down.\nMy kids aren’t outliers. We all enjoy the luxury of being out from under authority, to cut loose and do what’s right in our own eyes. And we are the people the Christ came to save. Those of us who are giving noogies, slapping faces, and stealing cookies at the bus stop—those of us who are hiding our shame, returning to our sins, and feeling beaten down by what we’ve done. We are the people Christ came to save. We’re all in the same boat. We’re just better at hiding our misdeeds than children are.\nThe day after Jesus’s transfiguration, He came down from the mountain, into the adorable, unwashed fray of regular humans, and He immediately encountered our brokenness. “You unbelieving and perverse generation, how long will I be with you and put up with you?” (Luke 9:41). He knows that we are trying to hide from authority, but this is exactly why He came. He came down from glory to heal a broken world.\nEven in the midst of His longing for our redemption, Jesus was about the business of healing, saying to the man in the crowd, “Bring your son here” (v.41). While the crowd and the disciples worried about who was supposed to be able to cast out demons, Christ had fixed His eyes upon the redemption of all things. He knew about the glory of God and was not confused by squirrely, bus-stop shenanigans. He knows that we are broken and full of terrible nonsense, but Jesus understands who He is, who His Father is, and who we are. He is not surprised that we are getting it wrong; that’s literally why He came.\nJesus came to save the lost and the broken. He shows forth the glory and greatness of God. Be astonished today, not at the misdeeds of man—that’s not surprising at all—but at the greatness of God’s love and grace for us. His name is great, and He is greatly to be praised (v.43).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day12.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Psalm 107:28–32",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\n28 Then they cried out to the LORD in their trouble,\nand he brought them out of their distress.\n29 He stilled the storm to a whisper,\nand the waves of the sea[a] were hushed.\n30 They rejoiced when the waves[b] grew quiet.\nThen he guided them to the harbor they longed for.\n31 Let them give thanks to the LORD\nfor his faithful love\nand his wondrous works for all humanity.\n32 Let them exalt him in the assembly of the people\nand praise him in the council of the elders.\nPsalm 107:28–32\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/SRT-LUKE-instagram-Day13.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 8:25",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse captures the disciples’ response to Jesus when He calmed the storm.\nThey were fearful and amazed, asking one another, “Who then is this? He commands even the winds and the waves, and they obey him!”\n– Luke 8:25b\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/12/4-Luke-2.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 10:1-42, Psalm 16:1-11, Romans 10:14-17",
        "devo_title": "The Son Reveals the Father",
        "devo_summary": "\nBY Guest Writer\n\nI was born in the 1980s—before digital cameras, before text messages or Instagram or any other instantaneous method of sharing photos of newborns existed. My dad used to take pictures of me and physically mail them to his parents. According to family legend, when my grandmother opened the envelope, she would call my dad and ask, “Why did you mail me a baby picture of you?”\nMy grandmother kept pictures of her family everywhere, on almost every available square inch of her walls and tables. It was one of my favorite things about her house. Every time we’d visit, we’d look at the baby picture of me next to the baby picture of my dad and marvel at the similarity; I looked exactly like my dad as a baby.\nScripture tells us Jesus is the exact expression of God’s nature (Hebrews 1:5). He “is the image of the invisible God,” and all of God’s fullness—all of it!—dwells in Jesus (Colossians 1:15,19). Jesus reveals this to His disciples in Luke 10, giving them a glimpse into His divinity. Jesus was God in the flesh, walking around on earth—fully man, fully God. The invisible God (John 1:18) became visible, flesh and bone, to dwell with His people.\nThe technical term for Jesus’s humanity and divinity is the “hypostatic union,” the mystery of His perfect union of God and man. We don’t know how that union works; we only know that it does. Jesus also tells us why the Father it is a mystery: because the Father intended it to be (Luke 10:21).\nThe Word became flesh and dwelt among us… we have all received grace upon grace from his fullness… No one has ever seen God. The one and only Son, who is himself God and at his father’s side—he has revealed him (John 1:14–18).\nJesus came because it was the Father’s good pleasure for the Son to dwell here, to live a fully human life, to stand in our place, and to take the punishment for our sin. Jesus came to reveal the Father’s lavish love and the riches of His grace. This Jesus, who loved sinners and outcasts, who died for His people to satisfy justice and turned over temple tables in perfect, righteous anger, who wept at the death of His friend and washed His disciples’ feet—this is our God incarnate, the full and perfect expression of who our God is. All glory and honor forever be to Him!\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram15.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 11:1-54, Isaiah 55:6-7, Romans 8:14-17 ",
        "devo_title": "True Blessedness",
        "devo_summary": "\nBY Guest Writer\n\nI was home alone one evening when someone started knocking at my door. We have a rather unwelcoming “No Solicitation” sign posted on our door, and it was past the time for a postal delivery. And yet, the knocking persisted. Generally, I don’t answer the door when I’m home alone, but I peeked around the corner and saw that it was our friendly neighbor, looking exceptionally apologetic.\n“Do you have a corkscrew we could borrow?”\nWe did, and I gave it to him, and sincerely told him to knock anytime.\nThe parable Jesus tells in today’s reading is about a persistent neighbor, only this one is knocking and knocking and knocking at midnight, after the whole house had already gone to bed. Some commentaries call this parable humorous, a quality we don’t always assign to Jesus’s words, but in this case, the story plays out a bit like a sitcom.\nA man and his family are asleep in bed, when a neighbor starts knocking. Eventually, the man gets up, begrudgingly, not out of the kindness in his heart, but because of his friend’s “shameless boldness” (Luke 11:8).\nThe point Jesus is making is not that we should be hospitable at all costs, even dragging ourselves out of a warm bed in the middle of the night to give our neighbor some bread. He’s telling us we should approach God with the same shameless boldness of the knocking neighbor in the parable. Some translations call it the neighbor’s “impudence,” or “shameless audacity.” These are not words I typically think of when I pray.\nI am learning, however, to be persistent in prayer, praying the same things over and over again—not out of disbelief, but out of belief and faith. Every night, I pray the same words over my daughters: “Please show them how much You love them. Give them hearts that love You, eyes that see You, ears that hear You.” It’s not laziness, but persistence. Over and over, I ask, seek, and knock at God’s door in prayer.\nJesus’s illustration of persistent prayer follows the Lord’s Prayer, a tangible example of how we should pray every day. His answer to the disciples’ request, “Teach us to pray,” is two-fold. First, pray for things like these. Second, pray persistently.\nYesterday, in Luke 10, we read about how Jesus came to reveal the Father. Today, He shows us how we can speak to the Father. Jesus invites us to know Him. And through Him, we’re invited to know the Father, too, to pray to Him without ceasing.\nMay we ask, seek, and knock with persistence and faith, knowing that God will always answer for the good of all those who love Him, and to make known the riches of His glory (Romans 8:28; 9:23).\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram16.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 12:1-59, 1 Kings 10:4-10, Psalm 88:1-7",
        "devo_title": "Acknowledging Christ",
        "devo_summary": "\nBY Guest Writer\n\nMore often than not, there are times when anxiety feels like my closest friend. It greets me in the morning, my heart rate rising with the sun. It follows me to the mirror, to the breakfast table, to the car, to work. It is the shadow I can’t get rid of, an endless churning of guilt and shame and fear in my heart and mind. It’s a disease, a chemical imbalance, a generational struggle.\nThis particular passage in Luke features a lot of anxiety, from the revelation that nothing hidden won’t eventually be known, to the fear of death, to the “unforgivable sin,” to Jesus’s famous command not to worry because we are worth more than the wildflowers and the sparrows.\nI tend to read Luke 12 as if it’s all about me: what I worry about, what I value, what I should or shouldn’t do. Don’t be like the Pharisees; fear God. Don’t be afraid; acknowledge Jesus as the Christ and don’t deny Him. Don’t blaspheme the Spirit (which is considered the “unforgivable sin,” the denial of Jesus’s work to the point that one considers it to be demonic). Don’t store up treasure for myself. Don’t worry about clothes or food—and on and on.\nWhile I do think Jesus is teaching us a lot about ourselves, our worldly impulses, and the things we worry about, He is also revealing much about God, His character, and His work. There are three specific truths I want to rest in today: first, the sovereignty and care of the Father; second, the advocacy of the Son; and finally, the provision of the Holy Spirit.\nThe Father: In Luke 12:6–7, we see a clear picture of the limitless power and the all-surpassing knowledge that God possesses. Everything hidden will be revealed. This would be terrifying if it weren’t for the next part. Even though everything awful we’ve ever done will made public, our belief in the life, death, and resurrection of Jesus makes us clean before God.\nThe Son: In verse 8, Jesus tells us that if we acknowledge Him, He will acknowledge us in the presence of God the Father (“before the angels of God” is a reference to God’s presence). He is our advocate in prayer before God, but He is also our advocate for salvation before God, the righteous Judge.\nThe Holy Spirit: Verse 12 teaches that the Holy Spirit is our provider, who will give us the words we need to acknowledge Christ when we are persecuted. Jesus promises His followers that the Spirit will give them what they need to continue in faith.\nIn a passage known for its treatment of anxiety, Luke assures us that God the Father, God the Son, and God the Spirit are working together in perfect unity, to care for us in perfect knowledge, perfect advocacy, and perfect provision.\nI may battle my anxiety until the day I walk into glory, but the death of my anxiety is assured because of the life of Jesus. The more the book of Luke reveals to me about the beauty of the Son, the closer I feel to the heart of the Father.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram17.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 13:1-35, Deuteronomy 32:10-14, Psalm 137:1-9",
        "devo_title": "The Narrow Way",
        "devo_summary": "\nBY Guest Writer\n\nIn Andrew Peterson’s beloved Christmas album Behold the Lamb of God, he sings the song, “Deliver Us,” based on Jesus’s lament for Jerusalem in Luke chapter 13. He sings, hauntingly,\nJerusalem, Jerusalem \nHow often I have longed\nTo gather you beneath my gentle wings.\nEven typing these words brings tears to my eyes. Peterson captures, in a way that only master songwriters can, the ache of the ages. The song ends with those lines, an answer to the previous verses that are sung from the perspective of God’s wandering people:\nOur sins they are more numerous than all the lambs we slay\nOur shackles they were made with our own hands\nJesus’s lament summarizes the history of God’s stiff-necked people. Jerusalem—used here both literally, in reference to the city, and also as a metaphor for God’s people throughout time—had a history of turning away from God and abandoning the prophets, judges, and even the Messiah God had sent to them. Even earlier in this chapter, we see a specific example of the Pharisees questioning Jesus’s miracles. The crowds believed, but the leaders rejected Him.\nDespite the innumerable sins of His people and their continuing self-imprisonment due to their own choices, Jesus weeps over the city and the people He came to save (Luke 19:41). God longs to gather His children, to protect them, to gather them under His wings (Psalm 91:4). Jerusalem is His greatest joy (Psalm 137:6), the people He will go to the greatest lengths to save. It is the promise of the whole of Scripture.\nJesus stands outside of the city where He will die, and His lament is not for His death. His lament is for the people He longs to save. He has just finished warning them, telling them that by not believing Him they will not join Him in the kingdom of God. But His lament shows us that He does not make these proclamations about the narrow way out of anger, but out of grief.\n“How often I wanted to gather your children together…\nbut you were not willing!” (v.34).\nEven in His lament over the past and current rejection of His people, Jesus knew He would be rejected yet again in Jerusalem. But the steadfast, faithful, persistent love of the Father through the ages, embodied in the person of Christ, never fails. Love would carry Jesus all the way to the cross, into the dark tomb, and ultimately, into the glorious resurrection—where He invites us to join Him, forever.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram18.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 14:1-35, Proverbs 25:6-7, Romans 12:16",
        "devo_title": "Teachings on Humility",
        "devo_summary": "\nBY Guest Writer\n\nI am uncomfortable writing about pride and humility, precisely because I have too much of one and not nearly enough of the other. I dare say I’m not alone, either. I did a little bit of cultural research when I started writing this, because I wanted to see how other people talk about humility.\nFirst, I found a series of business articles in prominent journals about how humility is the secret to good leadership—including an article literally titled, “17 Reasons Humility Will Help You Get Ahead.” Later, I found an article about the power dynamics of choosing your seat in a business meeting, and research about the psychology behind your choice.\nWhat Jesus says in Luke 14:7–14 is exactly the opposite: “But when you are invited, go and recline in the lowest place” (v.10). When He tells this parable, Jesus isn’t teaching a large crowd. He is eating a Sabbath meal in the house of Pharisees, the group that would be largely responsible for later placing Him on trial.\nIn this chapter, Jesus confronts the Pharisees three times. First, He heals a man on the Sabbath, an issue over which the Pharisees had previously confronted Him. Second, having observed the Pharisees carefully choosing their seats at the Sabbath meal, He tells a parable about being humble and always choosing the worst seat. Third, He tells another parable about a wedding feast where none of the invited guests come, so the host extends the invitation to the poor, the maimed, the lame, and the blind.\nThroughout Luke, we see Jesus inaugurating the kingdom of God and proclaiming its values. He challenges the Pharisees, and He challenges our hearts. The parables He tells are for His immediate audience, but they are also for us, showing us the way life should work in His kingdom. And in the kingdom of God, humility isn’t a tactic to get ahead. It’s not a carefully-calculated decision about where to sit in a meeting, or at a party.\nIn his book, The Freedom of Self-Forgetfulness, Tim Keller writes:\nGospel-humility is not needing to think about myself. Not needing to connect things with myself. It is an end to thoughts such as, ‘I’m in this room with these people, does that make me look good? Do I want to be here?’ True gospel-humility means I stop connecting every experience, every conversation, with myself. In fact, I stop thinking about myself. The freedom of self-forgetfulness. The blessed rest that only self-forgetfulness brings.\nI’ll pray through those words today, asking for self-forgetfulness and gospel-humility, asking for the Spirit to convict me when I put people and things before Jesus, and praying, inspired by the words of Paul in Romans, “Live in harmony with one another. Do not be proud; instead, associate with the humble. Do not be wise in your own estimation” (v.16).\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram19.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Romans 10:14-17",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n14 How, then, can they call on him they have not believed in? And how can they believe without hearing about him? And how can they hear without a preacher? 15 And how can they preach unless they are sent? As it is written: How beautiful are the feet of those who bring good news. 16 But not all obeyed the gospel. For Isaiah says, Lord, who has believed our message? 17 So faith comes from what is heard, and what is heard comes through the message about Christ.\nRomans 10:14–17\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram20.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 12:32",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse about the relationship between God and believers.\n“Don’t be afraid, little flock, because your Father delights to give you the kingdom.” \nLuke 12:32\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT_4-LUKE-3.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 15:1-32, Ezekiel 34:11–12, Romans 3:10-20 ",
        "devo_title": "Lost and Found",
        "devo_summary": "\nBY Guest Writer\n\nIf you’re fortunate, it’s been long enough since you’ve experienced being lost, that you’ve forgotten the sheer terror of it. Dig into your memories and find yourself there again, tucked into a clothing rack at a department store, searching for signs of your mama, or wandering through an unfamiliar city without your GPS, and allow yourself to feel it anew. The sweaty palms, the dry mouth, the disorientation that comes from not knowing which direction to go, the desperation to find yourself safely tucked back into the arms of the familiar.\nWe can’t fault the Pharisees and scribes, not really. They saw Jesus breaking bread with the “lost,” and they forgot, bless them, how remarkable it is to be found. “And the Pharisees and scribes were complaining, ‘This man welcomes sinners and eats with them’” (Luke 15:2). And so Jesus lays out a series of lessons.\nHe starts with sheep, a relatively disposable commodity. As a sheep farmer myself, I can say with certainty that the flock matters, as do the individual hooves and horns that make it up, but a lost sheep or two is relatively minor. That is, unless you’re the Good Shepherd… or that one sheep who’s wandered off.\nAs the religious leaders listened to Jesus, perhaps they counted themselves among the ninety-nine, safe in the pen of rules and right thinking. And yet, whether in the pen or gone astray, the Good Shepherd deeply loves His sheep, all of them. Pay attention to the numbers in this first scene. The ratio of lost to found is one to ninety-nine, but Jesus is about to raise the stakes.\nConsider a woman with ten silver coins. One slips through her fingers. It’s lost but not forgotten. She searches earnestly until the coin is in her hands. In Jesus’s second story, the ratio of lost to found is one to nine. Perhaps the Pharisees were still stifling a yawn at this point. Who cares about a single straggling sheep or even a single roll-away coin? When it comes to livestock and treasure, value is all relative.\nBut what about a son? Would we disregard a lost son carelessly? A loving parent would exhaust every resource to bring their lost boy home. The ratio here is intimate. One boy at home and one gone astray, one obedient and one in rebellion. Each time the Lord teaches the principle, the margins narrow. Heaven can never become so full of the saved that the Lord will cease to care about the lost.\nThose who bear His image are not cattle to Him. He doesn’t think of us like pennies, barely worth being picked up off the sidewalk. We are His beloved children, the apple of His eye (Psalm 17:8). At the cross, He proved He would pay any ransom for us, even if we were the only one lost in the darkness of sin. What the Pharisees didn’t see was that Jesus wasn’t just eating a meal with the lost. He was searching for lost sheep, seeking missing treasure, and running to meet His beloved sons and daughters.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram22.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 16:1-31, Proverbs 15:16, 1 Corinthians 4:7-13 ",
        "devo_title": "Kingdom Values",
        "devo_summary": "\nBY Guest Writer\n\nWe tend to pluck out Christ’s teachings and deliver them as neat and tidy Sunday school lessons. Every word is true and useful (Proverbs 30:5; 2 Timothy 3:16), and yet, when we place ourselves in the sandals of the original hearers and listen as they would have listened, we discover a depth we might otherwise miss.\nLet’s use Luke 16 as our case study for this principle. Luke 15 sets the scene. A crowd of tax collectors and sinners had gathered around Jesus, annoyed that “this man receives sinners and eats with them” (v.2). The nerve! Jesus addressed their unrighteous indignation with a string of vivid lessons. If we were watching this text unfold as a theatre performance, our program might read something like this:\nScene 1: A sheep, a coin, and a son—three stories about the lost.\nThe curtains would then fall and rise again to…\nScene 2: A swindler, a beggar, and a rich man—two stories about true riches.\nChrist’s words, “One who is faithful in a very little is also faithful in much” (Luke 16:10, ESV), are scribbled into the bottom of my laundry baskets as a reminder that if Jesus can’t trust me to do laundry well and with joy, He surely can’t trust me with something more significant. Laundry aside, this is the point Jesus makes in the parable of the dishonest manager. Though at first glance it might seem Jesus holds up the manager’s swindling as model behavior, it’s not the dishonesty Jesus wants us to emulate; it’s that he views money as a means to an end. So should followers of Jesus; the accumulation of wealth should never be our goal, but if we can use earthly wealth for eternal good, we will prove ourselves faithful. “So if you have not been faithful with worldly wealth, who will trust you with what is genuine?” (v.11, CSB).\nFast forward a few verses. Jesus is still responding to the hard-hearted Pharisees (vv.14–15) when He tells the tale of a rich man and a beggar named Lazarus. Lazarus dies and is in glory; the rich man dies and is in torment. After the rich man pleads for Lazarus to go to his relatives and call them to repent, the lesson ends with these words: “If they don’t hear Moses and the Prophets, neither will they be convinced if someone should rise from the dead” (v.31). God’s Word has been beating the same drum since the beginning: wealth might make things easier in this life, but it’s not what matters for the next. End scene.\nJesus was talking to people who valued wealth and saw it as a sign of God’s favor, but He reminds them that the kingdom doesn’t have quite the same economy. The faith of a child—not money or possessions—is all that’s needed. Money is alluring, but it is a master who ultimately disappoints. God looks at our hearts, not our bank account statements. “And he told them, ‘You are the ones who justify yourselves in the sight of others, but God knows your hearts. For what is highly admired by people is revolting in God’s sight’” (v.15).\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram23.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 17:1-37, Deuteronomy 10:12-13, Hebrews 3:7-11",
        "devo_title": "Faith and Duty",
        "devo_summary": "\nBY Guest Writer\n\nI’ve sung the hymn “Come Thou Fount of Every Blessing” nearly every night for the past decade. It’s the lullaby I sing over my children as I put them to sleep. I’ve spent thousands of hours rocking a swaddled cherub in my arms and softly singing these words:\nCome, Thou Fount of every blessing\nTune my heart to sing Thy grace\nStreams of mercy, never ceasing\nCall for songs of loudest praise\nI mean it. Deep down in my gut, I swear I do. And yet, in the light of day, when life is hard, my heart doesn’t turn toward praise quite so easily. The Lord described us perfectly when He said, “They always go astray in their heart; they have not known my ways” (Hebrews 3:10). There’s no sense in trying to sugarcoat it.\nThe prophet Isaiah declared, “We all went astray like sheep; we all have turned to our own way” (Isaiah 53:6). It’s why Robert Robinson, writer of the hymn I mentioned above, included these words, “Prone to wander, Lord I feel it. Prone to leave the God I love…” And why I sing them to my babes, knowing they inherited their wandering hearts from me. I’m so prone to wander toward fear, doubt, and worry, instead of trusting that God will come through. If the measure of my blessings hinged on the amount of my faith, I’d have to go without.\nFaith is the only gift we have to offer the Lord. It’s what the Samaritan leper brought Jesus in Luke 17, and it was enough. “And he told him, ‘Get up and go on your way. Your faith has saved you’” (v.19). But unlike faith, the grace of God isn’t measured in mustard seeds. The “streams of mercy” we sing about are more like a tidal wave, capable of washing away our sin and guilt (Zechariah 13:1), even when our faith is frail.\nPerhaps the reason I’m so comforted by the words of Come Thou Fount, is because of a story I once heard about its songwriter. As it goes, one day Robinson was riding in a stagecoach when a lady asked him his thoughts on the hymn she’d been humming. Robinson reportedly replied, “Madam, I am the poor unhappy man who wrote that hymn many years ago, and I would give a thousand worlds, if I had them, to enjoy the feelings I had then.”\nI’m so grateful for and encouraged by the disciples’ request of Jesus, found in Luke chapter 17. They asked, “Increase our faith!” (v.5). Their words remind me of the tender prayer of a father desperate to see Jesus heal his boy found in Mark 9:24, “I do believe; help my unbelief!”\nProne to wander. Lord, I feel it. And yet, we serve a God who is relentless in pursuit of us (Luke 15:4). Whether you have faith the size of a mountain or a speck today, you can wrap yourself up tightly and rest in this:\nJesus sought me when a stranger\nWandering from the fold of God\nHe, to rescue me from danger\nInterposed His precious blood\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram24.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 18:1-43, Genesis 18:13-15, Jeremiah 32:17 ",
        "devo_title": "Entering the Kingdom",
        "devo_summary": "\nBY Guest Writer\n\nIn my high school youth group, we used to play a game I loved. The game was Bigger or Better, and the object was simple: keep trading up for the biggest or best prize. To start, we were divided into teams and each team was given a single paper clip. We were then unleashed on a neighborhood with a simple assignment: “Come back with something bigger and better than this.” We’d go house to house, making trades. At first, we’d trade in the paperclip for something smallish, like a cup or dish. We’d trade that in for something bigger… say, a basketball or framed piece of art. And on and on we’d go, until we were called back together to display our spoils.\nTrading up is always a thrill. This is the message the rich ruler seemed to miss during his encounter with Jesus. He had his eyes on the prize of eternal life, but he misunderstood the path to getting there. Though he recognized Jesus as a “good teacher,” he missed God’s heart. This ruler was a good child who turned into a good man, and he wanted assurance that he was good enough.\nJesus rattled off a few of the ten commandments: “Do not commit adultery; do not murder; do not steal; do not bear false witness; honor your father and mother” (Luke 18:20). To which the man had the audacity to respond, “I have kept all these from my youth” (v.21). But even if this man had been perfectly obedient with these commandments, keeping the letter of the law is not the same as following the heart of the God behind that law.\nJesus offered him a trade up.\nInstead of keeping all the rules, the man could sell all his belongings. You see, Jesus knew that despite his outward obedience, the rich young ruler was missing out. His money was in the way. Rather than asking the man to make a tremendous sacrifice—another religious task—Jesus was really offering the man his freedom. But it does not always appear that way to those of us who hear such offers. No wonder the crowds declared, “Then who can be saved?” (v.26).\nJesus’s response: “What is impossible with man is possible with God” (v.27).\nGo on, bring to the Lord whatever you hope will save you. Bring your good works and best days. Bring your charity and church membership. Bring your idyllic childhood and productive adulthood. And trade them in. He may not ask you to sell everything and give the proceeds to the poor, but He will ask you to part with anything in your life that’s keeping you from knowing the love of God.\nAccept Christ’s invitation to lay down your goodness for something better. It’s a trade up.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram25.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 19:1-48, 2 Chronicles 16:9, James 4:13-17",
        "devo_title": "The Triumphal Entry",
        "devo_summary": "\nBY Guest Writer\n\nOne of the great riddles of being human is what to do with all the waiting.\nWe wait for the seasons to change.\nWe wait for our hurts to heal.\nWe wait for our children to grow up… then wait for them to return home.\nWe’re all waiting for something, and as my favorite rocker, the late Tom Petty, liked to remind us, “The waiting is the hardest part.”\nPay close attention to what’s happening in Luke 19, and you’ll see that while Christ’s followers were celebrating His triumphal entry into Jerusalem, they were waiting too. Verse 11 reveals, “As they were listening to this, he went on to tell a parable because he was near Jerusalem, and they thought the kingdom of God was going to appear right away” (emphasis mine).\nThe crowds were following Jesus, expecting Him to bring an end to their waiting. They thought He would enter Jerusalem, exile the government that had been oppressing them, and establish the glorious kingdom He’d been telling them about. This is the moment, they must have thought, when all the waiting—for freedom, for peace, for victory—will surely pay off. \nBut Jesus wasn’t about to stage a coup. He was marching toward the cross. The crowd’s hopes and dreams for the establishment of Christ’s kingdom on earth would have to wait. (At least for the kingdom the way they had expected it).\nFast-forward to today. You’re still waiting too. So am I. We want to see God move in our lives. We want to watch Him come in power and abolish everything that causes us pain. Instead of wringing our hands and pacing the floor, what can we do while we wait?\n“The whole crowd of the disciples began to praise God joyfully with a loud voice for all the miracles they had seen” (v.37). Though at this point the crowds still assumed Jesus was going to lead a military victory, they were right to rejoice over what they had already seen in anticipation of what was still to come.\nThe greatest indicator of what Christ will do is what He has already done. In every season of waiting we can join with the “multitude” of saints in declaring the victories He’s already given. The disciples had no way of knowing they were watching a preview of a future celebration of Christ’s triumph, when He will one day return in glory:\n“Then I saw heaven opened, and there was a white horse. Its rider is called Faithful and True, and he judges and makes war with justice… The armies that were in heaven followed him on white horses, wearing pure white linen… And he has a name written on his robe and on his thigh: King of Kings and Lord of Lords (Revelation 19:11,14,16).\nCelebrate every promise you’ve seen Him fulfill, every victory He’s ever secured, every blessing He’s every poured out. They are the down payment for the moment when all of our longings will be fulfilled. May we worship while we wait.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram26.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Ezekiel 34:11-12 ",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n11 “‘For this is what the Lord God says: See, I myself will search for my flock and look for them. 12 As a shepherd looks for his sheep on the day he is among his scattered flock, so I will look for my flock. I will rescue them from all the places where they have been scattered on a day of clouds and total darkness.\nEzekiel 34:11–12\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram27.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 19:10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Luke.\n“For the Son of Man has come to seek and to save the lost.”\nLuke 19:10\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT_4-LUKE-4.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 20:1-47, Isaiah 26:19, 1 Peter 1:3-4",
        "devo_title": "The Authority of Jesus Challenged",
        "devo_summary": "\nBY Claire Gibson\n\nPatrick and I sat in a tasting room with ten strangers, drinking wine from delicate glasses. Before us, an expanse of windows revealed a golden hillside. Our host raised a bottle of cabernet and smiled. As he poured the red wine, he told us about the vineyard’s renowned owner, John Shafer, a man who, in 1972 had left a successful banking career in Chicago to purchase farmland in California. A pioneer in American winemaking, John Shafer’s wines helped put Napa Valley on the map.\nEnraptured by the tale and tastes, I almost didn’t hear the door open behind me. Turning, I saw an elderly man walk in, using a cane. Wrinkled but smiling, he had blue eyes and a faint suggestion of hair on top of his head.\n“Well, here he is,” the tasting host said, standing quickly from the table. “This is John.”\nI could tell from the flabbergasted look on our host’s face, that this was no normal drop in. At ninety-two years old, the vineyard owner rarely made appearances. For decades, he’d put in the hard work of tending grapes. Now, he trusted his sons and staff to maintain his legacy. As I stared at John Shafer’s face, I felt like I was in the presence of royalty. In his presence, I cared a lot less about the wine and a lot more about the man who’d made it.\nThroughout Scripture, a “vineyard” is used as a metaphor for the nation of Israel. In Luke 20, the crowd listening to Jesus’s parable would have recognized that symbol. With this story, Jesus proclaimed that if the Israelites rejected Jesus, the promises and inheritance of God would go to new owners. In other words, God was about to offer His grace, kindness, and salvation to the Gentiles. The chief priests, scribes, and elders reacted quickly, shouting, “That must never happen!” (v.16).\nImagine if John Shafer had turned to me, and right there in front of his employee, said, “Claire, I’d like you to take over the day-to-day operations of this place.” Consider if he’d smiled, raised a hand, and pointed to the land outside those shining windows. “The whole thing is under your management.” Do you think his employee would have raised a toast? Not likely. Instead, they would have thought the owner had gone mad.\nFor millennia, Jews held claim to the exclusive privileges of being God’s people. They couldn’t believe those blessings could extend to anyone else. Jesus’s presence, His kindness to Samaritans and women and disabled people, His claims to be the Son of God—threatened everything the Pharisees held to be true. They were in the presence of the vineyard owner, and yet they refused to release their death grip on the grapes. They couldn’t see the person because their eyes couldn’t look past their own power.\nIf I felt awed by the presence of John Shafer in a tasting room, how much more should I be in awe of Jesus, who hands me the keys to His kingdom? It’s a kindness so kind, it might be seen as irresponsible. He has given us an inheritance that is “imperishable, undefiled, and unfading” (1 Peter 1:4). Some may reject Him, but to all who receive Him, Jesus gives the right to become children of God (John 1:12).\nHe steps forward, points to the vineyard, and says, “My beloved sister, enjoy.”\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram29.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 21:1-38, 1 Thessalonians 5:2-4, Hebrews 12:25-29",
        "devo_title": "The Coming of the Son of Man",
        "devo_summary": "\nBY Claire Gibson\n\nOne of the great perks of being a novelist is the research. Recently, for reasons that are not fully apparent to me, I’ve been devouring anything I can read about Italian orphanages during and after WWII. I’ve even connected with an eighty-year old Neapolitan man through Facebook. Through Google translate, he’s shared about his experience growing up under the care of a Christian family, the Santis, who ran the only Protestant orphanage in Southern Italy, a place called Casa Materna.\nThough Casa Materna is now closed, I immediately ordered every book on Amazon about the place. In reading about the Santi family during WWII, I was struck by one situation in particular. Under constant surveillance by Mussolini’s fascist spies, Papa Santi, the founder of Casa Materna, was arrested for his activities and his preaching. At the trial, the judge asked him what he preached every Sunday at the orphanage. In response, Papa Santi began reading directly from the New Testament! His unjust persecution turned into an opportunity for unparalleled witness.\nFrom my position of safety and wealth, WWII might seem like ancient history. But I am really just two generations removed from that reality—a reality that may have looked a lot like Jesus’s prediction of the end of the age.\nJesus doesn’t sugarcoat the truth for His disciples. He explains that the future is going to be full of war, famine, plagues, and natural disasters. He describes the destruction of the temple, the destruction of Jerusalem, and the persecution of believers. It is a picture of great chaos. And yet! In the midst of that chaos, His followers are to stand firm and lift their heads.\nMuch like Papa Santi in the midst of the chaos of WWII, Jesus’s followers are not to be distracted by the chaos of the kingdoms of the world, but to keep their eyes focused on the kingdom that is coming, one that cannot be shaken. Jesus is our only hope, our only comfort. Despite the chaos of the world, He will still come back. The Son of Man will not leave us as orphans. He will come with power and great glory. He is coming back to rescue us. It is a certainty. He promises, “Heaven and earth will pass away, but my words will never pass away” (Luke 21:33).\nWe shouldn’t expect our future to look much different from what Papa Santi faced in his lifetime. But what Jesus told His disciples is still true for us. We do not need to prepare our defense against the world; we need only to draw close to the Defender.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram30.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 22:1-71, Deuteronomy 16:1-8, Galatians 1:3-5",
        "devo_title": "The Plot to Kill Jesus",
        "devo_summary": "\nBY Guest Writer\n\nWhen I was a freshman in college, I grew in my faith like never before. I became captivated by the gospel, thirsty for truth, and passionate about Jesus. It was one of the sweetest and most vibrant chapters of my faith, but this explosive growth was accompanied by one negative consequence: self-righteousness.\nWith my newfound convictions, I felt strongly about the way things should be done, and the way things should not be done. When I went home on breaks, I lectured my parents about our home church and the things that needed to change. I pronounced harsh judgments on friends who were not following Jesus. I frowned disapprovingly when my boyfriend’s parents drank wine with their dinner. I was, in a word, insufferable.\nThankfully, my parents were patient and wise. They listened and gently challenged some of my thinking, but they also recognized I was young and in need of shepherding. In contrast with my demeanor, they showed grace.\nI will never forget that season of my life, when my love for Jesus resulted in some very un-Jesus-like behavior. I will forever be humbled by it, because it continues to remind me of the truth that human brokenness and sin runs deep, perverting even our noblest intentions.\nIn Luke 22, this aspect of sin is on full display. First we have the chief priests, who oversee Jesus’s arrest. In his commentary, The Gospel of Luke, New Testament scholar Joel B. Green explains that these religious leaders “believe themselves to be serving God, yet unwittingly serve a diabolical aim.” Then, we have a disciple who, in his desperation to defend his teacher, draws his sword and cuts off the ear of a chief priest’s servant. Swiftly and sharply, Jesus condemns this violence (v.51).\nWithin this scene we see two different types of people who are trying to honor God and doing just the opposite instead. How can we avoid doing the same?\nFirst, we must admit that we will inevitably do the same, because we are human. The same brokenness that runs through the high priests, and the same brokenness that runs through the disciple (Peter, according to the parallel account in John 18) also runs through us. We will get it wrong, and that is precisely why we need a Savior. Even our best efforts can become mangled by sin. That said, the Lord’s Table—which sits at the center of this chapter—is a compass of sorts.\n“And he took bread, gave thanks, broke it, gave it to them, and said,\n‘This is my body, which is given for you. Do this in remembrance of me’” (Luke 22:19).\nWhen Jesus instructs His disciples to remember, He is not only talking about His death. He is also talking about the example He set throughout His life. Jesus is the Savior who does not need weapons or worldly power to achieve His means. Jesus transformed the entire world by humbling Himself and laying Himself down—first in a manger, and then on a cross—and this is the standard to which we are held. This is how we preach Christ, without opposing Him in the process.\n \n\nSharon Hodde Miller leads Bright City Church in Durham, NC with her husband Ike. She also holds a PhD on women and calling, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram31.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 23:1-56, Psalm 38:20-21, Acts 4:23-31 ",
        "devo_title": "The Death of Jesus",
        "devo_summary": "\nBY Guest Writer\n\nOn September 11, 1934, theologian Dietrich Bonhoeffer wrote the following words in a letter to a friend:\n“We must finally stop appealing to theology to justify our reserved silence about what the state is doing—for that is nothing but fear. ‘Open your mouth for the one who is voiceless’—for who in the church today still remembers that that is the least of the Bible’s demands in times such as these?”\nBonhoeffer penned this plea as the Nazi regime was gaining power, the death toll was growing, and many of his fellow Christians remained silent. He watched in horror as the German church failed to speak up and do what was right, choosing instead the false innocence of silence.\nEighty-five years later, it is easy to look back and judge. It’s easy to wonder how Christians in Germany failed so miserably. And yet, to do so is to deny one of the most common tactics of sin: shifting blame.\nBlame-shifting is a thread that runs throughout Jesus’s trial in Luke 23. Pilate knows Jesus is innocent, and he does not want to execute him, and so he hands Jesus off to Herod (v.7). Herod, in turn, sends Jesus back to Pilate (v.11). Pilate then appeals to Jesus’s accusers, suggesting that a lesser punishment would be appropriate (v.16–20). But the crowds are unsatisfied. They will settle for nothing less than the death penalty. For a third time, Pilate pleads with the crowd to be reasonable (v.22), but they will not be dissuaded. Finally, Pilate finally hands Jesus over to them.\nIt would have been easy for Pilate to blame the crowd for Jesus’s fate. After all, he spoke up—multiple times!—but they insisted. What more could he have done? It also would have been easy for Herod to blame Pilate. After all, he didn’t kill the man. He simply handed him over to someone else.\nThis is what sin does. It shifts blame while insisting on its own innocence: So long as I wasn’t the one nailing Jesus to the cross, or rounding up my Jewish neighbors, or leading the lynch mob—I am innocent.\nHowever, when we read the story of Pilate, we are reminded that God holds us to a far higher standard. The story of Pilate chastens us with the truth that a holiness built on omission, inaction, and looking the other way is no holiness at all.\nIn Stuart Townend’s famous hymn, “How Deep the Father’s Love for Us,” he describes the events of Luke 23 this way:\nBehold the man upon a cross,\nMy sin upon His shoulders;\nAshamed, I hear my mocking voice\nCall out among the scoffers.\nIt’s difficult to imagine mocking our beloved Jesus. It’s nearly impossible to envision a time when we might look into His heartbroken eyes and jeer, impossible to imagine that we might be included among those for whom He prayed, saying, “Father, forgive them, because they do not know what they are doing” (v.34). But the tragic story of Pilate reminds us that sometimes the loudest act of abandonment is choosing to say nothing at all.\n\nSharon Hodde Miller leads Bright City Church in Durham, NC with her husband Ike. She also holds a PhD on women and calling, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram32.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 24:1-53, Philippians 2:7-11, 1 John 1:1-3",
        "devo_title": "The Reality of the Risen Jesus",
        "devo_summary": "\nBY Guest Writer\n\nThis year, my husband and I started a church, and in many ways it has been the most amazing adventure of our lives. We have seen signs and wonders, answers to prayer, supernatural provision, and the fruition of God-given vision. My husband and I have been awed and amazed, and truly, we will never be the same.\nAnd yet…\nAll along, during these months of amazement, I have noticed something funny in my soul. Call it an “inability to digest.” I have seen the miraculous with my own two eyes. I have experienced it, and I have lived it. And still, a part of me wonders, Really? Did that really happen? It’s as if my faith cannot catch up. No matter what God does, no matter how powerful and unforgettable, my brain struggles to wrap itself around the truth.\nThis is the dilemma of being a finite human being who worships an infinite God. As long as we live on this earth, we will struggle to grasp the ways of God. We observe this struggle in Luke 24. First, there are Jesus’s closest female companions, who have followed Him and supported Him all the way. By this point, they should have “gotten it,” yet when they see the empty tomb, they still have to be asked, “Why are you looking for the living among the dead?” (v.5). Then, in verses 36–37, when Jesus appears to the disciples, they assume they are seeing a ghost. Even after studying His hands and feet, they were still wrestling with disbelief (v.41).\nWhat this tells us is that faith is much harder than we often like to admit, and we see this theme woven throughout the Gospels. Over and over, Jesus’s followers fail to understand Him, and they struggle to believe. Whether it’s Jesus’s purpose, identity, or plan they’re misunderstanding at any given moment, they are consistently unable to keep up. Their faith never does keep pace with all that Jesus is doing.\nAnd I get it. This year, I have found myself in that place again and again, fumbling for a faith that matches the magnitude of all that God is doing around me. It’s humbling and convicting.\nThankfully, the good news of Jesus Christ does not rise and fall on the size of our faith. If that were the case, Jesus’s disciples would not have accomplished very much. Instead, the gospel of Jesus Christ rises and falls on the reality of His life, death, resurrection, none of which is strengthened or diminished by our ability to fully comprehend it.\nThis is the grace we have in Christ. Our faith will never match the size of His works. Our belief will never catch up to all that He is doing. But the story of Luke is the story of God using imperfect people with imperfect faith to accomplish Christ’s mission in the world. All that God requires is a willing heart—willing to try, and willing to fail—trusting Him to redeem the whole of it.\n\nSharon Hodde Miller leads Bright City Church in Durham, NC with her husband Ike. She also holds a PhD on women and calling, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram33.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Isaiah 26:19 ",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nYour dead will live; their bodies will rise.\nAwake and sing, you who dwell in the dust!\nFor you will be covered with the morning dew,\nand the earth will bring out the departed spirits.\nIsaiah 26:19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT-LUKE-instagram34.jpg"
    },
    {
        "book_title": "Luke",
        "devo_passages": "Luke 23:42",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the thief’s confession to Jesus on the cross.\nThen he said, “Jesus, remember me when you come into your kingdom.”\nLuke 23:42\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/01/SRT_4-LUKE-5.jpg"
    },
    {
        "book_title": "John",
        "devo_passages": "John 1:1-50, Genesis 1:1-5, Isaiah 55:10-11, Hebrews 1:1-4",
        "devo_title": "The Word Was God",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: John 1:1-50, Genesis 1:1-5, Isaiah 55:10-11, Hebrews 1:1-4\nGathered around the living room, we remained seated as the doorbell continued to ring. We didn’t need another casserole or vase of sympathy flowers; we needed words. \nVoid of compassion, the blank document—an unforeseen obituary—stared back at us, wringing all adjectives of their meaning, one after another. Each suggested description seemed to shrink our beloved boy, the one who held the titles of both my best friend and my younger brother, into someone foreign and unrecognizable. The task of fitting all of his life and all of our love into one small newspaper column was exhausting, so we traded our pencils for pillows and gave up for the night. \nA few hours later, unable to sleep, I rolled over to see a small beam of light coming from downstairs, and decided to follow it. I found my sleepy-eyed father furiously scribbling notes on a stack of white index cards. Between the light blue lines were favorite stories, memorable quotes, and beloved quirks. My dad handed me a stack, and as the dark sky faded into morning, our collection of cards finally created the outline of something familiar—someone familiar. \nI imagine the Apostle John sitting down to translate the encounters he’d had with Jesus into suitable words. To him, Jesus was not a faraway character, but a trusted friend and beloved Savior. Writing these words, this Gospel account, John probably recalled intimate details about Jesus—the way He smelled, what His favorite foods were, the sound of His laugh. He could clearly call to mind the expressions his friend made when feeling tired or excited or somber. Yet, John undertook the task of assembling words to describe the heaven-sent Son of God to those of us who didn’t know Jesus in the flesh.\nJohn must have had a wealth of stories to choose from when deciding how to open his eyewitness account. But, through the Holy Spirit’s inspiration, this dear friend of Jesus begins his narrative with the thing that identified Jesus most: \n“In the beginning was the Word,\nand the Word was with God,\nand the Word was God.”\n– John 1:1\nAfter years of witnessing Jesus’ parables, miracles, and interactions firsthand, John presents Jesus as the Word—a tangible love letter from God. Jesus did not come to merely deliver a message from God—He Himself is the message. \n“The Word became flesh and dwelt among us. We observed his glory, the glory as the one and only Son from the Father, full of grace and truth.”\n– John 1:14\nThe Apostle John’s words are not only the beginning to another chapter in the Bible; they are the beginning to understanding who Jesus is. He is our promised Savior. He is the one who has been with God from the beginning. He is the Word.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-John16-Instagram1s.jpg"
    }
]