[
    {
        "book_title": "Mark",
        "devo_passages": "Mark 1:1-45, Nahum 1:15, Malachi 3:1",
        "devo_title": "Jesus’ Ministry Begins",
        "devo_summary": "\nBY Raechel Myers\n\nText: Mark 1, Nahum 1:15, Malachi 3:1\nI sometimes study best with a pen in hand. \nThere’s probably some scientific reason to explain the powerful connection between our hands and head as they interact with the same thing—or maybe I just made that up. Either way, it totally works for me. When I really want to learn something, I use a pen to help me make a visual map of the text I’m reading. The book of Mark calls for pen-in-hand reading; there’s a lot going on and it all happens very quickly.\nThe apostle Luke spends the first two chapters of his Gospel beautifully telling the story of the expectation and arrival of the baby Jesus. Matthew walks us through one long (and super important!) genealogy of Christ before any real narrative begins. And John takes time to establish Jesus as the Word who was with God and is God. All wonderful stuff, critical to the canon.\nMark, on the other hand, hits the ground running. And really, he never stops. Heavy on directional language and light on details, the first chapter alone includes at least ten significant plot points, all connected with words like “immediately” and “right away,” as we whiplash into yet another important scene. (You know I marked every one of them with my trusty pen. Pun intended.)\nNow, I’m not accusing Mark of writing like he’s running out of time, but there is an efficiency to his message that tells me there’s no time to spare. The gospel is urgent, and there is much Mark wants his readers to know about the Christ he loves and follows.\nStill, amid the rapid-fire storyline of the first chapter of Mark, the moments of stillness have a way of standing out. (And yes, I marked these too.) Juxtaposing all the noisy action on the page, Jesus retreats to the wilderness (v. 12), silences an unclean spirit (v. 25), does not permit the demons to speak (v. 34), goes away to a deserted place to pray (v. 35), tells the healed man to keep quiet (v. 43), and ultimately begins preaching in deserted places (v. 45). This many instances of quiet become too loud to ignore on a page with so much activity.\nMark doesn’t waste any extra words saying what he wants us to know. From the very first line, he gets straight to the point: Jesus is “the Son of God” (v. 1). Later, God Himself addresses Jesus as His “beloved Son” (v. 11), and even the unclean spirit says to Jesus, “I know who You are—the Holy One of God!” (v. 24). According to Mark’s Gospel, Jesus’ divinity is non-negotiable. \nYou can see why the book of Mark appeals to me as a student of the Word. But that doesn’t keep it from being tender to my heart as well. “This is why I have come,” Jesus tells His disciples (v. 38). Not to be flashy, not to draw big crowds, but to preach the gospel with a contagious holiness that could drive out demons and heal the unclean. Yes, there is a lot of action, but the message is simple, spoken from the lips of Christ Himself: “Repent and believe in the good news!” (v.15).\nAs we embark on this journey into another exciting book of the Bible, let’s take out our pens, connecting our hands to our heads. Let’s pay attention to the inspired, intentional way this very unique book was written. But let’s not forget to also lay our pens down and engage our hearts, remembering Christ’s simple call to “repent and believe” that the gospel is true—that it is good news, and it is for all of us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram1s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 2:1-28, Mark 3:1-35, Hebrews 2:11-12",
        "devo_title": "Jesus Forgives and Heals",
        "devo_summary": "\nBY Rebekah Lyons\n\nText: Mark 2:1-28, Mark 3:1-35, Hebrews 2:11-12\nI’m a fan of doctors, of their life-saving work. I’m not a fan of being the patient. \nI can always find a reason to avoid a visit. I’ll let an ailment linger for days, aiming to kick it with a home remedy or just some good ol’ fashioned pain tolerance. But a couple years ago, while living in downtown Manhattan, I couldn’t shake or will away an overwhelming, inexplicable illness. After writhing in pain for three days straight, common sense kicked in; I hailed a cab at midnight and headed to urgent care.\nDesperation will do this, when denial inevitably falls short.  \nThey gave me something to ease the immediate pain, and insisted I visit my primary care physician the next morning. We ran labs for three days and found that all my levels were off. I could barely walk, barely eat. I was coming off a season of constant adrenaline, and when the pace finally slowed, my body followed suit. I learned the hard way that forty years old is not equal to twenty. My top priority would become rest in order to give my body the healing it required.\nWhen I read the story of the paralytic in Mark, I’m struck by the desperation of his friends to see him healed. Perhaps he had suffered a lifetime of loss and missed opportunity. And since there was no taxi to be found at midnight, they simply needed to find a way to get him in front of the Great Physician.\nThere’s a crowd in the way? No matter. There’s a roof in the way? No matter. Nothing deterred them from getting the help they were seeking. Their faith in Jesus’ power to heal enabled them to break through any barrier—literally. \nTheir tenacity moved Jesus. Scripture says when He saw their persistent faith, He uttered, “Son, your sins are forgiven!” (Mark 2:5). Jesus started with the inner healing of the heart, but didn’t stop there. He then commanded the man to get up and walk so the resistant religious leaders could see He had the authority of God to not only heal bodies, but also to forgive sins. \nWe want the external; Jesus goes after the internal.\nWe want what is seen; Jesus goes after what is unseen.\nDid He want the man to walk? Absolutely. Did He go after the healing of his heart? Fundamentally. \nThe nature of Jesus never changes. He always heals, always redeems, always restores. Our role is to come. When we reach our moment of desperate brokenness, no longer denying our sickness of heart and mind, we will do whatever it takes to get well. There we will behold His face, hear His voice, and receive His healing touch. \nThat’s the gospel, simple and plain. Jesus said, “Those who are well don’t need a doctor, but the sick do need one. I didn’t come to call the righteous, but sinners” (Mark 2:17). \nI want to be among the ones who know they are sinners—broken, weary, in desperate need of a Savior. I want to experience a break-through-the-rooftop kind of healing. I pray the Holy Spirit will convict me, moment by moment, again and again. His conviction is a grace, a kindness, and a revelation that all is not well. But the healing we need is found in the forgiveness of our Savior, Jesus.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram2s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 4:1-41, Amos 4:13",
        "devo_title": "Parables",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Mark 4:1-41, Amos 4:13\nMy childhood house is on the market. (It still feels weird to say it.) On my favorite mountain, yes. On the street lined with elm trees, certainly. On school bus 24’s route, always. But on the market—for sale, like a cup of lemonade from the neighbor’s kid? No, thank you. \nThis is probably why homeowners aren’t invited to the Open House. It would just be too hard to let go. Still, I can’t help but want to give prospective buyers some helpful hints as to how to live in the house. Perhaps, I’d offer them a sticky note tour.\nWelcome to our—er, potentially your—new home! I’d write. Don’t worry about taking off your shoes; the puppy’s ruined the carpet already anyway. \nHere’s where we keep the plates. Silverware can be found in the drawer on the left, and the trash can’s under the sink. \nMy dad stoned in that fireplace the summer before I started high school, and my mom made the quilt draped over the couch the summer I graduated college.\nMake sure you leave this door open for the cat, and help yourself to snacks. (I hide the chocolate in the top right cabinet.) Keep the front door closed so you don’t let the raccoons in! (I’m serious.) \nIt’s then that I realize what I’ve tried so hard to forget: the house they’ll be moving into won’t have snacks or cats or hand-me-down china or my mother’s quilts. They won’t be joining my family in the house. After we move out, the sticky notes won’t make any sense. \nInitially, some of Jesus’ parables don’t make much sense either. As He talks about sowing and mustard seeds, I imagine the onlookers wondering how in the world any of it applied to faith. So, why did Jesus tell parables? Was He making His lessons easier to comprehend? Was He avoiding complicated theology? No, Jesus was actually choosing to not let them understand.\n“To those outside, everything comes in parables so that they may look and look, yet not perceive; they may listen and listen, yet not understand; otherwise, they might turn back—and be forgiven.”\n—Mark 4:11-12\nJesus’ instructions were meant for those living in His house—His Father’s house, the Kingdom of God. The secret of the Kingdom God isn’t a story or an equation, but a person. And a story without Him, the main character, isn’t a story, but a parable. \nWhen listeners don’t see Jesus as the entrance to the Kingdom, or are out to manipulate His words, He creates a fence around His house by telling a parable. Jesus proves that you don’t arrive at the Truth by becoming smarter, wealthier, or more important; you find Truth by following Him to His house! \nAs for His disciples, Christ never leaves them hanging. He’s always willing to explain the parables when asked and reassure them with Truth. Privately, He would explain everything to them (Mark 4:10). The Harvest has come. It is Me. I am here. Do not fear. \nAs Christ’s followers, we get to live in that house with a protective fence and no need for sticky notes because we have His Word, filled with all we’ll ever need know. Thanks be to God! \n“He is here: the One who forms the mountains, creates the wind, and reveals His thoughts to man, the One who makes the dawn out of darkness and strides on the heights of the earth.\nYahweh, the God of Hosts, is His name.”\n—Amos 4:13\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram3s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 5:1-43, Acts 9:39-41",
        "devo_title": "Jesus’ Authority",
        "devo_summary": "\nBY Guest Writer\n\nText: Mark 5:1-43, Acts 9:39-41\nThe sheer magnitude of Christ’s sovereignty is a general theme of Mark chapter five. He is a really big God! The “Giant Jesus” motif of Mark’s gospel account actually begins at the end of chapter four, where the Good Shepherd proves He’s large and in charge. In the middle of a storm, He stands up in a rocky boat on the Sea of Galilee to calm the seas with this concise command: Peace. Be Still. With those three little words He confirms His complete authority over the natural world. \nAt the beginning of chapter five, Jesus demonstrates His supremacy over the supernatural world (Mark 5:1-13), and then goes on to prove His Lordship over death (Mark 5:35-43). But in my opinion, the best part of this passage is a story-within-a-story, which illustrates not only the incomparable power of Jesus, but also the tenderness of our big God (Mark 5:21-34).\nThe woman isn’t named, but she is framed by the symptom of her malady—blood—which was a gross violation of Jewish propriety (Leviticus 15:19-33). If you had an open wound or obvious hemorrhage, you were barred from communal activity, including worship. Much like a leper, this bleeding woman was considered ceremonially ”unclean.” She certainly wasn’t supposed to be in a public setting potentially contaminating her “clean” neighbors. \nBut she was so desperate for relief from her suffering that she chose to risk weaving her way through the crowd in hopes of touching the edge, or even just the tassels, of Jesus’ robe (Matthew 9 depicts this same story with that particular detail). \nHer trembling alone might have alerted Jesus to her presence (Mark 5:33). I imagine her there, breathing fast and hiding behind her veil, scared someone in the crowd would expose her for trampling on Torah rules, inciting a stern rebuke from the local priest, if not a stoning by the whole community.\nYet our compassionate Redeemer doesn’t reprimand her for breaking the law. Instead He leans in and listens to her whole story. Can you imagine how long it took her to explain the 12-year saga of losing her health, wealth, relationships, and reputation? \nAnd don’t forget the context here: Jesus is on His way to the home of a prominent local leader to attend to his dying daughter—a medical emergency, presumably one with priority. Besides, this woman’s already been healed physically. She’s had her turn, so to speak. It would’ve been completely understandable if Jesus had just kept on walking toward the gated community where Jairus lived. But He didn’t; instead, He stopped and gave His complete attention to a seemingly insignificant fringe-grabber.  \nOne of my favorite living authors is a lovely, humble pastor named Max Lucado. I’ve had the joy of getting to spend a little time with Max and his family over the past fifteen years, but prior to the privilege of meeting them personally, a friend shared a heart-warming observation she made while at a large gathering in their home. \nOne of the Lucado girls, who was six or seven at the time, idled over to the piano to play a simple tune she’d recently learned. When Max heard the first note, he politely excused himself from a serious conversation with several important publishing executives. Then he walked over, leaned against the wall next to the piano, and watched her play with obvious affection. He made his little girl feel like the most important person in the room that night. And she was—to her daddy, anyway.\nMark chapter five reminds us that while Jesus is the King of all kings, He’s also a perfectly personal Savior who delights in listening to His kids play Chopsticks. The beyond-colossal Ruler of the universe bends down to prove He’s absolutely crazy about you and me. \n\nLisa Harper is a master storyteller with a masters of Theological Studies from Covenant Seminary. She’s lauded as an engaging, hilarious communicator as well as an authentic and substantive Bible teacher. She’s been in vocational ministry for 30 years and has written 15 books and Bible study curriculums but says her greatest accomplishment by far is that of becoming Missy’s (her adopted daughter from Haiti) mama! They live on a hilly farmette south of Nashville, Tennessee, where they enjoy eating copious amounts of chips, queso, and guacamole.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram4s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 6:1-56, 2 Kings 2:11",
        "devo_title": "Belief and Unbelief",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Mark 6:1-56, 2 Kings 2:11\nWhen Jesus invited His disciples to steal away, sit, and stop for a while, you can imagine how readily they took Him up on the offer. In a world where a young girl can ask for the head of a prophet on a platter, and see the king swiftly grant her wish for fear of looking like a fool (Matthew 6:24-26), Jesus’ followers must have wondered what they’d gotten themselves into. But they’d seen the Son of God in all His glory, healing and saving and bringing dead people back to life. They’d witnessed with their own eyes that He was who the prophet said He was. They believed! Most of the time.\nLife as one of the Twelve was certainly eventful. Some passages in Mark’s Gospel make it sound nothing short of chaotic. “Many people were coming and going, and they did not even have time to eat,” Mark writes (v. 30). Sound familiar? The chaos swirls and the demands of the day rise like waves, ready to wipe out all our best intentions. But Jesus says, Come away. Find the quiet. Rest a while.\nThe disciples tried, but chaos followed. Jesus and the Twelve got into boats and sailed off “to a remote place” (v. 32). But someone caught sight of them and word spread, and there was a crowd waiting for them when they reached the shore.\nJesus, being the compassionate Son of God, got out of the boat and taught the people, right there at the edge of the shore, and kept teaching well into the night (v. 34). The disciples, naturally, got antsy. Send them away, they said. They must be hungry for dinner, they said. \nYou’re right, He said, You feed them. And when the disciples looked at Him like He was crazy, He gently nudged them forward to faith. He nudged them to believe.\nFeed them what? they asked. After all, He’d told them to bring nothing with them (v. 8). All they had was a few loaves and fishes… and Him.\nIt’s Me, you guys. Believe.\nAfter that miraculous feast, Jesus sent the disciples ahead again by boat, but chaos still followed—this time in the form of wind and waves. Jesus walked to them, holy feet on top of the water, and they cried out in fear at the sight. “Have courage!” He said. “Don’t be afraid” (v. 50).\nIt’s Me, you guys. Believe.\nAnd this would be the pattern. Where Jesus and the disciples went, a bluster of activity followed. People rushed through the streets to find Him, carrying the sick and ailing around on mats, hoping just to brush against the robe of the One who could heal. “And everyone who touched it was made well” (v. 56).\nThe Twelve saw it all; they were standing right there. Still, they struggled to believe. Still, Jesus had to constantly remind them that He was who He said He was.\nIt’s Me, you guys. Believe.\nWe’ve seen it, too, you know. Many of us have seen Jesus up close, in our lives and in His Word. We’ve seen Him change hearts and heal sickness and bring hope to the dark. And still, here in the chaos, we struggle to believe. \nBut the Son of God stands and calls to us, just as He called to the Twelve. He calls us to come away and rest for awhile, to remember He is who He says He is. Yes, we are weak and weary, but we are invited to stay near the very Son of God. We can rest in the knowledge that He still has the power to feed and calm and heal.\nIt really is Him, friends. We can believe. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram5s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Amos 4:13",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nHe is here:\nthe One who forms the mountains,\ncreates the wind,\nand reveals His thoughts to man,\nthe One who makes the dawn out of darkness\nand strides on the heights of the earth.\nYahweh, the God of Hosts, is His name.\n—Amos 4:13\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram6s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 2:17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.  This week, we’re memorizing a verse that summarizes the gospel:\nOn hearing this, Jesus said to them, “It is not the healthy who need a doctor, but the sick. I have not come to call the righteous, but sinners.”\n—Mark 2:17\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/4-Mark1.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 7:1-37, Jeremiah 17:9-10, Hebrews 8:6-7,Hebrews 8:10",
        "devo_title": "Jesus Interprets the Law",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Mark 7:1-37, Jeremiah 17:9-10, Hebrews 8:6-7,10\nThe heart is glorified in our culture. We sing songs about it. We talk about following it, as if it were a wise guide. We paint it onto greeting cards in February—beautiful, pink, and symmetrical. Can you imagine what a greeting card heart would look like if it were painted after the heart we read about in Mark 7? \nMaybe one side of it would be pretty and pink, but the other side? Scraggly, grey, ugly. A lopsided, scary-looking heart wouldn’t help greeting card sales, I know, but it would better match the heart Jesus talks about in this passage. He says that from our hearts come “evil thoughts, sexual immoralities, thefts, murders, adulteries, greed, evil actions, deceit, promiscuity, stinginess, blasphemy, pride, and foolishness” (Mark 7:21-22).\nThese evils are not caused by some outside force. They originate from within us (Mark 7:23). Nothing like being told your heart is the root of greed and evil actions to get your day going, right? But if we can sit with this truth for a little while, something very beautiful is revealed.\nI remember hearing my mom compliment her friend one time on how nice she looked. Her hair was fixed. She had on a new sweater. Her make-up was perfection. She looked lovely. \n“Thanks,” the friend said. “My mom always taught me that if you’re having a bad day, you can at least put on a cute outfit.”\nIsn’t this our natural response? To pull ourselves together from the outside in? We scrub our exterior as much as we can, hoping to fix what’s dirty and broken on the inside. This might look like a new outfit, or volunteering at church, or making sure you’re seen with the right crowd. None of those things are inherently wrong or bad, but when we do them in an attempt to heal something that feels broken, or to earn the approval of our Father, they begin to reflect what the Pharisees were doing: fixating on the law and rituals.\nJesus had something to say about these attempts of ours: “These people honor Me with their lips, but their heart is far from Me. They worship Me in vain” (Mark 7:6-7). Our rituals and outward behavior will not bring us into true communion with Christ because those things are not His primary concern. He is concerned with our hearts. He sees straight through the exterior into the real—into the dark, the grey, and the ugly.\nAnd here’s the beautiful part: Jesus chose to live right there, in our hearts, and to write the law under this new covenant. “I will put My laws into their minds and write them on their hearts. I will be their God, and they will be My people” (Hebrews 8:10). \nThis is what makes the whole gospel thing such a life-changer. We don’t have to scrub ourselves clean. The blood of Christ has already done that.  \nIt’s all too easy for me to slide back into Pharisee mode, to put on a cute outfit and hope for the best. But Pharisee mode prevents true communion with Christ. Let’s not offer Him our perfectly-symmetrical-greeting-card hearts today. Let’s offer Him our real hearts and, in return, experience real worship.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram8s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 8:1-38, Mark 9:1, 2 Samuel 7:14-16, Daniel 7:13-14",
        "devo_title": "Jesus the Messiah",
        "devo_summary": "\nBY Guest Writer\n\nText:  Mark 8:1-38, Mark 9:1, 2 Samuel 7:14-16, Daniel 7:13-14\nI love reading the book of Mark because he makes no apologies for Jesus’ seemingly oddball behavior. To bystanders, His acts might’ve seemed whacky or even alien—like He’s not from this world. You can see this so clearly in Mark chapter 8. \nAfter Jesus miraculously fed 4,000 people in the middle of nowhere and with next to nothing (Mark 8:17), He and His disciples boarded a boat. That’s where the disciples quickly realized they’d forgotten something essential: food. Somebody forgot the food!\nWhat follows might be one of the saddest statements recorded in the gospels. “Aware of their discussion, Jesus asked them: ‘Why are you talking about having no bread? Do you still not see or understand? Are your hearts hardened?’” (Mark 8:17).\nHis statement was filled with great sorrow, not because the disciples were thick-headed, but because they were so deeply entrenched in the ways of this world that they still couldn’t trust the promises of heaven. Jesus wanted them to see that He is not bound by the limitations of the physical world, so neither were they. \nThe Son of God did not follow the rules of the world. Unconcerned about fame, He told those He’d healed to not to say a word (Mark 8:25). When His disciples professed their belief that He is the Messiah, Jesus told them to keep it under wraps (Mark 4:10-12). Jesus did the opposite of what someone trying to gather a following would do, because His fame was not bound to this earth.\nBut Peter desperately wanted Jesus to stay here on this earth. They were healing people, feeding people, changing lives! So when Jesus began to explain that He was preparing to die, it was no surprise that Peter told Him to stop talking such nonsense. After all, Jesus was only in His thirties. Death was a long way off. Wasn’t it?\nJesus’ words were a loving warning: “You do not have in mind the concerns of God, but merely human concerns” (Mark 8:33).\nWhat are your concerns today? Are you hungry? Are you deeply desiring a change in your life? Are you desperate for peace? Are you confused about which job to take, what city to move to, or how to discipline that child who just seems to laugh at you when you put her in time out? These are valid concerns. They are real. But they are temporary. \nLosing our life—picking up our cross to follow Him—doesn’t necessarily mean suffering death by political execution. As Christians, everyday life is our cross. We are called to live with God’s concerns at the forefront of our minds, even as the world is screaming its empty promises at us. \nJesus is calling us to believe that He is fighting for us while we are silent, while we are still (Exodus 14:14). He is inviting us to be whacky like Him—to be of another world altogether. Like our Messiah, we can hold loosely to this temporary life because we know there is another, more brilliant Kingdom that is our home. \nHis dominion is an everlasting dominion\nthat will not pass away,\nand His kingdom is one\nthat will not be destroyed.\n– Daniel 7:14\n\nClaire Gibson is a freelance writer and editor whose work has been featured both locally and nationally in publications including The Washington Post, and Entrepreneur Magazine. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee. She loves her husband, Patrick, and their dog, Winnie.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram9s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 9:2-50, Philippians 1:15-18",
        "devo_title": "Jesus’ Glory Revealed",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Mark 9:2-50, Philippians 1:15-18\nI love to get down to business. If we are in a swimming pool, I can’t handle any of that standing and splashing around nonsense. I’d rather accomplish something and swim. If I have something important to tell you, I’ll rush it every time, forgetting to shoot the breeze first. I just love to keep things moving along and attend to the business at hand.\nWhen Peter suddenly finds himself face to face with Jesus, Moses, and Elijah transfigured, he immediately switches on his “Let’s do something!” response. Just look at his reaction. He doesn’t know what to do or say, so he scrambles and offers to build a tabernacle. Never mind that he doesn’t have tools or supplies. He sees God incarnate and his natural response is,  “Let’s build a place to honor—and maybe hide—some of this awful glory.”\nJust like Peter, when I think of how to interact with the glory of God, I want to rush to fix things, to hurry and set up the proper structure for Him. I’m inclined to scramble when faced with His glory, because I’m usually only focused on my own role instead of His.\nWhen Jesus appears transfigured with Moses and Elijah, one of the many things He’s proving is that He is His Father’s Man. He stands illuminated with Moses, a symbol of the Law, and Elijah, a symbol of the prophets, and shows us that He is the literal embodiment of both. But Jesus is not just some symbolic fulfillment; His actual person fulfills the words of the prophets and the strictures of the Law (Matthew 5:17). He is doing His Father’s will, and it is blindingly glorious.\nIn the face of this shining glory we find Peter. He was chosen by Christ to be the rock of the church (Matthew 16:18)—he’s a big deal among the disciples. But Peter was still trying to figure out what it really meant for Jesus to be who He is. I imagine it’s hard to see all the might and power of the universe sitting on the shoulders of a teacher and friend. On the Mount of Transfiguration, Peter is trying his best to work it all out. But his best is still human understanding, and when it comes to the infinite, there’s a point where we just have to acknowledge our limitations.\nWhen we glimpse the glory of God, we’re often like Peter: ready to go build tabernacles (or whatever seems right for the moment) and get started right away. But God speaks and gently redirects us, saying, “This is my Son, whom I love. Listen to him!” (Mark 9:7). \nLater, when Jesus heals the sick child, the response of the boy’s father is beautiful, yet simple: I do believe, but help me to understand (Mark 9:24, my paraphrase). Peter’s response could have been the same as that grieving father’s: Jesus! I believe. Help me to understand!\nIt’s not about me. It’s not about my belief or my ability to solve problems quickly. It’s about Christ revealed. God’s own glory is the centerpiece, not any human notion. \nFather, give us eyes to see as You see.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram10s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 10:1-52, Isaiah 51:17, 1 Peter 4:13",
        "devo_title": "Two Kingdoms",
        "devo_summary": "\nBY Kaitlin Wernet\n\nText: Mark 10:1-52, Isaiah 51:17, 1 Peter 4:13\nI’ll never forget the day Larry broke his neck. Wedged between cardboard boxes and covered in bubble wrap, my beloved rocking horse sat in the corner of a moving truck that would take him to my family’s new house, states away. \nMy dad dreamed up Larry shortly after I was born. He carefully calculated each detail, making sure it was short enough for my little-girl stature, wide enough to fill the empty corner of my bedroom, and colorful enough to make me cheer with delight. His creation was the perfect combination of mint green, pastel yellow, flowered harness, rope hair, and toddler joy. \nBut one sharp turn and a loud “crack!” later, Larry toppled into the truck’s side, breaking in two. I can only imagine the nightmares the poor truck driver probably still has after coming between a little girl and her rocking horse. \nAs I’ve become more aware of brokenness, I’ve realized it doesn’t always make a loud “crack!” As people fractured since the Fall, do we even notice the cracks? It’s easier to classify some things as broken: adultery, sickness, murder. But I’m slow to remember their opposites—marriage, wellness, friendship—are cracked too. Even our best is broken. \nC.S. Lewis reminds us that even our joy is broken:\n“We are half-hearted creatures, fooling around with drink\nand sex and ambition when infinite joy is offered us,\nlike an ignorant child who wants to go on making\nmud pies in a slum because he cannot imagine what\nis meant by the offer of a holiday at the sea. We are\nfar too easily pleased.”\nFar too easily pleased. Friends, this doesn’t mean we’re low-maintenance children of God. Rather, we are refusing to believe God is the supreme good. \nIn Mark 10, the crowds are asking Jesus questions about the Kingdom of God, each one revealing their half-heartedness; they want His approval on matters of divorce, salvation, and money. God never approves brokenness, but He does send someone to heal it. How easily we forget this truth. Even our memories are cracked!\nWe are adulterers; He remains committed to us.\nWe want possessions; He calls us His.\nWe are broken; He is whole.\nThe crowd asks pointed questions as they pick up the earthly, broken pieces to see where they belong in the big puzzle of the Kingdom of God. In each of His responses, we see Jesus point to God’s divine creation (v. 6), joining together (v. 9), covenant promise (v. 39), and sacred union (v. 39). Jesus mends even the brokenness we cannot see. \nAlthough Larry’s neck is now held together by Super Glue®, I love him the same way I did right after the final coat of paint was finished and I could behold my dad’s complete and perfect work.\nDespite our false notions and obvious cracks, Jesus looks at us the same way, remembering His Father’s creation and perfect union. “Come, follow me,” He says (v. 21). Like the healed blind man who can now see, may we follow Him on the road to His Kingdom. Amen. \nWake yourself, wake yourself up!\nStand up, Jerusalem,\nyou who have drunk the cup of His fury\nfrom the hand of the Lord;\nyou who have drunk the goblet to the dregs—\nthe cup that causes people to stagger.\n—Isaiah 51:17\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram11s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 11:1-33, Zechariah 9:9, Psalm 118:25-26",
        "devo_title": "Our King",
        "devo_summary": "\nBY Raechel Myers\n\nText: Mark 11:1-33, Zechariah 9:9, Psalm 118:25-26\nThe day our son was born, I was astonished.\nThe mere reality of birth was a surprise. One minute, there were four people in the room, and the next minute, there were five. The baby who was theoretically growing in my belly for nine months was an actual human being—he was here! He looked nothing like I’d expected, and his birth didn’t go anything like I’d planned, but he was here. I was shocked by how immediately I felt like a mother; the pride and protective instincts I felt for my child caught me off guard. The whole experience can only be described as astonishing. Unexpected, yet wonderful.\nFast forward six years. My baby boy was a kindergarten rock star, but one man hundreds of miles away made me feel fear like I’d never known. I was at the grocery store not far from my son’s school when I heard the news that Sandy Hook Elementary had been attacked by a gunman. Boys and girls my own child’s age were terrorized, injured, even killed.\nI’ll never forget counting the minutes until my little boy’s eyes met mine as he pounced, carefree, off his yellow school bus. He was fine, but I was not. I was not astonished that day; I was afraid. I wept into the night, praying for protection for my own son, and comfort for the mothers and fathers and children in Sandy Hook, Connecticut, whose lives would never be the same. \nAstonished and afraid. There’s a big difference, isn’t there? When I read Mark 11, I notice both of these reactions to Jesus upon His arrival in Jerusalem. Some were astonished and others were afraid.\nIn verse 18, just after Jesus overturned the tables and chairs in the temple, Scripture says the chief priests began “looking for a way to destroy Him. For they were afraid of Him.” But the crowd? In that very same moment, they were “astonished by His teaching.”\nLater, in verses 30-32, the chief priests weren’t able to give an answer to Jesus’ question about John’s baptism. Why? Because “they were afraid of the crowd.”\nThis dichotomy appears often in Jesus’ ministry—the crowds are astonished and the religious leaders are almost always afraid. In Mark 1:11, when Jesus cleansed a man of an unclean spirit, Scripture says the crowd was “astonished at His teaching because, unlike the scribes, He was teaching them as one having authority.”  \nThis dichotomy of astonishment and fear appears in our lives, too. We’re astonished at the skill of Olympic athletes, and we are afraid of heights. We are astonished by double rainbows, and we are afraid of loud thunderstorms. As we read the reactions of those who received Jesus’ authority and those who hoped to explain it away, I wonder, How do I react when I encounter Jesus’ authority in my own life? \nDoes it make me afraid? Does it compel me to hold tight to the things I love, lest He shake up my plans?  \nOr do I feel astonished at His power, the same way I was astonished at the wonder of meeting my baby boy? Am I surprised and delighted by the way Jesus works in ways I do not expect?\nAs we read the book of Mark today, let’s notice the authority with which Jesus rides into Jerusalem like the King that He is, how He surveyed the temple quietly in verse 11, then commanded the fig tree to wither in verse 14. Let’s watch the “unexpected, yet wonderful” way Jesus cleanses His Father’s house and answers the chief priests as they attempt to usurp Him. \nBecause Jesus is our King, and He is God’s Son, His authority doesn’t have to make us afraid. We can simply watch, astonished by the King of Kings, who has all authority in heaven and on earth!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram12s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Daniel 7:14",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nHis dominion is an everlasting dominion\nthat will not pass away,\nand His kingdom is one\nthat will not be destroyed.\n—Daniel 7:14\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram13s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 8:36",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. This week, we’re memorizing this question from Jesus: \nFor what does it profit a man to gain the whole world and forfeit his soul?\n—Mark 8:36\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/4-Mark2.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 12:1-44, Isaiah 5:1-5, 1 Peter 2:4-8",
        "devo_title": "The Chief Cornerstone",
        "devo_summary": "\nBY Guest Writer\n\nText: Mark 12:1-44, Isaiah 5:1-5, 1 Peter 2:4-8\nMany of us have heard the parable of the tenants found in Mark chapter 12. The owner of a vineyard leases it to careless tenants who eventually kill his son in order to keep the spoils for themselves. It’s about God’s chosen people, the Israelites, the ones who thought the work of salvation would take gusto and bravado, laws and legalities. \nBut they forgot who owned the vineyard, the grapes, and the wine, and that He’d only allotted it all to them for a time. Then one day He took it back and gave it to the entire world: to the Gentiles, Samaritans, Romans—the ends of the earth—and now to you and me. \nSometimes I find myself still tending to the vineyards and missing out on the feast He’s preparing (Isaiah 25:6). I swat at the people He sends my way, kill the inklings of hope in His name, and fight off those coming my way only to serve. \nI try to sacrifice Christ again and again with my sore attempts at gaining my own righteousness. I try to produce prize fruit on the merit of my own labors. Because when I laid my crowns at the feet of Jesus, I certainly expected to pick them back up somewhere along the way.\nPaul warns Christians that, to be in relationship with Jesus, we’d actually have to fellowship in His sufferings, becoming like Him in His death (Philippians 3:10). I must not have understood this because I most definitely did not expect to be so trampled down (Isaiah 5:1-5).\nI am the irresponsible tenant and the wild, overgrown grapes. I have mistreated my Father’s things and I have grown wild in going my own way. I have turned away from His feast, certain I can prepare and keep a better one. I have not submitted to His pruning, certain I can handle the shears on my own. But the ruined vineyard and the irresponsible tenants are no match for the Vinedresser.  \nHe clears the field again, gathers those stones again, and sets in its corner a Stone greater than all the other stones (Mark 12:10). He resurrects it again—stone by stone by living stone—building it all together into a temple for the Holy Spirit, leveling it on the ground of His Son, solid and firm (1 Peter 2:4-8). And the vineyards within bear fruit in abundance—the work of the Holy Spirit, the Vinedresser, and the Son in unison with one another. \nThis is the work of fruitful farming in the field of faith: to know He will send friend after friend to help guide us back to the right path. He will trample to death that which doesn’t bear fruit and He will even prune what’s good to make it healthier—and sometimes we won’t know the difference. This is the work of faith, to believe and to tend, to submit and to bear fruit. But it’s all done under the watchful, caring eye of the Vinedresser, within the safe haven of the living stones, and on the bedrock of the Cornerstone, Christ alone.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, tweets @lorewilbert, and posts photos @loreferguson. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram15s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 13:1-37, Jeremiah 31:35-37, Isaiah 51:6",
        "devo_title": "Things to Come",
        "devo_summary": "\nBY Annie Downs\n\nText: Mark 13:1-37, Jeremiah 31:35-37, Isaiah 51:6\nThere is one app I use constantly when I’m driving. And no, it’s not iMessage. (NO TEXTING AND DRIVING!) It’s a map app that updates in real time when there are accidents or other hazards on the road. It even updates for speed traps. \nA few months ago, as I was driving back home to Nashville, the app sounded its alert. There had been a major accident forty or so miles ahead, meaning my trip would be extended by thirty minutes.\nI appreciated the alert, but didn’t love the news. \nWithin a few miles, the app beeped at me again with a new route. I was supposed to get off the interstate at the next exit and weave through backwoods Tennessee for thirty miles. I’d never been that way before, and I had no idea where I was going; but the app did, and that was enough for me. \nAfter doing the bob and weave down two-lane country roads, I began to run parallel to the interstate and could see it backed up for miles and miles. Cars were stopped dead in their lanes, and drivers were out walking among them as the highway was now completely shut down. Now traveling in a steady stream of moving cars tracing the back roads, I wondered if they all had the same app and directions as me. Soon our caravan of strangers got back on the interstate right past the overturned tractor trailer, giving us a clear path back to Nashville.\nI felt sorry for the people stuck in the traffic. They had no idea what was coming when they were casually driving up I-24. And while it wouldn’t have changed the situation (that poor, unfortunate tractor trailer strewn across four lanes of traffic), it sure would have changed their response to it!\nThat traffic app is kind, in a weird way. It sees what I can’t see, warns me of things I want to avoid. It makes me feel safer to have the information.\nMaybe that’s what Jesus was doing on the hilltop overlooking Jerusalem. He chose to protect and care for the disciples—and us—through very hard times, by warning us that they were on the way (Mark 13:5-8). \nEvery building will fall apart?\nWars and rumors of wars?\nKingdom against kingdom?\nIt sounds scary and dangerous and altogether bad. This could not have been the disciples’ favorite conversation they’d ever had with Jesus. But what might sound harsh and frightening is really an act of Jesus’ love and protection. \nDo these warnings ever terrify me? WELL, SURE. But they are not meant to bring fear or worry. They are Jesus’ kindness to us. He sees what we cannot see, and sprinkles in a new set of directions throughout the text. “Be on your guard,” He tells us. “I have told you everything ahead of time” (Mark 13:23). And for that, we should be so grateful. \nWe can trust Jesus, no matter what is coming around the bend. We may not avoid pain and suffering along the way, but He promises we will see Him in the midst of it—because He’s already there.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram16s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 14:1-72, Isaiah 53:2-3",
        "devo_title": "The Lord’s Supper",
        "devo_summary": "\nBY Rebecca Faires\n\nText: Mark 14:1-72, Isaiah 53:2-3\nWaste not, want not. Right?\nWhen the woman at Bethany cracked the expensive jar of oil and poured it over Jesus’ head, her relatives flared their nostrils and demanded, “Why has this fragrant oil been wasted?” It seemed like a good question because the jug of oil was worth 300 denarii (Mark 14:4-5). Considering a day’s wages in Palestine at that time was one denarius (Matthew 20:2), this woman poured out a year’s wages on Jesus’ head, and all she had to show for it was oily hands.\nBut Jesus wiped His eyes and celebrated her gift, announcing that she had anointed His body in advance for burial. Indeed, in this chapter, the longest in the Gospel of Mark, we see Jesus in the center of several kinds of preparation as He walked through the days that led Him inexorably to the cross. \nThe preparations began with a plot to kill Jesus (v. 1), followed by the parenthetical anointing to prepare His body (v. 8). This led to the disciples’ preparation for Passover (v. 12) and concluded with Jesus’ prediction of betrayal (v. 18). And in the middle of all this preparation and betrayal, Jesus stopped and instituted the Lord’s Supper. He was preparing them for life without Him. \nIt makes sense that this indelible sacrament—one of His dearest gifts to us—was given as He was surrounded by betrayal on one side and suffering on the other. But the gospel is only realized in suffering. In fact, there is no gospel apart from Christ’s suffering. \nAs He broke the bread and offered up His body, Jesus was really giving us His whole “person” (Aramaic), His entire “being” (Greek). He then took the cup and said to them, “This is My blood that establishes the covenant; it is shed for many” (vv. 22-24). The Last Supper is the truest representation of our fellowship with Christ, and in this meal we see that His gift to us was complete.\nThe guests at Jesus’ final table would go on to betray Him—and not just Judas. In the end, they all deserted Him (v. 50). But even the most evil plots of men are within the scope of God’s providence. Isaiah prophesied that Jesus would be “despised and rejected by men” (Isaiah 53:3), and so it is fitting that the Lord’s Last Supper was attended by traitors. \nThe Lord’s Supper is not a table of virtue; it is a table of grace. Even on our best days we cannot earn His gift. He invites us to partake just as He invited the disciples—in spite of our betrayals and scheming against Him. Apart from Christ’s suffering, there simply is no gospel. \nNone of these preparations or promises made sense until He went to the cross. The great mystery of the gospel is revealed in Jesus’ death. \nThe jar that was broken to anoint Jesus was a complete gift. No one could pick up the shards and piece the pottery back together for another use later; the jar was smashed and irrevocably given (Mark 14:3). Christ was crushed for us, and His sacrifice is also freely, entirely, and totally given. We remember this every time we partake of the Lord’s Supper (Isaiah 53:5). His extravagant gift to us was not wasted and has changed the world forever.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram17s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 15:1-47, Psalm 38:20-22, Hebrews 5:7-10",
        "devo_title": "The Crucifixion",
        "devo_summary": "\nBY Andrea Lucado\n\nText: Mark 15:1-47, Psalm 38:20-22, Hebrews 5:7-10\nHere we are at Mark 15—the crucifixion of our Savior. Would you enter into this text with me?\nAt the start of this chapter, we find Jesus standing before a crowd of chief priests, elders, and scribes. These men, along with Pilate, do not believe Jesus is the Son of God, and they accuse Him of many things.  \nFrom there, Jesus is taken in front of an even greater crowd, a “multitude.” They, too, refuse to believe He is the Son of God, and demand for Him to die a criminal’s death.\nThen, the soldiers take Him away and clothe Him in a robe and a crown of thorns. “Hail, King of the Jews!” they yell (Mark 15:18). But they don’t actually believe Jesus is the Son of God, and so they mock Him, beat Him, and then lead Him away. \nNow, as Jesus hangs on the cross, the bystanders and passersby do not believe He is the Son of God. They blaspheme Him and taunt Him. \nIt seems everyone—Pilate, the chief priests, the multitude, the soldiers—has denied who Christ is. Nobody believes. All are blind and darkness consumes them, both literally and metaphorically. \nThis is our Good Friday sermon, and we know it well. We know we have to wait until Sunday, resurrection day, before we can talk about hope and life. But if we look closely at this chapter, we see a glimmer of hope begin to slide its way in, right here, in the ninth hour as the darkness lifts and Jesus cries out His final words: “‘Eloi, Eloi, lemá sabachtháni?’ which is translated, ‘My God, My God, why have You forsaken Me?’” (Mark 15:34).\nUntil this moment, all we have seen and heard is denial, skepticism, and accusation toward Christ. Now, in the midst of all these voices, rises one who believes: “When the centurion, who was standing opposite Him, saw the way He breathed His last, he said, ‘This man really was God’s Son!’” (Mark 15:39).\nFinally, the truth is spoken about who Jesus really is.\nAfter the centurion, Mark mentions the other believers who were present, like Mary Magdalene, “many other women who came up with Him to Jerusalem,” and Joseph of Arimathea (v. 40-41). The story is still dark, Sunday is not yet here, but as these people are highlighted amongst the unbelievers, we begin to feel all is not lost.\nWhen I read the centurion’s words, I am reminded that our disbelief can never be so strong that it will change the truth about who Christ is. In our darkest moments, when everyone around us—in our country, school, workplace, or home—seems to deny Him, Jesus will always be the Son of God. Nothing we say or do, no amount of denial, can change that. What God ordained from the beginning of time cannot be thwarted by a mob. That was true in Mark 15, and it’s true today. \nI am really anxious for us to get to the next part of the story, the beautiful resurrection and the hopeful ascension. But as believers, we know there is hope smack dab in the middle of the darkness. All we have to do is look up at the cross and declare what that centurion did so many years ago. Only this time, let’s use present tense: This man really is God’s Son!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/08/SRT-Mark-Instagram18s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 16:1-20, Acts 1:6-11, Isaiah 53:4-6",
        "devo_title": "Risen and Ascended",
        "devo_summary": "\nBY Amanda Bible Williams\n\nText: Mark 16:1-20, Acts 1:6-11, Isaiah 53:4-6\nWe’ve called Mark “the Gospel of Jesus on His feet,” and now we’ve seen it to be true.\nThrough fifteen chapters, we have watched as Jesus went about Galilee preaching the good news and healing the sick, feeding the hungry and teaching His disciples what it means to believe. We saw Him stand on His feet before the chief priests and their accusations, with only silence and truth as His defense. We saw Him climb a mountain and walk on water.\nBut then, the Gospel of Jesus on His feet came to an abrupt halt. The Messiah was led to a cross and crucified. One day. Two days. Three days in the ground, and then He was up again. The stone was rolled away, and a man shimmering in white stood to greet the women in the tomb. There was no body for them to anoint; He was gone. Jesus had been raised from the dead.\nAnd that’s how the Gospel of Jesus on His feet resumes, right here in Mark 16. Only now, everything has changed.\nHere, at the very end of Mark’s Gospel, there is a crucial shift: Jesus had completed the work He came to earth to do. He had healed and taught and traveled and forgiven and died and risen. And then, He commissioned.\nJesus implored and empowered His disciples to continue the ministry He began—the same disciples who, even upon hearing eyewitness testimony of Jesus’ resurrection, still didn’t believe until they saw Him for themselves. He called them to preach the gospel. Now, you go, He said to them. You heal. You teach. You spread the message of the forgiveness of sins. Get on your feet and go.  \nJesus called His disciples to stand up and step out, and then He did something stunning: He sat down.\n“Then after speaking to them, the Lord Jesus was taken up into heaven and sat down at the right hand of God.”\n– Mark 16:19\nStill today, Jesus sits at the right hand of His Father. He sits because the saving work He came to do here on earth has been done. He declared as much from the cross when He cried out, “It is finished” (John 19:30). The act of salvation is sealed and cannot be undone. Now, with the assurance that our Lord lives and reigns, we get to respond to His call: Get on your feet, and go.\nThe disciples were not alone as they went. Jesus had promised to go with them (John 14:26), and He did.\n“And they went out and preached everywhere, the Lord working with them…”\n– Mark 16:20\nFriends, the Gospel of Mark is not just the “Pedestrian Gospel” because of the action of the fast-paced narrative. The Gospel of Mark is the Pedestrian Gospel because it is the plainly presented message of the gospel of Jesus Christ—the forgiveness of sins accomplished in full by His life, death, and resurrection. It is the Gospel for all of us. For her and him, for you and me.  \nWe’ve not just heard about Him. We’ve seen Him. By His power and grace, let’s get up and carry His good news to the world. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Mark-Instagram19s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 10:45",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \n“The stone that the builders rejected has become the cornerstone.”\n—1 Peter 2:7 \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/SRT-Mark-Instagram20s.jpg"
    },
    {
        "book_title": "Mark",
        "devo_passages": "Mark 10:45",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. This week, we’re memorizing the key verse for the gospel of Mark.\n“For even the Son of Man did not come to be served,\nbut to serve, and to give his life as a ransom for many.”\n—Mark 10:45\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/4-Mark3.jpg"
    }
]