[
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 1:1-12, Exodus 24:3-8, Psalm 51:1-19",
        "devo_title": "A Living Hope",
        "devo_summary": "\nBY Erin Davis\n\nI have sepia-toned memories of wearing a pillowcase veil, grabbing a handful of dandelions, and marching my scrawny, little-girl legs down a grassy aisle, pretending to be a bride. To six-year-old me, the wait for my real wedding seemed impossibly long, but that didn’t stop me from actively hoping the day would eventually come. Nearly forty years of hindsight reveals that the gap between the hope and the reality was itty bitty. All too soon, I’d traded in cotton for tulle and weeds for roses in the blink of an eye.\nSo it is with the promises of Christ. Here, in the first chapter of 1 Peter, the apostle reminds us of our “living hope” (v.3). He doesn’t leave us guessing about what we’re hoping for. Through the resurrection of Christ, we have gained: rebirth and a salvation ready to be revealed, as well as an imperishable, undefiled, unfading inheritance (vv.3–5).\nLike a little girl trying to picture her future groom, these promises can look a little fuzzy around the edges. Yes, Christ has saved us, and He is changing us even now, but so much of our hope is in what’s been stored up for us in the future, or as Peter reminds us, what’s being “kept in heaven” for us (v.4).\nWe have a storehouse of hope. It is the ultimate trust fund, a hope chest full of the promises of God. While we have yet to see our God face to face, we’ve been given the gift of faith to believe in Him, know Him, and love Him now. And we “rejoice with inexpressible and glorious joy,” because even as we await His return, we are receiving the goal of [our] faith, the salvation of [our] souls” (vv.8–9).\nOurs is a living and active hope in a living and active God, who has unfathomable blessings in store for His bride. And yet, there are days, lots of them, when our living hope seems to be doing little more than gathering dust. Peter alluded to this early on. We are the “chosen, living as exiles” (v.1). We are chosen, yet sometimes unpopular in this world, never quite at home here. Sometimes our very cells seem to groan for more.\nWhen will we know what it’s like to be made new, fully shedding the broken version of ourselves? How long until the Lord shows His hand, demystifying the “salvation ready to be revealed in the last time”? (v.5). How much longer until we can open the hope chest to touch and feel our imperishable inheritance?\nIt will happen in the blink of an eye.\nYou are being guarded by God’s power through faith for salvation that is ready to be revealed in the last time. You rejoice in this, even though now for a short time, if necessary, you suffer grief in various trials (vv.5–6).\nThe gap between this present moment and future glory may seem impossibly large. Still we rejoice. Because we have a hope kept in heaven that can never be destroyed. One day we will trade in the suffering of these “various trials” for the many gifts God has tucked away for us.\nIt won’t be long now.\nThat is why, among the people of God, hope will always be alive and well.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day1.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 1:13-25, Isaiah 53:7-9, Ephesians 1:3-10",
        "devo_title": "A Call to Holy Living",
        "devo_summary": "\nBY Erin Davis\n\nThe list of things I know for certain is short, but I know this: I am not holy.\nI hear Peter’s charge to “be holy in all your conduct” (1 Peter 1:15) as he echoes the Lord’s words to “be holy, because I am holy” (Leviticus 11:44), and I feel the gravitational pull of defeat. Because it doesn’t seem to matter how much I want to be holy. (And trust me—I really, really want to be holy). There aren’t twelve steps I can take to become holy. There aren’t bootstraps big enough to pull me up toward the perfection of God. There’s no self-help guide to blamelessness. If personal holiness is up to me, it begins to feel like an impossible equation.\nThere are times when I get fed up with chronically missing the mark. I want to be holy because God is holy, but instead find myself broken because the world is broken. I was having one of these fed-up moments while driving down the highway recently. In my frustration I cried out to the Lord, praying, “How long, Lord, until I become like you?!”\nThis phrase came to mind; “In a moment.”\nFor a nanosecond I worried I was about to hit a semi head on, because I know I will not fully become like Christ this side of heaven. But no collision came. My heart was simply recalling the gospel hope I cling to. Scripture tells us that when Christ returns, we will be changed “in a moment, in the twinkling of an eye” (1 Corinthians 15:52).\nPeter isn’t tasking us with a moral standard our broken selves can never attain. He’s preaching the gospel. We can’t hear it too often. He reminds us of what’s truest about us as Christ-followers:\nFor you know that you were redeemed from your empty way of life inherited from your fathers, \nnot with perishable things like silver or gold, but with the precious blood of Christ, \nlike that of an unblemished and spotless lamb (1 Peter 1:18–19).\nYes, I am broken as my parents were broken.\nMy children are broken, as I am broken.\nYou are broken, as all people are broken.\nBut that is not our story, and it’s not our identity.\nOur brokenness and Christ’s holiness are two sides of the same gospel coin. And so we need to stop staring at our failed attempts at holiness. We need to flip the coin over, and instead gaze with wonder anew at the gospel of grace. Again, we cannot do it too often.\nMy power over sin rests not in me, but in the one who burst forth from the grave (v.21), the “holy, holy, holy” One (Revelation 4:8). I am holy, because Christ is holy, and I am hidden in Him (Colossians 3:3). Yes, my flesh is broken. But praise be to God, “All flesh is like grass and its glory like the flower of grass” (1 Peter 1:24).\nBut the holiness of God is mine forever.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day2.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 2:1-10, Psalm 34:1-14, Hebrews 13:14-16",
        "devo_title": "A Holy People",
        "devo_summary": "\nBY Claire Gibson\n\nHaley and I sat down at a picnic table. Her four young children ran to the playground.\n“So what do you want to know?” she asked. I took in a deep breath and looked at my notes. Where to begin?\nEarlier that year, I’d begun interviewing female veterans as research for a novel. Tall and blonde with striking blue eyes, Haley was dressed in casual jeans and a tee-shirt. You would never guess that just a few years ago, she had been deployed to Afghanistan, leading an engineering platoon.\nWhile they were deployed, she told me, her platoon built outposts for incoming NATO troops. Every few weeks, she and a group of 20 soldiers would travel to a remote location in the desert, where they’d construct wood platforms, assemble huge Army-green tents, and dig a trench as a temporary latrine. While they worked, an infantry unit provided security around the perimeter. They had to build quickly; the opposition was everywhere.\nThe image of Haley holding a hammer in the middle of enemy territory comes to mind as I read today’s passage. After all, Jesus calls us to begin constructing the kingdom of God here on earth—even though we will face resistance.\nPeter wrote his letters to a specific population of Christians who lived just before Roman Emperor Nero’s brutal persecution of the church, which began in 64 A.D. At the time, Christians experienced slander, ridicule, and discrimination from their neighbors. They were facing opposition on all sides, and Peter knew that the pressure was only going to get worse.\nBut in the midst of a dire situation, there was hope. Peter leans on a construction metaphor, explaining that they were being built up, like “living stones” into a spiritual house (v.5). And the resistance? The rejection? The reviling? None of that would come as a surprise to Jesus. He warned His followers that they would face persecution, opposition, and even open hatred (John 16:33). He knew they would face these things, because when you build a new kingdom in the middle of enemy territory, the enemy takes aim.\nAt the heart of this passage is a call to keep building—even if we’re afraid, even if it’s hard. (Perhaps especially if it’s hard.) I am a builder in the midst of enemy territory. So are you. There might be differences among us—race, age, nationality, background—and yet, our shared identity as Christ-followers gives us the freedom to stand side-by-side, raising our hammers together, participating in the construction of the kingdom of God.\nWhen the hammer gets heavy, 1 Peter 2:10 stands as a reminder: “Once you were not a people, but now you are God’s people; you had not received mercy, but now you have received mercy.” And Jesus? He is our cornerstone, the first piece of the foundation and the rock upon which the whole structure rests. Without Him, it would all fall apart.\nKeep building the spiritual house in the midst of this world. Do not grow weary. It may seem futile at times, but all our building is not in vain. With Jesus as our cornerstone, we are the beginnings of a city that will endure forever.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day3.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 2:11-25, Romans 13:1-7, Galatians 5:13-14",
        "devo_title": "A Call to Good Works",
        "devo_summary": "\nBY Claire Gibson\n\nInjustice of any kind is hard to bear. When I’m on the receiving end of hate, my natural inclination is to defend myself. To fight back. I have little strength to shoulder the weight of false accusations, unfair treatment, or slights on my character. And yet, that’s exactly what the passage in 1 Peter 2 is asking me to do: put down my rights and “submit to every human institution” (v.13).\nBefore we continue, it’s important to address the part of this passage that tells slaves to submit to their masters. The Greek word used here refers to household or domestic servants who would’ve also been slaves. Slavery in the first century was different than the American version of race-based slavery of the eighteenth and nineteenth centuries. Peter is not advocating for slavery as a system. He is instead dealing with it as a reality that some of the recipients of his letter lived under. For our purposes, it’s best to read this passage with the phrase “lowly workers” in mind. Peter was instructing Christians to endure their pain with grace.\nPeter would know. On more than one occasion, an oppressive government imprisoned him for his beliefs and preaching. He would eventually be crucified. In that place of oppression, he continued preaching the gospel, trusting that God would use every ounce of his suffering for the good of the world. He submitted to the path that God had paved for him, even though that path included hardship.\nIf you cringe at the word “submission,” you’re in good company. Submission is extremely counter-cultural in our “YOLO” society. An acronym short for you only live once, YOLO is a rallying cry that places happiness as the ultimate aim of life. If we only have this one life to live, we might as well make it a great, fun, exciting one, right? I have to admit, it’s a pretty attractive philosophy. But it stands at complete odds with Christianity.\nWe also live in a society that rails against injustice with ever-increasing outrage. Police brutality, racial bias in our judicial system, gender wage gaps, sexual abuse and harassment in the workplace—these are serious problems, constantly dominating my news feeds. But the problem with focusing all of my attention and outrage on the world’s ills is that I can so easily lose sight of my own sin. I begin to want change out there far more than I desire change in my own heart.\nRather than focus his eyes on the injustice leveraged against him, Peter chose to focus on the injustices he’d perpetrated against God, forgiven by Jesus’s blood. He knew the truth: Jesus’s life, death, and resurrection replaces our temporary perspective with an eternal one.\nHe himself bore our sins in his body on the tree; \nso that, having died to sins, we might live for righteousness (1 Peter 2:24).\nAs a Christ-follower, you’re not only going to live once—you’re going to live forever. Discomfort, pain, and injustice are real, but they are fleeting when compared to the glory and love of our Savior. I’d rather serve Jesus than my own happiness. And I can trust Jesus to use the injustices I see around me for the good of His kingdom.\nHow do I know this? Because He suffered a sham trial, a wrongful conviction, and bloody death—on my behalf. And thank God He did. Jesus transformed the ultimate injustice into the world’s greatest good.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day4.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 3:1-7, Genesis 1:26-28, Ephesians 5:22-33",
        "devo_title": "Wives and Husbands",
        "devo_summary": "\nBY Claire Gibson\n\nJust before Thanksgiving, Patrick asked my father for his blessing to propose. An Army Colonel who’d spent nearly 30 years serving in the U.S. Military, my father has all the outward trappings of intimidation. Patrick braced for the third degree. Instead, my father laughed, shrugged, and smiled.\n“You’re both smart,” he said. “If Claire wants to marry you, then you have my blessing.” Before Patrick could breathe easy, my father put up one finger as if he’d just remembered something important.\n“You know, Claire has a tendency to want to take charge,” he said.\nWay to go dad. I can’t blame him for saying that—it’s true. I do have a tendency to want to take charge. For that reason, reading this passage is difficult. It’s easy to read verses about how God loves me. It’s hard to read about what God expects of me. But deep down I know the passages of Scripture that make me most uncomfortable are likely the passages I need to engage with the most.\nWhen I read this passage the first time, all I could think about were women who’ve been mistreated, oppressed, and abused by men who have used these Scriptures to justify their abhorrent behavior. But Peter isn’t writing this passage for society at large. He’s telling individual women to submit to their own husbands, not for all women everywhere to be subordinate to men in general.\nIf my father’s first warning weren’t enough, nine years of marriage have likely taught my husband that my ability to submit isn’t my best quality. Whenever there’s a decision to be made, my knee-jerk reaction is to grab the reins—not out of kindness, but out of pride and fear. My desire for control is more powerful than my desire for deeper marital connection. All the while, the world tells me that I can be superwoman, have it all, remain young-looking, and raise a family. Soon, my hands are full of reins, but my heart is empty of peace. God invites me into a new way of living. The new way is slower, quieter. Because God loves me, I can trust that obeying His guidance won’t lead to more harm but, ultimately, to His blessing.\nAt the end of the previous chapter, Peter outlined Jesus’s suffering and sacrifice on the cross. He begins this chapter with these words: “In the same way, wives submit yourselves to your own husbands” (v.1). Peter then calls husbands to do the same, especially taking in to account the societal norms of the day, which saw women as “weaker” and less than their male counterparts. He instructs:\nIn the same way, you husbands must give honor to your wives. Treat your wife with understanding as you live together. She may be weaker than you are, but she is your equal partner in God’s gift of new life (v.7).\nJesus gave us a model for sacrificial love. And if we’re following His model, we cannot be surprised when loving well is sometimes hard and messy; it may cost us something in return. Jesus put down His rights in order to grant us access to the kingdom of God. In the same way, we’re called to put down our own need for control, trusting His ways are best.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day5.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "Galatians 5:13-14",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor you were called to be free, brothers and sisters; only don’t use this freedom as an opportunity for the flesh, but serve one another through love. For the whole law is fulfilled in one statement: Love your neighbor as yourself.\nGalatians 5:13–14\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day6.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 1:3-4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the first part of the key verse for 1 Peter.\nBlessed be the God and Father of our Lord Jesus Christ. Because of his great mercy he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead and into an inheritance that is imperishable, undefiled, and unfading, kept in heaven for you.\n1 Peter 1:3–4\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/4-SRT-12Peter-1.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 3:8-22, John 15:18-21, Galatians 3:23-29",
        "devo_title": "Do No Evil",
        "devo_summary": "\nBY Erin Davis\n\nThe year was 1967. Crowds had gathered outside the Pentagon to protest the ongoing Vietnam War. Members of the 503rd Military Police Battalion formed a semi-circle and pointed their rifles toward the protestors. It was a tense moment, in a tense era, in a tense world.\nBut then hope seemed to break right through the moment, as a young man stepped forward to place carnations inside the officers’ barrels. American photographer, Bernie Boston, captured the moment in a shot entitled, “Flower Power.” The photograph moved the nation so profoundly, it earned Boston a nomination for the Pulitzer Prize, and the ethos of an entire generation was captured and preserved.\nWhatever your political beliefs, as Christ’s followers, we’ve been given clear marching orders to protest the evil so prevalent in our world. We don’t fight with rebel fists, clenched in rage. Our assignment is to do good, to combat evil with righteousness, darkness with light, lies with truth, hatred with love.\nThough it sounds warm and fuzzy, we cannot expect the world to respond to us with heart eyes. Jesus Himself warned us that they would instead take up arms against us.\n“If the world hates you, understand that it hated me before it hated you. If you were of the world, the world would love you as its own. However, because you are not of the world, \nbut I have chosen you out of it, the world hates you” (John 15:18–19).\nThis battle is not new. There is no bait and switch. Jesus is clear: we will offer love and receive something else in return. Our good deeds may fall on deaf ears, or worse, turn others against us. Knowing this to be true from his own experience, Peter sought to encourage believers who faced suffering for the sake of the gospel. He told them, “It is better to suffer for doing good, if that should be God’s will, than for doing evil” (1 Peter 3:17).\nBecause of Christ, we are free to face such reactions from the world without the element of surprise. As in all things, Christ goes before us. He absorbed insults for His wisdom, betrayal for His faithfulness, and lashings for His love. Because of Him, we can bless when we are cursed, do good when others seek to harm us, and love when we are hated. We stand ready with hope, in a dark world that needs hope so desperately.\nMay we follow the example of our humble Savior, Church. May our hope in Jesus prepare our hearts for the battles we may face because of our love for Him. Let the world hurl their worst in our direction. Because of Jesus, we stand ready, eager to see hope break through.\nBut in your hearts regard Christ the Lord as holy, ready at any time to give a defense to anyone who asks you for a reason for the hope that is in you. Yet do this with \ngentleness and respect (1 Peter 3:15–16).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day8.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 4:1-11, Proverbs 10:12, Romans 6:1-11",
        "devo_title": "Following Christ",
        "devo_summary": "\nBY Erin Davis\n\nI’m a big fan of the bottom line. Get me to the point, and fast. Perhaps that’s why I love this gem, found near the middle of the book of 1 Peter: “Above all, maintain constant love for one another, since love covers a multitude of sins” (4:8).\nThis is the axis upon which the book of 1 Peter pivots. If we take a zoomed out approach, we see Peter tackling all manner of tough topics in this little letter. From holiness, to submission, to suffering, to leadership—Peter went for the jugular in his appeal to the Church. But all of it rises and falls and culminates with love.\nBecause what is “holiness,” divorced from a love for God? It’s rule-following at best, and legalism at its worst. What is submission apart from love? Manipulation? Fear? The ugly counterpart to dominance? Who wants a loveless marriage or cold-hearted shepherd? Not me. Not you, I’m sure.\nLove is the linchpin that holds us all together. That’s why Peter reminds us that as Christ’s followers, love is what we are to strive for “above all.” But look again. This is not just is not the run-of-the-mill love we have for our favorite brand of ice cream. It’s not even the kind of deep love we feel for the people who mean the most to us. This love, “covers a multitude of sins” and shortcomings and heartache. Peter is reminding the Church of the first century to mirror Christ’s love, demonstrated most profoundly by His sacrifice on the cross. In Christ, we are a new creation, and as such, we ought to seek to live like one—free from the bondage of sin and shame.\nFor we know that our old self was crucified with him so that the body ruled by sin might be rendered powerless so that we may no longer be enslaved to sin, since a person who has died is freed from sin (Romans 6:6–7).\nThe center of Peter’s letter—of the entirety of God’s Word, really—and of our faith is this gospel truth. Christ’s abundant love, manifested in His sacrifical life, death, and resurrection, covered my sins. It covered yours. This is the gospel, in its boiled down, beautifully simple form. Love is the bottom line.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day9.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 4:12-19, Isaiah 11:1-5, Matthew 5:3-12",
        "devo_title": "Christian Suffering",
        "devo_summary": "\nBY Kaitlin Wernet\n\nThese days, there’s a pair of boxing gloves resting on the passenger’s seat of my car, and it makes me entirely giddy. While I’m certain I’m also improving my self defense skills and I hope to intimidate all those around me at the sight of my gloves, that’s not why I have them at all. I recently joined a boxing gym with one of my coworkers. It’s something I never thought I’d do for a million reasons, and exactly why I love it so much.\nYou see, the past year I’ve battled opponents like chronic pain, fatigue, and depression, which wiped me out and put me on the sidelines for weeks-turned-months on end. I am still far from winning these matches, but I’m thankful that some of the very worst parts have lifted, leaving a little space for hopeful and fun activities like exercise—things I had missed immensely. So I guess you could say my jab-jab-cross-uppercut enthusiasm is fueled by gratefulness for my newfound health and the growing distance between me and long, sleepless nights. I am doing this for my former self who couldn’t.\nSuffering can feel like a tough blow to the head or a punch right in the stomach, but Jesus has already fought for us and given us strength we could never muster for ourselves. And now, we suffer differently, for our former selves who couldn’t survive sin at all. Instead of backing down to pain, we rejoice when His glory is revealed, and even we “are ridiculed for the name of Christ, [we] are blessed” (1 Peter 4:13–14). We do not suffer in the same way others do because we know exactly how the battle ends.\nOne of the first things I learned in boxing was how to wrap my hands before putting them inside the gloves. Using a cloth bandage, I begin by wrapping my wrists, then criss-cross around my hand, covering each knuckle and protecting each finger. And because I do this, I know I’ll be safe, no matter how hard I hit the punching bag.\nWhen we face hard times as children of God, we are given something to wrap around our hearts for protection: the truth of who He is. We cover our minds in Scripture, trusting that no matter what we face, we do not face it without our Father, who wears a belt of righteousness and a sash of faithfulness (Isaiah 11:5).\nWith these words, He makes sure all our doubts are answered and all our fears are covered by His love for us. So when we step into the ring of discomfort, we already know the outcome; we are called blessed by the Lord, our God. Thanks be to Him.\n“Blessed are the poor in spirit,\nfor the kingdom of heaven is theirs.\nBlessed are those who mourn,\nfor they will be comforted.\nBlessed are the humble,\nfor they will inherit the earth.\nBlessed are those who hunger and thirst for righteousness,\nfor they will be filled.”\n– Matthew 5:3–6\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day10.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 5:1-7, Proverbs 3:27-35, 1 Timothy 3:1-13",
        "devo_title": "About the Elders",
        "devo_summary": "\nBY Guest Writer\n\nI’m a girl very much in love with creature comforts like yoga pants, guacamole, and on-demand TV. I’d rather not be uncomfortable, much less suffer. I mean, I’m not alone in this, right? While we may not suffer isolation or oppression like the readers of Peter’s letter, we all have places of hardship and difficulty.\nYes, despite my affection for stretchy pants and binge-worthy programming, life for me has sticky places. Places that reveal my selfish heart and prickly pride. I have relationships that are tense and less than loving. There are situations that bring me a ton of stress and, to a mild degree, “suffering.” But tucked here in 1 Peter 5 is a tiny, often overlooked admonition that might help soften the blow of those situations.\nPeter is encouraging church leaders, called elders, to shepherd and serve the people of God well. Why would Peter interrupt his commentary on suffering and Christian living in an ungodly culture to talk to church leadership? It seems Peter knew that their wise counsel and tender care would be critical in helping God’s people persevere.\nBut I wonder if Peter was also speaking to this group of men because he knew they would experience their own unique brand of suffering because of their call to shepherd God’s flock? Are we surprised? Living in relationship with Christ-followers is hard and messy because living in any relationship is hard and messy. We sometimes glamorize or expect more from our brothers and sisters in Christ, but friend, though Jesus is King of my heart, I can still be super selfish, prideful, and easily frustrated. How about you?\nI don’t want to cause anyone undue suffering, especially not someone who is sacrificially serving the body of Christ. Our leaders are called, and I think equipped, to demonstrate grace and humility toward the people of God. But look at what Peter says to you and me: “All of you clothe yourselves with humility toward one another” (1 Peter 5:5). We can all partner together to make the work of living together as Christ-followers a bit easier by putting on humility.\nWhen we choose to believe the best about the girl whose short reply kind of hurt our feelings, we put on humility. When we extend grace to the friend who blew us off (again), we put on humility. When we focus on our leaders’ strengths rather than berating them for their weaknesses, we put on humility. When we gladly serve, even as others do less than their fair share, we put on humility.\nThis call rings loudly within the context of Christian community, but think about the places in your life where you are currently suffering. Could Peter’s charge to be clothed with humility let you stretch in grace, persevere in patience, or extend forgiveness? Perhaps none of our hard places will feel as comfortable as our yoga pants, but might humility be the thing that makes us more comfortable in those less than comfortable circumstances?\n\nWhitney Capps is a national speaker for Proverbs 31 Ministries. Her first book, Sick of Me (B&H Publishers) and bible study, We Over Me (LifeWay) both release in March 2019. Whitney is the founder of Simple Seminary, a place for the everyday gal to learn theology. She and her husband, Chad, are raising their four boys just outside Atlanta, Ga. You can connect with her at whitneycapps.com or on Instagram, @whitneycapps.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day11.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 5:8-14, 2 Corinthians 4:7-18, Ephesians 6:12-20",
        "devo_title": "Firm in the Faith",
        "devo_summary": "\nBY Guest Writer\n\nIn this world, we are going to suffer. It’s true. That’s what Peter is saying at the end of his letter. There are spiritual things going on in this world that he wants us to remember. First, we have an enemy, and a very real one at that. And his most successful tactical move toward defeating us is perhaps our own tendency toward distraction. We’d much rather look for ways to explain our pain and suffering, or find ways to numb or ignore it—anything but lean into it.\nThe world is blind to the schemes of the enemy, who has also blinded their eyes to the light of the gospel (2 Corinthians 4:4–6). This is why Peter is pleading with Christ-followers to “be sober-minded, be alert.” Because our “adversary the devil is prowling around like a roaring lion, looking for anyone he can devour” (1 Peter 5:8).\nNow, I can assure you that when facing down a lion, real or hypothetical, my first instinct will always be to flee, not stand and fight. And this lion Peter is warning us about is very real, indeed—whether we’re aware of him or not—and he is always stalking us, circling, looking for a weakness to exploit. Therefore, we are to “resist him,” standing “firm in the faith, knowing that the same kind of sufferings are being experienced by [our] fellow believers throughout the world” (v.9). We must be awake to his schemes.\nSuffering throughout a fallen world? The enemy would far rather we continue to be surprised by it, especially if, in the midst of our pain, we begin to doubt the goodness of our God. And so we must remember that our personal pain and suffering this side of heaven are not the exception (1 Peter 4:12). Nor are our struggles really with one another; they are with evil itself (Ephesians 6:12).\nThis enemy will use every weapon in his arsenal to abuse us and tear us away from the path God has called us to. He wants to keep us from maturing in the faith, and he most definitely does not want us to become who God created us to be: devoted lovers of God, who display His love and splendor to the world. Our enemy wants to wound us and will stop at nothing to do it.\nBut here’s the most important thing to remember: Jesus Christ defeated death and evil itself (John 16:33), and if we are in Him, we’ve conquered them too—the enemy cannot harm us (1 John 5:4, 18–19). We belong to a loving, all-powerful God, who does not abuse us through suffering. Instead, He draws us closer to Him, healing and transforming us through our pain—not in spite of it. Because of this, we will never be crushed under the weight of persecution or affliction. This suffering is only temporary, but our salvation is secure, our relationship with our Creator everlasting (2 Corinthians 4:7–9, 16–18). And after we have suffered a little while, God Himself will restore us and make us strong, firm and steadfast (1 Peter 5:10). Thanks be to our God.\n\nKara Gause is a content editor for She Reads Truth, happily residing with her family in Nashville, Tennessee. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day12.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "Galatians 3:27",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor those of you who were baptized into Christ have been clothed with Christ. There is no Jew or Greek, slave or free, male and female; since you are all one in Christ Jesus. And if you belong to Christ, then you are Abraham’s seed, heirs according to the promise.\nGalatians 3:27–29\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day13.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "1 Peter 1:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the second half of the key verse for 1 Peter.\nBlessed be the God and Father of our Lord Jesus Christ. Because of his great mercy he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead and into an inheritance that is imperishable, undefiled, and unfading, kept in heaven for you.\n1 Peter 1:3–4\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/4-SRT-12Peter-2.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "2 Peter 1:1-15, John 21:17-19, Titus 3:4-7",
        "devo_title": "Growth in the Faith",
        "devo_summary": "\nBY Rebecca Faires\n\nAt first, Peter just doesn’t get it. After all, he’s the guy who cut off a guard’s ear in the garden and denied Christ three times before His crucifixion. Peter was quick to speak, but understanding took years. The mystery of the Messiah was a true mystery to him. He didn’t fully understand Christ’s purpose, or how He was truly God.\nBut in this letter, it’s clear Peter finally understands. Here he makes one of the clearest declarations of Christ’s divinity found in the New Testament, calling Him “our God and Savior Jesus Christ” (2 Peter 1:1). After Christ’s death and resurrection, Peter finally grasps who Christ really is.\nWinston Churchill once quipped, “Men occasionally stumble over the truth, but most pick themselves up and hurry off as if nothing has happened.” Ah, Winston, how do you know us so well? When we see the truth of Christ as Messiah and Savior, it’s sure easier to dust ourselves off and hurry on like we never caught a glimpse of the truth. The truth was hard for Peter, and it’s still hard for us to understand today.\nBut truth of this saving knowledge of Jesus is central to Peter’s letter. So what does he mean by “the knowledge of God and of Jesus our Lord”? (v.2). This knowledge is supposed to multiply grace and peace to us. Saving knowledge of God leads us to grow in our faith. God’s grace is the source of all godly living, thus God’s grace results in godliness.\nPeter’s list of godly qualities does not detail the prerequisites for salvation, but the natural outpouring of a heart that seeks knowledge of God. It’s possible to be Christians and still be “ineffective or unfruitful in the knowledge of our Lord” if we aren’t increasing in the qualities of godliness (v.8, ESV). Even with the saving knowledge of Christ, we still need His grace. That’s why Peter prays, “May grace and peace be multiplied to you through the knowledge of God and of Jesus our Lord” (v.2).\nThen Peter enjoins believers to “make every effort to confirm your calling and election, because if you do these things you will never stumble” (v.10). This is the proper activity of the Christian life. We are to know Christ, and by knowing Him, to grow in Him and abide in Him.\nSeek Christ. Don’t squander His grace. All who abide in Him will bear fruit. If your faith is not bearing fruit, something is wrong. Many have deceived themselves, thinking their faith was genuine. Others have stunted their own growth in the faith by negligence and sloth. The answer to either peril is the same: run to Christ, whose “divine power has given us everything required for life and godliness through the knowledge of him who called us by his own glory and goodness” (v.3).\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day15.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "2 Peter 1:16-21, Matthew 17:1-8, 2 Timothy 3:10-17",
        "devo_title": "The Trustworthy Prophetic Word",
        "devo_summary": "\nBY Rebecca Faires\n\nI’m so pregnant right now. I’m past taking chipper walks and decorating my nursery. I’m at the stage where I can’t sleep anymore, so I just cry while I watch reruns of Dr. Quinn, Medicine Woman. I love being pregnant, and I was such a good soldier for so long. But there’s something about the difficulty of the last few weeks of pregnancy that primes and steels a woman for the intensity of labor and delivery. It makes us ready and willing to undergo any hardship just to be delivered from the close quarters of late pregnancy. That, and I’m tired of performing a trust fall every time I try to sit in a chair.\nI love having babies. But when pregnancy gets hard, I have to remember the end goal—the baby! Somehow in the muddle of pregnancy and labor I forget all about the baby and focus on my heartburn and my contractions. I literally forget about the baby. This is true for so many things; when times get dark, it can be easy to forget the one, most important thing and instead get caught up in all the peripheral ephemera. But when it’s dark, we need the lamp of truth to lead us home.\nGod’s Word is that lamp shining in a dark place. His Word was delivered by prophets and then confirmed in the person of Jesus Christ. He inspires and fortifies our faith by the eyewitness accounts that again and again confirm what the prophets spoke and wrote.\nPeter was one such eyewitness, a man who stood on the mount of transfiguration and heard the voice of God. I can’t even imagine. Somehow Peter managed to pry himself off the ground and listen to the words God spoke: “This is my beloved Son, with whom I am well-pleased!” (2 Peter 1:17). God is constantly bringing us the light of His Word to illuminate our confusion.\nDon’t allow yourself to be confused or distracted. We do not hold to a cleverly devised myth, but to Truth itself. Christ came in space and time, walked before eyewitnesses who beheld “his glory, the glory as the one and only Son from the Father, full of grace and truth” (John 1:14). We have the witness of the Word, strongly confirmed in history, bearing witness to Christ, our Light and Life (2 Peter 1:19).\nWe must hold tight to the things that are true. We know that Jesus is God’s son (Matthew 17:5). We know that He came to save us (Romans 6:23). And we know that His Word is a light in the darkness (2 Peter 1:19).\nToday, even though I have both heartburn AND contractions, I am looking forward to holding my baby. Instead of letting ourselves get caught up in the passing peripherals, we must remember that Christ is the one important thing, and we have the truths of God’s Word to hold us steady when the rush and press of life threatens to tip us over.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day16.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "2 Peter 2:1-22, John 10:27-29, Ephesians 2:19-22",
        "devo_title": "The Judgment of False Teachers",
        "devo_summary": "\nBY Kaitie Stoddard\n\nIn high school, we learned the basic structure of a great story: conflict, climax, and resolution. You start with conflict; the obstacle in the story that the main character must overcome. Then you need a climax; the dramatic turning point where the battle is faced head-on. And finally, you give the reader resolution; the conflict is defeated, and the story concludes. You’ll notice most of our beloved books and movies follow this format.\nI’m sure I don’t need to tell you that life doesn’t usually play out like a movie. There’s not always a simple three-part storyline. And sadly, there is sometimes no obvious resolution to our problems.\nOur reading from Peter’s second letter addresses the resolution coming for false teachers. Peter calls out religious teachers profiting from a blasphemous version of the gospel. Make no mistake, Peter saw this as a serious offense. Yet, while their sin was worthy of death, many of the false teachers seemed to keep prospering in their work.\nPeter’s letter to believers essentially says, “You may not see the resolution right now, but let me tell you how this story is going to end.” Peter declares that God is for the good of His people, and the Lord will fiercely defend His children from evil. Peter reminds us that God fights for His people. He’s not some fairy godmother who shows up to grant our wishes. Peter recalls how the Lord destroyed whole cities and even sent a flood because of His wrath and judgment against wrongdoing.\nSometimes we squirm a bit when we hear about God’s wrath. We might feel more comfortable with depictions of the sacrificial Lamb or the overflowing Spirit. But when we cut out the God of justice, we miss out on a vital part of the Lord’s heart. Perhaps we squirm because we know deep down we deserve wrath too. But the greatest story of all time shows we have nothing to fear.\nThe story of Jesus started in the garden, where the great conflict of sin entered stage left. From that time on, men and women tried to overcome their flaws and put the world back together with little success. It’s not until Jesus took center stage, bearing the weight of the world’s sin on the cross, that we reached the true climax of the story. Because the Lord knows how to rescue us (2 Peter 2:9), He knew how death needed to be defeated. Christ was raised victorious, and all who call on His name will enter the kingdom of heaven with Him. When you’re in the midst of a struggle with no resolution in sight, remember how this grand story ends.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day17.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "2 Peter 3:1-13, Genesis 1:6-10, Genesis 7:17-24, Revelation 21:1-8",
        "devo_title": "The Day of the Lord",
        "devo_summary": "\nBY Kaitie Stoddard\n\nYou know when you make a big deal out of something pretty insignificant? Maybe your day didn’t start on the right foot, and you just hit a tipping point. Now you’ve completely lost perspective on the matter at hand and can’t seem to right your focus. Does this ever happen to you?\nIt’s easy to get caught up in the struggles of the daily grind. While we believe the very breath in our lungs is a gift from God, we lose our grasp on the miracle of life when the kids are fighting, a stressful project is due, or a relationship goes awry. It’s natural to focus on the things in our lives that need attention, but how can we do that without losing sight of the bigger picture?\nIn Peter’s second letter, he reminds believers not to lose sight of the greater story. For Peter, one of the most encouraging things to remember in times of trials was the coming Day of the Lord. So often, we focus on the death and resurrection of Christ but forget His promise to return. When we do, we lose sight of where our lives are headed.\nPeter even said that there will be false teachers who question God’s timing and try to convince believers that Christ isn’t coming back. But our hope rests in the trustworthy promises of the Lord. And because Christ said He’ll return like “a thief in the night,” we need to be prepared for His arrival at any moment (1 Thessalonians 5:2).\nWhat does it look like to be prepared? It’s not about storing up good deeds, because nothing we ever do will be perfect enough to deserve heaven. All we need to do is place our trust in Jesus, our Savior. He stands in the gap and covers all our sin. “Based on his promise, we wait for new heavens and a new earth, where righteousness dwells” (2 Peter 3:13). These promises rest not on our merit, but on His.\nIn knowing that Christ will come back at any moment, the stressors of our lives seem less significant. In the new heavens and new earth, a bad grade on a test or an embarrassing moment won’t mean a thing. In fact, “Death will be no more; grief, crying, and pain will be no more, because the previous things have passed away” (Revelation 21:4). We will be with the one who created us, the one who fulfills our every need. In the midst of the messy and mundane, let’s refocus our eyes upward as we wait expectantly for the coming of the Lord.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day18.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "2 Peter 3:14-18, 2 Corinthians 4:1-6, Galatians 5:1-6",
        "devo_title": "To Him Be the Glory",
        "devo_summary": "\nBY Kaitlin Wernet\n\nCan’t we all just agree that cookie dough is best when consumed raw? (Yes, I am aware of those four little words—“do not consume raw”—on the package that would say otherwise.) I don’t know if it’s the taste of sheer rebellion or the perfectly gooey texture, but regardless, I am never totally convinced that sacrificing the delicious and immediate taste of cookie dough is worth the patience and distress of waiting for the dough to actually become warm cookies.\nPerhaps the English proverb “Have your cake and eat it too” should apply to any type of baked good. We want to experience the good thing that’s available now and still have the good thing to come later. Thankfully, Peter’s letters don’t ask us to make that choice. Unlike the cookie dough warnings, Peter encourages us to savor our relationship with God both now and forever, because that’s how much time we’ve been given to enjoy our Savior.\nGod’s economy is different from anything we’ve ever experienced here on earth. His understanding of time and other resources is complete, whereas ours is limited. But being His children, we don’t need to worry about saving or storing up His goodness in order to make sure they will last another day. Nor do we need to feel ashamed for fully enjoying God and His blessings too much; His glory is consistently and eternally abundant.\nNow, we await the day when all His promises will come to fruition (Romans 15:4). Throughout eternity, we will have the privilege of learning more about the One who made those promises to us.\nNow, as an act of submission to a loving God, we attempt to live up to our calling as people who are already spotless in His sight, fully loved and wholly accepted (2 Peter 3:16). Throughout eternity, we will enjoy the righteousness Christ has won for us. Sin will be a thing of the past.\nNow, God’s ways appear to be hidden from us, but we can trust that they are always better than our understanding (Isaiah 55:8–9). And throughout eternity, we will see Him face to face and know Him as He truly is (1 Corinthians 13:12).\nNow, we are called to be on guard, to be sober-minded, so we will not be led astray. Peter instructs us to do this as we “grow in the grace and knowledge of our Lord and Savior Jesus Christ” (2 Peter 3:17–18). Throughout eternity, we will reign with Him.\nEven as we prepare for God’s coming kingdom, He has given us “everything required for life and godliness through the knowledge of him who called us by his own glory and goodness” (1 Peter 1:3). As he concludes his second letter, Peter reminds us of this truth that is everlasting: God’s own glory and goodness are ours to receive, enjoy, and share, from now until eternity. To Him be the glory, always. Amen.\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day19.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "Ephesians 2:19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n19 So then you are no longer foreigners and strangers, but fellow citizens with the saints, and members of God’s household, 20 built on the foundation of the apostles and prophets, with Christ Jesus himself as the cornerstone. 21 In him the whole building, being put together, grows into a holy temple in the Lord. 22 In him you are also being built together for God’s dwelling in the Spirit.\nEphesians 2:19–22\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/SRT-12Peter-Instagram-Day20.jpg"
    },
    {
        "book_title": "1 & 2 Peter",
        "devo_passages": "2 Peter 1:3",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 2 Peter.\nHis divine power has given us everything required for life and godliness through the knowledge of him who called us by his own glory and goodness.\n2 Peter 1:3\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/4-SRT-12Peter-3.jpg"
    }
]