[
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 1:1-2, Acts 16:6-15, 1 Peter 5:1-5",
        "devo_title": "Paul’s Opening Words",
        "devo_summary": "\nBY Bailey Gillespie\n\nNot everyone makes dinners from scratch. Nor do they set the table while singing folk songs in four-part harmony, no less. No, not everyone does these things. But the Trudeau family does. And years ago, when disease broke into their family, my friends still continued to welcome people into their home, investing great care and attention into making their space a refuge since so much of their time would be spent there due to illness. \nReceiving an invitation to dinner at the Trudeaus’ home is special because there are just so many things for them to juggle on an average night, let alone one with company—a warm hearth for cold bodies, hand-crafted dairy-free dressings, detoxifying herbal tea, gentle noise levels. But their home has always been a warm place because this family is the essence of hospitality. When you leave, it feels like you’ve actually been touched by grace and peace. Not merely abstract concepts on a page, grace and peace are felt in the Trudeaus’ home—as real as the gift of hospitality, evidenced by their thoughtfulness and intention, not to mention the gloriously sautéed pork chops or a round of acapella sing-a-longs.\nIn Paul’s letter to the Philippians, he begins by giving them something: “Grace to you and peace from God our Father and the Lord Jesus Christ” (Philippians 1:2). It may seem like a simple greeting, similar to “Hello!” or “Nice to see you!” But the phrase carries more spiritual depth along with it. In Paul’s day, letters were the primary way to convey personal information from afar. It wasn’t like today, where you can text your relatives across the world or confess your love on Facebook Messenger and, best-case scenario, hear back within the hour. Because writing and sending letters required valuable commodities, there was often more intentionality behind it. \nPaul’s message to the believers in Philippi was even more important because his words were the closest he could get to being there with them in person. Being imprisoned, he wanted to thank this church for their financial support and faithful friendship, for being his partners in the gospel (Philippians 1:5). And after personally experiencing the grace of God and His peace that surpassed all understanding (Philippians 4:7), Paul desired for his brothers and sisters in Christ to experience these things too.\nWhen Paul wrote to the saints in Philippi, he extended a spiritual blessing. Both “grace” and “peace” were common salutations in Paul’s day, but he reimagined the phrase and used it to remind his readers of the gifts already imparted to them by God’s Spirit. By greeting fellow believers in this way, Paul encouraged them to remember what was theirs in Christ Jesus. \nMay we seize these blessings from Paul’s church greeting, remembering that grace and peace are real and active gifts that the Father gives to us through the Holy Spirit and makes accessible through His Son. They are ours today, if only we would receive them. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Day1-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 1:3-11, Acts 16:16-40, Philemon 1:4-7",
        "devo_title": "Thanksgiving and Prayer",
        "devo_summary": "\nBY Melanie Rainer\n\nEarly into this past Advent season, I wrote letters until the ring finger on my right hand blistered. For two days straight, I wrote cards of gratitude and joy for each of the volunteers in the children’s ministry I lead, followed by cards filled with stickers and sweet words for every child (ages three and over) in my ministry. In each child’s card, I wrote a variation on a similar theme, but all had the same conclusion: “I hope you always remember how much Jesus loves you.”\nI assume these cards were tossed aside in the holiday hubbub, or purged in the seemingly requisite January clean-out that most families undertake. As I wrote, I kept thinking, Do these words matter? Is it worth the time? Maybe the cards matter, maybe they don’t, but I know the words on them do. And every time I penned that phrase, I prayed the child who received the card would take it to heart. \nPaul’s letter to the Philippians starts with similar sentiments, echoing ancient truths and the hope that the words within the letter would sink down deep into the hearts of those who would read it. This opening exhortation to his readers in Philippi offers a template for godly relationships of believers deeply committed to sharing the love of Christ. Paul expressed gratitude for the Philippians, “for every remembrance” of them (Philippians 1:3), as well as their partnership in the spread of the gospel. \nPaul has a history with the Philippians, and it is on this rich foundation that he builds this really beautiful letter. In Acts 16, we see that when Paul first came to Philippi, a woman called Lydia was converted to faith, and then she and her family invited Paul to stay with them. Their generous hospitality was marked by open ears, open hearts, and open homes. \nLater in the chapter, Paul and Silas were arrested, and in the end, the Lord delivered them from prison. However, during their imprisonment, one of their jailers became a believer, and also welcomed Paul and Silas to his home: “He brought them into his house, set a meal before them, and rejoiced because he had come to believe in God with his entire household” (Acts 16:34). \nPaul seems to care very deeply for the Philippians. As modern readers, we know the rest of this letter will hold both caution and affection. But this beautiful opening reveals the heart and intent behind Paul’s words. We see in these verses how godly relationships work when they are anchored in love for the gospel; there is push and pull, earnest prayer, and deep care for one other’s true well-being and spiritual growth. \nAs I write, I see the faces of those believers who I know I can cling to with the same godly affection Paul has for the Philippians, who balance their love for me with their desire for me to grow more like Jesus every day. They aren’t afraid to whisper (or shout) rebuke in love, and they bathe their strong words in prayer for my sanctification. These people have partnered with me in the hard work of sharing the gospel with a world that has become increasingly hostile toward it. \nI am so thankful for these friends, and today I pray for them in the same way Paul prayed for his friends in Philippi: “that [their] love will keep on growing in knowledge and every kind of discernment,” and that they would “be pure and blameless in the day of Christ, filled with the fruit of righteousness that comes through Jesus Christ to the glory and praise of God” (Philippians 1:9–11). \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Day2-1024x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 1:12-26, 1 Corinthians 2:1-5, James 3:13-18",
        "devo_title": "To Live Is Christ",
        "devo_summary": "\nBY Guest Writer\n\nYears ago, I gave a talk about fear and anxiety. About thirty women settled into a cozy room as I began sharing some of my story. Looking back on my childhood, I see a little girl who wanted to play it safe, who perpetually problem-solved worst-case scenarios, one who felt shadowed by a vague sense of fear. This stream of anxiety ran steadily throughout my life, but no one would have known. I was the kid who easily made friends, loved school, and didn’t cause much trouble. I was the strong, steady one—until I wasn’t.\nIn my late twenties, in the midst of young marriage and new motherhood, the stream of anxiety became a flood. Panic attacks began to torment me. For the first time, my underground anxiety burst out and threatened to take center stage. I felt embarrassed and ashamed. I didn’t want to admit my confusing fears, and I certainly didn’t want others to see my struggle. After all, I was supposed to be the strong, steady one. \nAt this point in my talk, I told the women that I had a secret. I began unbuttoning my shirt. Awkward silence filled the room. Underneath my faded, denim top I wore a white t-shirt and cold, bulky metal chains. No one had suspected that I was wearing chains, yet they were there the whole time—pinching, constraining, and weighing me down. We don’t always know the chains people are wrapped up in, do we?\nThe apostle and missionary Paul wore chains too. In his letter to the believers in the city of Philippi, Paul explains that he is “in chains for Christ” as he endures house arrest (Philippians 1:13 NIV). For years he has been misunderstood, criticized, slandered, and beaten, and now he is jailed in Rome. \nSome could view Paul as a failure. Some could question his faith or even the power or goodness of God. Yet Paul is convinced that his current suffering is nothing to be ashamed of or to hide. On the contrary, he insists that his circumstances advance the gospel message. He tells the Philippians, “Because of my chains, most of the brothers in the Lord have been encouraged to speak the word of God more courageously and fearlessly” (Philippians 1:14 NIV). Even in jail, Paul rejoices that his guards are hearing about Jesus and that other believers are encouraged and empowered. \nWe may marvel at Paul’s perspective, but let’s not romanticize our chains. In 1 Corinthians 2, Paul reveals his weakness, fear, and trembling (v.3). We all chafe and wrestle with painful circumstances, those things we would never choose for ourselves, yet God still allows. \nWhat pinches you, constrains you, or weighs you down? Our anxieties, our fears, our sufferings are heavy and costly. But we don’t have to hide them or be ashamed. Even our struggles can deepen our dependence on Christ and point others to the one who walks us through our darkest valleys and who redeems us—chains and all. \n\nPatti Sauls lives in Nashville, Tennessee, with her husband Scott and daughters, Abby and Ellie, where they serve alongside the people of Christ Presbyterian Church. Prior to living in Nashville, the Sauls planted churches in Kansas City and Saint Louis and served at New York City’s Redeemer Presbyterian Church. A trained speech therapist, Patti also enjoys serving behind the scenes, hiking with friends, and reading good books.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-AppOnly-Day3-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 1:27-30, Philippians 2:1-18, Psalm 133:1-3, 1 Corinthians 1:10",
        "devo_title": "Christian Humility",
        "devo_summary": "\nBY Guest Writer\n\n“So, have I missed anything during my Twitter vacation?” I asked my husband, half joking, half serious. Every January, I take an annual social media break. Whatever I call this—a fast, a disappearance, a protest, a spiritual practice, an act of self-care—I’m always astonished how the break makes my world feel quieter. It’s sobering to notice how I’m being shaped by the constant noise of life online. And I wonder how Jesus might be calling all of us to a better, humbler way.\nIn His letter to the church at Philippi, Paul has quite a bit to say on the subject of humility. He writes, “Consider others as more important than yourselves” (Philippians 2:3), before drawing comparisons to Jesus Himself in 2:5–7. \nIf this tempts you to empty yourself into silence or challenges your natural fighter instinct, please know this isn’t an invitation to be passive. Jesus was a man who frequently challenged power, debating religious leaders and touching the unclean, and defending the dignity of people on the margins of life. So no, humility isn’t about shrinking into invisibility. There are certainly things worth fighting for.\nPerhaps humility is more of a posture. And if humility is our posture and Christ is our example, then we can walk in love and know how to respond when we come up against the messiness of the world, acting from a place of love and security rather than reacting. We can know when to rage against the darkness and when to be still.\nWe can also learn when to sit and listen. We can fight the darkness while honoring each other’s humanity. We can acknowledge that even the corrupt and the cruel are loved by a God who grieves for them, who longs to lead them out of the darkness and welcome them as sons and daughters.\nSo, the social media thing? You don’t have to scroll far to see the human tendency to posture with pride. I see it when I ask a question and I’m already planning what to say next. I see it when my love for a person cools because I don’t like their behavior online. I see it when we slip into performative debates for the cultural currency of likes and retweets.\nIn life online and off, what would it look like to look out for the interests of others before my own? How might we learn to consider others with more importance, even when we disagree? What kinds of questions ought we learn to ask before we speak? And how will it empower us to know when our words really matter?\nQuestions like these might help to foster humility. And no doubt, we need the help because humility is a hard way. But it’s also one we don’t have to walk alone.\n\nJen Rose Yokel is a poet, writer, a spiritual director in training, and a contributing writer at The Rabbit Room. Originally from Central Florida, she now makes her home in Fall River, Massachusetts, with her husband Chris. Some of her favorite things include used bookstores and good coffee. You can find more of her writing at jenroseyokel.com or follow her on Twitter and Instagram @jen_rose.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Day4-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 2:19-30, Acts 19:21-22, 1 Corinthians 16:10, 1 Thessalonians 5:12-13",
        "devo_title": "Timothy and Epaphroditus",
        "devo_summary": "\nBY Bailey Gillespie\n\nIt was an early morning in June when I logged into my work computer at our university library. I hadn’t been online for more than a minute before seeing tributes pouring in from church leaders, moms, and others whose lives have been enriched by this one woman and her heart for God. Elisabeth Elliot had died. \nElisabeth’s writing helped guide my spiritual formation after I stumbled across her work somewhere around the age of twenty years old. An American missionary, wife, author, and speaker, she was a modest saint, one who would never call attention to herself. She saw our lives as “chalices” or “empty vessels willing and ready to be filled with the life of God.” But on this June morning, people seemed to think it right to honor her long walk of faithfulness. \nDuring his missionary journeys, the apostle Paul honored his ministry partners in a similar way by speaking well of them. When he wrote to groups like the one in Philippi, he vouched for his friends and elevated their good qualities so there would be no question of their credibility. Timothy was a “like-minded” man doing the Lord’s work with “proven character” (Philippians 2:20, 22; 1 Corinthians 16:10). Epaphroditus was his “brother” who should be welcomed with “great joy” (Philippians 2:25, 29). Paul also asked these churches to recognize and hold in high regard those among them who were risking their lives for the kingdom (1 Thessalonians 5:12–13). \nJesus tells us, “You will have suffering in the world.” (John 16:33). I’ve always found it strange when we describe life as having seasons of trials and tribulations. Instead of life being a static plane of serenity with intermittent times of trial, it sometimes seems that life itself is the trial with intermittent times of serenity. One thing that gives us strength while following Jesus is our friendship with others and their encouragement on the journey. \nI hope people pointed out the good they saw in Elisabeth Elliot while she was alive. I imagine that her modest personality was challenged now and then by opportunities to focus on affirmation from others. But even if not, I hope her story inspires us to follow Paul’s model and affirm the God-honoring qualities we see in our brothers and sisters. This isn’t to draw self-serving attention or make them arrogant; it’s an opportunity to build up the Body of Christ in a world so often marked by anything but serenity.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-AppOnly-Day5-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Psalm 133:1",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHow good and pleasant it is when brothers live together in harmony! —Psalm 133:1\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Day6-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 1:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Philippians, Paul’s declaration of complete devotion to the gospel of Jesus Christ.\nFor me, to live is Christ and to die is gain. —Philippians 1:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Lockscreen-Day7-576x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 3:1-11, Jeremiah 9:23-24, 1 Peter 2:1-10",
        "devo_title": "Knowing Christ",
        "devo_summary": "\nBY Melanie Rainer\n\nWhen my husband was in business school, he had to develop an “elevator pitch” as part of his job search. An elevator pitch is a fairly standard business practice with the goal of selling something (a business idea, a person for a job, or a product) in the amount of time it takes you to ride an elevator with someone. For my husband and his fellow students, the idea was simple. At career fairs with large companies who hired the best and brightest from top business schools, you need to make yourself stand out in thirty seconds or less: say who you are, why you are different, and why you can bring unique value to the company. \nIn the first eleven verses of Philippians 3, Paul offers his own succinct and beautiful elevator pitch for gospel transformation. He lays it all out, right there: who he was, who he is now, and why it matters.\nSo who was Paul? He was the Hebrew born of Hebrews, who said of himself, “If anyone else thinks he has grounds for confidence in the flesh, I have more” (Philippians 3:4). Paul, a Pharisee whose life mission was to persecute and kill Christians, had all the right answers. He followed the law, which he knew backward and forward and to the letter. \nBut when confronted firsthand and face to face with the truth of who Jesus really is, Paul declared, “Everything that was a gain to me, I have considered to be a loss because of Christ” (v.7). Despite the perfect resumé, the right pedigree, the unflappable credentials—Paul had nothing to offer before God. What a radical gospel transformation Paul experienced! It’s incredible, his confidence in the gift of grace that Christ offers to us. \nI often feel so very lost in the darkness of my own sin. I know I have nothing to offer, despite my best efforts. But this confidence Paul describes? I don’t always believe it is available to me, too. My brain and its twisted paths of anxiety, fear, too many words and not enough faith, often lead me down the road of relying on my own flesh. I reason, I’m not good enough for God, but if I work harder, read my Bible more, pray more, be nicer to people, maybe then I’ll become more like Christ.\nBut here, in his eleven-verse elevator pitch for the gospel, Paul reminds me again that those thoughts are not true. My righteousness cannot come from my own flesh or from the law, but only through faith in Christ (vv.9–10). Jeremiah 9:23–24 echoes the same promise: \nThe wise person should not boast in his wisdom;  the strong should not boast in his strength;  the wealthy should not boast in his wealth.  But the one who boasts should boast in this:  that he understands and knows me— that I am the LORD.\nHe is the Lord, mighty to save and full of abounding grace. What He requires from us is a desire “to know Him and the power of His resurrection” (Philippians 3:10), a power that is available to all who receive the gospel of grace. May we remember, and always be thankful for, the privilege of being able to stand on the merit of Christ alone. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-AppOnly-Day8-1024x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 3:12-16, Romans 8:28-30, 1 Corinthians 9:19-27, Colossians 3:1-4",
        "devo_title": "Reaching Forward to God’s Goal",
        "devo_summary": "\nBY Guest Writer\n\nThere’s a quote attributed to Maya Angelou that somehow gives comfort to my inner critic: “I did then what I knew how to do. Now that I know better, I do better.” I’m not sure if these are actual words written by Dr. Angelou or if it’s one of those quotes that has been passed around so much on Instagram nobody knows the true source. But wherever it comes from, I like it. Something in it resonates with me, an echo of much-needed grace.\nI’d like to think this is a message someone in the church at Phillippi needed to hear when Paul’s letter came to town. In Philippians, Paul isn’t writing to correct an issue or fight a dangerous teaching. Instead, he’s sent an extended thank-you letter, a note of encouragement, and a rally to keep going.\nMetaphors about running races and winning prizes aren’t all that unusual in Paul’s writing, but if we look a bit more closely, we’ll find the words of a gentle, loving coach here. His letter to the Philippians includes a heartfelt thank you for their support, and the reminder that there is still so much work to do for the kingdom (Philippians 1:21–24). He points to Jesus’s obedience unto literal death as the ultimate example of humility (Philippians 2:8), a stark contradiction to his own list of credentials for “confidence in the flesh,” which is enough to make any zealous striver or recovering perfectionist wither. It’s also a false confidence Paul now recognizes as utterly empty (Philippians 3:4–6). His priorities have changed. \nYes, there is work. There is effort. There is a goal to pursue, a race to run, a job to do (Philippians 3:12–13). But look for the grace between the words: there is no striving in his words. Paul calls this way of thinking a mark of maturity—the realization that all we need is God. This is not the anxious striving to appease an angry Father. This is not fearfully walking on eggshells. Instead, Paul appeals to his readers’ identity as “citizens of heaven,” and encourages them to “live up to whatever truth we have [already] attained” (Philippians 1:27; 3:16).\nAnd so, there is the tension: to work hard for God’s purposes, but trust that Christ has taken hold of us. To embrace our identity as kingdom citizens, while knowing we won’t live this life perfectly, nor could we ever earn our way back into a right relationship with God. To be content where we are while seeking to grow, and trusting that when the time is right, the Holy Spirit will reveal truth and nudge us in the direction that will lead us to look more like Jesus. “Forgetting what is behind and reaching forward to what is ahead,” we learn to pursue the ultimate prize: Christ Jesus Himself (Philippians 3:13–14).\nWe grow. We learn. We know better. We do better. Until the day we step into the kingdom and the breeze on our faces feels like home.\n\nJen Rose Yokel is a poet, writer, a spiritual director in training, and a contributing writer at The Rabbit Room. Originally from Central Florida, she now makes her home in Fall River, Massachusetts, with her husband Chris. Some of her favorite things include used bookstores and good coffee. You can find more of her writing at jenroseyokel.com or follow her on Twitter and Instagram @jen_rose.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Day9-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 3:17-21, Philippians 4:1, Romans 16:17-20, 2 Thessalonians 1:5-12, Titus 2:11–14",
        "devo_title": "Stand Firm in the Lord",
        "devo_summary": "\nBY Guest Writer\n\nThe blaring siren and flashing blue lights jerked me out of my daydream. How fast was I driving, anyway? Turns out I was cruising along at 53 miles an hour in a 40-mile-an-hour zone. And it wasn’t the first time. There’s a reason my dad often told me I had “a lead foot.” This time, the police officer was firm yet gracious. He urged me to keep my speed down, but let me off with a warning instead of a costly ticket. \nI may sometimes be too speedy, but nothing compared to Mario Andretti, the professional racecar driver. He would regularly race at speeds over 200 miles an hour. When asked for a racing tip, he quipped, “Don’t look at the wall.” His point was that a driver’s car follows what he is focused on. Where you look is where you go. If you keep looking at the wall, you’ll crash into it.\nIn his letter to the church in Philippi, Paul is urging the impressionable believers to keep their focus on Christ. Paul longs for them to flourish in the faith, not to crash into walls of false teaching. In chapter 2, Paul warns the church against legalism. This deception rejected the sufficiency of Christ’s righteousness that comes from God through faith. Then and now, legalistic thinking insists that it’s a person’s best efforts and striving that make them right with God and with other people. I crash into a wall of legalism when I assume God merely tolerates me instead of remembering that He deeply delights in me as His beloved daughter. I crash when I’m critical and judge others for not meeting my personal expectations and preferences.\nIn chapter 3, Paul warns against another danger. While speeding away from the wall of legalism, some may over-correct and ricochet into the wall of licentiousness. This deception insists on throwing off moral restraint in hopes of satisfying all appetites and desires. “Their destiny is destruction, their god is their stomach, and their glory is their shame,” says Paul (Philippians 3:19). Licentiousness says “anything goes,” that if it feels good, you should do it. I crash into a wall of licentiousness when I pridefully believe that I’m above temptation and fail to recognize my need for God’s good boundaries. I crash when I foolishly allow my desires to drive me to do things that hurt myself and hurt others.\nAt the root of all legalism and licentiousness is a worship of self above all else. Paul is, in essence, warning, “Don’t look at the wall!” Where you look is where you go. When we focus on ourselves, it’s not long before we crash. But this does not need to rule us. We can stand firm in the Lord as we remember that our true citizenship, our true allegiance, is in heaven with God (Philippians 3:20). May the Lord capture our hearts and affections, enabling us to focus on Him, worshiping Him alone. The One who made us is also the only One who can save us. Only He truly satisfies our deepest longings and desires, and only He can safely lead us home.\n\nPatti Sauls lives in Nashville, Tennessee, with her husband Scott and daughters, Abby and Ellie, where they serve alongside the people of Christ Presbyterian Church. Prior to living in Nashville, the Sauls planted churches in Kansas City and Saint Louis and served at New York City’s Redeemer Presbyterian Church. A trained speech therapist, Patti also enjoys serving behind the scenes, hiking with friends, and reading good books.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-AppOnly-Day10-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 4:2-9, Matthew 6:25-34, John 15:7-11, Romans 8:5-6",
        "devo_title": "Practical Counsel",
        "devo_summary": "\nBY Guest Writer\n\nCompany was coming to town, the house was in disarray, I had mounds of laundry and cooking before me, and I was apologizing to my 10-year-old daughter for being impatient. She gave me a hug and said, “Mom, look at the things you have finished, not the things you haven’t.” In essence, the Lord was graciously reminding me, through my daughter, to “rejoice in the Lord always”—in everything—even while in the midst of a list of to-dos (Philippians 4:4). \nAs daughters of the King, rather than living in worry and fear, we can rejoice in “the riches of his grace that he richly poured out on us with all wisdom and understanding” (Ephesians 1:8–9). I don’t know about you, but so often, I live in and wrestle with worry. When I hear that command to rejoice, I fall into discouragement because I know my life’s not marked by rejoicing. Paul was in prison when he wrote “Rejoice!” So why can’t I rejoice where I am today? I spin my wheels trying to figure out how to cultivate a life of joy and peace. Today’s reading reminds me that the answers to how we live this life of faith are found in God’s Word. \nGod knows how to bring us peace because He is the God of peace (Philippians 4:9). He knows what will bring us true joy. He is always near, and so there’s no reason to worry; His peace will guard our hearts and minds (vv.5–9). \nWe cannot add one moment to our days by worrying, and so we are to set our minds on the Spirit, who offers us “life and peace” (Matthew 6:27; Romans 8:6). Whatever is true, honorable, just, pure, lovely, commendable—these are the things we should dwell on (Philippians 4:8). All of these things and more we are able to receive through His Spirit and His Word; He uses both to draw us to Himself.\nWill we continue to worry, to set our minds on things of the flesh? Yes, we may always struggle with that. But we are saved by grace, works in progress; the One who’s begun a good work in us will carry it on to completion (Philippians 1:6). And that is truly a great cause for rejoicing, because “as far as the east is from the west, so far has he removed our transgressions from us” (Psalm 103:12). Wherever we find ourselves today—even in dark seasons and in overwhelming situations—we can rest in Him and rejoice because the gospel is true.\n\nKimberly Girard is a well-loved child of God, wife of an extraordinary man, mother of three amazing kids, and writer living in Pittsburgh, Pennsylvania. You can find her at Loud Singing and on Twitter. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Day11-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 4:10-23, Proverbs 11:24-25, Acts 20:32-35, 2 Corinthians 9:6-9",
        "devo_title": "Encouragement and Prayer",
        "devo_summary": "\nBY Guest Writer\n\nSome call it “liminal space,” the time or space between what has been and what lies ahead. It might be a time of waiting or even transformation. These places can be painful or beautiful: a time of singleness or the joyful, anticipated waiting during engagement. The days of longing for children or the day after the youngest leaves for college. The darkness of depression or the lifting of anxiety. In these uncertain places, how can we learn to be content?\nIt’s likely that Paul wrote his famous declaration of contentment from inside the walls of a Roman prison, and yet his words brim with gratitude. His friends in Philippi were concerned, doing what they could to help him, and he acknowledged that just knowing they care is enough. He tells them, “I have learned to be content in whatever circumstances I find myself. I know both how to make do with little, and I know how to make do with a lot” (Philippians 4:11–12). In other words, “Thanks for your concern, but don’t worry! I’m going to be okay.”\nIn this letter, Paul is warm and optimistic, shifting the focus off of himself to encourage a church. His words radiate joy and humility bound up in a deep truth. Contentment doesn’t lie in comfort, and it doesn’t even lie in freedom. In this liminal space between living free or dying a brutal death, Paul shares this secret from behind bars: “I am able to do all things through Him who strengthens me” (Philippians 4:13).\nIn our own liminal spaces, maybe we can find a little bit of that strength too. Not in a naively optimistic way that ignores or denies reality, but in a solid confidence that someday this, too—everything, really—will be made right. And in this contentment, we can take the steps we need toward the changes we desire, from making friends in a new city, to scheduling a doctor appointment, to leaning on Him to get up and take each day one step at a time.\nConsider the journey of a caterpillar becoming a butterfly. This old metaphor of free-flying beauty springing forth from a squirmy, leaf-munching creature can sound a little cliché. But there’s a reason this image resonates and endures. The caterpillar doesn’t just spin a little capsule and pop out fully formed. It liquifies to a death-like state. It waits. It struggles to tear out of its chrysalis, strengthening its wings so it can fly. Stop the process too soon, or attempt to help a butterfly escape, and it’s over. Every step of the process is vital. \nPerhaps our own waiting spaces are like that. Changing, struggling, and finding contentment in the shelter of God—over and over again, until we are made completely new. But regardless of the space we currently inhabit, whether moving forward in a joyful burst of enthusiasm or in a seemingly endless season of waiting—we are not alone. “In any and all circumstances,” we already know the secret of being content: Jesus Christ is our peace. And by His Spirit we are strengthened and equipped, enabling us to do all things.\n\nJen Rose Yokel is a poet, writer, a spiritual director in training, and a contributing writer at The Rabbit Room. Originally from Central Florida, she now makes her home in Fall River, Massachusetts, with her husband Chris. Some of her favorite things include used bookstores and good coffee. You can find more of her writing at jenroseyokel.com or follow her on Twitter and Instagram @jen_rose.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-AppOnly-Day12-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "John 15:9",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“As the Father has loved me, I have also loved you. Remain in my love.” —John 15:9 \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Day13-972x1024.jpg"
    },
    {
        "book_title": "Philippians",
        "devo_passages": "Philippians 4:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize this verse from Philippians 4, which reminds us to dwell on things of the Spirit.\nFinally brothers and sisters, whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is lovely, whatever is commendable—if there is any moral excellence and if there is anything praiseworthy—dwell on these things.  —Philippians 4:8\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/02/SRT-Instagram-Lockscreen-Day14-NEW-576x1024.jpg"
    }
]