[
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "Acts 16:1-40, Acts 17:1-34, Acts 18:1-5",
        "devo_title": "Paul’s Ministry in Thessalonica",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Acts 16:1-40, Acts 17:1-34, Acts 18:1-5\nEditor’s note:\nThe Scripture reading for today is longer than the others and comes from the book of Acts. These chapters in Acts provide context for our study of 1 and 2 Thessalonians, and give us a foundation for understanding the Apostle Paul’s relationship with this church.\nMy grandmother had five siblings, and by the time I came along, the six had married to become twelve. I grew up around their vegetable and flower gardens, in their kitchens that smelled of soup beans and cornbread. I listened to them tell stories late into the night, sat by as they played cards amid uproarious laughter, even stood outside in my pajamas after dark as they howled old songs by the light of the moon.\nI rarely think of one of them without thinking of all of them. In my mind they were a set—always connected. That’s not to say they were always together over the years. They saw wars and endured moves and raised children in different states. But when life separated them, they built bridges with letters. They wrote letters home from overseas, sent postcards when they traveled, mailed handwritten pages of updates from one address to the other.  Even now that only two of the twelve remain, they write letters to us, their family. They keep us connected still. \nLetters encourage in a way email never will. They speak to a part of the soul that social media comments can’t quite reach. When I read the letters from the Apostle Paul to the church at Thessalonica, I hear the earnestness of words written by hand and carried on foot. I hear a weary pastor, a brother in the faith, longing to see his congregation—his family. \nToday’s Scripture reading gives us context for our study of the letters of 1 and 2 Thessalonians. Acts 16 and 17 tell how Paul visited Thessalonica on his second missionary journey—a journey that included many other cities and countless trials along the way. The apostle faithfully preached the gospel to anyone in earshot, and they ran him out of nearly every town he dared enter. But Paul’s work was not in vain because the Holy Spirit was at work. Families of faith formed along his route—one of them in Thessalonica.\n Paul’s letters to the Thessalonian believers are like so many of his other letters, filled with instruction on how to live the Christian life. But these letters do more than clarify theology; they are filled to the brim with affection and encouragement for the men and women whose belief in and hunger for the gospel encouraged him, their teacher. Paul wrote to build up his Thessalonian faith family, not with empty platitudes, but with a hope rooted one truth: “This Jesus I am proclaiming to you is the Messiah” (Acts 17:3). \nAs you walk through 1 and 2 Thessalonians in the coming weeks, read with a heart for the present and an eye to the future. We are here on this earth for a time, connected as sisters and brothers in the faith. But we are only here for a time. The greatest encouragement we have to offer one another is the hope of Christ.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-1-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 1:1-10, Romans 8:35-39, 1 Peter 4:12-14",
        "devo_title": "We Always Thank God for You",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Thessalonians 1:1-10, Romans 8:35-39, 1 Peter 4:12-14\n“I would maintain that thanks are the highest form of thought, and that gratitude is happiness doubled by wonder.”\n– G. K. Chesterton\nI went to a high school with clean carpets, new lockers, and teachers who cared. Whenever adults mentioned the school and its shiny gymnasium floors, they would say, “We’re so blessed to have this facility.” Our teachers would smile as they paraded us to the library full of new books: “We’re so blessed to have this facility.”\nIt became a joke, at least between my sister and me, who were still learning the ropes of gratefulness. We’d lounge on the beautifully upholstered purple furniture, looking at original paintings of eagles hung on the walls while chanting to each other in our best Michigan-mom accents, “We’re so blessed to have this facility.”\nSomehow, blessedly, we moved from lying around, idly kicking at our backpacks, to being contributing members of that community, and our hearts moved from mockery to genuine thankfulness for the incredible, undeserved blessings in our lives.\nIf we can consider Chesterton’s words that the highest form of thought is thankfulness, then ungrateful mockery is possibly the lowest form of thought. Paul is setting the example for his beloved Thessalonians by weaving his thankfulness throughout this letter to them. And he doesn’t just thank them for doing a great job; he thanks God for all the saving benefits bestowed on them, and celebrates the evidence of the gospel in their lives (1 Thessalonians 1:2-5). His thanks are, above all, to God. \nAll good comes from God, so no good can be hoped for by sinners but from God. Paul’s thanks to God are appropriate because God is the author of all that is good—not just all the good that comes to us, but even all the good that is done by us.\nI think of myself as a pretty thankful person—maybe you do, too—but I hadn’t thought of it as a duty. Matthew Henry goes so far as to say, “Thanksgiving to God is a great duty, to be performed always or constantly; even when we do not actually give thanks to God by our words, we should have a grateful sense of God’s goodness upon our minds.” We are to set our minds always in the gear of gratefulness.\nDo you find yourself in a habit of gratefulness to God, or are you set in mockery? When I consider the percentages of the words that come out of my mouth, I’m definitely teasing or complaining at least as much as I’m blessing and thanking.\nIf you also find yourself struck by the mockery and ungratefulness that escapes your lips and hangs around your mind, you’re in good company. But don’t just grit your teeth and try harder. Paul immediately points us to the three cardinal graces: faith, hope, and love. And he doesn’t say, “Try harder, y’all! Get you some more faith, hope, and love!” Instead he names the cause of these graces: our Lord Jesus Christ.\nAll good comes from Him, and any change in our hearts comes from Him. He is the object and also the instigator of our thankfulness. For the gospel also comes to us not only in words, but in power (1 Thessalonians 1:5).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-2-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 2:1-20, 1 Corinthians 9:3-14, Hebrews 4:12",
        "devo_title": "You Are Our Glory and Joy",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: 1 Thessalonians 2:1-20, 1 Corinthians 9:3-14, Hebrews 4:12\nI send more emails every day than I can count, but there’s one that brings me an inordinate amount of joy. It’s not work-related, requires many pop culture references, and has low standards for correct grammar. Any questions as to why it’s my favorite? \nYou see, a few years ago, I was sitting at my desk at a new job when an email popped up from a name I recognized, yet hadn’t talked to in quite some time. “LONG LOST FRIEND” was in the subject line, and the unnecessary capitalization has become our own kind of necessary in the hundreds of emails that have been sent and received since. \nWhat started out as a lighthearted attempt for two girlfriends to catch up over lunch breaks and between meetings became a regular rhythm in my day, and eventually, the sweetest lifeline. This email chain connected two very different lives: one single and dating, and the other newly married; one in Tennessee and the other in Mississippi. But despite our different seasons of life, both of us needed encouragement, typed-out prayers, and echoes of “me too” in ways we couldn’t before describe. \nPaul’s letter to the Thessalonians puts words to why the silly emails between my friend and me aren’t so silly after all: God created our lives to be shared. When the Thessalonians read Paul’s words for the first time, I like to imagine them getting the same silly grin I do when an email pops up from my modern-day pen pal. Paul was their guy! He understood them! Thessalonica was going through their own share of suffering and affliction, but this letter was filled with gospel truths—the motivation they needed to help them endure. \nPaul’s letter illustrates that being a family of faith involves knowing and being known. His writing assumes a prior two-way relationship, one that repeats phrases like “for you yourselves know” and “as you know.” Closeness in community is vital for any gospel-centered relationship—in ministry, in suffering, and everything in between. But this closeness is not merely circumstantial or emotional; it is rooted in truth and grown in grace.\nOne of the best ways to receive and offer encouragement in community is through God’s Word. Paul knew the importance of communicating the truth about Jesus, mentioning Him by name in every single chapter of 1 Thessalonians. As sisters in Christ, we too ought to permanently carry the gospel of hope on our tongues. \nGod gives us pieces of His own love when He gives us friendship with one another. Whether with a faraway friend via email or a coworker over coffee, we get to witness redemption, encourage growth, and partake in God’s goodness when we share with others “not only the gospel of God but also our own lives” (1 Thessalonians 2:8). Thanks be to God.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-3-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 3:1-13, Matthew 4:1-11, Romans 8:16-21",
        "devo_title": "Stand Firm in the Lord",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Thessalonians 3:1-13, Matthew 4:1-11, Romans 8:16-21\nI enjoy being alone. If I’m honest, I should go ahead and admit that it’s actually one of my favorite things to do. After a busy weekend or a house full of activity, I long for a quiet space, large window, soft blanket, and a cup of hot goodness. This is my happy place, and I could stay there for what seems like forever. I am especially prone to long for my alone time when my outward circumstances weigh heavily on my brain and my heart longs for an escape. \n I often joke that I just want to sleep it—whatever “it” may be—off. In my ideal world, when things are not going my way, when suffering comes and danger knocks on my door, I simply want to retreat, disappear, and not return until all is well again. And I’d prefer to do this alone.\nThough being alone provides a much-needed space to quiet the noise and refocus my thoughts, something dangerous can happen when I retreat to my happy place in order to avoid the discomforts of my reality.  I create an open space for fear to grow, an inviting environment for lies to build and pain to settle in. It becomes easy to lose sight of truth, and I inevitably pull further and further away from Christ. \nI know that it is during these times especially that I need to pray and intentionally focus my attention on God’s Word. But can I be honest? In the midst of suffering, this becomes harder and harder to do alone. \nIt is during these exact times that I am grateful for my community—friends who will not sit back and watch me sink, but instead will selflessly show up at my door and sit with me. Sometimes they come carrying a load of their own, and our prayers for each become what we both need in order to stand. Whether I want to admit it or not, it is the presence and prayers of others that help keep me secure.\nThere is danger in suffering alone. But Christ knew this about us; therefore, He has called us to care for, love, and support those around us regardless of our own personal discomforts. He uses our pain, our circumstances, and stories to grow us in both love for Him and for His kingdom. Paul said it this way to the Thessalonians: \n“So we have been greatly encouraged in the midst of our troubles and suffering, dear brothers and sisters, because you have remained strong in your faith.”\n– 1 Thessalonians 3:7\nClearly, Paul does not avoid the topic of suffering. He knows it all too well. However, he also knows that his ability to love, encourage, and pray for the people around him is directly connected to his dependence on Christ. \nWhen relying on our personal strength to stand, we will surely fall. However, Christ calls us to trust in Him in all circumstances. It is only the outpouring of His love that strengthens us to stand, and encourage those around us. Thanks be to God who knows us better than we know ourselves, and gave us the gift of community. “And may the Lord cause [us] to increase and overflow with love for one another and for everyone” (1 Thessalonians 3:12).\n\nWynter Pitts is the founder of For Girls Like You, a resource ministry for both tween girls and their parents. The mother of four girls herself, Wynter’s mission is to empower and equip women of all ages in becoming who God created them to be, and to support parents in raising strong Christ followers. She is the author of several books, including You’re God’s Girl Devotional and She Is Yours: Trusting God As You Raise the Girl He Gave You.  Wynter, her husband Jonathan, and their daughters (ages 7-13) live in Dallas, Texas. Follow her on Instagram @forgirlslikeyou.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-4-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 4:1-12, Ezekiel 36:26-27, 1 Peter 1:15-23",
        "devo_title": "Live in Holiness",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Thessalonians 4:1-12, Ezekiel 36:26-27, 1 Peter 1:15-23\nThe word “holiness” is one of those terms that, depending on your background, can carry a lot of baggage. For some of us, it’s connected to feelings of guilt and shame, an impossible standard hanging over us. Others associate it with harshness and judgment after hearing it taught legalistically.\nAt first blush, 1 Thessalonians 4 might seem to play into these stereotypes by linking holiness with sexual morality. Paul exhorts the Thessalonians toward holiness by cautioning them from indulging in “lustful desires” (v. 5), and instead encouraging them to “control their own bodies.” Just another Christian prude, our present-day culture might think. However, there is more going on here than first meets the eye.\nFirst is the Thessalonian culture, which is remarkably similar to our own. Many New Testament scholars note that the pagan Thessalonian culture had a liberal view of sexuality. Sex outside the bounds of marriage was not only permissible, but even encouraged.\nThe second thing to note about this passage is the tone. It’s tempting to read instructions about holiness in a thundering voice of condemnation, but that was not Paul’s approach. In verse 1, the Greek word erotao—translated “entreat” or “encourage”—has a connotation of gentleness and friendship. Paul isn’t dropping a hammer of judgment; instead, he is clarifying and affirming a community he loves. \nPaul can see the Thessalonians are living their faith well. They are honoring Christ with their lifestyles. They are pursuing holiness in every area of their lives. But as they continue to do so, Paul wants them to make a distinction between the teachings of their culture and the teachings of Christ, which diverge on the issue of sexual practice. \nThis context matters, especially in light of popular stereotypes about Christian holiness and sex. For Paul, holiness is not a measuring stick we should use to compare and condemn. By its reckoning, we all fall short.\nInstead, holiness is our witness. It’s how we point the world to the character of God and proclaim, “This is what God’s love is like.” God’s love is intimate and invested. It is constant and covenantal. It is dignifying rather than degrading. It does not use and abuse. It does not take advantage for a short-lived thrill. It isn’t rooted in selfish desire but self-giving faithfulness. Our holy lives bear witness to all these things.\nIn that sense, holiness is not simply about being different or set apart, but reinvigorating the imagination of a world which misunderstands both God and sex. Rather than sneer at our culture and its sexual norms, we can humbly and joyfully point to something better. Our holy lives can serve as the embodiment of God’s best for humanity, a vision of freedom, honor, and dignity.\nHoliness was never meant to be a spiritual bludgeon. And it is much more than a set of boundaries and rules. It is our witness to a world that has forgotten how to live. It is our witness to a world that has forgotten what we are for. And it is our witness to a world that has forgotten what God is like.\nEverything about us—our bodies, our sex—is a part of that witness. We, the people of God, exist to point people to God. Love is His song, and holiness is the dance.\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She blogs at SheWorships.com, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-5-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "Romans 8:37-39",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nNo, in all these things we are more than conquerors through him who loved us. For I am persuaded that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor any other created thing will be able to separate us from the love of God that is in Christ Jesus our Lord.\n—Romans 8:37–39\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-6-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 5:16-18",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for 1 Thessalonians.  \nRejoice always, pray constantly, give thanks in everything; for this is God’s will for you in Christ Jesus.\n—1 Thessalonians 5:16–18\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/4-Thessalonians-1-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 4:13-18, 1 Thessalonians 5:1-11, Joel 2:31-32, 1 Corinthians 15:42-49",
        "devo_title": "Build Each Other Up",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Thessalonians 4:13-18, 1 Thessalonians 5:1-11, Joel 2:31-32, 1 Corinthians 15:42-49\nGod keeps His promises.\nIt’s an indisputable fact that no one can keep promises better than God. I will not be persuaded otherwise, and neither should you. After repeatedly attempting to achieve lifelong happiness by setting my hope on the promises of friends, boyfriends, or family members, and then finding myself picking up the pieces of my broken heart after the carpet got yanked out from under me each time, I finally can speak this truth: There ain’t nobody NOWHERE that can keep a promise like God can! \nAllow me to elaborate.\nIn 1 Thessalonians 4, Paul encourages believers not to grieve hopelessly when fellow Christians die.  Grieving like there is no hope is what the world does, not what Christians do. Paul isn’t trying to be callous here—of course there is room to grieve when a loved one dies. He’s using that example as a way to illuminate a substantial promise from God: Life in this world is only the beginning.\nHere’s the thing: the same power (God’s power) that raised Christ from the dead is taking up active residence in every believer. God’s power transforms us from those who were once walking in darkness into children of glorious light. This illuminating power enables us to lead lives of godliness and holiness— teaching, correcting, convicting, guiding, and comforting us. And it is that very same power that gives God’s people strength and peace in their dying hour. \nBut God’s power doesn’t stop working there. Today’s reading promises that His power is working even after death, resurrecting believers into life eternal. This is the great hope: when this life has been lived, we get to spend eternity in paradise! Paul urges his audience to build up fellow weary believers with the truth of this promise.\nIn today’s decidedly postmodern, secularist world, the idea of spending an eternity in paradise seems pretty far-fetched. We’re taught to trust what we can see and can be proven with tangible evidence. But as citizens of the kingdom of God, we’re instructed to trust One that we can’t see or touch. How do we do that? Well, it takes faith. But not blind faith—informed faith. We need faith that relies on what we already know to be true about God and His promises. Here’s a small pool of evidence:\nGod promises Abraham that He would make him a great nation… Check!\nGod promises to deliver the children of Israel from slavery in Egypt… Done!\nGod promises to send a Messiah… Yep!\nGod promises to send the Holy Spirit… Again, check!\nEven with just a few examples, it’s plain for us to see that God promises big, but He always delivers. Even if no one else in our world can keep a promise, God can. But listen, don’t keep this good word to yourself!  “Encourage one another with these words” (1 Thessalonians 4:18). Let another sister know that when we’re tossed around by the broken promises of others, or when it seems that we’re just spinning our wheels in this life of faith, we’ve got to remember this promise from God: This life is only the beginning.\nAnd you can take that to the bank.\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-8-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Thessalonians 5:12-28, 2 Chronicles 31:4-10, Ephesians 4:11-16",
        "devo_title": "Hold On to What Is Good",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: 1 Thessalonians 5:12-28, 2 Chronicles 31:4-10, Ephesians 4:11-16\nWhat is God’s will for my life?\nOh, the anxious hours I’ve spent with this question on repeat, searching for a spiritual formula to solve life’s riddles. My college years especially were a mishmash of trusting the Lord with newfound abandon yet agonizing over every decision. What am I supposed to study? Am I supposed to go on this mission trip or that one? Should I break up with this boy? Should we get back together?\nThe weight of my young world balanced precariously on so many question marks. Sometimes it still does.\nThe uncertainties I’ve faced in each phase of life have felt big and I’ve felt small, like life is the sum of a million puzzles, most of them missing a piece (or ten). But as the years pass and draw me closer to the Lord, a surprising truth has become clear: God’s will is not a problem to be solved.\nGod’s Word tells me His faithfulness does not depend on my wisdom (Lamentations 3:22-24).\nGod’s Word tells me His grace does not depend on my performance (Ephesians 2:8-9).\nGod’s Word tells me that no matter what shape my life takes, His steadfastness and goodness trump whatever is going on around me (Psalm 136).\nFriends, our circumstances are big, but our God is bigger. And as we learn to trust the bigness of our God and the sureness of His sovereignty, we find that His will is not just a path—it is also a way of walking.\nIn his letter to the church at Thessalonica, Paul reduces all our agonizing life questions to a non-formula so simple it makes the perfectionists among us a little crazy:\n“Rejoice always,\npray constantly,\ngive thanks in everything;\nfor this is God’s will for you in Christ Jesus.”\n-1 Thessalonians 5:16-18\nNo hoops to jump through. No tests to pass. No situational tidiness required. Only actively resting in our God.\nWhy an active resting? Because rejoicing is not a passive pursuit. Thanksgiving is not an emotion. We are to declare God’s goodness in every circumstance. We are to let the world know what He has done and what He is doing. We are to pray to Him, seek Him, give Him thanks with an expectant, joyful heart. This is God’s will for us in Jesus.\nThere are heartaches among us today. So many question marks, so much waiting, so many puzzles missing a piece. And with so much confusion surrounding us in this world, Paul tells us to “test all things” with the help of the Holy Spirit, and then to cling to what’s true and “hold on to what is good” (v. 21). And we know this: In everything, our God is good. \nGod’s love for you is steadfast, no matter the path you’re walking. His promises hold even when your world is crumbling. It is not up to you to be the god of your circumstances. It is for you to give thanks to the One who is greater than any circumstance you will ever face.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-9-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 1:1-12, Isaiah 66:15-16, Romans 8:30",
        "devo_title": "You Will Be Counted Worthy",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Thessalonians 1:1-12, Isaiah 66:15-16, Romans 8:30\nI am more of the abundant grace mindset, that all my sins, infractions, and struggles are covered by the spread of the gospel’s cloak. The idea that I must be made worthy of my calling as a child of God rubs raw against me. I don’t like it, if I’m honest. I know my soul, my sins, the weights that so easily entangle me and my proclivity for veering off the seemingly impossible bullseye of perfection. I will not be found worthy. I will be found wanting. \nIt seems I am always looking for loopholes in my Christian life. I am by nature lazy and despise boundaries and constraints unless they’re of my own making. I look for ways out and around and over or under, but rarely through because through is hard—and I don’t like hard. This is why I like the abundant grace theology: I can fail hard all my life, kick against the pleasant boundaries God has set for me, and I’m still in.\nThis is what Dietrich Bonhoeffer called cheap grace—dependance on a cosmic cloak with nothing of form beneath it: “Forgiveness without requiring repentance, baptism without church discipline. Communion without confession. Cheap grace is grace without discipleship, grace without the cross, grace without Jesus Christ.” When I make the gospel simply about grace and not about the specific work of the Father, the Son, and the Holy Spirit, I have cheapened the work. It becomes another form of godlessness. All about me, my performance, and an automatic pass regardless. \nPaul, in 2 Thessalonians, gives me the perfect “gospel catch-22.” I am caught up in a story written before the foundation of time that was written by God and not my own worthiness or sense of it. “To this end we always pray for you, that our God may make you worthy of his calling and may fulfill every resolve for good and every work of faith by his power” (1:11, emphasis mine). Whose calling? Not mine, His. Whose power? Not mine, His. So whose work is this staying worthy? His work by His hand. I cannot wriggle out of this work even if I tried. I am caught in an endless loop of His calling and His power. Caught. Stayed. All in. \nThere are ways we usurp the gospel’s full work in us, by neglecting to acknowledge the One whose work all this is. It is His power to will and work in us, and any power we might have is a mere shadow, a substanceless trick of the light. He compels and pursues us, He guards us and guides us, He protects us and provides for us, He completes the work of salvation by the power of the Spirit, through the work of the Son and under the care of the Father. This work is by and for and with and about Him—not us. Even my wriggling out of the careful and pleasant boundaries He has laid for me point to His calling and His power (Psalm 16:5-6). \nWhere are you omitting God from the gospel today? How are you making it simply about grace and your own work? Where are you forgetting the wonderful catch-22 loop you’re bound by and set free within? His calling, His work, and by His power. This grace is not cheap; you were bought with a price (1 Corinthians 6:19-20). But this grace is also entirely free—by the work and hand of God—for you.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-10-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 2:1-17, Daniel 11:36-37, Matthew 24:30-31",
        "devo_title": "Do Not Let Anyone Deceive You",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: 2 Thessalonians 2:1-17, Daniel 11:36-37, Matthew 24:30-31\nI’m not sure who began the rumor, but somebody did. Somebody in the church at Thessalonica whispered to somebody else that the Day of the Lord had come, and panic began to spread. \nPerhaps this person saw evil happening around him and drew his own conclusions. Perhaps someone misinterpreted Paul’s first letter that described Jesus’ Second Coming to be a warning that the Second Coming was upon her. We don’t know, but from the way Paul addressed the issue, we do know that this rumor caused anxiety. \nPaul pleaded with the church,  “We ask you, brothers, not to be easily upset in mind or troubled, either by a spirit or by a message or by a letter as if from us, alleging the Day of the Lord has come. Don’t let anyone deceive you in any way” (2 Thessalonians 2:1-3). \nPaul’s strategy to dispel this rumor was to fight it with the truth. Referencing a visit recorded in Acts 17:1-13, he asks: “Don’t you remember that when I was still with you I told you about this?” (2 Thessalonians 2:5). He then details the events they had gone over together in Scripture, the events that would precede the End Times, how Christ would prevail over the evil one, and how all of this would happen under the sovereignty of God’s timing. \nIn their state of confusion, Paul used the truth to reassure the church. The truth can do the same for us. What rumors do we fall prey to? What causes us to feel fear or to panic? \nIt is not only rumors about the End Times that can upset us. It can be rumors about other aspects of our faith. Rumors about people we know. Rumors about people we don’t know. Rumors are so dangerous because beyond misleading people with falsities, they cause unnecessary fear and anxiety. They cause us to trust the story rather than our God. Or, they cause us to judge others based on what we’ve heard about them, rather than what God says about them.\nThough rumors may be impossible to avoid, especially in our social-media-driven culture, they are not impossible to dispute. As Christ followers, we are also truth followers, and as truth followers we should also be truth seekers. The ones who—before buying into the rumor—ask ourselves, as Paul did with the Thessalonians: \nWhat is the truth here?\nWhat does Scripture really say about this?\nWhere is the Holy Spirit guiding me on this topic, or this story?\nIn this way, we will not be deceived. \nRumors cause shadows of confusion, but the truth exposes lies to the light. Rumors cause fear and panic, but the truth brings freedom and peace. Rather than adding to the rumor mill, may we be the ones who put a stop to it with truth—a truth that says God loves us and has given us eternal encouragement and good hope by grace. Now that is a story we can trust in.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-11-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 3:1-18,  2 Corinthians 11:7-9, 1 Peter 5:8-11",
        "devo_title": "May the Lord Direct Your Hearts",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 2 Thessalonians 3:1-18,  2 Corinthians 11:7-9, 1 Peter 5:8-11\nI try not to follow ambulances, rubber neck at traffic accidents, or stare when someone drops a whole bag of marbles on the ground. But when something goes terribly wrong, somehow we all want to turn our heads to watch. I think it comes from twin desires to help, but also to gawk.\nA few years ago, my then eight-year-old daughter and I walked into the food court of our local mall. There we found ourselves pushed to the front of a crowd that must have been nearing 100 people. They were encircling a lifeless boy on the floor, who looked to be no more than two years old. Together, we stood helpless, looking on while EMTs performed CPR on his little body.\nI don’t know a lot about medicine, but I do know you only implement CPR if there is no pulse or breathing. It’s our way of manually keeping a body going. Since that was already being done, there was really nothing left for the other 100 of us to do.\nAnd so we all stood still and watched. His mother didn’t cry; she paced, she moaned, she shouted. We felt powerless to help the child or his mother. It was shocking to see so many people standing there, hands at their sides, while the battle between life and death was fought right in front of us.\nIt’s awful to face our own powerlessness. I like to really lean my shoulder into a job and then promptly see a result for my effort. But when it comes down to it, when things are really important, I’m like that crowd of people, rendered helpless, left watching and waiting.\nIn 2 Thessalonians 3:5, Paul prays, “may the Lord direct your hearts to God’s love and Christ’s endurance.” The whole Christian walk is one of dependance. The air we breathe, the gravity that holds us to the earth, and the ability to wonder at it—it all comes from God’s common grace. We have no endurance apart from the endurance of Christ. \nMoments of calamity and tragedy unveil our deep neediness and utter helplessness. They direct us to our only strength and recourse, which is Christ. And it is only by His strength that we will not grow weary in in our faith and in doing good in the name of the gospel (2 Thessalonians 3:13).\nWhen we saw the baby and his mother in crisis, I took my little girl by the hand and led her around the corner where we found a quiet spot to pray. But even our prayers are a recognition of our enormous need. Prayer is not about what we do, but about running to the God who can do all things. It is an avenue for God to impart His love and endurance to us. \nWhat a tremendous grace this is, to know the God who loves perfectly and to be in relationship with the God who endures endlessly. In the face of our overwhelming sorrows, He directs our hearts back to Him. His is the real strength in our ever-present weakness. \nThe God of all grace, who called you to his eternal glory in Christ, will himself restore, establish, strengthen, and support you after you have suffered a little while. To him be dominion forever. Amen.\n—1 Peter 5:10-11\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-12-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "1 Peter 5:8-9",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBe sober-minded, be alert. Your adversary the devil is prowling around like a roaring lion, looking for anyone he can devour. Resist him, firm in the faith, knowing that the same kind of sufferings are being experienced by your fellow believers throughout the world.\n—1 Peter 5:8-9\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-12Thessalonians-Instagram-13-1.jpg"
    },
    {
        "book_title": "1 & 2 Thessalonians",
        "devo_passages": "2 Thessalonians 3:5",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for 2 Thessalonians. \nMay the Lord direct your hearts to God’s love and Christ’s endurance.\n—2 Thessalonians 3:5\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/4-Thessalonians-2-1.jpg"
    }
]