[
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 1:1-11, Psalm 119:1-7, Acts 16:1-5",
        "devo_title": "Timothy’s Ministry",
        "devo_summary": "\nBY Jessica Lamb\n\nScripture Reading: 1 Timothy 1:1-11, Psalm 119:1-7, Acts 16:1-5\nMy maiden name was regularly mistaken for a similarly spelled, but distinctly different, last name. People confused the two enough that my father, brother, and I often answered to the wrong name without much thought. My mother, though, never let the wrong name slide. She’d politely smile and correct every person, sometimes more than once, who added an unnecessary “r” to the pronunciation of our last name. Though it was only part of her name by marriage, she fiercely defended its integrity. \nWhat remains fascinating to me about this common mistake is how often people disagreed with her correction, telling her the way they misunderstood our name was, in fact, more accurate. It was as if their opinion of what our last name ought to be was more important than what our name truly is. Persistent as they were, they could not change the truth. \nThe fight for preserving what is true is at the heart of today’s reading, and of 1 Timothy as a whole. Paul wrote to Timothy, his coworker and protégé, to encourage him to guard the heritage of the Christian faith—a faith that was being challenged by false teaching and a skewed understanding of what it meant to be a follower of Jesus. \nIn Acts 16, we catch a glimpse of how Paul’s mentorship of Timothy began. Timothy left his family to travel with Paul on his second missionary journey, sharing the gospel and establishing the early Church. He became one of Paul’s most trusted disciples and coworkers, ministering alongside Paul as he wrote much of the New Testament. Paul wrote this first letter to Timothy while the young protégé was serving as pastor to the church in Ephesus. \nWe see the depth of their relationship in how Paul addresses Timothy. More than just a coworker, Timothy is Paul’s “true son in the faith” (1:2).  That affectionate reference is, in part, a reminder to Timothy that he, and all believers, are part of a spiritual heritage. When we come to faith in Jesus, we become part of the family of God (1 John 3:1-2). In this family, part of our ministry is to guard the lineage of our faith by remembering what it means to be a believer and then passing those truths down to future generations. \nThe believers Timothy pastored were distracted by empty speculations and false doctrine. We have to guard against the same—whether in our own hearts, in our own conversations, or in how we teach others about our faith through our words and actions. \nGod Himself is the best authority on our faith. His Word isn’t a list of meaningless rules; it is light in the darkness, a lamp that shows us where to place our feet as we live lives faithful and true to the heritage of the gospel. When we keep our focus on growing in affection for God and His Word, we stay true to our pursuit of love that comes from a pure heart, a good conscience, and a sincere faith. \n\nJessica Scoggins (not Scroggins) Lamb consumes books, tea, and street-style tacos with equal ferocity. When she’s not working as the managing editor for She Reads Truth, she can be found singing Broadway tunes off-key or traveling. She lives with her husband, daughter, beloved mutt, and tolerated chickens in Nashville, TN.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day1-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 1:12-20, Acts 8:1-3, Acts 9:1-22",
        "devo_title": "Paul’s Testimony",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Timothy 1:12-20, Acts 8:1-3, Acts 9:1-22\nI never wanted to join the circus. And yet, here I am, breathlessly perched on the tightrope of terrified obedience. It’s that narrow road we’re called to walk as followers of Christ. The stakes get higher when our faith in Christ compels us to go and to do, to serve and to minister, knowing we don’t have what it takes to do so on our own. \nAs we read Paul’s words in 1 Timothy, we can squint our eyes and see him walking on the tightrope ahead of us. As he describes his qualifications for ministry, it’s clear Paul knows how unqualified he truly is. \nIt was Paul, after all, who approved the persecution of Stephen. That event was the spark that ignited a raging fire of persecution among God’s people. While the Church wept and wailed, “Saul… was ravaging the church. He would enter house after house, drag off men and women, and put them in prison” (Acts 8:3). \nPut that on your Bible college application.  \nBased on Saul’s resume, there’s not a single one of us who would pick him to teach the gospel, encourage the saints, plant churches, spearhead missionary journeys, and appoint church leaders. And yet, God Himself described Saul (a.k.a. Paul) as His “chosen instrument” (Acts 9:15). \nThis is the seemingly upside down way of our sovereign God. He never calls us into kingdom work because we are the most fit, the most prepared, the most gifted, or the most popular. He doesn’t ask us to do things that we could easily do in our own strength and power. \nInstead, He invites us out onto that tightrope where we know we aren’t qualified, where we must trust His Spirit for every step. A life of ministry and obedience can feel scary because we know we cannot grit our teeth and do what is required on our own. We aren’t capable of reaching a lost and dying world or serving selflessly in our own strength. We can’t generate enough elbow grease to produce faithfulness on our own. Our resumés are just good kindling in God’s economy. \nThat reality can paralyze us. And yet, when human eyes only saw Saul’s failures, God looked at him and saw future faithfulness:\n“I give thanks to Christ Jesus our Lord who has strengthened me, because he considered me faithful, appointing me to the ministry” (1 Timothy 1:12). \nWhile we tend to evaluate our qualifications based on what we see in the rearview mirror, only God is able to see our forward faithfulness. In His sovereignty, He knew that Saul was too weak and sinful to surrender and serve, but He also saw the coming tsunami of grace that would sweep Saul away from his rebellion. \nThe next time you look at the ways God calls you to live, love, and serve, thinking “I can’t do this,” know that you’re right. We can’t walk the narrow road on our own. May the gospel steady our feet as with eyes on Jesus we dare to take the next step toward future faithfulness.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day2-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 2:1-15, Deuteronomy 6:4, John 10:14-18, 2 Peter 3:14-16",
        "devo_title": "Instructions on Prayer",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Timothy 2:1-15, Deuteronomy 6:4, John 10:14-18, 2 Peter 3:14-16\nJust as we’ve all been doing for the past few millennia, I skipped ahead this morning. I glanced at 1 Timothy 2 and read the last few verses and my stomach sunk. This chapter has been hotly debated by theologians far more versed than I in the original languages, in historical context, and in all kinds of study. How can I possibly add to the conversation? \nTo write about 1 Timothy 2 for a community of women who will all have some sort of pain or story or lens through which they read this chapter feels too daunting for me. But then my eyes catch the last words of it: “continue in faith, love, and holiness, with good sense” (v. 15). What does it mean, first, for me to honor and obey these words before I think of communicating them to others? Chiefly it means to exercise self-control and read from the beginning. My eyes moved back up the page to these words: \n“First of all, then, I urge that petitions, prayers, intercessions, and thanksgivings be made for everyone, for kings and all those who are in authority, so that we may lead a tranquil and quiet life in all godliness and dignity. This is good, and it pleases God our Savior, who wants everyone to be saved and to come to the knowledge of the truth” (vv. 1-4).\n“First of all, then… ” \nThere is an order to these words. Paul wants to communicate something to Timothy: that all people in all places need “petitions, prayers, intercessions, and thanksgivings” made on their behalf, and in doing so it leads to a “tranquil and quiet life in all godliness and dignity” (v. 1). It gives dignity to all people everywhere when we pray for them, thank God for them, and intercede on their behalf. \nIt seems to me the enemy’s best ploy is to steal our dignity, our quietness, and our peace by disordering our reading. Enticing us to lack self-control and skip passages, cherry-picking the most difficult or most beautiful to meet whatever need we have in ourselves or see in culture. But to live quietly, peacefully, and with dignity, we must read in order and, in some ways, do in order. \nBefore we argue about hotly debated subjects, do we first dignify one another by praying, interceding, and giving thanks for each other? Are we first people of peace by offering supplication (the action of asking or begging for something earnestly or humbly) on behalf of their personhood, character, story, theology, and personality? Are we primarily people of quietness, trusting that it is God who changes hearts and minds and stories—not us? \nThere is so much division in our world today. One needs only a cursory glance at the news to know brokenness abounds. But it’s not just in culture; it’s in the Church, too—this passage is a prime example of passages that divide instead of unite. How, then, can we be people who first pray before debate, who first intercede before we interject, and who first give thanks before we theologize? \nThis morning, as I write, I want to stay in the first few verses of 1 Timothy chapter 2 before I move further down in the passage. I want to learn to pray with this kind of open-handedness to the God of the universe on behalf of all people everywhere. \n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day3.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 3:1-16, Romans 9:15-24",
        "devo_title": "The Mystery of Godliness",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: 1 Timothy 3:1-16, Romans 9:15-24\nThe hymn “In Christ Alone” has been my church’s unofficial anthem for several years now. I say “anthem” because whenever the worship leader begins to play the familiar chords, the energy in the room changes. Everyone’s attention seems to become more focused, both forward and upward. People stand without prompting, and by the end of the song, we’re all sort of yell-singing our favorite line: “Up from the grave He rose again!” We are declaring in this anthem what we believe. We’re reminding each other of what’s true, and the power of this is tangible in the room.\nPerhaps this is why Paul slipped a hymn into his instructions for Timothy. “The mystery of godliness is great,” he says in 1 Timothy 3:16. He then explains what that mystery is by using lines from what some scholars believe was a popular hymn of his time.\n“He was manifested in the flesh, vindicated in the Spirit, seen by angels, preached among the nations, believed on in the world, taken up in glory” (v. 16).\nThey are the basic tenets of Christianity—truths Timothy knew well. Paul understood our human tendency to forget the truth and simply begin to follow a religion or set of rules for the sake of following something. Using the power of an anthem—his “In Christ Alone,” shall we say—Paul reminds Timothy of the gospel before diving into further spiritual instruction. We need the same thing. \nThere’s a method to our godliness, and it’s crucial to understand the reason behind what we do and Who we live for if we’re going to stand strong in our faith.\nIn almost the same breath that he declares the mystery of godliness, Paul also delivers a warning to Timothy, saying that in later times there will be false teachers, deceitful spirits, and many who depart from the faith (1 Timothy 4:1-2).\nPaul was right. Heresy, deceit, and hypocrisy are not only things of the future; they are rampant in our world now. Knowing, understanding, and believing the mystery of godliness—the gospel of Jesus Christ—is more crucial than ever. Without God’s truth as our anchor, we will float from here to there with each person who enters our lives touting a new philosophy or theology (James 1:6). But with our anthem close to our hearts, we remember who Jesus is and we can distinguish His truth from the lies.\nJust as Paul did in his letter to Timothy, we must remember and remind one another of what is true. We declare our anthem to one another again and again, “giving thanks always for everything to God the Father in the name of our Lord Jesus Christ” (Ephesians 5:19-20).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day4-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 4:1-16, Ecclesiastes 9:7-9, Colossians 2:16-23",
        "devo_title": "Instructions for Ministry",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Timothy 4:1-16, Ecclesiastes 9:7-9, Colossians 2:16-23\nFlossing is the elephant in the room when it comes to dental hygiene. It’s right there, we all know we should be attending to it, but few of us are hitting the bullseye.\nWhen I first draw out the fresh clean length of floss, all’s fair. As the glistening rope is shimmied between rows of teeth, its usefulness preserves its privilege to be allowed access to my mouth. But the second the act of flossing is over, the string of floss immediately shifts from valued instrument to absolute and unequivocal garbage. Once I’ve finished flossing and set the floss down for even a second, there is no circumstance that could persuade me to take that floss up again and begin the process afresh. Something in my brain tells me that once the floss has left my hands, it’s no longer something useful—now it’s appalling and gross.\nArbitrary rules like this usually stem from an important kernel of truth, ranging from harmless to helpful, and even downright quirky. Some people won’t let one food touch another. Others mandate that the proper orientation of toilet paper is out instead of in. But we stray into dangerous territory when we position our cute, quirky opinions as moral law. Paul is writing to Timothy about this precise problem.\nFolks at the church in Ephesus had gotten carried away with their opinions, and instead of sticking to the simple truth of Scripture, they added their own rules and declared these as essentials of the Christian faith. Rather than commending them for adding more strictness to the law, Paul condemns these extra rules, reminding them that creation is good. These additions are actually a departure from the faith. Legalism is a natural bent of the human heart. We adore making up our own rules and setting up our opinions as law. Our inclination toward rulemaking is as strong in matters of faith as it is in dental hygiene. But we are not called to simply follow rules; we are called to pursue the living Christ.\nPaul encourages us to train ourselves in godliness. God gave us the law to train our sinful hearts. In Paul’s letter to the Galatians, he calls the law our tutor: “Therefore the law was our tutor to bring us to Christ, that we might be justified by faith” (Galatians 3:24). We need training wheels to point our hearts in the right direction. We need guidance to orient our lives in the ways of grace. God laid out tracks for us to follow, and as we learn to wobble in His ways, we start to think like Him—start to act more like Him. We find we are no longer focused on the rules, but running after the Father with all our might.\nThe leaders of Ephesus were getting it all backwards; they were focused on things with limited benefit. But Christ invites us to Himself, for He is beneficial in every way (1 Timothy 4:8). They couldn’t see the forest for trees—or anything important because they were fighting over whether or not they should eat ham. We can’t lead others to Christ when we aren’t seeking Him ourselves. \n Look to Christ. Run to Him. “For this reason we labor and strive, because we have put our hope in the living God” (v. 10).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day5-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "2 Peter 3:14-15",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nTherefore, dear friends, while you wait for these things, make every effort to be found without spot or blemish in his sight, at peace. Also, regard the patience of our Lord as salvation, just as our dear brother Paul has written to you according to the wisdom given to him.\n—2 Peter 3:14-15\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day6-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 1:15",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for 1 Timothy.\nThis saying is trustworthy and deserving of full acceptance: “Christ Jesus came into the world to save sinners”—and I am the worst of them.\n—1 Timothy 1:15\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/4-TimothyTitus-1-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 5:1-6:2a, Matthew 18:15-20, 1 Corinthians 7:39-40",
        "devo_title": "Support and Honor",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: 1 Timothy 5:1-6:2a, Matthew 18:15-20, 1 Corinthians 7:39-40\nIt was my first time driving in a funeral processional. I’d always been a passenger, not the driver. But on this day I was in the car alone, hazard lights flashing, trusting the cars in front of me to lead me safely to the funeral home. A couple dozen cars drove along, speeding up and slowing down in unnatural rhythm, trying our best to keep too much space from forming between each car in the line. A police officer in a black sedan with flashing lights would block an intersection until some of us passed, and then he’d speed up, siren blazing, to beat the lead car to the next intersection.\nThe last stretch of the drive took us down a busy four-lane highway where we came to a stop, assumedly due to afternoon Nashville traffic. But the cause of the delay soon showed itself: two long lines of cars had parted, moving to either side of the road and stopping in silent, reverent lines, waiting for us to pass. I felt like an Israelite driving through the Red Sea on dry ground, passageway granted by a supernatural turn of events. Maybe that sounds melodramatic, but in a world where we daily insist on our own truth and our own way, the gesture struck me as an unlikely bastion of decency in an individualistic society. The last shall be first. Those who mourn shall be comforted. It was the gospel in everyday clothes.\nIn our reading today, Timothy, a young pastor of a young church, was learning to lead his congregation in caring for one another. Paul, an older, more experienced brother in the faith, was writing to bolster Timothy’s faith and offer some practical advice. The headline of this particular part of his letter? Support and honor. \nThese are actions most of us agree to in theory. Support those in need; honor one another as fellow image-bearers of God. Those who do not know Jesus recognize these concepts too, even if they call them by a different name. It’s the reason the line of cars didn’t plow over the police officer that day and insist on their right to the road: we recognize there is a “right” thing to do. The problem comes in moving from theory to practice; we might agree that supporting those in need is good and important, but exactly who is “in need” and how to support them—there’s the rub. \nThe first two verses of today’s reading set the crucial premise for the detailed, context-specific instructions Paul gave Timothy on the subject: “Don’t rebuke an older man, but exhort him as a father, younger men as brothers, older women as mothers, and the younger women as sisters with all purity” (1 Timothy 5:1-2). Fathers, brothers, mothers, sisters. In other words, regard your fellow church members as family and act toward them accordingly. \nThe Church—the family of God—is to care for one another in love and sincerity. We are to move past good intentions and into action, even though it means risking tension, disagreement, and misunderstanding. If we are indeed family, then we can work it out together, forgiving our imperfections and ignorance along the way, gently helping one another grow in the ways of truth and love as imitators of Christ. And if we are followers of Christ and co-laborers in His gospel, then His reputation, not ours, is what is ultimately at stake. \nAs a family who knows the life-changing, life-giving grace of Jesus, may the countercultural support and honor we show one another cause the world to stop and wonder: Who taught them to love like this?   \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day8-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "1 Timothy 6:2-21, Psalm 90:1-17, Matthew 27:11-14",
        "devo_title": "Guard the Heritage",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Timothy 6:2-21, Psalm 90:1-17, Matthew 27:11-14\nI have the gift of always ordering the right thing off the menu. Most of the time, I just look at my husband and ask, “Do you just want me to order for us?” (In truth, it’s more of a statement, than a question.) And 99% of the time, I end up with the best dish. \nBut that other 1% of the time, I end up disappointed and usually blame what I consider to be an erroneous menu description, perhaps one that highlighted the wrong ingredient. Or maybe I’d assumed that something would be roasted and instead is raw—that sort of thing. \nWhen reality doesn’t measure up to our expectations (whether it’s a movie we’ve been wanting to see, a meal at a fancy restaurant, or a blossoming relationship), it can be devastating. Paul is warning the church at Ephesus about this very thing: false teaching leads to bad fruit. And he is calling on Timothy to guard the truth, the legacy of the faith.\nPaul chides those who claim to speak the gospel but believe that “godliness is a way to material gain” (1 Timothy 6:5). He lists signposts of their wayward focus: envy, quarreling, slander, evil suspicions, constant disagreement. He warns Timothy, but then he takes it a step further.\nPaul’s warning is not passive. This passage is full of strong action words that charge Timothy and his congregation with the weighty responsibility of representing the faith. John MacArthur wrote that this passage outlines what a man of God should be known for—“by what he flees from, follows after, fights for, and is faithful to.” \nAnd what is the north star for this calling, for our calling as Christians? What is the standard to which we should evaluate the things, people, and ideas we flee from, follow, fight for, and are faithful to? What tells us what we should guard? Scripture, that’s what. \nWhen Paul uses the word “guard” in verse 20, he uses the Greek word phylassō, which appears approximately 30 times throughout the Bible. Jesus used it when He said, “Blessed rather are those who hear the word of God and obey it” (Luke 11:28).\nWe represent the Word of God. We image God Himself. We are mirrors, reflecting the beauty of Christ out into the world. And Paul dares us to do so with integrity to the faith as written in the Holy Word.  \nIn a sermon on this passage, Ligon Duncan said: \n\n“Paul calls on Timothy and his congregation, and us, to retain the truth, to hold fast to it; to refrain from dabbling in worldly speculation and false teaching; to realize that false teaching will lead sheep over the edge into destruction; and to be utterly dependent, as we hold fast to that truth, on the only thing that can hold us up, which is the grace of God.”\n\nThanks be to God that we have such a steadfast anchor in the person of Christ and in the Word. And in a world marked by postmodernism, swaying between “your truth” and “my truth” and, so often, no truth at all, I pray that we will lean on the Father’s grace as we guard the heritage of our faith.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day9-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 1:1-18, 2 Corinthians 3:4-6, 1 Thessalonians 5:16-22",
        "devo_title": "Not Ashamed of the Gospel",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Timothy 1:1-18, 2 Corinthians 3:4-6, 1 Thessalonians 5:16-22\nThe exact details of the story have faded in my memory. I’m not sure where I heard it or the name of the man at the center of the narrative. I don’t need to know his name to want to be just like him. \nHis story goes something like this… \nChristians were gathered in a home church in a country where worshiping Jesus was strictly forbidden. Authorities raided the home, forcing the terrified worshipers to lie on the floor, then brutally beat anyone who dared to resist. Despite this violence, they could not stop the man; he was determined to rise. \nOver and over, he simply stood up silently, squared his shoulders, and looked his attackers in the eye. He was beaten back down each time only to rise to his feet again. He did not fight. He did not argue. He simply stood, no matter how bloody and bruised he became. Eventually, his attackers relented. Like Paul’s words to Timothy—penned despite imprisonments, beatings, abandonments, and trials—this man’s faith could not be shaken. He would not be kept down. \nI may never face the butt of a gun as a result of my faith in Jesus. I may never know Paul’s fate of repeated imprisonment for declaring the gospel. The stakes may not look as dramatic, but we all know how it feels to be beaten down in some way or another. We feel the pressure to play it safe and be quiet about Jesus. But we cannot. Over and over and over, we must continue to rise. We must.\nPaul’s powerful words echo throughout time, to the Church in every era. Whatever obstacles we face in culture or in the parthenon of public opinion, whatever makes our knees buckle, whatever threatens to silence us, or makes us want to simply lay low—when we weigh them against the heavy weight of the gospel, the scales are easily tipped. \nWe must speak out.\nWe must live boldly.\nWe must rise.\nFear cannot become our default. Let us remind each other often that we are a people uniquely armed with power and love and self-control (2 Timothy 1:7). Through the silent testimony of our sold-out lives and words seasoned with grace, we must declare, “But I am not ashamed, for I know whom I have believed, and I am convinced that he is able to guard until that Day what has been entrusted to me” (v. 12). \nWhat inspired Paul to declare the gospel so boldly? He refused to forget the stench of the prison of sin he had been delivered from. Every other cell smelled like freedom. He remembered how it felt to be buried by the weight of his own sin, but through Jesus, he had been invited to rise and walk a new life. \nPaul’s declaration to Timothy, and our declaration to each other is this: I am not ashamed of the gospel, because the gospel is not ashamed of me. Church, we do not deserve such extravagant grace. We are a ragamuffin bunch called to reach the world with radical truth. \nThere will always be opposition. Even so, let us rise. \n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day10-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 2:1-13, Romans 6:5-10, 1 Corinthians 15:3-8",
        "devo_title": "Be Strong in Grace",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Timothy 2:1-13, Romans 6:5-10, 1 Corinthians 15:3-8\nTwo weeks into my first year teaching history at a private school in Nashville, the Latin teacher stopped at my door. He was tall and round about the middle, with short hair, deep eyes and a soft-spoken voice that carried kindness on every syllable. His oldest daughter was in my class, and when he asked if I wanted to share lunch at the picnic tables, I hesitated. Life had taught me to suspect older men, to assume their intentions were nefarious. But Ben Ellis just wanted to share turkey sandwiches and talk about history. Trying my hand at trust, I said yes.\nOver the next year, Ben made a habit of stopping at my door, checking in, dropping off history resources and pep talks in equal measure. His wife and five children became regulars at our dinner table; my husband and I at theirs. Ben was one of the first people to encourage me in my writing, buying a copy of the crappy short story I wrote about birds and pretending not to notice the typos. \nAnd then everything changed. Esophageal cancer invaded his body. Soon, he was no longer round about the middle. Soon, he was no longer teaching. \nDuring his months of treatment—even up until the last days on earth—Ben enjoyed singing hymns, in particular a call-and-response song that goes like this: \n\n I am bound, (I am bound)\nI am bound, (I am bound)\nI am bound for the Promised Land.\n\nIt was true of him, and it is no less true of me. We are bound for another place. But it’s important to remember that the word “bound” has many different meanings.\nOf course, “bound” can mean you are headed somewhere, and we are headed for eternity with God. Jesus promises that He is preparing a place for us, so that we can be with Him forever in that place. We can be confident in that promise because Jesus’ resurrection was not a fairy-tale. It was a historical event verified by more than 500 witnesses (1 Corinthians 15:6). Because Jesus destroyed death, death no longer determines our final destination.\nBound can also mean shackled, as in, bound in chains. On earth, we are certainly entangled with suffering. Paul tells Timothy not to shy away from that truth. He reminds Timothy that our temporary struggle is like that of a soldier, an athlete, or a farmer—people who sacrifice willingly, trusting that their efforts will reap a later reward. But as Christians, our reward is not a prize or a harvest. Our reward is not a change in our circumstances, or the healing of our cancers. Our reward is the person of Jesus Christ. We are bound, yes, but we are bound for something. We are bound for Him. \nPaul was bound for the Promised Land too. He was literally shackled—his only connection to the outside world, his pen. And he proclaimed the gospel loudly, disregarding that his message almost certainly would lead to his execution.\nBut in all the ways we are bound, God is not bound. While we are moving toward heaven, He is unhindered by time and space. While we are limited by our lack of resources, depleted energy, and grief at the suffering all around us, He does not grow weary. His Word is at work in the world—everywhere, always. And that is great news.\nAs I consider the limitations on my life, the suffering I wish was over, I cling to God’s promise. Though I am weak, He is strong. Though I am bound, He is already here.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day11-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 2:14-26, Galatians 5:22-25, 1 Peter 3:14-16",
        "devo_title": "An Approved Worker",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Timothy 2:14-26, Galatians 5:22-25, 1 Peter 3:14-16\nWords have the power to heal or destroy. “Sharper than a knife,” we say. When a simple turn of phrase has cut you, you know what I’m talking about.\nI’m not prone to physical violence. If anything, I avoid it at all costs. But if I’m truthful, which is the whole point here, I can’t begin to count the times I’ve wounded another with careless syllables, intentionally and unintentionally. I imagine I’m not alone in this.\nWhen Paul urges Timothy in his second letter to warn believers to “avoid irreverent and empty speech” (2 Timothy 2:16) he is talking about more than petty gossip. This letter, written shortly before Paul’s death, focuses on the importance of teaching God’s inspired Word correctly. If all words hold incredible life-giving and death-bringing power, imagine how the divine Word of God can alter a life. Sadly, Christians have been known to twist and abuse the Word of God far too often. This was a problem Paul addressed around AD 67, and it’s a problem that still plagues our communities today.\nI’m sure we can all call to mind a person in our day and age we might consider a heretic or false teacher. While it’s natural to want to defend the faith, and guard the hearts and minds of others, Paul’s teaching directs us to check our own mouths first. \nPaul cautions Christians not to fight about words or get caught up in quarrels over small matters of interpretation. Now, I’ve known many people who enjoy arguing about theology. While there can be productive debate among believers and instances when we must call out false teachings, often these squabbles turn into a hypocritical and discouraging witness. \nThe trouble comes when we start preaching about things we don’t understand, or building walls around beliefs that Christ never promoted. Traveling down that road, we can become a hindrance to the faith of others. As Paul put it, you can actually lead to the “ruin of those who listen” (v. 14). Yikes! Now that is something I definitely don’t want to be guilty of! \nAs women in the Word, God will hold us accountable for our stewardship of this precious gift of faith. It’s a great responsibility to wield the most potent Word in all of humankind; as the Gospel of Luke says, “From everyone who has been given much, much will be required” (12:48). \nWhen we stand before our Lord, we will want to stand “as one approved, a worker who doesn’t need to be ashamed, correctly teaching the word of truth” (2 Timothy 2:15). In order to do that, we must be careful how we speak about holy things. We need not be afraid to share our faith, but we should do so “with gentleness and respect, keeping a clear conscience” (1 Peter 3:16).\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day12-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "Galatians 5:22-23",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBut the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. The law is not against such things.\n—Galatians 5:22-23\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day13-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 3:16-17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for 2 Timothy. \nAll Scripture is inspired by God and is profitable for teaching, for rebuking, for correcting, for training in righteousness, so that the man of God may be complete, equipped for every good work.\n—2 Timothy 3:16-17\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/4-TimothyTitus-2-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 3:1-17, Exodus 7:8-13, John 15:18-21",
        "devo_title": "Struggles in the Christian Life",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Timothy 3:1-17, Exodus 7:8-13, John 15:18-21\nTrials are the anvil on which our faith is formed, and yet it is within those trials that we need more faith. Often times, the thing we need most desperately in the midst of trial is the thing still yet unformed in some ways. How, then, is the Christian to prepare for difficulties? How do we prepare for the moments when “evil people and imposters go from bad to worse, deceiving and being deceived” (2 Timothy 3:13)? I know in those moments I’m most desperate for the lifeboat of a proven faith and not a thing that feels feeble, unfinished, or in process. I want bedrock and my faith feels like it rests on sinking sand. \nPaul tells Timothy that the answer for how to “continue in what you have learned and firmly believed”—even though it is still being formed—is in “knowing from whom you learned it and how from childhood you have known the sacred Scriptures, which are able to give you wisdom for salvation through faith in Christ Jesus” (vv. 14-15).\nThe answer to a robust faith in the midst of trials is meditation upon Scripture, shoring up our belief, our faith, and our certainty that God is both good Himself and doing good in all our situations. These words of life are able to make us “wise for salvation, through faith in Christ Jesus” (v. 15). This is an astounding promise and a perfect guarantee. Scripture never returns to us void. It always produces the fruit of righteousness: wisdom through faith in Jesus. Not wisdom in our own ability to get through trials or wisdom in proven methods of success. Wisdom through faith in Jesus. \nWhen we believe Jesus is who He says He is and will do what He says He will do, our faith is bolstered and we are reminded of the hope within us. Apart from Christ Jesus, we can continue in nothing. Apart from faith centered in Him, we can continue in nothing. Apart from wisdom through faith in Him, we can continue in nothing. Apart from Scriptures from which wisdom is gained through faith in Him, we can continue in nothing. And so, in a beautiful full circle, apart from God giving us Scriptures from which wisdom is gained through faith in Him, we can continue in nothing. Everything begins and ends with Jesus, sweet Jesus. \nHow do we continue in what we have learned and firmly believe? Jesus. Jesus. Jesus. Every day in every way. If trials are the anvil on which our faith is formed, Christ is the hammer and the fire and the blacksmith, and the finished thing is more perfect and beautiful for it all.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day15-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "2 Timothy 4:1-22, Deuteronomy 31:6-8, 1 Corinthians 9:24-27",
        "devo_title": "Keep the Faith",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Timothy 4:1-22, Deuteronomy 31:6-8, 1 Corinthians 9:24-27\nI’ve run exactly one marathon—actually, a half marathon. It was the winter of 2012, a mild winter, and most mornings, I could survive my five-mile training run with no more than leggings, a long-sleeved shirt, and a hat to keep the wind off my ears. The online guide I’d printed out for first-timers alternated short runs with longer ones, and as I checked the calendar, I realized I was about to hit a new milestone: six miles. I’d never run that far in my life. Every time I passed the five-mile marker, I started walking. That was enough right? Why go further?\nMy mind told my limbs that it was too hard, too boring. And so I stopped. Nashville has a renowned running club, which offered half-marathon training, and I knew if I had any chance at hitting my goal, I needed help.\nThe following Sunday morning, I showed up to the running club, amazed that there were so many, like me, who needed the help of others. A short Indian man led my pace pack, and when I fell out (at mile five, again) he fell back with me, using his watch to push me to run for a minute, walk for a minute, until my body overpowered my mind. Within a few weeks, I was running seven miles, then ten. And though I was slow, I persisted. \nRunning is such an easy metaphor because it is so applicable to our life as Christians. Living a life of self-control and faith can leave us asking, “Why?” What’s the point of waiting until marriage, when there’s so much romance and sex to be had now? What’s the point of trusting in God, when things aren’t going the way you’d planned anyway? What’s the point of staying married, when the days blend together, one never-ending drone of laundry to wash, messes to clean, and cooking to complete? The mundane rhythms of a faithful life are like the pain of a solitary run—one foot after another, breathing, willing yourself not to stop, or to be diverted to another path. It’s not easy, and most of the time, it’s not fun. But it is worth it. \nPaul tells Timothy not to grow discouraged in his particular race. Persist, he says, whether it is convenient or not. In fact, I’d venture to say that persistence is most evident when it’s not convenient. When life gets boring and painful, like a long and solitary run, we are so quick to turn for relief, for permission to stop, for a detour. We itch to hear some new truth that indulges our desire for comfort. But our comfort isn’t in the race ending; our comfort comes in the form of great partners, running at our side. \nFor a while, Timothy had Paul by his side, like my friend in the running club, offering advice, encouraging him onward. But Paul knew his race was nearly finished. As death lingers in the near future, Paul tells Timothy that he will have to go on alone. But even alone, we are not alone. Paul tells him, “Everyone deserted me, but the Lord stood with me” (2 Timothy 4:16).\nI do not know what particular race this day holds for you. This month. This year. Perhaps you are staring at the uphill climb of divorce, a valley of infertility, or the flat plains of our mundane world. Run, my friend. Run slow, if you have to. Enjoy your Christian running mates, if and when they are there. And when they are gone, run, knowing that Jesus is by your side.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day16-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "Titus 1:1-16, Ephesians 4:11-13, Hebrews 6:13-20",
        "devo_title": "Titus’s Ministry",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Titus 1:1-16, Ephesians 4:11-13, Hebrews 6:13-20 \nHave you ever worked under poor leadership? Sadly, most of us have had a run-in with a bad boss or two. If you have ever worked for someone you couldn’t trust, respect, or follow, you know how frustrating and even hurtful those experiences can be. \nThankfully, I have had the experience of working under good leadership more often than not. When you operate under people you trust, respect, and want to follow, it positively impacts your entire life—not just at work, but at home too. It’s easy to spot models of healthy and unhealthy leadership in the workplace, and of course the same can be said for our churches.    \nThe Apostle Paul took Christian leadership seriously because he understood the impact of an authoritative voice. In his letter to Titus, Paul begins with a declaration of his identity, calling himself “a servant of God and an apostle of Jesus Christ” (Titus 1:1). He also lays out his mission statement: to build up the church in the truth so their lives would change and they would receive God’s promised eternal life (vv. 1-3). With Paul as a model of faithful leadership in the early Church, we see that a godly leader finds their identity and purpose in the Lord. \nWhile Paul starts the letter with the state of his own heart, he continues by addressing the requirements for elders, saying in short: it matters how you live your life. He warns against corrupt leaders who are “full of empty talk and deception” because he knows the damage those people wreak (v. 10). Instead, Paul calls for an elder to be “not arrogant, not hot-tempered, not an excessive drinker, not a bully, not greedy for money, but hospitable, loving what is good, sensible, righteous, holy, self-controlled, holding to the faithful message as taught” (vv. 7-8). To use a well-worn but apt cliche, a godly leader is not just someone who can “talk the talk,” but a person who “walks the walk.” Better still, a godly leader is one who walks toward Jesus.\nWhose lead are we following today? And where are we leading those who follow us? This is not a call to ignore our bosses or disregard those in leadership over us, but rather to be conscious of who is shaping us on a soul level. Are we following those whose identity and purpose are found in the Lord, who live godly lives? \nPaul’s letter to Titus gives a good template for what godly leadership looks like, but ultimately, our only perfect leader is Jesus—Jesus, who came in the fullness of God, yet took on the form of a baby and served the broken people of this world to the point of death on a cross. Jesus is the only leader who understands our every feeling and can wipe away our every sin. He is a better guide than any worldly influencer and the only one worthy of surrendering your life to. If you’re looking for a leader who will never fail you, look no further than the feet of Jesus.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day17-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "Titus 2:1-15, Malachi 3:17-18, 1 John 3:2-3",
        "devo_title": "Sound Teaching",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Titus 2:1-15, Malachi 3:17-18, 1 John 3:2-3\nWhen my husband and I went to graduate school, we found a darling old home to rent on a popular street in St. Louis. It had antique door knobs, stained glass windows, and an old-fashioned brass post box that the mailman would slip our mail through each day. I swooned when we moved in, enchanted by all the architectural elements and the original hardwoods and the stunning, old stone fireplace. \nI loved that house, until I didn’t. Until we found a mouse, until the emerald green tile in the shower collapsed on my visiting brother-in-law, until our gas bill was more than $400 in the wintertime, the foundation literally started crumbling into the basement, and the water that ran from the taps turned brown inexplicably and then stayed that way. The house was beautiful and charming, but it wasn’t sound. \nWhen Paul writes to Titus, the church in Crete was experiencing a similar sort of story. Many people were teaching a Christianity that looked appealing, but was antithetical to the gospel. Titus 1 explains this in detail as Paul tells Titus that the false teachers are “ruining entire households” (v. 11). Theirs was an unsound gospel, and Paul knew the church in Crete was not safe on such a weak foundation.\nIn Titus 2, Paul exhorts each member of the household to carry their own weight toward sound teaching. Everyone had a task: older men and older women, young women and young men, slaves and their masters. From “teach what is good” to “be sound beyond reproach,” Paul’s instructions were serious, so that “God’s word would not be slandered” (vv. 1–9). \nPaul probably could have stopped there. He was respected by Titus, who would take his words to heart. Paul could trust Titus to put the gospel first. But Paul continues on. In Titus 2:11–14, he recounts the glorious gift of the gospel. Paul’s ballast is Scripture; he is stabilized by grace. Paul is hardly one to say “just do this,” but instead illustrates why someone ought to. He writes:\n“For the grace of God has appeared, bringing salvation for all people, instructing us to deny godlessness and worldly lusts and to live in a sensible, righteous, and godly way in the present age, while we wait for the blessed hope, the appearing of the glory of our great God and Savior, Jesus Christ” (vv. 11–13).\nI can’t help but think of my toddler, who adores Laura Numeroff’s picture book, If You Give A Mouse a Cookie. The rest of that sentence is, “he’ll ask for a glass of milk.” The theme goes on and on, a series of if-thens that build throughout the book. \nPaul’s closing statements in chapter 2 are a cosmically important “if-then,” telling Christians how to act: If Jesus really brought salvation, then you have to deny worldly lusts and live in a godly way. \nThe false teachers in Crete were not living out a gospel that matched the work of Christ. Sound theology mattered to Paul; integrity to the gospel should matter to all of us. May we continue to rely on the unfettered grace that God gives to us to live out our lives in a way that honors him. May we rest soundly on the gospel, our foundation in faith.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day18-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "Titus 3:1-15, 2 Corinthians 1:3-11, Ephesians 2:8-10",
        "devo_title": "Christian Living",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Titus 3:1-15, 2 Corinthians 1:3-11, Ephesians 2:8-10\nGoodness, this passage reads like such good advice! The kind of advice I usually receive is more like:\nLay the baby on her front. (Read: late 80s.)\nLay the baby on her back. (Read: early 90s.)\nDon’t sit on cold concrete. (Why?)\nClean the baseboards every week. (Please don’t make me.)\nIf you don’t have anything nice to say, don’t say anything at all. (This is actually pretty good advice.)\nNever miss an opportunity to go to the lavatory. (It’s just true.)\nOf course, receiving good advice and following it are two very different things. (I definitely don’t keep my baseboards properly cleaned.) We are often tempted to think that just knowing the right thing should be enough, a kind of salvation-by-information or salvation-by-education. But, as Paul points out, we aren’t the kind of people who just need another good bit of advice. We aren’t following the good advice we’ve already heard.\nIn fact, Paul is writing something much different from an advice column. He is talking about a transformation of life. We, left to ourselves “were once foolish, disobedient, deceived, enslaved by various passions and pleasures” (Titus 3:3). And it wasn’t merely a bit of good advice that saved us. It was not someone offering an odious, “Here’s what you oughta do…” No, it was grace. God poured out His Spirit on us through Jesus Christ. We were justified, not by following a nifty list of suggestions, but purely by grace.\nThis salvation by grace, through Christ, by the work of His Spirit, is what we are to insist on. It is this which actually transforms us. Yes, there are things we ought to do and ought not to do, but grace alone is sufficient to transform us from fools who refuse sound wisdom, to sons and daughters who walk in the righteousness of Christ. “Insist on these things,” Paul says, “so that those who have believed God might be careful to devote themselves to good works” (v. 8). Devotion to good works is the fruit of God’s gracious work of transformation.\nDon’t worry about advice. It’s tempting to read Paul’s words as a list of how we are falling short, and how we need to change our behavior so we fit in as God’s kind of people. We are already God’s people. While we were still sinners, Christ died for us. And because of His sacrifice and His grace, He is changing us from the inside out. The work is done by Him. Step into the waters of regeneration and walk out a new creation. Paul is describing a whole new kind of humanity, one not achieved by human effort, but by God’s redemptive grace.\nThanks be to God!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day19-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "Hebrews 6:17-19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBecause God wanted to show his unchangeable purpose even more clearly to the heirs of the promise, he guaranteed it with an oath, so that through two unchangeable things, in which it is impossible for God to lie, we who have fled for refuge might have strong encouragement to seize the hope set before us. We have this hope as an anchor for the soul, firm and secure.\n—Hebrews 6:17-19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/SRT-TimothyTitus-Shareimage-Day20-1.jpg"
    },
    {
        "book_title": "1 & 2 Timothy and Titus",
        "devo_passages": "Titus 3:5",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\nThis week we will memorize the key verse for the book of Titus. \nHe saved us—not by works of righteousness that we had done, but according to his mercy—through the washing of regeneration and renewal by the Holy Spirit.\n—Titus 3:5\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/4-TimothyTitus-3-1.jpg"
    }
]