[
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:161-176, Ecclesiastes 12:12-14, John 21:1-19",
        "devo_title": "My Heart Fears 0nly Your Word",
        "devo_summary": "Christians don’t just read the Bible. We enter into a life-long relationship with it. We read it over the course of a lifetime, knowing we will never exhaust all there is to know or glean from God’s Word. Often, when we return to passages we’ve read before, we come to them having changed since the last time we spent time with those verses. We go through things that shift how we see the world—vocational upheaval, marriage, divorce, parenthood, miscarriage, life-altering diagnoses, unexpected windfalls of good-fortune, and the like.\n\nAs we experience more of the joys and heartaches associated with living in this world, we look at Scripture through different eyes. Sometimes a theological idea we thought we had wrapped up in a tidy bow suddenly becomes shot through with questions we never thought to ask when we were younger and had not suffered much.\n\nThis is one of the reasons I am so drawn to the story of Peter’s reinstatement in John 21:1–19. Here we find Simon Peter, who was one of Jesus’s closest friends, sitting with the fact that he had denied Jesus in His greatest hour of need. He had done so exactly as Jesus predicted he would, even though he swore this sort of failure wasn’t something he was capable of (Mark 14:31).\n\nI love the story because it’s about someone who appeared to have as good of a relationship with Jesus as anyone could have, and yet he himself was weak. When Jesus appeared on the shore cooking breakfast for His friends, and caused their empty nets to be filled with more fish than they could handle, Peter recognized Jesus, because this is the same way Jesus first called Peter—with a miraculous catch of fish (Luke 5:1–11).\n\nWhen Peter jumped out of the boat and cast his drenched and dripping self at the feet of Jesus, he had no relational ground to stand on. He’d betrayed his best friend, his Lord. And yet, Jesus asked Peter the most simple and searching question imaginable: “Do you love me?” And Peter, paradox that he is, answered truthfully. He did love Jesus. He did. When Jesus said, “Feed my sheep,” He was hearkening back to when He first called Peter and told him He would make him a fisher of men. Peter’s failure did not disqualify him from Jesus’s love, or from Jesus’s call on his life.\n\nI love this passage because it offers so much hope to people who go through seasons of struggle and failure and wonder if they have lost the love of God. Peter could do nothing but receive from Jesus. On that shore, he had nothing to offer. And yet, he longed to be near his Lord and friend. We know this because earlier, before Jesus was crucified, He taught that people would ultimately need to be nourished by His flesh and blood. It was a teaching many found too difficult to embrace, and they left. But when Jesus asked His disciples if they, too, would leave, it was Peter who said, “Lord, to whom will we go? You have the words of eternal life” (John 6:68).\n\nPeter’s story reminds us that the thing we must cling to most, and fear above all else, is the Word of Christ (Psalm 119:161). Though our circumstances change, and even we change, He does not (Hebrews 13:8). Where else can we go?\n\nWritten by Russ Ramsey",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-12-wordpress.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:145-160, Romans 2:12-13, Ecclesiastes 2:24-25",
        "devo_title": "I Have Not Forgotten Your Instruction",
        "devo_summary": "It was the first time I’d ever stood up in front of our church congregation, some fifteen years ago. Alongside our fellow “new members,” my husband and I looked out over the church body we were joining, as our pastor read our favorite Bible verses aloud and introduced us by name. Never one to go first, I listened from the end of the line as one inspirational verse after another was read into the microphone, each one offering another shade of affirmation, encouragement, and faith. But as I listened for the first time to the verses of other new congregants, I felt panic set in: Had I misunderstood the instruction? The sound of my blood pumping in my ears grew louder, nearly drowning out my pastor’s voice completely, until my husband gently squeezed my hand to hear my own “favorite verse” from Scripture:\n\n“There is nothing better for a person than to eat, drink, and enjoy his work. \n\nI have seen that even this is from God’s hand, \n\nbecause who can eat and who can enjoy life apart from him?” (Ecclesiastes 2:24–25).\n\nYup.\n\nIn all of Scripture, with its sweeping poetry and prose, that was “my verse”—is my verse, I should say. In that moment of pride, I began to doubt my seemingly simple choice. I was afraid that, out of context, it misrepresented my faith and understanding of the gospel and downplayed my affection for God. I’ve since come to realize just how accurately it still reflects my relationship with Him and the sin that so often distracts me from Him: my heart’s unfortunate tendency to wander.\n\nI’m easily distracted, you see. By work. By striving. By perfectionism of the textbook-definition variety. And when I get caught up in working and worrying, spinning myself into a cycle that pushes God away from the center of my heart’s affections—that’s when He reminds me of what’s true. He gently squeezes my heart in such a way that I’m forced to acknowledge the emptiness I’m feeling, the deep ache I work so hard to numb with the distraction of productivity, when I try to live my life with my gaze affixed on anyone or anything “apart from him” (John 15:5).\n\nThe Westminster Shorter Catechism posits that “the chief end of man is to glorify God and enjoy him forever.” In my own walk with God, I’ve tended to focus on the first part, on what it might mean to glorify Him. I’ve twisted the idea of bearing His image into a works-based, legalistic, shallow religion that has very little to do with my God.\n\nBut to enjoy Him. To be satisfied in Him. To delight in His Word. To stop and savor His provision and the work He’s called me to, not just for what they might become in the future, but for what they are today—well, that sings of enjoying relationship with my very relational God, the one who is ready to answer when we call out to Him, when we seek Him with all our heart (Psalm 119:145). His Word is a very precious gift that instructs us on how to best live this life He’s given us (v.153). And it is clear: in knowing Him, being in His presence, there is abundant joy and eternal pleasure. But apart from Him, we will never be satisfied (Psalm 16:11). This is the instruction my wandering heart so desperately needs.\n\nWritten by Kara Gause",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-11.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:121-144, Romans 15:4, 1 Corinthians 13:1-13",
        "devo_title": "Your Decrees Are Wondrous",
        "devo_summary": "Reading the Bible has always been hard for me. That may sound strange coming from someone who works for a company with the motto, “Women in the Word of God every day.” Over the years, being in the Word has proved tricky for several reasons, one of which is its familiarity. I’ve read Scripture my whole life, yet the transformative stories and commands lose their potency when I grow used to their rhythms and cadence, to the way the words sound when they roll off my tongue.\n\nLet me be clear: Scripture can’t lose its power or potency. But I can diminish its work in my life through my own apathy. I can choose not to slow down and really open myself to the text or the Holy Spirit who speaks through it.\n\nA decade ago, I walked through a situation that required me to love a friend and leader in our church community with what the Bible calls agape love—a love that seeks someone else’s wellbeing. Since I could no longer speak with this person directly, the development of this love had to take place solely between God and me. So, my best friend and I made a pact to read 1 Corinthians 13 every day for a whole year. The love passage. This well-known chapter was the best model we could find for the altruistic, Christlike, agape kind of love.\n\nJust because it was a well-known chapter didn’t mean it was easy to put into action. By focusing our attention on one passage for an extended period of time, the purpose was long-term, personal transformation. I began reading it to myself out loud, as if to absorb into my very being. I can still hear the lines echoing through my car, as I read it aloud each morning:\n\n“Love is patient, love is kind. Love does not envy, \n\nis not boastful, is not arrogant, is not rude, \n\nis not self-seeking, is not irritable, \n\nand does not keep a record of wrongs” (1 Corinthians 13:4–5).\n\nThese aren’t just eloquent lines of verse or truisms to tuck away in our back pocket. They’re the living, active words of God. My friend and I didn’t set out to memorize the chapter, but within a couple weeks it was buried inside us. I found that my heart had been softened toward God’s Word and toward this person from our community. And even though it may not have redeemed the situation, it changed my heart.\n\nAs Psalm 119 says, “Your decrees are wondrous; therefore I obey them” (v.129). Let’s obey God’s decrees by burying them inside us, even if that means reciting them aloud for 365 days. When our hearts have a chance to catch up with our minds, we begin to embody truth and become not a clanging cymbal but a transformed child of God (1Corinthians 13:1).\n\nWritten by Bailey Gillespie",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-10.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:105-120, Proverbs 19:21, 1 Chronicles 28:9-20",
        "devo_title": "Your Word Is a Lamp for My Feet",
        "devo_summary": "“Okay. What have you learned from this?”\n\nThis phrase, spoken by my father, was a mainstay of my growing up. I heard it one summer afternoon when I was eight years old, following my sheepish confession that I’d accidentally shot my neighbor, Mr. Horner, with my BB gun. I heard it late one snowy Michigan night, when my car came to rest against a chain-link fence—after I’d impatiently tried (unsuccessfully) to maneuver it between a ditch and another parked car in my girlfriend’s driveway—resulting in a phone call to my dad, asking him to come help me dig my car out of a snowdrift. And I’ve uttered that same question to myself countless times since, even as I’ve grown older and the learning opportunities have evolved with time and age.\n\nAlways spoken in love, and almost always received with humility, it’s a phrase so simple, yet it resounds with the essence of the relationship between a dad and a son. I’m deeply grateful to fall into the increasingly receding percentage of men whose fathers are truly fatherly.\n\nWe might not expect to find such a rare, human moment between father and son within Scripture. While God’s Word is relatable and relevant across time, I still struggle sometimes to grasp the idea that these words were written to real people who existed in a real time and place. But that wasn’t the case for me when I read David’s words to his son, Solomon, in 1 Chronicles 28. His words could’ve just as easily been written to me in a text message from my dad on any given Monday morning:\n\n“As for you, Solomon my son, know the God of your father, \n\nand serve him wholeheartedly and with a willing mind, \n\nfor the LORD searches every heart and understands the intention of every thought.\n\nIf you seek him, he will be found by you” (v.9).\n\nI can almost picture the memories and hard-won lessons flashing before David’s eyes as he distills his life into just two simple sentences, passing down parting wisdom to his son. After charging Solomon with the great responsibility of building the temple and outlining the requirements of the job, David’s parting words to his son, and some of his last we read in the Bible, include loving encouragement that ultimately points Solomon to a present, secure, steadfast God. He tells Solomon to “be strong and courageous, and do the work… for the LORD God, my God, is with you. He won’t leave you or abandon you until all the work for the service of the LORD’s house is finished” (v.20).\n\nWhat a delight it is to be offered wisdom by those who’ve come before us, and in turn, to offer guidance to those who will come after us. But isn’t that what this entire book, the Bible, is about? It’s a lamp to lead our feet along the path of life (Psalm 119:105). It gives guidance from a loving Father through stories of His own and others’ that are full of grace and love, that shape us and call us to grow. May we honor the same Father of David and Solomon, feel loved by Him, and love like Him every day.\n\nWritten by Ryan Myers",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-9-wordpress.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:89-104, Isaiah 40:6-8, Isaiah 41:17-20",
        "devo_title": "Your Word Is Forever",
        "devo_summary": "His photo was taped to my computer monitor at work and to the refrigerator door at home—a three-year-old boy with olive skin, black hair, deep brown eyes, and a dimple above each cheek. He was a child of God with no earthly mama or baba to call his own, and I wanted so badly for him to be ours.\n\nI’ve said that adoption feels as miraculous as childbirth, a million little pieces that must fall perfectly into place for that blessed homecoming to occur. It seemed all but impossible in the beginning—too much paperwork, too much money, too many unknowns. And then there was his heart. This image-bearer was created by God with a very special heart, one that somehow managed to channel blood throughout his small frame despite missing some very important vessels. He’s been a miracle from the start.\n\nSomewhere in those early days of wondering if this beautiful, brokenhearted boy could be our son, I read a passage from Isaiah 41 that made my own heart beat loud and fast.\n\n“I am the LORD, the God of Israel. I will not abandon them… \n\nI will open rivers on the barren heights, and springs in the middle of the plains. \n\nI will turn the desert into a pool and dry land into springs… \n\nSo that all may see and know, consider and understand, \n\nthat the hand of the LORD has done this, \n\nthe Holy One of Israel has created it” (Isaiah 41:17–18,20).\n\nI taped those words to my computer monitor, right next to that dimpled smile. It was a promise from God to His people, and it became my prayer in the joy and hope and helplessness of the days and months ahead.\n\nLord, do what we cannot. Be who we cannot. Create vessels where there are none, and a road home for this boy of ours, if indeed he’s ours. Create what only you can create, as only You can. May all who see it know that You and You alone bring life and hope.\n\nPsalm 119:89 says that God’s Word is forever, “firmly fixed in heaven.” But the concept of an unbreakable thing is difficult to understand when you yourself are broken. The idea that something lasts forever feels like fiction when the world we live in is filled with people, places, and promises that fade. But God’s Word is both unbreakable and everlasting. Tethering my heart to it changes the way I walk through this wounded, temporary world. So, I grabbed hold of that Isaiah passage, and I still haven’t let it go.\n\nOur son did come home, despite all the obstacles. And after his first heart catheterization here, the surgeon showed us images we’d prayed for, but never dreamed we’d see: vessels where there once were none, tangible hope created from nothing. But would God have been good if that catheterization had found nothing new, no surgical path forward? A resounding, Yes. Because our hope is not in healed hearts or an oasis planted in the desert; our hope is in the One who speaks arteries and myrtle trees into existence, whose Word never fades or fails, even when our bodies most certainly will.\n\nThose verses I stared at day after day in that season—the same ones I clung to by his hospital bed in the year that followed—do not guarantee an outcome. They guarantee God’s goodness. He is bigger than outcomes, even when our circumstances shift and our hearts ache. We can trust the God who makes all things new.\n\nWritten by Amanda Bible Williams",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-8.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:73-88, Hebrews 4:12-13, Genesis 18:9-15, Genesis 21:1-7",
        "devo_title": "I Put My Hope in Your Word",
        "devo_summary": "I grew up going to church three times a week and met some of my closest friends (even to this day!) in youth group. Most of my Facebook statuses in high school were inspirational Bible verses that I hoped would encourage my friends at my public high school who weren’t believers. I went to a Christian university for my undergraduate degree, where mandatory chapel was held twice a week, and every student was required to take six semesters worth of Bible classes. I interned at a local church and even earned a minor degree in the Bible. And then, I went to graduate divinity school.\n\nBut somewhere along the way, I stopped delighting in Scripture. I saw it as something to be studied, but not something to be taken to heart. I began to think of God as something to learn about rather than someone to know. To date, this was one of the most confusing times in my life so far.\n\nAfter a time spent in this confusing season, I was given a special project at work; I was instructed to go through the entire book of Genesis, chapter by chapter, writing discussion questions along the way for kids aged eleven to fifteen.\n\nI don’t know the last time you read through the book of Genesis (maybe in January when we read it together, as a community), but there are some stories in that book that are, well, a little less than age-appropriate for young teens. As I was going through some of the trickier passages, the discussion point I kept coming back to was that God keeps His promises to His people. His people keep turning away from Him, not believing Him, disobeying Him and turning to other gods, but God is consistently faithful to His promises.\n\nOne of the passages that fell into this category was the story of Sarah and her pregnancy with Isaac. When God told her she would become pregnant in her old age, Sarah laughed at the very thought (Genesis 18:9–15). But God kept His promise to her, and she bore a son (Genesis 21:1–7). After reading and working through the rest of the book of Genesis, I went into my friend’s office exasperated and frustrated with myself because I couldn’t find anything else for the discussion questions. She encouraged me to keep at it and do my best, and reassured me that maybe it was okay if God keeping His promises was the main theme of the project.\n\nSoon after completing the project, I realized that what had been frustrating me about the book of Genesis was exactly what I needed to hear and understand about God in a season of my own confusion and doubt: God keeps His promises to His people. He keeps His promises when your world seems to come crashing down. He keeps His promises when your best friend betrays you, when a dear family member falls ill, when the plans you had for your life have suddenly fallen to pieces around you. I know He does because I’ve seen it in my own life. His promises to His people are true. We can put our hope in Him to do so (Psalm 119:81). What a beautiful gift.\n\nWritten by Ellen Taylor",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-5.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:57-72, Deuteronomy 6:6-9, Joshua 2:1-21",
        "devo_title": "I Have Promised to Keep Your Words",
        "devo_summary": "I remember listening to journalist Malcolm Gladwell interview Nashville legend and famed songwriter Bobby Braddock. Their conversation centered on what goes into writing a truly sad song, the kind of tune that finds you driving with one hand on the steering wheel so the other can be free to wipe the tears from your eyes.\n\nAs they talked, they decided that country music has a leg up on rock and pop when it comes to mournful tracks, but the question that lingered was Why? In the end, Braddock said it came down to details: “We cry when melancholy collides with specificity.” It’s one thing to sing about heartache, and another thing entirely to sing about standing by a lost friend’s grave and the angels’ faces delighting to welcome that friend home. Take a listen to “Go Rest High on That Mountain” by Vince Gill to hear what I’m talking about.\n\nThe reason that details help sad songs resonate with us is because they echo our own experience. We live in a world of details, not generalities. Somehow, the details make a thing more real. When it comes to God’s Word, I delight in the details. You see, in the ancient world, there was no paper. Instead, texts were written on papyrus, a material similar to paper but made out of certain flattened reeds—and papyrus wasn’t cheap. That means that everything included in God’s Word is important. There are no throwaway lines, no unimportant details.\n\nIn the story of Rahab, there’s a detail that jumps off the page for me. When she lets the two Israelite spies down through her window, she does so with a “scarlet cord” (Joshua 2:18). And it was this scarlet cord that would identify her home and keep her safe when the Israelites later attacked Jericho. It wasn’t brown or blue or white. It was a scarlet rope—and that makes all the difference in telling this story.\n\nFor those early Israelite readers of Rahab’s account, they would have connected the red color of the rope “dripping” down the window frame with the lamb’s blood a previous generation had brushed on the doorframes of their homes. While still slaves in Egypt, God had passed over the houses of the Hebrews on the night the firstborn in every household in the land had died (Exodus 12:23). The blood marked those inside as belonging to God. Rahab was a Gentile and a prostitute, but she, too, would be marked as one of God’s people. Though she was late to the party, so to speak, the “blood” of the scarlet cord would bring Rahab her own Passover moment.\n\nThe symbol, of course, is not as important as the thing it symbolizes. What set Rahab apart as a member of God’s family was not the red rope but her loyalty to Yahweh, based on the reports she had heard (Joshua 2:10–11). By helping the Israelites, she was committing treason, and she knew it. By earthly measures, the people of Jericho should have been able to withstand an attack by the Israelites. Rahab could have turned the spies over to the authorities and garnered herself the favor of Jericho’s king. But she believed what she had heard about the Lord, and she gave Him her allegiance, echoing with her life what the psalmist would later write: “The LORD is my portion” (Psalm 119:57).\n\nBut the scarlet cord doesn’t just point backwards to Passover; it also points forward to Christ. It is Christ’s red blood that now marks those who are members of God’s family. The Passover account had always foreshadowed the sacrifice of Jesus, and God had always planned on making one new people from Jews and Gentiles. Rahab’s story reveals this had long been in God’s heart to do. The prostitute-turned-daughter of the King is even honored with a place in Jesus’s family tree (Matthew 1:5).\n\nGod is the Author of Scripture. No detail is included by accident. Every last one is an invitation to thank Him for His faithfulness, our God who knows the end from the beginning (Isaiah 46:10).\n\nWritten by John Greco",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-4.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:33-56, 2 Timothy 3:16-17, James 1:16-25",
        "devo_title": "Teach Me the Meaning of Your Statutes",
        "devo_summary": "One of my strongest memories from my sophomore year of high school is of a black, 5-inch thick three-ring binder I carried everywhere. I was part of the not-so-exclusive academic quiz bowl team at my school, and every few weeks, I would compete against other schools to see which team could “buzz in” first to earn points answering trivia questions. My binder was filled with the printed records of previous tournament questions and answers. Though questions were rarely repeated, I poured over that binder every opportunity I could find, hoping that my incessant studying might reveal recurring subject matter or a pattern in how questions are worded for tournaments to give me an edge over the competition. To this day, I’d still choose a trivia night at a local restaurant over almost any other activity.\n\nI used to think taking this same approach to Scripture was proof that I loved God’s Word. Studying the Bible—its words, history, cultural contexts, and languages—has been life-giving to my faith in my undergraduate and postgraduate studies, as well as in my career. But I have to be reminded that life as a follower of Jesus is so much more than just memorizing facts about God or storing up interesting trivia about the Bible. Our reading and study of Scripture should shape us and reorient our hearts as it shows us who He is and who we are in Him.\n\nI come back to the book of James over and over when I find my heart wanting to make a god of knowing about God, rather than truly knowing Him. The book is full of direct one-liners that cut right to the truth: truly delighting in God’s Word means living out what the Word teaches us. In the opening passage of his letter, James sums this up by telling believers that we must be “doers of the word and not hearers only” (James 1:22).\n\nHearing without acting is more than useless—it’s self-deception, because as believers, we are new people born of the gospel (v.22,18). James writes that God has implanted His Word in us (v.21). We miss the point if we are not willing to let its truth take root, growing and bearing fruit in us as we are changed and made more like Christ.\n\nEssentially, we are living out what the psalmist pleads with God to do: transform him so that he can keep God’s commands (Psalm 119:21). By His Spirit and His Word, we’ve been made into new people. Unlike the person who looks in the mirror and responds, “I forget,” when asked what they look like (vv.23–24), we are called to remember who we are as we walk away from reading the Bible. If we go about our lives without acting on what it teaches, we live as fractured people, at odds with who we now are in Christ. Praise God, because He’s done the hardest work in giving us new hearts already!\n\nBeing in the Word of God every day equips us to live out the Word of God every day. It guards against forgetting what is true of our God and of ourselves. Let our prayer echo that of the psalmist as we come to the Bible each day: ”Teach me, LORD, the meaning of your statutes, and I will always keep them” (Psalm 119:33).\n\nWritten by Jessica Lamb",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-3.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:17-32, Joshua 1:6-8, Galatians 4:1-7",
        "devo_title": "Give Me Life Through Your Word",
        "devo_summary": "In her essay called “The Wreck of Time,” Annie Dillard references the idea that when a single person dies, we treat it as a tragedy. But when a million people die, we treat it as a statistic.\n\nThis unsettling observation shows how inconsistent we humans can be concerning the value of a life. On the one hand, if a friend or relative or some other cherished person is taken from us, we are moved to deep and abiding sorrow. On the other hand, if a million lives with whom we share no personal connection are suddenly wiped out by a viral pandemic or natural disaster, any initial sadness and shock we feel can fade within weeks, and possibly within hours. The one who is close to us seems more precious even than the million who are further away.\n\nOur selective valuation of our fellow humans invites a haunting question: If the million don’t matter to us as much as the one, then can we honestly say that the one really matters at all? How precious are many lives, how precious is a single life, and how precious is my life… really?\n\nEach of us living today is one in seven billion. Of all the people who have ever lived, we are one in 107 billion. David hinted at this relative smallness of ours when he cried out to God, “What is a human being that you remember him, a son of man that you look after him?” (Psalm 8:4).\n\nThankfully, Scripture provides us with a strong and sure answer. David continued, “You made him a little less than God and crowned him with glory and honor” (v.5). The poet-king after God’s own heart is genuinely awestruck by the truth about all humans and about each individual human: We are made in the image of God (Genesis 1:27). Of all creatures everywhere, only humans are esteemed in this way.\n\nThis truth about our inestimable value becomes even more compelling when we realize that in Christ, we are the image of God but also much more: Scripture tells us we are the children of God. And as His children, He gives us life through His Word and teaches us His ways (Psalm 119:25–26). In his letter to the Galatians, Paul amplifies this astonishing truth by reminding us that through faith in Christ, God has adopted us, sent His Spirit into our hearts, invited us to call Him “Father,” and made us heirs of all that is His (Galatians 4:4–7).\n\nAs Brennan Manning has written, “Define yourself radically as one beloved by God. This is the true self. Every other identity is an illusion.”\n\nThe next time you look in the mirror, don’t for a moment think that you’re looking at a mere face in the crowd. Don’t for a moment think that you’re looking at a tragedy or a statistic. You have no true basis for looking at yourself in this way. Rather, you are looking at an esteemed crown of God’s creation, a beloved child of God, and a privileged heir of everything.\n\nThis is your true self. Every other identity is an illusion.\n\nWritten by Scott Sauls",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-2.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:1-16, Psalm 19:7-8, Exodus 20:1–17",
        "devo_title": "Happy Are Those Who Keep His Decrees",
        "devo_summary": "I used to really love the law (Exodus 20:1–17). I remember enthusiastically singing the Ten-Commandments song “The Perfect Ten” at school and church with the confidence of a child whose Christian walk was just beginning.\n\nNumber one, we’ve just begun: God should be first in your life!\n\nNumber two’s the idol rule: those graven images aren’t nice.\n\nI’d assure myself as I sang…\n\nNumber three: God’s name should be never spoken in jest.\n\nNumber four: the Sabbath’s for our worship and for rest.\n\nSo far, so good. Our family was known for nothing if not for our Sunday naps.\n\nNumber five: we all should strive to honor father and mother.\n\nNumber six: don’t get your kicks from killing one another.\n\nSuccess!\n\nNumber seven: life is heaven when you’re true to your mate.\n\nNumber eight: don’t steal and break this rule for goodness’ sake!\n\nNumber seven was easy—I didn’t even have a mate!\n\nNumber nine: don’t be the kind who goes around telling lies.\n\nNumber ten: don’t covet when you see your neighbor’s house or wife!\n\nI was doing so well. It had never occurred to me to covet my neighbor’s wife. In my mind I would sing that song with a full band playing behind me—like a victory song. I was delighting in God’s law because it was just so keepable! But as I grew to understand the law, I began to understand how difficult it was to follow.\n\nI thank God that He brought me out of the age of check, check, check into the maturity of, If this is the measuring stick, I will never measure up. And even more, I’m thankful He didn’t leave me there with my checklist. When God mercifully, gradually granted me eyes to see how readily I broke His law by commission, omission, and flat-out rejection of Him, the big band musicians in my head began to slowly lower their instruments and solemnly take their seats. I wasn’t delighting in God’s law at all. I had been delighting in my “keeping” of His law.\n\nBut my delight hasn’t gone away; it has instead shifted and matured. Now, my soul finds rest in knowing that the law has been fulfilled by Christ on my behalf. Because of Jesus, the law no longer justifies or condemns us—it frees us and becomes our guide for thankful obedience to the One by whom we are justified.\n\nDo you get that? If the law is our measuring stick, every one of us will be found unrighteous. But Jesus kept God’s law perfectly, imparting His righteousness to us so that when we are measured, we, too, will be counted as righteous—as perfect law-keepers!\n\nNow, when I catch myself humming that childhood ten commandments tune (or teaching it to my children), I hear it differently. Not as a reminder of what I have to do, or even as a condemnation of what I can’t do. I hear it now as an assurance of what He has done, and as the kindest, clearest roadmap to the heart of the Father. He makes me righteous, and I delight in pleasing Him. “Oh that my ways may be steadfast in keeping [His] statutes!” (Psalm 119:5, ESV).\n\nLord, I love your law. “With my lips I declare all the rules of your mouth” (v.13, ESV).\n\nWritten by Raechel Myers",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-1.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:161-176, Ecclesiastes 12:12-14, John 21:1-19",
        "devo_title": "My Heart Fears 0nly Your Word",
        "devo_summary": "Christians don’t just read the Bible. We enter into a life-long relationship with it. We read it over the course of a lifetime, knowing we will never exhaust all there is to know or glean from God’s Word. Often, when we return to passages we’ve read before, we come to them having changed since the last time we spent time with those verses. We go through things that shift how we see the world—vocational upheaval, marriage, divorce, parenthood, miscarriage, life-altering diagnoses, unexpected windfalls of good-fortune, and the like.\n\nAs we experience more of the joys and heartaches associated with living in this world, we look at Scripture through different eyes. Sometimes a theological idea we thought we had wrapped up in a tidy bow suddenly becomes shot through with questions we never thought to ask when we were younger and had not suffered much.\n\nThis is one of the reasons I am so drawn to the story of Peter’s reinstatement in John 21:1–19. Here we find Simon Peter, who was one of Jesus’s closest friends, sitting with the fact that he had denied Jesus in His greatest hour of need. He had done so exactly as Jesus predicted he would, even though he swore this sort of failure wasn’t something he was capable of (Mark 14:31).\n\nI love the story because it’s about someone who appeared to have as good of a relationship with Jesus as anyone could have, and yet he himself was weak. When Jesus appeared on the shore cooking breakfast for His friends, and caused their empty nets to be filled with more fish than they could handle, Peter recognized Jesus, because this is the same way Jesus first called Peter—with a miraculous catch of fish (Luke 5:1–11).\n\nWhen Peter jumped out of the boat and cast his drenched and dripping self at the feet of Jesus, he had no relational ground to stand on. He’d betrayed his best friend, his Lord. And yet, Jesus asked Peter the most simple and searching question imaginable: “Do you love me?” And Peter, paradox that he is, answered truthfully. He did love Jesus. He did. When Jesus said, “Feed my sheep,” He was hearkening back to when He first called Peter and told him He would make him a fisher of men. Peter’s failure did not disqualify him from Jesus’s love, or from Jesus’s call on his life.\n\nI love this passage because it offers so much hope to people who go through seasons of struggle and failure and wonder if they have lost the love of God. Peter could do nothing but receive from Jesus. On that shore, he had nothing to offer. And yet, he longed to be near his Lord and friend. We know this because earlier, before Jesus was crucified, He taught that people would ultimately need to be nourished by His flesh and blood. It was a teaching many found too difficult to embrace, and they left. But when Jesus asked His disciples if they, too, would leave, it was Peter who said, “Lord, to whom will we go? You have the words of eternal life” (John 6:68).\n\nPeter’s story reminds us that the thing we must cling to most, and fear above all else, is the Word of Christ (Psalm 119:161). Though our circumstances change, and even we change, He does not (Hebrews 13:8). Where else can we go?\n\nWritten by Russ Ramsey",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-12-wordpress.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:145-160, Romans 2:12-13, Ecclesiastes 2:24-25",
        "devo_title": "I Have Not Forgotten Your Instruction",
        "devo_summary": "It was the first time I’d ever stood up in front of our church congregation, some fifteen years ago. Alongside our fellow “new members,” my husband and I looked out over the church body we were joining, as our pastor read our favorite Bible verses aloud and introduced us by name. Never one to go first, I listened from the end of the line as one inspirational verse after another was read into the microphone, each one offering another shade of affirmation, encouragement, and faith. But as I listened for the first time to the verses of other new congregants, I felt panic set in: Had I misunderstood the instruction? The sound of my blood pumping in my ears grew louder, nearly drowning out my pastor’s voice completely, until my husband gently squeezed my hand to hear my own “favorite verse” from Scripture:\n\n“There is nothing better for a person than to eat, drink, and enjoy his work. \n\nI have seen that even this is from God’s hand, \n\nbecause who can eat and who can enjoy life apart from him?” (Ecclesiastes 2:24–25).\n\nYup.\n\nIn all of Scripture, with its sweeping poetry and prose, that was “my verse”—is my verse, I should say. In that moment of pride, I began to doubt my seemingly simple choice. I was afraid that, out of context, it misrepresented my faith and understanding of the gospel and downplayed my affection for God. I’ve since come to realize just how accurately it still reflects my relationship with Him and the sin that so often distracts me from Him: my heart’s unfortunate tendency to wander.\n\nI’m easily distracted, you see. By work. By striving. By perfectionism of the textbook-definition variety. And when I get caught up in working and worrying, spinning myself into a cycle that pushes God away from the center of my heart’s affections—that’s when He reminds me of what’s true. He gently squeezes my heart in such a way that I’m forced to acknowledge the emptiness I’m feeling, the deep ache I work so hard to numb with the distraction of productivity, when I try to live my life with my gaze affixed on anyone or anything “apart from him” (John 15:5).\n\nThe Westminster Shorter Catechism posits that “the chief end of man is to glorify God and enjoy him forever.” In my own walk with God, I’ve tended to focus on the first part, on what it might mean to glorify Him. I’ve twisted the idea of bearing His image into a works-based, legalistic, shallow religion that has very little to do with my God.\n\nBut to enjoy Him. To be satisfied in Him. To delight in His Word. To stop and savor His provision and the work He’s called me to, not just for what they might become in the future, but for what they are today—well, that sings of enjoying relationship with my very relational God, the one who is ready to answer when we call out to Him, when we seek Him with all our heart (Psalm 119:145). His Word is a very precious gift that instructs us on how to best live this life He’s given us (v.153). And it is clear: in knowing Him, being in His presence, there is abundant joy and eternal pleasure. But apart from Him, we will never be satisfied (Psalm 16:11). This is the instruction my wandering heart so desperately needs.\n\nWritten by Kara Gause",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-11.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:121-144, Romans 15:4, 1 Corinthians 13:1-13",
        "devo_title": "Your Decrees Are Wondrous",
        "devo_summary": "Reading the Bible has always been hard for me. That may sound strange coming from someone who works for a company with the motto, “Women in the Word of God every day.” Over the years, being in the Word has proved tricky for several reasons, one of which is its familiarity. I’ve read Scripture my whole life, yet the transformative stories and commands lose their potency when I grow used to their rhythms and cadence, to the way the words sound when they roll off my tongue.\n\nLet me be clear: Scripture can’t lose its power or potency. But I can diminish its work in my life through my own apathy. I can choose not to slow down and really open myself to the text or the Holy Spirit who speaks through it.\n\nA decade ago, I walked through a situation that required me to love a friend and leader in our church community with what the Bible calls agape love—a love that seeks someone else’s wellbeing. Since I could no longer speak with this person directly, the development of this love had to take place solely between God and me. So, my best friend and I made a pact to read 1 Corinthians 13 every day for a whole year. The love passage. This well-known chapter was the best model we could find for the altruistic, Christlike, agape kind of love.\n\nJust because it was a well-known chapter didn’t mean it was easy to put into action. By focusing our attention on one passage for an extended period of time, the purpose was long-term, personal transformation. I began reading it to myself out loud, as if to absorb into my very being. I can still hear the lines echoing through my car, as I read it aloud each morning:\n\n“Love is patient, love is kind. Love does not envy, \n\nis not boastful, is not arrogant, is not rude, \n\nis not self-seeking, is not irritable, \n\nand does not keep a record of wrongs” (1 Corinthians 13:4–5).\n\nThese aren’t just eloquent lines of verse or truisms to tuck away in our back pocket. They’re the living, active words of God. My friend and I didn’t set out to memorize the chapter, but within a couple weeks it was buried inside us. I found that my heart had been softened toward God’s Word and toward this person from our community. And even though it may not have redeemed the situation, it changed my heart.\n\nAs Psalm 119 says, “Your decrees are wondrous; therefore I obey them” (v.129). Let’s obey God’s decrees by burying them inside us, even if that means reciting them aloud for 365 days. When our hearts have a chance to catch up with our minds, we begin to embody truth and become not a clanging cymbal but a transformed child of God (1Corinthians 13:1).\n\nWritten by Bailey Gillespie",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-10.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:105-120, Proverbs 19:21, 1 Chronicles 28:9-20",
        "devo_title": "Your Word Is a Lamp for My Feet",
        "devo_summary": "“Okay. What have you learned from this?”\n\nThis phrase, spoken by my father, was a mainstay of my growing up. I heard it one summer afternoon when I was eight years old, following my sheepish confession that I’d accidentally shot my neighbor, Mr. Horner, with my BB gun. I heard it late one snowy Michigan night, when my car came to rest against a chain-link fence—after I’d impatiently tried (unsuccessfully) to maneuver it between a ditch and another parked car in my girlfriend’s driveway—resulting in a phone call to my dad, asking him to come help me dig my car out of a snowdrift. And I’ve uttered that same question to myself countless times since, even as I’ve grown older and the learning opportunities have evolved with time and age.\n\nAlways spoken in love, and almost always received with humility, it’s a phrase so simple, yet it resounds with the essence of the relationship between a dad and a son. I’m deeply grateful to fall into the increasingly receding percentage of men whose fathers are truly fatherly.\n\nWe might not expect to find such a rare, human moment between father and son within Scripture. While God’s Word is relatable and relevant across time, I still struggle sometimes to grasp the idea that these words were written to real people who existed in a real time and place. But that wasn’t the case for me when I read David’s words to his son, Solomon, in 1 Chronicles 28. His words could’ve just as easily been written to me in a text message from my dad on any given Monday morning:\n\n“As for you, Solomon my son, know the God of your father, \n\nand serve him wholeheartedly and with a willing mind, \n\nfor the LORD searches every heart and understands the intention of every thought.\n\nIf you seek him, he will be found by you” (v.9).\n\nI can almost picture the memories and hard-won lessons flashing before David’s eyes as he distills his life into just two simple sentences, passing down parting wisdom to his son. After charging Solomon with the great responsibility of building the temple and outlining the requirements of the job, David’s parting words to his son, and some of his last we read in the Bible, include loving encouragement that ultimately points Solomon to a present, secure, steadfast God. He tells Solomon to “be strong and courageous, and do the work… for the LORD God, my God, is with you. He won’t leave you or abandon you until all the work for the service of the LORD’s house is finished” (v.20).\n\nWhat a delight it is to be offered wisdom by those who’ve come before us, and in turn, to offer guidance to those who will come after us. But isn’t that what this entire book, the Bible, is about? It’s a lamp to lead our feet along the path of life (Psalm 119:105). It gives guidance from a loving Father through stories of His own and others’ that are full of grace and love, that shape us and call us to grow. May we honor the same Father of David and Solomon, feel loved by Him, and love like Him every day.\n\nWritten by Ryan Myers",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-9-wordpress.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:89-104, Isaiah 40:6-8, Isaiah 41:17-20",
        "devo_title": "Your Word Is Forever",
        "devo_summary": "His photo was taped to my computer monitor at work and to the refrigerator door at home—a three-year-old boy with olive skin, black hair, deep brown eyes, and a dimple above each cheek. He was a child of God with no earthly mama or baba to call his own, and I wanted so badly for him to be ours.\n\nI’ve said that adoption feels as miraculous as childbirth, a million little pieces that must fall perfectly into place for that blessed homecoming to occur. It seemed all but impossible in the beginning—too much paperwork, too much money, too many unknowns. And then there was his heart. This image-bearer was created by God with a very special heart, one that somehow managed to channel blood throughout his small frame despite missing some very important vessels. He’s been a miracle from the start.\n\nSomewhere in those early days of wondering if this beautiful, brokenhearted boy could be our son, I read a passage from Isaiah 41 that made my own heart beat loud and fast.\n\n“I am the LORD, the God of Israel. I will not abandon them… \n\nI will open rivers on the barren heights, and springs in the middle of the plains. \n\nI will turn the desert into a pool and dry land into springs… \n\nSo that all may see and know, consider and understand, \n\nthat the hand of the LORD has done this, \n\nthe Holy One of Israel has created it” (Isaiah 41:17–18,20).\n\nI taped those words to my computer monitor, right next to that dimpled smile. It was a promise from God to His people, and it became my prayer in the joy and hope and helplessness of the days and months ahead.\n\nLord, do what we cannot. Be who we cannot. Create vessels where there are none, and a road home for this boy of ours, if indeed he’s ours. Create what only you can create, as only You can. May all who see it know that You and You alone bring life and hope.\n\nPsalm 119:89 says that God’s Word is forever, “firmly fixed in heaven.” But the concept of an unbreakable thing is difficult to understand when you yourself are broken. The idea that something lasts forever feels like fiction when the world we live in is filled with people, places, and promises that fade. But God’s Word is both unbreakable and everlasting. Tethering my heart to it changes the way I walk through this wounded, temporary world. So, I grabbed hold of that Isaiah passage, and I still haven’t let it go.\n\nOur son did come home, despite all the obstacles. And after his first heart catheterization here, the surgeon showed us images we’d prayed for, but never dreamed we’d see: vessels where there once were none, tangible hope created from nothing. But would God have been good if that catheterization had found nothing new, no surgical path forward? A resounding, Yes. Because our hope is not in healed hearts or an oasis planted in the desert; our hope is in the One who speaks arteries and myrtle trees into existence, whose Word never fades or fails, even when our bodies most certainly will.\n\nThose verses I stared at day after day in that season—the same ones I clung to by his hospital bed in the year that followed—do not guarantee an outcome. They guarantee God’s goodness. He is bigger than outcomes, even when our circumstances shift and our hearts ache. We can trust the God who makes all things new.\n\nWritten by Amanda Bible Williams",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-8.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:73-88, Hebrews 4:12-13, Genesis 18:9-15, Genesis 21:1-7",
        "devo_title": "I Put My Hope in Your Word",
        "devo_summary": "I grew up going to church three times a week and met some of my closest friends (even to this day!) in youth group. Most of my Facebook statuses in high school were inspirational Bible verses that I hoped would encourage my friends at my public high school who weren’t believers. I went to a Christian university for my undergraduate degree, where mandatory chapel was held twice a week, and every student was required to take six semesters worth of Bible classes. I interned at a local church and even earned a minor degree in the Bible. And then, I went to graduate divinity school.\n\nBut somewhere along the way, I stopped delighting in Scripture. I saw it as something to be studied, but not something to be taken to heart. I began to think of God as something to learn about rather than someone to know. To date, this was one of the most confusing times in my life so far.\n\nAfter a time spent in this confusing season, I was given a special project at work; I was instructed to go through the entire book of Genesis, chapter by chapter, writing discussion questions along the way for kids aged eleven to fifteen.\n\nI don’t know the last time you read through the book of Genesis (maybe in January when we read it together, as a community), but there are some stories in that book that are, well, a little less than age-appropriate for young teens. As I was going through some of the trickier passages, the discussion point I kept coming back to was that God keeps His promises to His people. His people keep turning away from Him, not believing Him, disobeying Him and turning to other gods, but God is consistently faithful to His promises.\n\nOne of the passages that fell into this category was the story of Sarah and her pregnancy with Isaac. When God told her she would become pregnant in her old age, Sarah laughed at the very thought (Genesis 18:9–15). But God kept His promise to her, and she bore a son (Genesis 21:1–7). After reading and working through the rest of the book of Genesis, I went into my friend’s office exasperated and frustrated with myself because I couldn’t find anything else for the discussion questions. She encouraged me to keep at it and do my best, and reassured me that maybe it was okay if God keeping His promises was the main theme of the project.\n\nSoon after completing the project, I realized that what had been frustrating me about the book of Genesis was exactly what I needed to hear and understand about God in a season of my own confusion and doubt: God keeps His promises to His people. He keeps His promises when your world seems to come crashing down. He keeps His promises when your best friend betrays you, when a dear family member falls ill, when the plans you had for your life have suddenly fallen to pieces around you. I know He does because I’ve seen it in my own life. His promises to His people are true. We can put our hope in Him to do so (Psalm 119:81). What a beautiful gift.\n\nWritten by Ellen Taylor",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-5.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:57-72, Deuteronomy 6:6-9, Joshua 2:1-21",
        "devo_title": "I Have Promised to Keep Your Words",
        "devo_summary": "I remember listening to journalist Malcolm Gladwell interview Nashville legend and famed songwriter Bobby Braddock. Their conversation centered on what goes into writing a truly sad song, the kind of tune that finds you driving with one hand on the steering wheel so the other can be free to wipe the tears from your eyes.\n\nAs they talked, they decided that country music has a leg up on rock and pop when it comes to mournful tracks, but the question that lingered was Why? In the end, Braddock said it came down to details: “We cry when melancholy collides with specificity.” It’s one thing to sing about heartache, and another thing entirely to sing about standing by a lost friend’s grave and the angels’ faces delighting to welcome that friend home. Take a listen to “Go Rest High on That Mountain” by Vince Gill to hear what I’m talking about.\n\nThe reason that details help sad songs resonate with us is because they echo our own experience. We live in a world of details, not generalities. Somehow, the details make a thing more real. When it comes to God’s Word, I delight in the details. You see, in the ancient world, there was no paper. Instead, texts were written on papyrus, a material similar to paper but made out of certain flattened reeds—and papyrus wasn’t cheap. That means that everything included in God’s Word is important. There are no throwaway lines, no unimportant details.\n\nIn the story of Rahab, there’s a detail that jumps off the page for me. When she lets the two Israelite spies down through her window, she does so with a “scarlet cord” (Joshua 2:18). And it was this scarlet cord that would identify her home and keep her safe when the Israelites later attacked Jericho. It wasn’t brown or blue or white. It was a scarlet rope—and that makes all the difference in telling this story.\n\nFor those early Israelite readers of Rahab’s account, they would have connected the red color of the rope “dripping” down the window frame with the lamb’s blood a previous generation had brushed on the doorframes of their homes. While still slaves in Egypt, God had passed over the houses of the Hebrews on the night the firstborn in every household in the land had died (Exodus 12:23). The blood marked those inside as belonging to God. Rahab was a Gentile and a prostitute, but she, too, would be marked as one of God’s people. Though she was late to the party, so to speak, the “blood” of the scarlet cord would bring Rahab her own Passover moment.\n\nThe symbol, of course, is not as important as the thing it symbolizes. What set Rahab apart as a member of God’s family was not the red rope but her loyalty to Yahweh, based on the reports she had heard (Joshua 2:10–11). By helping the Israelites, she was committing treason, and she knew it. By earthly measures, the people of Jericho should have been able to withstand an attack by the Israelites. Rahab could have turned the spies over to the authorities and garnered herself the favor of Jericho’s king. But she believed what she had heard about the Lord, and she gave Him her allegiance, echoing with her life what the psalmist would later write: “The LORD is my portion” (Psalm 119:57).\n\nBut the scarlet cord doesn’t just point backwards to Passover; it also points forward to Christ. It is Christ’s red blood that now marks those who are members of God’s family. The Passover account had always foreshadowed the sacrifice of Jesus, and God had always planned on making one new people from Jews and Gentiles. Rahab’s story reveals this had long been in God’s heart to do. The prostitute-turned-daughter of the King is even honored with a place in Jesus’s family tree (Matthew 1:5).\n\nGod is the Author of Scripture. No detail is included by accident. Every last one is an invitation to thank Him for His faithfulness, our God who knows the end from the beginning (Isaiah 46:10).\n\nWritten by John Greco",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-4.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:33-56, 2 Timothy 3:16-17, James 1:16-25",
        "devo_title": "Teach Me the Meaning of Your Statutes",
        "devo_summary": "One of my strongest memories from my sophomore year of high school is of a black, 5-inch thick three-ring binder I carried everywhere. I was part of the not-so-exclusive academic quiz bowl team at my school, and every few weeks, I would compete against other schools to see which team could “buzz in” first to earn points answering trivia questions. My binder was filled with the printed records of previous tournament questions and answers. Though questions were rarely repeated, I poured over that binder every opportunity I could find, hoping that my incessant studying might reveal recurring subject matter or a pattern in how questions are worded for tournaments to give me an edge over the competition. To this day, I’d still choose a trivia night at a local restaurant over almost any other activity.\n\nI used to think taking this same approach to Scripture was proof that I loved God’s Word. Studying the Bible—its words, history, cultural contexts, and languages—has been life-giving to my faith in my undergraduate and postgraduate studies, as well as in my career. But I have to be reminded that life as a follower of Jesus is so much more than just memorizing facts about God or storing up interesting trivia about the Bible. Our reading and study of Scripture should shape us and reorient our hearts as it shows us who He is and who we are in Him.\n\nI come back to the book of James over and over when I find my heart wanting to make a god of knowing about God, rather than truly knowing Him. The book is full of direct one-liners that cut right to the truth: truly delighting in God’s Word means living out what the Word teaches us. In the opening passage of his letter, James sums this up by telling believers that we must be “doers of the word and not hearers only” (James 1:22).\n\nHearing without acting is more than useless—it’s self-deception, because as believers, we are new people born of the gospel (v.22,18). James writes that God has implanted His Word in us (v.21). We miss the point if we are not willing to let its truth take root, growing and bearing fruit in us as we are changed and made more like Christ.\n\nEssentially, we are living out what the psalmist pleads with God to do: transform him so that he can keep God’s commands (Psalm 119:21). By His Spirit and His Word, we’ve been made into new people. Unlike the person who looks in the mirror and responds, “I forget,” when asked what they look like (vv.23–24), we are called to remember who we are as we walk away from reading the Bible. If we go about our lives without acting on what it teaches, we live as fractured people, at odds with who we now are in Christ. Praise God, because He’s done the hardest work in giving us new hearts already!\n\nBeing in the Word of God every day equips us to live out the Word of God every day. It guards against forgetting what is true of our God and of ourselves. Let our prayer echo that of the psalmist as we come to the Bible each day: ”Teach me, LORD, the meaning of your statutes, and I will always keep them” (Psalm 119:33).\n\nWritten by Jessica Lamb",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-3.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:17-32, Joshua 1:6-8, Galatians 4:1-7",
        "devo_title": "Give Me Life Through Your Word",
        "devo_summary": "In her essay called “The Wreck of Time,” Annie Dillard references the idea that when a single person dies, we treat it as a tragedy. But when a million people die, we treat it as a statistic.\n\nThis unsettling observation shows how inconsistent we humans can be concerning the value of a life. On the one hand, if a friend or relative or some other cherished person is taken from us, we are moved to deep and abiding sorrow. On the other hand, if a million lives with whom we share no personal connection are suddenly wiped out by a viral pandemic or natural disaster, any initial sadness and shock we feel can fade within weeks, and possibly within hours. The one who is close to us seems more precious even than the million who are further away.\n\nOur selective valuation of our fellow humans invites a haunting question: If the million don’t matter to us as much as the one, then can we honestly say that the one really matters at all? How precious are many lives, how precious is a single life, and how precious is my life… really?\n\nEach of us living today is one in seven billion. Of all the people who have ever lived, we are one in 107 billion. David hinted at this relative smallness of ours when he cried out to God, “What is a human being that you remember him, a son of man that you look after him?” (Psalm 8:4).\n\nThankfully, Scripture provides us with a strong and sure answer. David continued, “You made him a little less than God and crowned him with glory and honor” (v.5). The poet-king after God’s own heart is genuinely awestruck by the truth about all humans and about each individual human: We are made in the image of God (Genesis 1:27). Of all creatures everywhere, only humans are esteemed in this way.\n\nThis truth about our inestimable value becomes even more compelling when we realize that in Christ, we are the image of God but also much more: Scripture tells us we are the children of God. And as His children, He gives us life through His Word and teaches us His ways (Psalm 119:25–26). In his letter to the Galatians, Paul amplifies this astonishing truth by reminding us that through faith in Christ, God has adopted us, sent His Spirit into our hearts, invited us to call Him “Father,” and made us heirs of all that is His (Galatians 4:4–7).\n\nAs Brennan Manning has written, “Define yourself radically as one beloved by God. This is the true self. Every other identity is an illusion.”\n\nThe next time you look in the mirror, don’t for a moment think that you’re looking at a mere face in the crowd. Don’t for a moment think that you’re looking at a tragedy or a statistic. You have no true basis for looking at yourself in this way. Rather, you are looking at an esteemed crown of God’s creation, a beloved child of God, and a privileged heir of everything.\n\nThis is your true self. Every other identity is an illusion.\n\nWritten by Scott Sauls",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-2.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:1-16, Psalm 19:7-8, Exodus 20:1–17",
        "devo_title": "Happy Are Those Who Keep His Decrees",
        "devo_summary": "I used to really love the law (Exodus 20:1–17). I remember enthusiastically singing the Ten-Commandments song “The Perfect Ten” at school and church with the confidence of a child whose Christian walk was just beginning.\n\nNumber one, we’ve just begun: God should be first in your life!\n\nNumber two’s the idol rule: those graven images aren’t nice.\n\nI’d assure myself as I sang…\n\nNumber three: God’s name should be never spoken in jest.\n\nNumber four: the Sabbath’s for our worship and for rest.\n\nSo far, so good. Our family was known for nothing if not for our Sunday naps.\n\nNumber five: we all should strive to honor father and mother.\n\nNumber six: don’t get your kicks from killing one another.\n\nSuccess!\n\nNumber seven: life is heaven when you’re true to your mate.\n\nNumber eight: don’t steal and break this rule for goodness’ sake!\n\nNumber seven was easy—I didn’t even have a mate!\n\nNumber nine: don’t be the kind who goes around telling lies.\n\nNumber ten: don’t covet when you see your neighbor’s house or wife!\n\nI was doing so well. It had never occurred to me to covet my neighbor’s wife. In my mind I would sing that song with a full band playing behind me—like a victory song. I was delighting in God’s law because it was just so keepable! But as I grew to understand the law, I began to understand how difficult it was to follow.\n\nI thank God that He brought me out of the age of check, check, check into the maturity of, If this is the measuring stick, I will never measure up. And even more, I’m thankful He didn’t leave me there with my checklist. When God mercifully, gradually granted me eyes to see how readily I broke His law by commission, omission, and flat-out rejection of Him, the big band musicians in my head began to slowly lower their instruments and solemnly take their seats. I wasn’t delighting in God’s law at all. I had been delighting in my “keeping” of His law.\n\nBut my delight hasn’t gone away; it has instead shifted and matured. Now, my soul finds rest in knowing that the law has been fulfilled by Christ on my behalf. Because of Jesus, the law no longer justifies or condemns us—it frees us and becomes our guide for thankful obedience to the One by whom we are justified.\n\nDo you get that? If the law is our measuring stick, every one of us will be found unrighteous. But Jesus kept God’s law perfectly, imparting His righteousness to us so that when we are measured, we, too, will be counted as righteous—as perfect law-keepers!\n\nNow, when I catch myself humming that childhood ten commandments tune (or teaching it to my children), I hear it differently. Not as a reminder of what I have to do, or even as a condemnation of what I can’t do. I hear it now as an assurance of what He has done, and as the kindest, clearest roadmap to the heart of the Father. He makes me righteous, and I delight in pleasing Him. “Oh that my ways may be steadfast in keeping [His] statutes!” (Psalm 119:5, ESV).\n\nLord, I love your law. “With my lips I declare all the rules of your mouth” (v.13, ESV).\n\nWritten by Raechel Myers",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2020/07/HRT-Psalm119-Instagram-1.jpg"
    },
      {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Philemon 1:1-25, Colossians 3:22-25, Colossians 4:1-9, Romans 12:9-13",
    "devo_title": "Philemon & Onesimus",
    "devo_summary": "The gospel tells us who we are to each other. The relationship between Philemon and Onesimus drives this point home by way of a fascinating bit of drama.\n\nOnesimus, Philemon’s runaway slave, was from Colossae, and he was one of the people who delivered Paul’s letter to the Colossians. We know this because in Colossians, Paul writes to the church there:\n\n“I have sent [Tychicus] to you… so that you may know how we are and so that he may encourage your hearts. He is coming with Onesimus, a faithful and dearly loved brother, who is one of you” (Colossians 4:7–9, emphasis mine).\n\nThen, when we read the opening verses of Philemon, we discover that the church in Onesimus’s hometown, Colossae, met in Philemon’s house (Philemon 2). This means that when Tychicus stepped into the church in Colossae, he was actually standing in Philemon’s home. And who stood beside him? Onesimus, who had likely stolen from Philemon to fund his escape. Philemon 10–16 tells us Paul sent Onesimus back to Philemon for the purpose of reconciliation.\n\nConsider the drama of this moment. There would’ve been no notice of Tychicus’s and Onesimus’s arrival beforehand, just the sight of them. Imagine as they presented the two letters from Paul: one to the Colossian church that met in Philemon’s home, and the other a bit of personal correspondence from the apostle to Philemon about the prodigal standing there before him.\n\nPhilemon had his runaway slave right there in front of him, reminding him of the way Onesimus had wronged him, and yet he also had Paul’s words telling him Onesimus was a changed man, and that the two of them had become brothers in Christ. The gospel had reshaped their relationship already.\n\nPaul reminds Philemon of the truth of the transforming power of God’s grace at work in his life before he asks Philemon to now live by it (Philemon 4–7). The whole point of the gospel is that when Christ is the Lord of our lives, everything changes: how we see each other, how we react to those who have wronged us, and even what we should demand of them. This is hard, though, isn’t it? We often want to hold on to the ways we’ve been wronged. Why do we do that? If we are in Christ, the gospel overrules any other definition we may have of who we are to each other.\n\nFor love’s sake, Onesimus and Paul agreed Onesimus needed to be reconciled to Philemon. As his drive to escape led Onesimus to flee 1,200 miles to get away from Philemon, the drive to be reconciled now set him on a 1,200-mile return. But it wasn’t just Onesimus who needed to be set free. Paul would’ve been glad to keep him around, but there was a debt they owed Philemon. They owed it to Philemon to invite him to receive Onesimus as a brother. They couldn’t withhold this.\n\nForgiveness is the work of liberation. Every one of us has, at one time or another, been enslaved by someone else’s anger, bitterness, or disappointment, just as we have taken others captive by our own. This is where forgiveness comes in. To forgive is not merely to dismiss an offense. It is to release someone that we might both live in freedom.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-40.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 16:1-5, 2 Timothy 1:1-5, 1 Corinthians 4:17, Philippians 2:19-24, 1 Thessalonians 3:1-6, Psalm 133:1-3",
    "devo_title": "Timothy",
    "devo_summary": "What is your secret to success? I sometimes think my small successes come from my patience or my skill, or my grand intellect. The world applauds us and tells us that the road to personal success starts with our own bootstraps. But it just doesn’t ring true. While we certainly ought to be industrious and wise, genuine success isn’t rooted in ourselves. The only path to true and lasting success is found in the person of Christ.\n\nTimothy struggled with the issues of being a young minister in the church. Did he face parishioners who did not respect him because of his youth? Did he doubt his own calling and capability to fulfill it? Either way, Scripture clearly reveals that Timothy did not fix his hopes on his own talents, nor did Paul, his mentor and friend.\n\nPaul doesn’t comfort Timothy by saying “You’ve got this! You are worthy! You can do it!” His appeal isn’t to Timothy’s own abilities or personality at all. Rather, he simply calls Timothy to remain steadfast in faith, to commit himself to the faithful teaching of the Word, to hold on to the gospel. When the Word of truth is at the center, our age and confidence don’t matter. How others perceive us does not matter. We are called to preach only one thing: Christ, and Him crucified (1Corinthians 2:2). This is the true mark of ministry. It isn’t charisma, a nice personality, slick programs, or an impressive resumé. It is simply devotion to the gospel, to the Word, to Christ. And this comes only by the work of the Spirit.\n\nIndeed, Paul’s commendation of Timothy is always on this ground. He recognizes in Timothy the work of the Spirit, because he sees the genuineness of Timothy’s faith, which he has maintained since his youth. Furthermore, Timothy had proven himself a faithful minister as he served with Paul in the mission field. Timothy serves as a reminder of undistracted devotion to Christ.\n\nA second feature of Timothy’s ministry with Paul is its deeply personal nature. Note how often Paul addresses Timothy in familial and affectionate terms: he calls Timothy a “dearly loved” and “faithful child in the Lord” (2Timothy 1:2; 1Corinthians 4:17), a “brother” and “God’s co-worker” in the faith (1Thessalonians 3:2). His relationship to Timothy is one that fills him with thanksgiving and great joy (2Timothy 1:3–4), and has the quality of intimate kinship (Philippians 2:22). This, too, is a mark of the impact of the gospel. While it is true that “all seek their own interests, not those of Jesus Christ” (v.21), we see that Timothy, shaped by the gospel, has become like-minded with Paul, genuinely caring about the interests of the flock (v.20).\n\nTimothy’s life and ministry are a reminder of what it looks like to serve the gospel and what it means to be a child of God. Just as Timothy devoted himself to the Word and ministry and a heartfelt faith, serving with Paul “like a son with a father,” so should we walk before Christ, walking with the ministers of the gospel in our own time. Christ has accomplished for us the work of salvation, that we might be fellow heirs with Him, children of God (Romans 8:17). So then, brothers, let us walk as children of God, in sincere devotion to the faith.\n\nWritten by Caleb Faires",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-39.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 18:1-4, Acts 18:18-28, Romans 12:3-8, Romans 16:3-4, 1 Corinthians 16:19, Proverbs 10:17",
    "devo_title": "Priscilla & Aquila",
    "devo_summary": "Have you ever had a Priscilla or Aquila in your life? A godly older couple or mentor who knew the way of God and wanted to share it with you? It takes a lot of patience and humility to helpfully share what you know about “the way of God” (Acts 18:26). Some folks have a great deal of theoretical knowledge about the way of God, but don’t have the heart or the time to make an investment. Others are so intently walking the way of God (a good thing) that they forget to pause and invest in others along the way. Still others haven’t matured enough spiritually to start making those investments.\n\nA Priscilla-and-Aquila relationship is rare to come by. If you have the opportunity for spiritual mentorship of that kind, Scripture encourages it and affirms it—and you should certainly take advantage of it. On the other hand, it’s possible that God is calling you to be a spiritual mentor, to actively disciple a friend or acquaintance from church or your community. Is there someone that He may be asking you to take aside and explain the way of God?\n\nOne key approach that we can learn from these godly leaders in Acts is that “they invited [Apollos] to their home and explained to him the way of God more adequately” (Acts 18:26, NIV). For these two, discipleship and spiritual investment started with hospitality. The old adage is true here when applied to spiritual growth: “People don’t care how much you know, until they know how much you care.”\n\nPriscilla and Aquila made a kingdom investment through a simple act of hospitality and friendship. From the comfort of their home, they carefully explained the scriptures to Apollos, who became one of the greatest teachers and preachers of his day.\n\nIt’s worth noting that while it’s debated by biblical scholars, Apollos is thought by some to be the writer of the book of Hebrews. Now, if that were true, it only amplifies the impact of this couple’s discipleship of Cornelius. Can you imagine? I doubt Priscilla and Aquila ever expected that sort of canonical ripple effect. They were simply loving their brother in faith well, while protecting the integrity of the gospel.\n\nIt just goes to show that you may never really know the full impact of a discipleship investment you make in another. Let’s make sure we are faithful in taking advantage of every opportunity that God places in our path to be discipled and offer discipleship in this frenetic age. It requires intentionality and a slowing of pace, but the impact is immeasurable.\n\nWritten by Andrew Stoddard",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-38.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 6:1-3, Mark 3:20-21, John 7:1-5, 1 Corinthians 15:3-7, Acts 15:1-21, James 1:1, James 1:19-27",
    "devo_title": "James",
    "devo_summary": "My wife and I share a favorite word for our children’s arguments: snit. It perfectly captures the pettiness of so many little squabbles. We love our children very much, and we’ve spent the last thirteen years shepherding their hearts and minds. But with six kids we cannot get involved in every disagreement. And when it’s on the level of a snit, we rely on them to solve it on their own.\n\nDo you imagine that James and Jesus got into snits? If so, that must have been incredibly exasperating for James, because he would’ve been the only one bringing the snittiness to the conflict—Jesus was never at fault (2Corinthians 5:21).\n\nThe Bible doesn’t tell us much of Christ’s childhood, nor of the younger years of sibling relations, but during His early ministry we catch a glimpse of conflict. His siblings, who had grown up with Him, were at odds with Jesus’s bold claims. “He’s out of His mind,” they declared to the crowd, and sought to pull him aside (Mark 3:21). What else could they do to restrain their eccentric and possibly deluded brother? This was no longer a snit, after all, and I reckon James thought Jesus the one at fault.\n\nWhen James came to faith, following his brother’s resurrection, all signs of a possible rivalry and opposition disappeared. His epistle, which was the first letter written of the New Testament letters, is not focused on himself or his biological connection to Jesus, but rather on the marks of true faith. His call was to “pure and undefiled religion” (James 1:27), to a faith that was not mere lip-service.\n\nLike Christ’s exposition of the law in His Sermon on the Mount (Matthew 5–7), James’s epistle reminds us that the call to faith in Christ is not shallow and promiscuous, allowing us to snag salvation and then go about our merry way. Rather, faith in Christ is transforming. The power of the “implanted word” produces not only salvation, but good works; it opens our ears to hear, and shapes our will to do the work of the kingdom (James 1:21).\n\nWe are prone to make a religion of our own design, to tell ourselves that our version of faith is genuine and pleasing to God. But James reminds us that neither a mere outward show of faith, nor a faith without outward results is genuine. In the first chapter alone, James reminds us that true Christianity is marked by wisdom, genuine faith, humility, endurance, gratitude, self control, making us doers of the Word, upholders of the law, servants to the needy, and set apart from the world (James 1:5–27).\n\nJames’s own life was a record of the gospel’s transformative power. He once was offended by Jesus, and prone to his own kind of “envy and selfish ambition” (James 3:16), even pronouncing Jesus insane (Mark 3:21). What a glorious testimony to the power of the gospel! As we look at the life of James, we are met with the evidence of God’s grace, which transforms unbelief to firm faith, and petty ridicule to a thirst for righteousness. May God be so gracious to us also, that we may be increasingly conformed to the image of Christ.\n\nWritten by Caleb Faires",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-37.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 10:1-48, Galatians 3:27-29",
    "devo_title": "Cornelius",
    "devo_summary": "Cornelius’s conversion was no ordinary conversion. It symbolized the reach of the gospel to the Gentile world. Cornelius was a devout Gentile man who loved God. He was a centurion who used his power to care for Jewish people in his area. One day while he was praying, an angel of the Lord came to him and told him to send for Simon Peter, who was staying in a town not far away.\n\nPerhaps the greatest significance to Cornelius’s story in Scripture is the impact it had on Peter’s ministry as an apostle. The Lord had called Peter to be His witness in the world, commissioning him to proclaim a gospel that was meant to go out through Jerusalem, Judea, and Samaria, to “the ends of the earth” —meaning the Gentile world (Acts 1:8).\n\nIn those days, the line was clearly drawn between Jews and Gentiles. They were separated not only by belief, but by ceremony, diet, and a range of other religious and cultural practices. It would have been hard for even the most enlightened Jew to imagine full-on fellowship with Gentiles. And yet salvation in Christ was offered fully and equally to them both. Simon Peter would play a key role in the gospel reaching beyond the Hebrew people, and Cornelius would be the Gentile to receive the gospel from him.\n\nAs Cornelius’s servants were on their way to get the apostle, Peter had a vision of all kinds of clean and unclean animals being lowered in a sheet. The Lord said, “Get up, Peter; kill and eat” (Acts 10:13). Peter was incredulous. Never in his life would he defile himself in this way, by partaking of what was unclean. But the Lord said, “‘What God has made clean, do not call impure.’ This happened three times, and suddenly the object was taken up into heaven” (vv.15–16).\n\nThis vision was about more than food. It was about Cornelius, and by extension, the entire Gentile world. The Lord was using Cornelius to teach Peter how to take the gospel beyond his own people, and how to regard them as clean. After Peter’s vision, Cornelius’s servants arrived and asked him to come to Cornelius’s house to proclaim the gospel to them.\n\nWhile Peter was preaching to Cornelius’s family, the Holy Spirit came down in a way that was similar to Pentecost. In both cases, the Holy Spirit descended on everyone present, and they all understood each other, even though people were speaking in different languages (Acts 2:6, 10:46). God’s Holy Spirit saw no distinction between Jews and Gentiles, and here was the proof.\n\nWe see in the text that Peter struggled a little to believe what God was doing. He was still learning. Peter believed Gentiles could be saved without first converting to Judaism. But with Cornelius, he witnessed it firsthand, and it astonished him. God was expanding Peter’s understanding of the breadth and scope of His saving grace. And it all came back to one basic need every single person who has ever lived shares: the need for peace with God, which is accomplished alone through Jesus Christ. May God always expand our view of His grace, our love for the lost, and our passion for His presence.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-36.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 9:36-42, Romans 6:4-5, Ephesians 2:1-10, Proverbs 11:24-25",
    "devo_title": "Tabitha",
    "devo_summary": "Would you rather be known for the things you did or the things that were done for you? My guess is that most men, particularly in the West, would rather be known for the legacy we’ve left. We’d prefer that people remember us for the things we accomplished professionally, socially, or even in ministry. It sounds weak, deflating, or even (dare I say) “unmanly” to be known for the ways in which we were dependent on others to help us.\n\nTabitha’s story should cause us to reconsider this posture. Today’s passage tells us that Tabitha was “always doing good works and acts of charity” (Acts 9:36). She was known for what she did within the community. I can imagine when people talked about her, it was always with esteem and honor. Yet biblically she’s not known as much for what she did, as much as what was done for her.\n\nWhen we encounter Tabitha’s story, we realize we’ve encountered a corpse. She’s dead! The apostle Peter happens to be in town, and through the powerful work of the Spirit of God in him, Tabitha is raised to life again. “This became known throughout Joppa, and many believed in the Lord” (Acts 9:42). She was returned from the grave to life, able to continue on “doing good works and acts of charity.” And that’s her story in Scripture.\n\nIt’s our story as well. Our reading in Ephesians today tells us that we were in the same condition: spiritually dead. There was no spiritual life happening, no resolute will we could exercise, no power we could employ to lift our hand to God and get His attention. We were dead in our trespasses and sins. “But God, who is rich in mercy,” raised us to life again by his grace (Ephesians 2:4). He came to us, as if we were dead on our backs, and breathed new life into us that can never be taken away.\n\nSome men try to live life seeking to be known for what they’ve done. Spiritually speaking, that won’t work with God. Because of our stone-cold-dead spiritual hearts, we have no good works. We have no deeds that will earn us God’s attention and favor. The argument of, “Look what I’ve done to enter heaven,” is not enough. Dead men don’t do works of any kind.\n\nYet for those who, like Tabitha, are known by what God has done for us, we’ll find the joyful embrace of our Father in heaven. All we must do is trust His Word and the promises He’s made within it. Everyone who believes in the Lord Jesus Christ will be saved. Everyone who turns to Him by faith—not their own deeds—but by faith in Christ’s deeds, will be raised to life again one day.\n\nSo today, trust Christ. Turn from your sin, embrace Jesus by faith, and be raised to life spiritually to be full of good works and acts of charity that glorify Him. Those who are raised alive in Christ are God’s “workmanship, created in Christ Jesus for good works, which God prepared ahead of time for us to do” (Ephesians 2:10).\n\nWritten by Jeremy Writebol",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-33.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 9:1-30, Acts 13:1-12, 2 Corinthians 11:18-31, 2 Timothy 4:6-8",
    "devo_title": "Paul",
    "devo_summary": "Is there someone in your life you pray would experience the transforming power of the gospel—peace with God, a clear conscience, and a sense of purpose and hope? Have you ever doubted such a transformation could be possible for someone whose heart was so hard toward God that all they felt toward the Church was hate?\n\nJesus can reach even the hardest heart, and we need look no further than the story of the apostle Paul for proof. Paul didn’t just oppose Jesus; he wanted to see everyone who preached about Him die. We’re talking about more than mere desire here. Paul got permission from the religious authorities to hunt down Christians and oversee their trials, which would end in martyrdom. Paul made it his mission to rid the earth of the Body of Christ.\n\nAs Paul was on his way to Damascus to arrest Christians, Jesus appeared to him on the road and struck him blind. As Paul groped around in the dark, Jesus said, “Saul, Saul, why are you persecuting me?” (Acts 9:4). In response, Paul asked, “Who are you, Lord?” and after Jesus revealed Himself, He told Paul to go into the city, where he would be told what to do (vv.5–6).\n\nWhat did the Lord want Paul to do? He wanted him to become His apostle to the Gentile world. And that is just what happened. Paul gave the rest of his life, until his death at the hands of Rome, to proclaiming Christ, establishing churches in Galatia, Philippi, Thessalonica, Corinth, Colossae, Ephesus, and many other cities and villages throughout the Roman Empire.\n\nJesus didn’t just transform Paul from someone who persecuted the Church to someone who didn’t. He took this man who was so singularly devoted to the Church’s destruction and made him into a man who would play a greater role in expanding the Church than anyone else from his era.\n\nI have people I pray for every day, asking the Lord to transform their hearts and open their eyes to His grace. And if I’m honest, sometimes I feel like my prayers are asking too much. But when I look at the life of the apostle Paul—the author of Galatians, Colossians, Romans, Ephesians, and many other books in the New Testament—I see the power of Christ at work in the life of a man whose heart was as hard as they come. So I pray again, because if the Lord can transform a man like Paul as He did, He can do the same for anyone. He has even done it for me.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-32.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 8:5-8, Acts 8:26-40, Isaiah 56:1-8, 1 Peter 2:9-10",
    "devo_title": "Philip & the Ethiopian Official",
    "devo_summary": "My best friend’s mom (let’s call her “Debbie”) gave me my first Bible on my sixteenth birthday. At the time, I was pretty skeptical about this Jesus character, and I was seeking answers to life’s questions anywhere and everywhere—except the Bible. I was pretty confused by her present, and to tell the truth, I would’ve preferred a gift certificate to a local music store where, yes, physical copies of CDs and cassettes are sold. (Remember those?) But I’m not a monster, so I thanked her for the gift and promised to look through it with an open mind. Over the next several years, she would answer my many questions about the Bible, describing for me the power and beauty of Jesus Christ.\n\nDebbie welcomed me into her home day after day as one of her own, and almost twenty-five years later, she still refers to herself as my “other mother.” Even then, she loved me in spite of my flaws and many mistakes, meeting me right where I was, and from there, walking beside me through some really difficult times. Because of her indefatigable love and compassion, I trusted her, and it’s because of my trust in Debbie that I was willing to crack open that Bible and see what I could find. Indeed, I found everything.\n\nWhen a person of mighty faith encounters someone whose heart is open to the possibility of God’s presence, amazing things happen. All it takes is patience, trust, love—and listening to the call of the Holy Spirit (Acts 8:29). Like Philip in today’s passage, Debbie was obedient to God’s calling, she trusted Him to open my eyes to His Word, and she loved me despite the obstacles of my skepticism and confusion about God. Like the Ethiopian official, I was willing to ask for help. In other words, she showed up, and because of the trust she engendered in me, I let her in.\n\nIn today’s passage we learn that “Philip proceeded to tell [the Ethiopian official] the good news about Jesus, beginning with [the] Scripture” he’d been reading when Philip met him (Acts 8:35, 32–33). We should note that Philip didn’t launch into some pre-packaged speech, but instead began their conversation with the very Scripture that was giving the Ethiopian official some trouble, meeting him right where he was on his own faith journey. Philip put aside any agenda he may have had and let the Holy Spirit guide him through what I imagine was a beautiful exposition of God’s love illustrated by the good news about Jesus. The Ethiopian official certainly seems to have responded favorably to Philip’s patient explanation given that he asked Philip to baptize him right there on the spot, at the first sight of water (Acts 8:36). What a powerful and intimate moment, that God’s love would be on grand display as one man welcomed another out of the darkness and into the marvelous light of God’s family and eternal kingdom (1 Peter 2:9–10).\n\nWritten by Alex Florez",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-31.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 6:1-15, Acts 7:1-60, Psalm 23:4",
    "devo_title": "Stephen",
    "devo_summary": "A fundamental part of being human is our creation and understanding of coherent life stories. The circumstances that bring great joy to us or cause the deepest sense of shame can be found in our perception of what constitutes the good life, and how our own life story is aligning with that perception. The central emotional core of a person or even a group can be discovered in the stories they find themselves in and how they interpret those stories. Sometimes, a challenge to the guiding story of a culture can result in the deepest intolerance, primal anger, and even murder.\n\nMeet Stephen, a leader of the church in Jerusalem, one chosen by the apostles to serve. Stephen is culturally Greek and a Jewish convert to Jesus Christ. In his outreach effort to other Greek-speaking Jews of Jerusalem, as well as before the religious ruling council, he implores them to remember the story of their people—and also includes a firm rebuke.\n\nStephen’s attempt to defend and persuade reaches back more than two thousand years and recounts the great redemptive story, which of course, includes those to whom he is speaking. He starts with Abraham and ends with the religious leaders’ rejection of Jesus as the Messiah. However, it is Stephen’s critique of the historic pattern of idolatry, their failure to truly follow the law of Moses, the rejection and murder of God’s prophets and now Jesus, that enrages them.\n\nIt’s Stephen’s interpretation of the story of God’s plan that brings about their rage. His faithfulness to stand firm and share the true gospel and point to the real Savior places him in extreme danger, and abruptly leads to his death by stoning. Was his life a waste and his death in vain? Absolutely not. Stephen’s martyrdom acted as the catalyst to push the early Christians out of Jerusalem and into the world. In his moment of greatest suffering, he was given a vision of Jesus Christ, prompting him to say: “‘Look, I see the heavens opened and the Son of Man standing at the right hand of God!’” (Acts 7:55–56). And as he dies, he prays for those who are killing him:\n\n“Lord, do not hold this sin against them!” (Acts 7:60).\n\nHis words are similar to the words Jesus said while He was suffering on the cross (Luke 23:34); Stephen dies a martyr’s death that continues the work of God. Despite this violent murder scene initiated through false accusation in the most amazing and paradoxical way, Stephen’s prayer, “Lord, do not hold this sin against them”—an echo of Jesus’s own prayer—continues to be answered, as the enemies of God are lovingly and radically reconciled to Him (Romans 5:10).\n\nWritten by Robert Wheeler",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-30.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 14:1-11, John 20:24-29, Hebrews 10:36-39, Hebrews 11:1-2",
    "devo_title": "Thomas",
    "devo_summary": "It is easy to look at the disciples and wonder how they could’ve been so slow to understand who Jesus was. How could they have doubted Him? He was right in front of them. But we have the advantage of being on this side of the resurrection, so we can see the whole story arc of Scripture. And some of us still have the propensity to doubt! Had we been with the disciples, we likely would’ve been just like them.\n\nWhile Peter was the most bold and outspoken of the disciples, Thomas was the most consistent in his struggles to believe. In John 14, in the middle of the upper room discourse, Jesus is assuring His disciples that He will come again, and gives His final encouragement and charge to them just before being arrested. Immediately after Jesus says definitively, “If I go away and prepare a place for you, I will come again and take you to myself, so that where I am you may be also,” Thomas pipes up with a doubter’s question, asking how they could know where Jesus was going or how to get there (John 14:3–5). Jesus’s response leaves little room for doubt:\n\n“I am the way, the truth, and the life. \n\nNo one comes to the Father except through me. \n\nIf you know me, you will also know my Father. \n\nFrom now on you do know him and have seen him” (vv.6–7).\n\nTwice in four verses Jesus makes declarations of His lordship and of the way of salvation. Yet Thomas still hesitated to believe. Scripture defines faith as “the reality of what is hoped for, the proof of what is not seen” (Hebrews 11:1). This is what Thomas was missing, the thing he lacked: what he could not see, he could not believe. He was a disciple, one of Jesus’s closest friends for three years. He was with Jesus at His arrest and with the rest of His followers after His death. He was a true follower of Christ, but he struggled to believe.\n\nAfter Jesus rose from the dead, He appeared to the rest of the disciples, but Thomas was absent. When the other disciples told him about their encounter with the risen Lord, Thomas said, “If I don’t see the mark of the nails in his hands, put my finger into the mark of the nails, and put my hand into his side, I will never believe” (John 20:25). Maybe he said this with arrogant defiance, but it seems more likely that he yearned to believe and simply could not. He had followed Jesus to the very end, but he did not know how to follow Him further.\n\nSo Jesus did what He does with seeking doubters: He gave Thomas reason to believe. He appeared again and showed Thomas His wounds, but He did not stop there. He wouldn’t let Thomas stagnate as a doubter. With the same clarity as He spoke in the upper room, Jesus declared:\n\n“Because you have seen me, you have believed. \n\nBlessed are those who have not seen and yet believe” (John 20:29).\n\nHe was summoning Thomas, and everyone who reads these words, to faith, for His “righteous one shall live by faith,” which is how He calls us to live (Hebrews 10:38).\n\nWe have the whole of Scripture, yet we still doubt. Like Thomas, we struggle to follow Jesus, who we forget is always with us (Hebrews 13:5; Psalm 46:1). And so Jesus’s words are for us too. He is preparing a place for us to be with Him (John 14:3). He is the way, the truth, and the life (v.6). And we are blessed if we believe without seeing, by faith.\n\nWritten by Barnabas Piper",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-29.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Matthew 27:15-31, Acts 3:1-16",
    "devo_title": "Barabbas",
    "devo_summary": "On the day Jesus was condemned to die, another man, Barabbas, was released from custody for the crimes he had actually committed. What little we know of Barabbas from the four Gospels is not flattering. In the book of Matthew, he’s a notorious criminal (Matthew 27:16); Mark and Luke call him a “murderer” who participated in a rebellion (Mark 15:7; Luke 23:19); and John’s account equates him with a robber or a bandit (John 18:40).\n\nKnowing little else about Barabbas, I’m left to fill in the gaps with my imagination. I picture him in chains, hearing the crowds chant his name just as the guards approach him, grunting out, “Pilate wants to see you.” Maybe he assumes that this is the end of the road: a swift and guilty verdict, followed by execution. He squints as he steps into the sunlight, noticing another prisoner standing before the crowd. Perhaps later he’ll reflect on this moment, but for now, all that registers is the cacophonous crowd and the pit in his stomach at the sight of the governor, the man whose judgment can end his life with a single word.\n\nI wonder what he thought about in his presumed final moments? With the hand of justice tightening around his throat, does he regret his actions or simply that he was caught? Is he ready to fight his sentence or submit to it?\n\nBut then, in a surreal moment that Barabbas himself might never come to understand, the crowd erupts into a frenzied cheer as Pilate raises a hand in his direction; instead of leading him to his execution, the guards release him to the mob whose thirst for blood has shifted to another man: “JESUS OF NAZARETH, THE KING OF THE JEWS” (John 19:19). The rest of Barabbas’s life remains lost to history.\n\nBarabbas walked away a free man that day, making it easy to judge him as a hopeless criminal who literally got away with murder. But if I’m honest, I see that I have something significant in common with Barabbas: a lifetime’s worth of thoughts, words, and deeds that fall infinitely short of God’s glory and should condemn me to exist apart from His presence forever (Romans 3:23). But instead, Jesus died in my place—He died instead of me. It was His blood that pardoned me and set me free. And so these words from the apostle Peter feel as if they’re directed just to me:\n\n“You denied the Holy and Righteous One and asked to have a murderer released to you. \n\nYou killed the source of life, whom God raised from the dead; \n\nwe are witnesses of this” (Acts 3:14–15).\n\nJesus took my place on the cross that day, and so, in a very real way, it was I who killed Him. But if He died at my hands, He was raised to life by God’s, and I recognize that I share in that part of the story too. Like Barabbas, my guilt has been stricken from the record, the bloodstains on my hands washed clean away. I don’t know what Barabbas did with his freedom, but with mine, I cling to the hope of glory offered by the one who set me free.\n\nWritten by Alex Florez",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-26.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 18:28-40, John 19:1-22, Psalm 2:1-12",
    "devo_title": "Pilate",
    "devo_summary": "The Church has faced many foes over the centuries. Some of them came in the form of government leaders who sought to persecute and destroy the Church, while others came from those who appeared to be friendly, but who instead brought in destructive doctrines that harmed the Church from within. Throughout history, the Church has faced down depressions, wars, famine, and disease, yet she always continues to grow and march forward.\n\nThis year has brought with it words like “COVID-19” and “quarantine,” things we never could have imagined becoming a regular part of our vocabulary. I work as both a teacher and a pastor, and this season has forced me to learn how to do both in completely new ways. This past spring, I had to figure out how to teach, disciple, and minister to a flock comprised of many who do not have Internet or social media access, and many whose homes I should not enter because they are more susceptible to the disease. Churches and pastors are concerned about how this will affect their church’s ability to minister and survive. Families are hurting. People are in great need, and we don’t know what even the next few months may hold.\n\nIn the midst of this uncertainty, I drew immense encouragement from today’s readings. Pilate thought that he stood before Jesus as one who had the authority to let Him live or die. What he did not know was that the Creator of life and the One who was about to defeat death was standing there before him. Pilate clearly wanted no part of the sham trial in which he had been forced to participate. He faced intense pressure from the Pharisees and chief priests to put Jesus to death, and while he could find no fault in Him, he was ultimately afraid of the people’s word against him before the Roman government. And so he handed over the Son of God to be crucified in order to pacify a blood-thirsty crowd.\n\nPsalm 2 provides us with a glimpse into how heaven views these foolish attempts to usurp the power of God and His Son. Human rulers have no power at all before God. When Pilate asked the people if he should crucify their King, he asked more than he ever could have imagined. Rather than putting another pretender to the throne to death, Pilate had sentenced God’s anointed King—the Son who would receive the nations as His inheritance—to die like a common thief.\n\nIn sending Jesus to His death, Pilate did not know that he and every human ruler were about to be exposed as the powerless, dependent creatures they really are. Pilate did not have power over life and death, but Jesus did, defeating death when He was raised from the dead.\n\nOnly God knows what trial each of us will be facing as we read this. Whatever it may be, let me assure you of this: the real King is on His throne. Whatever circumstances we may be facing, whoever may be lined up against us, whatever pain life may throw our way, none of it catches our Father off guard, and He is working it all together for the good of those who love Him (Romans 8:28). The King is strong and the King is good, and you can trust Him today.\n\nWritten by Scott Slayton",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-25.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Matthew 10:1-4, Luke 22:1-6, Matthew 26:17-25, John 13:2-29, Matthew 26:47-50, Matthew 27:3-10, Romans 2:5-8",
    "devo_title": "Judas Iscariot",
    "devo_summary": "While writing her play about Jesus, The Man Born to Be King, Dorothy Sayers struggled to understand what drove Judas. She asked, “What did the man imagine he was doing? He is an absolute riddle. He can’t have been awful from the start, or Christ never would have called him.”\n\nHe was a riddle. We know Judas was greedy and that he skimmed off the top (John 12:6). But the money the chief priests offered in exchange for Jesus, thirty pieces of silver, hardly compensated for the three years he spent following Jesus. Though no one can really say conclusively all that drove Judas, there are some things we do know. First, we know the man he seemed to be. He seemed to be a devoted disciple who did the same things as the others. He had concealed his duplicity so well that when Jesus declared one of the disciples would betray Him, no one immediately pointed in Judas’s direction.\n\nSecond, we know he acted under the influence of Satan. John tells us it wasn’t just that Judas was indifferent to Jesus. He was acting in collusion with the devil (John 6:70; 13:2, 27). Think of all he saw and heard: every miracle, parable, and act of mercy. Neither Jesus’s words nor His actions penetrated Judas’s heart. He was a riddle, to be sure, part pragmatist, part pretender, part conspirator. Maybe even he couldn’t even explain his own reasons.\n\nDuring the last supper, when Jesus offered Judas bread, it was a gesture of love, an opportunity to consider their history together. But Judas’s mind was already made up. He took the bread from Jesus’s hand and then he left. Everyone likely figured since he kept the money, he was off to settle a tab or give the customary Passover alms to the poor on their behalf. They were wrong.\n\nAs one who saw this moment unfold, John tells us what was really going on as Judas disappeared: “After receiving the piece of bread, he immediately left. And it was night” (John 13:30). Light and darkness are prevalent symbols throughout John’s Gospel. He often spoke of Jesus as the Light of the World (John 1:9; 3:19; 8:12; 9:5; 11:9; 12:46). John described Judas as a man abandoning the Light of the World to step into the darkness. The next time the two would meet would be later that night when Judas arrived at Gethsemane with a band of soldiers.\n\n“Friend,” Jesus asked him, “why have you come?” \n\nThen they came up, took hold of Jesus, and arrested him (Matthew 26:50).\n\nJesus knew full well why Judas had come, yet He kept the door open for reconciliation until the end. But Judas wouldn’t have it.\n\nIs Christ offering you reconciliation today? If you are a pretender, it’s possible the only ones who know it are you and Jesus. There is grace and joy to be found in Him, but this isn’t a game. Judas reminds us that we can sit under solid teaching, spend time with believers, even participate in ministry, and still be a fraud. Being known as a Christian and loving Jesus can be two entirely different things.\n\nAs you see Judas go out into the darkness, may you also see Jesus, the Light of the World, remain unshakably dedicated to His mission to die in your place. He loves you. Do you love Him?\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-24.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 10:38-42, John 11:19-27, John 12:1-8, Psalm 16:1-11, Psalm 27:4",
    "devo_title": "Martha & Mary",
    "devo_summary": "It’s amazing to me how different the personalities of siblings can be. My brother and I have the same genetic makeup from our parents, the same receding hairlines, and the same eyesight in need of significant correction—yet our personalities are very different.\n\nBrian is the smart and adventurous type—a hands-on, mechanical guy. When we were kids, he was less inclined to participate in the “normal” team sports like football and basketball, preferring the outdoor adventures of mountain biking and summiting 20,000-foot mountains, or taking stuff apart just so he could put it back together again. I, on the other hand, enjoy picking apart an argument in a book. I’m the guy who follows team sports, and while I have climbed to 15,000 feet, I’m more apt to studying the subjects of the humanities: history and theology, and an occasional philosopher or two. My brother and I are a lot alike, but we’re also very different individuals.\n\nMary and Martha present the same sort of contrast, especially in their spirituality. Luke describes the time Martha and Mary were hosting Jesus at their home. Certainly, they were close friends, and having Jesus over didn’t seem unusual. But on this particular occasion, one sister, Martha, was busy preparing the meal and getting things ready. Mary, on the other hand, was sitting and listening to Jesus teach, in the place of a disciple. Instead of doing the work expected of the women in preparation of the meal, she was at the feet of Jesus, listening, learning, and receiving. Instead of trying to feed Jesus, she was being fed by Him. However, her sister, Martha, “was distracted by her many tasks,” her frustration obvious as she asked:\n\n“Lord, don’t you care that my sister has left me to serve alone? \n\nSo tell her to give me a hand” (Luke 10:40).\n\nWhile the differences between these two women stand out, their faith in Christ as the “resurrection and the life” (John 11:25), and their devotion and expressions of love to Him demonstrate that they were committed to the same pursuit: honoring and loving Jesus with all they had. Could that be the lesson for us? Could we be as bold in our devotion, service, humble learning, and trust of Jesus as these women were?\n\nBoth women cried out to Jesus, mourning the death of Lazarus: “Lord, If you had been here my brother would not have died” (John 11:21, 32). Their grief showed itself in their shared family traits: a bold, responsive, trusting faith in Jesus. And Jesus met them in their sorrow.\n\nThat faith built upon itself as Mary displayed her understanding of the work of Jesus, anointing His feet with luxurious, expensive oil, as if to prepare Him for His burial—this, too, was an act of worship and devotion (John 12:1–8). Mary understood that “one thing is necessary”—Jesus—and she chose Him above all else (Luke 10:42).\n\nThough the faith of these women is shown in different ways, it is strong all the same. They held back nothing to follow Him and love Him. Could we be more like them in our own pursuits of Christ?\n\nWritten by Jeremy Writebol",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-23.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 11:1-18, John 11:28-44, 1 Corinthians 15:12-18, 1 Corinthians 15:55",
    "devo_title": "Lazarus",
    "devo_summary": "It was a huge surprise when I heard that a dear friend and his wife had contracted COVID-19. A disease that had previously involved masses of unnamed people around the globe immediately struck close to home. They are just a short drive from us, and before the quarantine, it was common for us to meet up for lunch or coffee together. Instantly, this is no longer a faceless disease affecting thousands around the world—now, it has affected my close friends! My experience with this illness is no longer something I can hold at arm’s length.\n\nIt seems there is a moment in each human life when the myth of our own invulnerability comes to an end. We become keenly aware of our own fragility and mortality. Nothing threatens our perceived sense of control quite like a severe illness and the possibility of death. Sickness and death have been part of every human’s existence from the beginning of life, and yet these inevitabilities still take us by surprise. Every sickness strikes at an inopportune time, and the loss of a friend is always premature. We are to do battle with these foes, and yet we know that every single one of us will succumb at some point—our lives will end. It is often during these seasons of illness and loss that we are most aware of Jesus’s care.\n\nHis experience with sickness and death is not removed from the same sort of emotional pain and loss that we feel. It can be tempting to imagine Jesus going about His life without the same sort of pains that we experience. His relationship with two sisters and their brother shows us the extreme care and sensitivity He has toward His friend’s suffering, sickness, and death.\n\nMeet Mary, Martha, and Lazarus, three siblings who had a unique and special friendship with Jesus. Theirs was a noteworthy connection, and their home and hospitality played an important role in His life. When Jesus hears about the serious illness of His dear friend, Lazarus, He prepares for the four-day journey that will take Him from relative safety into much more danger, saying:\n\n“Our friend Lazarus has fallen asleep, but I’m on my way to wake him up” (John 11:11).\n\nHis disciples warn Him of the imminent danger. They know that journeying to this region will likely result in His death and perhaps even their own. And they are correct; in the most practical way, Jesus lives out His own teaching, eventually laying down His life for His friends, for us—”no one has greater love than this” (John 15:13).\n\nWe know what happened to Lazarus. It is thrilling and shocking, and it reveals so much about the unique authority Jesus Christ has over death. On a closer look, there is also something particularly compelling and beautiful about the quality of the self-giving friendship between Jesus and these three siblings. The sisters ask their good friend to take the four-day journey back to help the one He loved. And Jesus answers in the affirmative, ready to take on the days of travel toward His own danger, rejection, suffering, and death. Jesus loves His friends. He goes to them and is deeply moved by them. He suffers with them and will suffer for them—and they weep together.\n\nWritten by Robert Wheeler",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-22.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 19:1-10, Leviticus 6:1-7, Matthew 6:19-24, Hebrews 13:5, Galatians 3:7",
    "devo_title": "Zacchaeus",
    "devo_summary": "For those of us who grew up attending Sunday School, the name Zacchaeus calls to mind a cutesy tune about a “wee little man,” who “climbed up in a sycamore tree, for the Lord he wanted to see.” But we’re a bit hazy on the rest of the story. We might have missed the point that Zacchaeus’s story is much more significant than simply a tale of a tiny guy climbing a tree and meeting Jesus.\n\nZacchaeus was a tax collector, meaning he was in league with the hated Roman Empire, and a thief who overcharged his fellow Jews, skimming the profits for his own benefit. Throughout the Gospels we read of “tax collectors and sinners” as a group of despised, loathsome people hated by God-fearing Jews for their immorality. Zacchaeus was chief among them. So when Zacchaeus made the decision to climb a sycamore tree to see Jesus, he was discarding what little dignity he had left.\n\nBut that is not the truly surprising part of the story. When Jesus saw him, He called Zacchaeus by name, as one who knew him, and said, “Hurry and come down because today it is necessary for me to stay at your house” (Luke 19:5). After all, He did not come to call the righteous, but to call sinners to repentance (Luke 5:32).\n\nIn the face of judgment and complaint, Jesus went to Zacchaeus’s home. The text has little to say about their conversation; it simply records the transformation that took place. Zacchaeus willingly offered up half of his wealth for the poor and promised to repay everyone he had extorted four times what he had initially taken (Luke 19:8). By Jewish law, a just repayment would have been full repayment with a twenty percent penalty (Leviticus 6:5). But Zaccheus offered a four hundred percent repayment, because true repentance is not just ceasing to sin, but turning away from it altogether and hating it. When Jesus heard this from Zacchaeus He simply said:\n\n“Today salvation has come to this house… \n\nbecause he too is a son of Abraham. \n\nFor the Son of Man has come to seek and to save the lost” (Luke 19:9–10).\n\nBy declaring this, Jesus was calling Zacchaeus a true child of God, a person of true faith (Galatians 3:12). This was a man turning from the idol of money to follow Jesus no matter the cost. He was no longer putting his faith in wealth but trusting that God would never leave him or abandon him (Hebrews 13:5). Rather than hoarding wealth that would rot away, Zaccheus began storing up treasures in heaven (Matthew 6:19).\n\nIn truth, Zacchaeus’s small stature matters little in his story. Only his change of heart matters. His change of Lord matters—from that of money to Jesus (Matthew 6:24). He is a picture of true and deep repentance and the lasting transformation it brings.\n\nWritten by Barnabas Piper",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-19.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 10:17-31, Luke 12:16-21, Ecclesiastes 5:8-20",
    "devo_title": "Rich Young Ruler",
    "devo_summary": "In 2009, I was a senior in high school, and I knew exactly what I wanted to do with my life. I wanted to study computer science at an elite institution and go work for Google or one of the other Silicon Valley behemoths. I wanted to change the world, sure, but I also wanted to make truckloads of money. I wanted to be a Christian, too, but just as an added feature to my life, because more than anything, I wanted to make lots of money—with a side of maybe changing the world along the way. I was aspirationally rich, so to speak, but not unlike the young man we read about in today’s passage.\n\nIn Mark 10, we meet “the rich young ruler,” who approaches Jesus about what it takes to inherit eternal life (vv.17–22). This wealthy young man runs up to Jesus and asks, “Good teacher, what must I do to inherit eternal life?” (Mark 10:17). Jesus responds by listing some of the laws required for following the Lord, and the rich young ruler testifies that he does not break these laws, that he has “kept all these from [his] youth” (v.20). What follows is a tremendous scene of Jesus’s love and the young man’s disappointment.\n\n“Looking at him, Jesus loved him and said to him, \n\n‘You lack one thing: Go, sell all you have and give to the poor, \n\nand you will have treasure in heaven. Then come, follow me.’ \n\nBut he was dismayed by this demand, and he went away grieving, \n\nbecause he had many possessions” (Mark 10:21–22).\n\nJesus loved this young man enough to tell him the truth—that not even keeping all of the commandments is not enough to be saved—news that would’ve been difficult for him to hear and receive in that moment. In order for the man to inherit eternal life, he must be willing to give up what he values most in his present, earthly life: his riches.\n\nSo much can be gleaned from Jesus’s interaction with the rich young ruler, first and foremost being that it is difficult for the rich to enter the kingdom of God (Mark 10:23–31). Not because it’s a sin to be rich, but because wealth often comes with a love of money and sense of independence that can become greater than a love for God (Matthew 6:24).\n\nMore broadly speaking, when we read this man’s story, we ought to ask ourselves: What part of my life am I unwilling to give up in order to follow Jesus? What do I love more than I love Him? Following Jesus costs us everything. Even good things we love. The entirety of our lives must be submitted to His lordship. Don’t turn away sad like the rich young ruler. Joyfully lay down your worldly possessions for a life of following Him.\n\nWritten by Chris Martin",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-18.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 10:46-52, Psalm 146:1-10, Isaiah 42:1-8, Romans 4:3-5",
    "devo_title": "Bartimaeus",
    "devo_summary": "To follow Jesus is to leave another world and way behind.\n\nWith the Passover drawing near, Jesus and His followers stopped in Jericho to gather supplies for the last eighteen miles of their pilgrimage into Jerusalem. As they left the city, a large crowd followed (Mark 10:46).\n\nA blind man named Bartimaeus sat outside the city gate begging (Luke 18:35). In that day and age, his condition doomed him to a life of poverty and darkness. This was the nature of the world he inhabited. Blindness dictated that he’d be a beggar for life, helpless at the gates, living off the charity of other men and women.\n\nBartimaeus, who experienced the world through the sounds and the silences of the people around him, sat up when he heard the large, enthusiastic crowd flood the street by which he sat. He called for someone to tell him what was happening. “Jesus of Nazareth is coming,” someone said. Sitting up in excitement, Bartimaeus cried out, “Jesus, Son of David, have mercy on me” (Mark 10:47).\n\nAs he cried out for Jesus’s mercy, the crowds told him to be quiet (Luke 18:39). But Bartimaeus believed the prophets who said that “everyone who calls on the name of the Lord will be saved” (Joel 2:32), so he dug down deep and cried out even louder, “Son of David, have mercy on me!” Though they’d never met, Bartimaeus believed this serendipitous encounter on the road outside of Jericho could very likely be the moment where God would exchange the ashes of his life for beauty, and he did not want to let this hour of the Lord’s favor pass him by (Isaiah 61:2–3).\n\nJesus called for him, and springing to his feet, Bartimaeus threw down his cloak that held the proceeds of that day’s begging and took the hand of a man who led him to Jesus (Mark 10:50).\n\n“What do you want me to do for you?” Jesus asked him.\n\nBartimaeus did not hesitate: “I want to see” (Mark 10:51).\n\nHe didn’t want money. He didn’t want honor. He wanted his eyes opened. Bartimaeus saw Jesus as the one man who could do for him something no one else could. He knew he was asking for more than the gift of sight. If Jesus were to heal Bartimaeus, He would strip away the man’s means of income, his place in the community, his daily routine, his identity. Bartimaeus understood this, but who else could deliver him? (Romans 7:24). And when Jesus did heal him, He said, “Receive your sight… Your faith has saved you” (Luke 18:42–43; Mark 10:52).\n\nTo Bartimaeus, his way was now wherever Jesus was, and so he began to follow Him, glorifying God (Luke 18:43). This moment was so much more than a miracle for Bartimaeus. It was a conversion. He didn’t just put his faith in Jesus; he put his life in Jesus’s hands, leaving everything behind to follow Him.\n\nMany come to Jesus thinking He can do wonderful things for them, but when people come asking for a new life few realize this means they must leave their old one behind. And yet, no matter what is left behind, what is given in exchange is infinitely greater.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-17.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 9:1-8, Mark 10:35-45, 1 John 1:1-4, Revelation 1:9-20",
    "devo_title": "John",
    "devo_summary": "There are many incredible stories of personal transformation in the Bible, but perhaps one of the most overlooked is that of the apostle John. Along with his brother James, John was one of the most boisterous and strong-headed disciples. It’s likely that’s the reason Jesus called these two sons of Zebedee “the Sons of Thunder” (Mark 3:17)—which has got to be one of the best nicknames in the entire Bible.\n\nThese two brothers caused quite a stir among the other disciples when they asked to be seated at the right and left sides of Jesus upon entering heaven (Mark 10:35–45). Maybe it was misguided passion that caused the brothers to ask for this honor, but it came across as youthful arrogance. Their boneheaded request stirred up indignation from the rest of the Twelve. It also earned them a strong rebuke from Jesus in the form of a sermon about humility, explaining that “even the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many” (v.45).\n\nJohn witnessed the major miracle moment of Jesus’s transfiguration (Mark 9:2–8), one that helped equate Him with His Father in heaven, and during His crucifixion, Jesus personally instructed John to watch over His mother Mary once He was gone (John 19:16–27).\n\nIn his older years, John likely had plenty of time to mull over all of these experiences and life lessons. Out of the Twelve, only John would live to old age. Tradition holds that each of the other apostles were martyred because of their faith.\n\nI imagine John played these significant memories in his mind over and over again as he wrote the Gospel and epistles that bear his name. These are the events that shaped not only his life but also the early Church. I wonder if, in his final days, John pondered why he, among all the disciples, was not sentenced to death as a martyr. Surely he missed his friends, his brother, and his Savior. Toward the end of his life, John was exiled to the Greek island of Patmos for preaching the gospel. This is where he would write the book of Revelation. The words and revelation given to John after his extensive life experience are also a gift to us, thousands of years later.\n\nJohn is an example of what it’s like to be radically transformed by God’s love, regardless of occupation or station in life; God uses us all to build and grow His Church. John was transformed from a headstrong, perhaps self-serving, young disciple into a faith-filled and faithful old man with the gift of memories from Christ’s earthly days, of witnessing His Savior’s ministry firsthand. His story exemplifies the life-changing power of Christ’s love.\n\nWritten by Robert Carnes",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-16.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 8:1-3, Mark 15:37-47, John 20:1-18, Colossians 1:9-14",
    "devo_title": "Mary Magdalene",
    "devo_summary": "Some of the most precious words in all of Scripture are “and such were some of you” (1Corinthians 6:11, ESV). After listing categories of people who would not inherit the kingdom of God, Paul reminded the Corinthians that they, too, once fit in these categories. “But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God” (v.11). The shame of their past lives had been redeemed and cleansed by the work of the Lord Jesus.\n\nI cannot help but think of these words from 1 Corinthians 6 when I read the narrative of Mary Magdalene’s interactions with Jesus. When we meet Mary in Luke’s Gospel, she is with Jesus and the Twelve as He is “telling the good news of the kingdom of God” (Luke 8:1–2). From this passage, we’re told she was a woman from whom seven demons had gone out (v.2), which means that when she first encountered Jesus, she was demon-possessed. But now here she is, standing alongside Him as He preaches the good news.\n\nMary demonstrated the new life she had found in Jesus by her faithful service to Him. Mark reports that she was one of the women who “followed him and took care of him” (Mark 15:41). When Jesus hung on the tree, she did not abandon Him, but instead stood there watching with other women as her Lord gave His life (John 19:25). And before daybreak on the morning of the resurrection, she discovered that the stone sealing His tomb had been rolled away and ran to share the news with the disciples (John 20:1–2). After His resurrection, Jesus appeared to her and entrusted her with the task of telling the disciples about His impending ascension to the Father. She announced to them, “‘I have seen the Lord!’ And she told them what he had said to her” (vv.11–16,18).\n\nMary Magdalene’s sin and shame, whatever they may be, did not have the final word—God’s grace did. Mary met Jesus and He changed the trajectory of her life forever. He does the same for us. Have you been worried that God might not use you because of sin in your past? Are you afraid that people will hear you talk about Jesus and assume you are a hypocrite because of the things you did before you were a Christian? Look at Mary. Luke’s first words about her tell us what she once was, but look at what she became because of her Savior!\n\nMary met Jesus when she was demon-possessed, and after she was delivered of them, she followed Him faithfully. And when each of us first met Jesus, there was nothing particularly impressive about us; like everyone else, we were mired in sin and foolishness. What did He do? He washed us, saved us, justified us, and cleansed us. Now, as men who have been made new, we faithfully follow Him. We love Him, we serve Him, and we bear witness to His saving grace.\n\nWritten by Scott Slayton",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-15.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 6:1-14, John 6:22-40, 2 Kings 4:42-44, Matthew 5:6",
    "devo_title": "The Boy With Fish and Loaves",
    "devo_summary": "If you were to ask me the names of the Christians who’ve had the greatest influence on me, I wouldn’t list well-known pastors, leaders, or authors, though many have helped shape my thinking on important subjects. No, you wouldn’t recognize the names of those who’ve had the deepest impact on my life. Some are pastors, though most weren’t when I met them. Some are teachers, some homemakers, and others are businessmen. Simply put, the Christians who have influenced me the most are normal, ordinary followers of Jesus who God has used in extraordinary ways.\n\nIn today’s reading, we have a beautiful example of how Jesus used an ordinary person and everyday objects to reveal more of Himself. After Jesus healed a man who had been lame for almost forty years, He crossed to the other side of the Sea of Galilee. By this time in His ministry, many had been astounded by Jesus’s works and miracles, and crowds of people had begun to follow Him.\n\nThe time of Passover was near and crowds were growing and continuing to follow Him. And so He turned to Philip and asked where they could find bread to feed such a crowd. Philip’s answer? Not even two hundred denarii worth of bread (roughly seven months’ wages) would “be enough for each of them to have a little” (John 6:7).\n\nBut then another disciple, Andrew, said, “There’s a boy here who has five barley loaves and two fish—but what are they for so many?” (vv.8–9). And he was right; how could so little feed so many? But for Jesus, it was enough. The boy came and gave all he had, what must’ve seemed like a small offering to some, and Jesus multiplied it to feed the massive crowd. John emphasized the completeness of the miracle when he explained that everyone had eaten their fill, and yet there was enough left over to fill up twelve baskets (vv.10–13). Jesus took this boy’s small meal and used it to fill the bellies of a crowd of thousands—plus leftovers.\n\nJesus’s miracle spoke volumes about who He is, revealing that He is more than enough to satisfy the crowd’s deepest needs. They knew the story of the manna that God had rained down from heaven to feed the Israelites during their flight from Egypt (Exodus 16; John 6:31). Jesus reminded them that the Father gives true bread, and in answer to their desire to receive “this bread always” (v.34), Jesus told them:\n\n“I am the bread of life… \n\nNo one who comes to me will ever be hungry, \n\nand no one who believes in me will ever be thirsty again” (v.35).\n\nJesus’s words were loaded and the people knew it. He had invoked the divine name, “I AM,” which God used to reveal Himself to Moses (Exodus 3:14). He was making the connection for them: the manna in the wilderness was ultimately pointing to Him all along. The people simply wanted full bellies, but Jesus was showing them that He alone could feed their souls.\n\nOne of the astonishing features of this narrative is the small sacrifice that led to Jesus’s amazing demonstration of power and the stunning proclamation of His deity. Every Christian who has ever wondered what role they can play in the kingdom of God should be encouraged by this boy’s example. We don’t know his name, but Jesus used this boy’s offering to proclaim His saving power and might to the multitude.\n\nHe does the same with us. We bring Jesus our time, talents, and treasures—as small and insignificant as they appear to be—and He multiplies them, impacting and changing the lives of many.\n\nWritten by Scott Slayton",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-12.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 4:1-42, Jeremiah 17:9-13, Revelation 21:6, Revelation 22:1-5",
    "devo_title": "The Woman at the Well",
    "devo_summary": "God loves to use the unexpected: unlikely kings, unlikely prophets, unlikely disciples, and unlikely mothers. The Samaritan woman in John 4 is an unlikely convert and evangelist. She had everything working against her. She was a woman in a patriarchal society, where even speaking publicly with a man was taboo. She was a Samaritan talking with a Jew, though their cultures despised one another. She had a checkered relational and sexual past, pushing her to the fringes of society. Yet Jesus still sought her.\n\nTheir conversation at Jacob’s well is an odd one. It bounces from topic to topic so as to leave the reader quite confused—living water and multiple husbands and places of worship and so forth. But if we read carefully, we see Jesus masterfully, gently, and pointedly guiding her to an understanding of saving truth.\n\nHe asks for a drink of water to open the door to conversation then quickly offers her living water. She doesn’t understand and is understandably taken aback, but Jesus presses even harder with a direct offer of salvation: “Whoever drinks from the water that I will give him will never get thirsty again” (John 4:14). Again, she fails to understand.\n\nJesus pivots again, this time in a seemingly bizarre manner, asking about her husband. Why? What is He getting at? It is not random at all. Jesus is showing her who He is, the Lord who searches hearts and gives to each according to their deeds (Jeremiah 17:10). He is declaring His power and kingship and showing that His offer of living water is infinitely more than she could imagine. By offering living water, Jesus is declaring Himself the Alpha and Omega and offering her access to the river of life that flows from the throne of God (Revelation 21:6). He is offering her healing and wholeness in the presence of God (Revelation 22:1–5).\n\nShe tries to deflect by changing the subject and throwing out a red-herring argument for debate about where the proper place to worship is for Jews and Samaritans. Jesus turns that around, too, ending with a declaration of Himself as the Messiah. Finally she is left with no argument and no response but to tell her fellow townspeople, “Come, see a man who told me everything I ever did. Could this be the Messiah?” (John 4:29). And many did believe because of her testimony and because of Jesus’s words.\n\nJesus preached one of His most powerful sermons, made some of His clearest claims as Savior and Messiah, and promised eternal life to a promiscuous Samaritan woman, perhaps the least likely of recipients. He did so with kindness and gentleness, but He would not let her deflect or ignore or misunderstand. He wanted her to believe, and she did. And her response was to spread the good news, telling others to come, to meet Jesus. The water of life is for all who believe, no matter how unlikely, and it is to be shared by all who believe and trust in Jesus.\n\nWritten by Barnabas Piper",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-11.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 5:21-43, Leviticus 15:25-27, Revelation 21:4",
    "devo_title": "Jairus & His Daughter",
    "devo_summary": "Faith is such a hard concept to teach. It seems so abstract, so contradictory in its definition of the assured reality of what we cannot see. “Seeing is believing”—that’s the phrase so many areas of our lives push us to affirm, as if seeing something is what makes it real. That’s what makes the biblical concept of faith so contradictory: “Now faith is the reality of what is hoped for, the proof of what is not seen” (Hebrews 11:1).\n\nFaith is the “proof of what is not seen” in a world where seeing is the most widely-accepted kind of proof. So the Christian faith is truly otherworldly. It feels foreign to the human understanding of truth and how we measure reality. The faith we are called to have as Christians is powerful because our faith is in the finished work of our God, not the future work of our own hands. It is this faith that pushes back the gnawing ache of fear, even amidst the darkest darkness of life.\n\nIn Mark chapter 5, we are introduced to Jairus and his daughter. A leader of the synagogue, Jairus comes to beg Jesus to save his daughter as she is dying. He believes Jesus has the ability to save his daughter, and Jesus begins following him to his home.\n\nWe don’t know much about Jairus or his daughter, but we do know he was a religious leader in the local synagogue. He likely had more money than the average person living at that time. Even the fact that he was a man, rather than a woman, gave him authority in his day. All of these things combined would have made him one of the most powerful people around—a stark contrast to the bleeding woman who grabs Jesus’s clothes as He is on His way to heal Jairus’s daughter.\n\nWhen Jesus finally arrives at the synagogue leader’s house, people are clamoring, talking about how the daughter has died. Sensing fear in Jairus, He tells him, “Don’t be afraid. Only believe” (Mark 5:36). Jesus proceeds to tell the crowd in the house that the girl is asleep, not dead, which draws mockery and laughter from those in attendance. Jesus then goes to the girl, takes her hand, and says, “Little girl, I say to you, get up” (vv.41–42).\n\nWhat is it that we are desperate for the Lord to fix in our own lives? Do we think it is impossible for the Lord to intervene and answer prayers we pray in the midst of mockery and doubt? Faith is the antidote to fear. When we fear evil and its effects on our lives, we lack faith in God to overcome the world, but He already has (John 16:33). The Lord has not forgotten us, and so whatever it is we fear, we must take heart: He is already near and He loves us.\n\nWritten by Chris Martin",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-10.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 5:1-11, Matthew 4:18–22, Matthew 14:22-32, Matthew 16:13–20, Luke 22:54-62, John 21:15-19",
    "devo_title": "Peter",
    "devo_summary": "Reading about the life of Peter—his triumphs, his blunders, and his heart—it’s not hard to see why Jesus chose the gruff fisherman to be one of His closest friends during His earthly life. If I were to describe Peter in a hashtagable phrase, it would be all in.\n\nWhen we first meet Peter in Luke’s Gospel, he’s just come in from a long night of fishing. On the crowded shore of the Sea of Galilee, his world collides with Jesus. From the start, Peter is all in. He gives Jesus his boat to use as a pulpit, so the crowds can hear Him (Luke 5:3). He obeys Jesus against all earthly common sense to go out for another round of fishing—with nets that he’d just cleaned after being out all night (vv.4–7). And then he leaves everything behind to follow Jesus (v.11).\n\nBut that’s just the beginning. Peter’s the only disciple to get out of the boat to walk on the water with Jesus (Matthew 14:28–29). He’s the first disciple to confess Jesus is “the Messiah, the Son of the living God” (Matthew 16:16). And even if the attempt was misguided, he’s the one who pulls out a sword to defend Jesus from arrest (John 18:10). Peter is all in for Jesus. It’s no wonder Jesus likes to have Peter by His side.\n\nBut Peter is also all in when it comes to his fear. When the pressure is on, Peter denies Jesus three times to save his own skin (Luke 22:54–62). Along with the other disciples, Peter runs and hides while Jesus is being beaten and crucified for our sins (Matthew 26:31).\n\nWhen I read about this side of Peter’s story, I can’t help but see myself. How many times have I done the safe thing rather than the right thing? How many times have I thought about my own well-being rather than the sacrifice Jesus made on my behalf? As much as I want to be the Peter who steps out onto the Sea of Galilee and walks on the waves, I’m more often the Peter who sinks with his doubts.\n\nThankfully, Peter’s story is ultimately not dependent on his own faithfulness, because Jesus is all in for Peter. Whether the fisherman is getting things right or wrong, Jesus is pulling for His friend. Even before Peter’s cowardly betrayal, Jesus prays for his future ministry (Luke 22:31–32). And when He is resurrected from the dead, Jesus makes a point of commissioning Peter three times to feed His sheep—a threefold restoration for a threefold betrayal (John 21:15–17). This is good news for all of us who resemble Peter in this way. Let’s be all in for Jesus; He’s all in for us. He proved it on the cross.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-9.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 3:1-21, Numbers 21:1-9, John 7:45-52, John 19:38-42",
    "devo_title": "Nicodemus",
    "devo_summary": "It’s been just about fifteen years since I met Jesus. I can still remember what it was like to be brand new to the faith—and also what it was like to be completely hostile toward the gospel, when what seemed so obvious to those who believed was anything but to the uninitiated like me.\n\nThe Bible is full of the stories of people who were trying to make sense of Jesus. People like Nicodemus. He was one of the religious elite, one of the people you would expect to know everything about what it meant to worship God (John 3:1). But when he heard about Jesus’s teaching, he was curious. When he heard about the signs He performed, Nicodemus knew he had to speak to Him.\n\nBut when he actually talked to Jesus, he was confused. Jesus said strange things that seemed to make no sense, things that were surely impossible, like: “Unless someone is born again, he cannot see the kingdom of God” (John 3:3). I have to wonder, in that moment when Jesus was explaining this, did Nicodemus get it? Did he understand what Jesus was talking about? Maybe. But probably not.\n\nIn fact, I’m willing to bet that Nicodemus didn’t get it that night. Because there was a time when I didn’t either (and ditto for you, too). And that’s okay. But here’s what I love: the interaction between Nicodemus and Jesus isn’t the end of Nicodemus’s story. Nicodemus keeps showing up all throughout John’s Gospel. He’s on this journey trying to figure things out. He left Jesus in the night and didn’t understand, but He kept wrestling with what Jesus told him. When the other religious leaders were trying to decide what to do with Jesus, Nicodemus began to defend Him (John 7:45–52). He still didn’t seem to quite know what to make of Him, but He knew that Jesus wasn’t some charlatan. And then we see him again, after Jesus has been killed, as one of the people who prepared His body for burial (John 19:38–42).\n\nNicodemus was on this journey for years. He didn’t understand at first, but he didn’t stop trying to figure out who Jesus was. It wasn’t obvious to him, but eventually, it seems like he got it. Through three years of wrestling, he began to see what can only be seen by those who are born again.\n\nI still remember when I saw and understood the truth; when what wasn’t obvious to me, suddenly was. And that’s something I hope I don’t forget, especially when I think about people I know who still don’t understand the gospel. They don’t get it now, but that doesn’t mean they never will. It might be three years or thirty, but someday, it could happen. They, just like you and me, could be born again, and when they are, they will see the kingdom of God for themselves.\n\nWritten by Aaron Armstrong",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-8.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Matthew 3:1-17, Matthew 11:1-15, Matthew 14:1-12",
    "devo_title": "John the Baptist",
    "devo_summary": "It’s noteworthy that the one meant to pave the way for the Messiah didn’t create a new school of thought within the walls of the temple system. He wasn’t integrated into the political hierarchy of the day, artfully preparing for Jesus to emerge as a powerful leader. He was not a great warrior, destined to be captain of Jesus’s guard.\n\nHe was a desert prophet.\n\nThe cousin of our Lord lived an eccentric, ascetic, and intentional life. Wearing animal furs, eating wild honey and locusts, and proclaiming a message of change; John spent most of his adult days in the harsh landscape of the desert wilderness. His behaviors and appearance may strike us as odd, and they would’ve been outside of the norm for the typical working person in his day too. His austere appearance was mirrored by his stark message of repentance and preparation.\n\nAnd yet he amassed quite a following, and what he had to say struck a chord with the people. So much so that the authorities and the establishment were concerned about his popularity. His message was powerful, authentic, and rang true, and it confronted the establishment in some pretty intense ways.\n\nWe can learn a lot from John the Baptist when it comes to stewarding influence. His entire life can be characterized as a bold, unwavering arrow, pointing toward anyone who had eyes to see Jesus. From his miraculous birth, to his tragic death, John the Baptist lived one core message that could be summed up as this: Get real about yourself, get right with the Lord, get ready for the Messiah. He directed every follower he ever had straight to Jesus.\n\nWe live in the age of personal influence management. “You are your own brand”—that’s a mantra we hear a lot from leadership and business gurus. And, on a pragmatic marketplace level, they’re not wrong. More and more, we hear talks and read articles about “influence” as it relates not only to organizations but as it relates to individuals. In our day, the real question is not whether or not you have influence, but what are you doing with it? Whose banner are you raising? Whose name are you really hoping will be made great? How willing are you to hand it all over so that it points to Jesus?\n\nWe may not be called to be prophets, but we are called to use our gifts, our talents, our voices, and our influence to point to Jesus with everything we’ve got. Even when, from a temporal perspective, it doesn’t seem like a prudent investment or a wise bet. Whether a banker or a butcher, an entrepreneur or an engineer, we must be prepared to pour out every ounce of our energy and influence to point to Jesus, the one who makes all things new, right, and whole.\n\nWe have a bit of an advantage compared to John. He had to stake everything, every ounce of his reputation, on the one who was coming after him. Jesus hadn’t walked on water yet, nor had He healed blind Bartimaeus. Jesus hadn’t conquered the grave, yet John staked everything on what was to come.\n\nWe have the distinct historical advantage of already knowing the powerful outcome of Jesus’s earthly ministry. We can point to the one who was, and is, and is to come, declaring with confidence and everything we have that He is greater (Revelation 1:8; Matthew 3:11). Full stop.\n\nWritten by Andrew Stoddard",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-5.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 2:21-38, Isaiah 9:1-7, 1 Peter 2:4-10",
    "devo_title": "Anna & Simeon",
    "devo_summary": "I love to know things. All the things. It’s probably not healthy, but there you go. On the one hand, this desire to know everything has created in me a lifelong love of learning. On the other hand, it can make me pretty impatient when there’s something I don’t know and no one can help me find the answer.\n\nIn other words, I’m the opposite of people like Anna and Simeon. I love how understated their stories are here in Luke’s Gospel. They both longed for the redemption of Israel—for the promised Messiah to come, the one who would be called “Wonderful Counselor, Mighty God, Eternal Father, Prince of Peace” (Isaiah 9:6).\n\nAnna served in the temple, praying and fasting day and night (Luke 2:36). Simeon was told by God that he would not die before he actually saw Him with his own eyes (v.26). How long had he waited, I wonder. Was he patient as he waited for God to do what He promised to do? Did he have moments of doubt and frustration? Whatever Simeon and Anna might have felt, there’s a powerful emotional pay-off when, on a certain day, a couple named Mary and Joseph brought a baby named Jesus into the temple to be dedicated—and all of a sudden the wait was over.\n\nThe Messiah had come, and Simeon didn’t just get to see Him with his own eyes—he got to hold Him in his arms! Is it any wonder that he prayed, “Now Master, you can dismiss your servant in peace, as you promised. For my eyes have seen your salvation” (Luke 2:29–30). In other words, That’s it! I’m good—I can die now because You kept Your promise, Lord! And when Anna saw Jesus, she did much the same, thanking God and telling everyone about the Messiah, sharing the good news with all those who were longing for redemption (v.38).\n\nThey got to see what we have not. They got to see in person what we long to see: the one who is called the cornerstone of our salvation (1 Peter 2:7), the Savior we want all the world to know. And I’m not going to lie, I’m a little jealous of that at times. But I also know that there’s a day coming when I’ll get to meet Anna and Simeon, these two faithful servants who had waited so long for their Redeemer to come. And when I do, I’ll get to ask them what that was like. And together we will celebrate not just that He came, but that His work is finally and fully finished.\n\nBut that day isn’t here yet. I get to wait for Jesus to come, too. Because one day, He will return, and whether it’s eighty-four days or eighty-four years from now, I’m going to do my best to keep waiting with expectation, to keep hoping, looking forward to the day when we all get to stand together before Jesus and celebrate all that He has done for us.\n\nWritten by Aaron Armstrong",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-4.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 1:26-38, Luke 2:1-7, John 2:1-12, John 19:25-27",
    "devo_title": "Mary of Nazareth",
    "devo_summary": "It is easy to think of Mary as a beatific saint, a luminous figure who is borderline supernatural. To view her this way, however, is to so sensationalize her and disconnect her from reality that we dishonor her place in God’s Word. Mary played a pivotal role in the story of redemption, but not because she was extraordinary.\n\nShe was from Nazareth, a tiny town just this side of nowhere. She was a virtuous young woman, a follower of God’s law who was soon to be married. Her fiancé, Joseph, was from the line of King David. While this may sound special, in his day-to-day life he was just a carpenter, not royalty. But he was an honorable and good man, so all signs pointed to Mary having a decent, normal, small-town future raising her family.\n\nWhen the angel, Gabriel, appeared to Mary, everything changed, but she didn’t become a different person. She had been chosen to be the mother of the Messiah. Gabriel called her “favored woman” and told her she would have a son who would be of the line of David and whose kingdom would have no end. He would be called Jesus.\n\nMary’s response gives a glimpse into why she “found favor” in the eyes of God (Luke 1:30). She was troubled when Gabriel called her favored one. She asked, “How can this be?” after being told she would be a mother, but not with the doubt and skepticism of her cousin Zechariah when the angel told him his wife would have a son. He was struck dumb for over nine months (vv.19–20). The angel welcomed Mary’s question and answered, explaining that the Spirit of the Lord would come upon her and something transcendent and miraculous would come about (v.35). When she heard this she did not question further or challenge, she simply replied, “I am the Lord’s servant… May it happen to me as you have said” (v.38).\n\nMary gave birth to Jesus in the meanest of circumstances: a newborn King sleeping in a feeding trough with shepherds as courtiers. But Mary treasured up those things in her heart (Luke 2:19). She raised her son, the Son of God. She knew His business, and when the time came, she gave Jesus the motherly nudge He needed.\n\nThey were at a wedding in Cana, and the wine had run out, meaning the party would be over prematurely. Mary knew her son’s time had come, and she said and did a very motherly thing; she mentioned the problem in passing to Him. When He didn’t promptly act, she then announced to the wedding servants, “Do whatever he tells you,” and walked away (John 2:1–5). She had raised the King, and now she was gently prompting Him to act.\n\nMary was the mother of the Savior, the mother of her own King. She wasn’t extraordinary, but she trusted in her extraordinary God as His humble servant. You and I are not called to the same remarkable miracle she was, but we are called to follow Mary’s example of humility and faith and to live according to God’s Word.\n\nWritten by Barnabas Piper",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-3.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 1:5-25, Luke 1:57-66, 1 Samuel 1:9-18, Psalm 113:5-9",
    "devo_title": "Zechariah & Elizabeth",
    "devo_summary": "My wife Susie and I got married in June 2013. In April of this year, Susie gave birth to our first child, Maggie. It took a couple of years for us to get pregnant, and throughout that time, it felt as though I was praying every single day for the Lord to give us a child. I struggled with the Lord, asking Him why we weren’t getting pregnant as quickly as our friends were. I am well aware that many couples, including some friends of ours, struggled to get pregnant much longer than we did, and some may never have biological children. But because of my incessant prayer for a child over the years, I see the lives of Zechariah and Elizabeth differently than I did before.\n\nZechariah and Elizabeth are the parents of John the Baptist. But when we meet them in Luke 1, they are faithful followers of the Lord, a priest and his wife, who cannot have children. The Gospel of Luke tells us they “both were righteous in God’s sight, living without blame according to all the commands and requirements of the Lord” (Luke 1:6). They were childless and were well along in age, unlikely to ever have children.\n\nOne day, Zechariah entered the temple to complete his priestly task, and an angel of the Lord appeared to him. It scared him, understandably so, “but the angel said to him, ‘Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you will name him John. There will be joy and delight for you, and many will rejoice at his birth’” (vv.13–14).\n\nThe point of Zechariah and Elizabeth’s story isn’t that they eventually gave birth to a son, a child they had likely prayed for countless times over many years—though obviously their son played an important role in the coming of the Messiah. The point of Zechariah and Elizabeth’s story is that God was faithful to work in and through their lives in ways they never could have imagined.\n\nZechariah and Elizabeth served the Lord faithfully, even when their prayers seemed to go unanswered for so long. Even in the face of disappointment, they did not lose hope, and they did not stop asking Him. What about us? Do we continue to hope in Him, to trust Him while we wait for an answer? Do we continue to pray and to seek Him?\n\nWhat do you desperately long for Him to do? Ask Him.\n\nWritten by Chris Martin",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-2.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 1:1-5, John 1:14-18, Luke 4:16-30, Matthew 16:13-20, Matthew 17:1-7, Mark 15:1-5, Mark 15:16-39, Matthew 28:1-10, Matthew 28:16-20, Colossians 1:15-20, John 21:25",
    "devo_title": "Jesus",
    "devo_summary": "Though the apostle John reminds us that the libraries of the world would fail to contain all the books on Jesus that could be written (John 21:25), the carpenter from Nazareth stands alone as the single subject worthy of the attempt. But Jesus desires faith, not books, and calls disciples, not biographers.\n\nThe whole Bible is about Jesus. Though His name does not appear on a single page of the Old Testament, He is there. He is there at creation, the Word through whom all things were made (Genesis 1:1–31; John 1:1–3). He is there in God’s plan to send a Savior to bruise the serpent’s head (Genesis 3:15; 1 John 3:8). He is there in the promise to bless all nations through Abraham’s offspring (Genesis 12:1–7; Galatians 3:16). He is there in Egypt to rescue His people from the cruelty of Pharaoh (Exodus 12:29–32; Jude 5). He is there in the wilderness, the rock that provided relief for the thirsty (Exodus 17:6; 1 Corinthians 10:4). He is there in God’s promise to David, the King who would sit on the throne forever (2 Samuel 7:16; Luke 1:33). And on and on it goes, from Genesis to Malachi.\n\nWhen we turn the page over to the New Testament, suddenly Jesus is there in the flesh, fully God yet somehow also fully man. The God who made us is also a fellow human, our brother. What could be written about this dual nature of the Son of God could also fill libraries, but again, that is not why we have been called—to fill libraries. We have been called to follow Jesus, to be His disciples. So we must be people who read the stories of Jesus again and again, who soak in His teachings, His parables, His miracles, His life, death, and resurrection. We must be people who see Him even in those passages where He is not named. And we must be Christians, literally “little Christs,” continuing the kingdom work of Jesus in our communities and across the world.\n\nPaul summed it up well when he wrote, “He is before all things, and by him all things hold together” (Colossians 1:17). Not some things or many of the things, but all things. Jesus is there, in everything we read in Scripture, but in everything we experience in this life too. Even in the dark places that seem a million miles removed from Christ, He is there, weeping over our sin-twisted world, drawing near to the brokenhearted, and loving the unlovable. You and I are commanded to make His name known in such places—to invite the lost home and to give all the glory to Jesus. It’s all about Him. Always.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/06/HRT-WMITWnt-Instagram-1.jpg"
  },
    {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Esther 2:1-18, Esther 3:1-6, Esther 4:1-17, Esther 8:1-7, Hebrews 4:14-16",
    "devo_title": "Esther",
    "devo_summary": "I’m surprised when I find someone who’s never seen The Princess Bride. I’m embarrassed for them, actually. And I always feel a certain responsibility to make sure they remedy this oversight. Why? Because The Princes Bride is a perfect story, one where nothing is wasted. It has everything: pirates, sword fighting, giants, power-struggles, true love, and rodents of unusual size. Everything.\n\nEsther’s story is perfect too. It has everything. A proud king. A defiant queen. An assassination attempt. An ambitious, venomous second-in-command. A seventy-five-foot gallows in the heart of town, built especially for the sage-like guardian of the beautiful orphan girl who would become queen of the land. Esther has quite a story.\n\nIn the book of Esther, we read about Ahasuerus and his rule over Persia, but Esther’s story runs much deeper and higher. Even though God is not mentioned by name in this book, He is the supreme King and hero of this story. His providential hand leads His people from certain destruction to the kind of safety found only in being the object of the King of king’s affection.\n\nYou should read the book of Esther in one sitting. Enjoy the twists and turns. Appreciate the irony laced throughout. Feel the fear and trembling Mordecai, Esther, and their people must have known as Haman’s gallows took shape. The story itself deserves our appreciation for its complexity, drama, romance, outcome, and humor. (See Esther 6:1–11 for an example of tragic comedy in Scripture. I dare you not to smile, just a little.)\n\nOne of the things I find most refreshing about Esther’s story is her lack of ambition. Greatness is thrust upon her. She finds herself in positions where she has an influential voice, and she uses it. But she never seeks her own glory. She seeks truth and then advocates for the truth to be known.\n\nA story like Esther’s speaks to a bigger truth than the state of Persian politics. She speaks to the truth the apostle Paul describes in his letter to the Corinthians: God uses what is seemingly insignificant and despised in the world to bring to nothing that which is exalted over God (1 Corinthians 1:27–29).\n\nEsther’s life story is a double-edged sword. It is a rebuke to those who are tempted to scheme and plot their way to greatness. But it’s also a story with this reassurance: No matter how powerful the schemes of man may appear, God can topple them in a moment with ease. May that sword cut us both ways for the glory of God.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day54.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Daniel 3:1-30, Isaiah 43:2",
    "devo_title": "Shadrach, Meshach, and Abednego",
    "devo_summary": "Compromise is all around us today. It’s everywhere we look, even the church. The idols of our age tempt us with false promises. And if we reject the promises of sex, power, and money, we may be left out. On the other hand, if we stand by our convictions, we may find ourselves alone. Yet, at the heart of it, the Bible teaches us that this world holds out empty promises that can never fill our souls. When we go with the currents of this world, we may find immediate gratification, but the pleasure will be fleeting and we will be left with nothing but empty hands and broken hearts.\n\nThe story of Shadrach, Meshach, and Abednego is a powerful reminder that conviction trumps compromise every time. When Nebuchadnezzar warned of judgment for not worshiping a man-made image, Shadrach, Meshach, and Abednego boldly proclaimed their faith in God and would not bow to another. Nebuchadnezzar said to them, “If you don’t worship [the image], you will immediately be thrown into a furnace of blazing fire—and who is the god who can rescue you from my power?” (Daniel 3:15).\n\nThese were men of God who did not compromise. The faithful men answered, “If the God we serve exists, then he can rescue us from the furnace of blazing fire, and he can rescue us from the power of you, the king. But even if he does not rescue us, we want you as king to know that we will not serve your gods or worship the gold statue you set up” (vv.17–18).\n\nAnd God did just as they knew He would. After being thrown into the fire, they emerged completely untouched; their clothes and hair were left unsinged, and not even the smell of smoke lingered on them. What a testimony to the comprehensiveness of the Lord’s protection. God often meets His children in the most profound furnaces of life, promising, “You will not be scorched when you walk through the fire, and the flame will not burn you” (Isaiah 43:2).\n\nPerhaps the burning desire to turn to the things of this world is a fire crackling in your heart today. Is God not able to strengthen you to resist compromise? Is our God not able to empower you to resist the temptations that so easily entangle us? The same Jesus who promised to be with us until the end of the age (Matthew 28:20) also taught us to pray, “Lead us not into temptation, but deliver us from the evil one” (Matthew 6:1, NIV). Therefore, be strong. Do not compromise. The reward for faithfulness is infinitely better than the fleeting satisfaction that comes from yielding to this world’s temptations.\n\nWritten by Matt Capps",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day53.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Daniel 2:1-49, Luke 12:11-12, Colossians 3:23-24",
    "devo_title": "Daniel",
    "devo_summary": "The Bible is full of imperfect people who wavered in their faith and obedience. Moses led God’s people out of Egypt but first pleaded with the Lord to pick someone else. David was a man after God’s own heart but committed adultery and murder. Elijah asked God to take his life after defeating the prophets of Baal on Mount Carmel. Peter was one of Jesus’s best friends and a leader in the early Church, but he also publicly denied the Lord three times. The list could go on and on. But there are a handful of people for whom Scripture records no such mixed reviews. The prophet Daniel is one of them.\n\nThe consistent testimony of God’s Word is that Daniel obeyed the Lord, even under the tremendous pressure that comes with living as a captive in a foreign land. That, of course, doesn’t mean Daniel was without sin. Rather it means that Daniel was a man of unusually strong faith.\n\nThis faith is on full display in Daniel 2. King Nebuchadnezzar has had a dream and wants one of his wise men to interpret it for him. The catch? The interpreter must also tell the king what the dream was about. A seemingly impossible task, the empire’s other wise men quake with fear, especially when the king issues an order for their execution. But not Daniel. Instead of trembling, Daniel and his friends pray.\n\nWhen God answers, Daniel confidently proclaims, “Don’t destroy the wise men of Babylon! Bring me before the king, and I will give him the interpretation” (Daniel 2:24). Daniel knows that the vision he has received is from the Lord and that it will satisfy the king’s request. No doubt about it.\n\nAs Daniel reports, Nebuchadnezzar’s dream was about world empires—his own and three to follow. During the time of the fourth kingdom, a new kingdom arises, unlike the others, and it has no end. The message is simple but important: God is sovereign over world history. Nebuchadnezzar may have thought himself the ruler of his expansive realm, but God is the rightful Ruler of the world.\n\nEven before Daniel received the interpretation of Nebuchadnezzar’s dream, he knew this. It’s why he could behave with such faith while living in Babylon. According to the common beliefs of the day, the gods were territorial. Babylon belonged to Marduk and his pantheon. Yahweh’s territory was the land of Israel. In other words, Daniel’s God should have been powerless to act on Daniel’s behalf while Daniel was in exile. But that isn’t how the world actually works. The one true God knows no boundaries, no territories, and no limits. He is the God of history, sovereign over all peoples, all lands, and all circumstances.\n\nAll too often, my behavior betrays the doubts that reside in my heart. If I really believed that God held every detail of my life in His hands, my first response to trouble would be faith rather than the enacting of some detailed plan to manage things on my own. Daniel’s life is a reminder that there is another way, a way that sees living in a foreign land with other gods not as a hardship but as a training ground for deeper faith. May we all keep this perspective, for we all, like Daniel, are far from home.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day52.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Ezekiel 2:1-10, Ezekiel 3:1-15, Ezekiel 12:1-20, Isaiah 55:6-7",
    "devo_title": "Ezekiel",
    "devo_summary": "Several years ago, my mother-in-law shared with my wife that she had started eating something called Ezekiel Bread. After explaining its many health benefits, she said, “And it’s even in the Bible!” (We were fairly new Christians at the time, and my mother-in-law was trying to be supportive.) To this, my wife said, “Oh, interesting,” and then looked up the bread in the book of Ezekiel—where she read about how he baked it. Needless to say, after hearing that, I’m pretty sure my mother-in-law never ate it again.\n\nAround that same time, I was in the Christian Books section of my local bookstore, talking to an associate. He mentioned that he was a Christian, and then shared (completely unprompted, mind you) his belief that Ezekiel was obviously describing UFOs and aliens in his visions. I am not exaggerating, not even a little.\n\nAll this to say, the prophet Ezekiel incites a response from people. Too often, people think they’re supposed to focus on the hard-for-us-to-understand imagery in his prophecies, spending potentially far too much time trying to determine what the many-wheeled, many-eyed, and many-winged creatures really are. And while there’s nothing wrong with wanting to understand the imagery, we should be careful to not get so hung up on it that we miss that Ezekiel’s message was meant to be understood.\n\nGod said to Ezekiel, “Son of man, eat what you find here. Eat this scroll, then go and speak to the house of Israel” (Ezekiel 3:1). The Lord instructed the prophet to warn the Israelites that they had become “rebellious pagans” (2:3). God’s rebuke was to be given, regardless of whether or not the Israelites would listen and receive it (2:7; 3:11). With words and actions, Ezekiel then warned the people of God’s coming judgment, and what they would experience when Israel was taken away by the Assyrians into captivity (12:1–6).\n\nAnd even though they didn’t listen, Ezekiel did as God commanded. He spoke a message offering forgiveness and restoration, a plea from God for Israel to turn from her wicked ways and trust in Him. He called them to reject the sin that had ensnared them as a people for generations.\n\nThis is what is so easy for us to miss when we spend our time focusing on the weirder parts of the book, or trying to apply them in ways they were never meant to be applied. What seems strange to us can easily distract us, or even cause us avoid this book altogether. But this book is really good for us! I know I need it, as it shows me just how much I need Jesus. Apart from Christ, I know I am just as wicked and rebellious as any of the Israelites to whom Ezekiel spoke. I know that I would gleefully still be thumbing my nose at my Creator, had Jesus not saved me. And whether or not I listen to it, whether or not I pay attention, this book is still good news, “sweet as honey in my mouth” (Ezekiel 3:3).\n\nWritten by Aaron Armstrong",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day51.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "2 Kings 19:8-19, 2 Kings 19:35-37, Isaiah 38:1-20",
    "devo_title": "Hezekiah",
    "devo_summary": "King Hezekiah was a man of prayer. Today’s readings contain three of his prayers, and each one is different.\n\nThe first appears in 2 Kings 19:14–19 as Judah faced impending invasion by the Assyrians, who had invaded the land and besieged Jerusalem. When Sennacherib, the Assyrian general, sent a letter full of threats to Hezekiah, the king immediately ran to the temple where he spread the letter out before the Lord. The king’s prayer was bold and public. He begged God to vindicate Himself and show His glory among the nations. Hezekiah was desperate, but he also knew that his prayer was in accordance with God’s stated plans and purposes (2 Samuel 7:23; Psalm 67:1–2). The Lord answered with swift and decisive deliverance (2 Kings 19:35–37).\n\nThe second prayer appears in Isaiah 38:1–2. Once again, Hezekiah faced an imminent threat, though it wasn’t a national emergency this time—it was personal. God’s prophet, Isaiah, diagnosed the king with a terminal illness. Upon hearing the news, the king immediately turned his face toward the corner of his room. Once again, Hezekiah’s prayer was a desperate appeal for deliverance. Hezekiah asked God to remember how he had walked faithfully and wholeheartedly, doing what pleases the Lord (v.2). Hezekiah was a godly king, but I’m certain he also knew his own sin. There was no guarantee God would grant his request. I imagine that’s why, after making that appeal, the king wept so bitterly. God heard his humble anguish, and He extended the king’s life by fifteen years (v.15).\n\nHezekiah’s third prayer appears in Isaiah 38:9–20, and it is offered in response to being healed. In these circumstances, we might expect the king to respond with a poetic song of thanksgiving and praise. The king does write a poem, but it’s surprising, more contemplative than you’d think; he writes a hymn rather than a praise chorus. He does eventually give thanks (v.19), but first, the king reflects on the horror and oppression he felt when facing death (vv.10–14), as well as God’s power to forgive sins and restore life (vv.17–18). The experience sobered him, and it encouraged him to both “walk along slowly” (v.15) and to recount God’s salvation to the next generation (v.19).\n\nI love how each of Hezekiah’s prayers is so unique, each shaped by his changing circumstances. We shouldn’t be surprised if it’s the same for us. But in every circumstance, Hezekiah knew where to turn, and he did not stop asking God for rescue. We can have the same confidence, to turn and take our desperation, tears, deep contemplation, and thanksgiving all to the Lord.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day50.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Hosea 1:2-11, Hosea 2:1, 5-23, Hosea 3:1-5, Psalm 144:2",
    "devo_title": "Hosea and Gomer",
    "devo_summary": "Growing up, I often daydreamed about being married. I learned to cook, thinking I would bless my future wife with my culinary skills. I worked hard to get a good job, hoping to one day provide a nice, comfortable life for my future bride. It was rare for me to go on a date without wondering if the girl sitting across from me might be my future wife. I spent a lot of time dreaming about what marriage would be like, imagining how beautiful it would be. But like so many things in life, God’s plans are bigger and even more beautiful than we could ever conjure up. His ways are better than ours, but that doesn’t mean they’re always easier.\n\nNow, imagine how Hosea must have felt when God gave him this call:\n\n“Go and marry a woman of promiscuity” (Hosea 1:2).\n\nWhy would God call Hosea to faithfully love a woman who would not be faithful to him in return? To offer everything to someone who offered him so little, and then to “go again; show love to a woman who is loved by another man and is an adultress”? (Hosea 3:1). This biblical account only makes sense when we realize that it is not primarily written about Hosea and Gomer. Their marriage is a living metaphor for the faithful love God continuously showers upon His faithless people.\n\nThough His people did not reciprocate His faithfulness, and though they used His gifts to worship false gods such as Baal (Hosea 2:8), God promised to deliver His people from the consequences of their rebellion and to restore them to the blessedness of right relationship with Him. And in framing His promise, God drew upon the metaphor He had established between the faithful husband Hosea and the faithless wife Gomer:\n\n“I will take you to be my wife forever.\n\nI will take you to be my wife in righteousness, \n\njustice, love, and compassion.\n\nI will take you to be my wife in faithfulness,\n\n and you will know the LORD” (Hosea 2:19–20).\n\nThis Old Testament account of the gracious faithfulness of God is good news for the modern-day people of God. We may be living in a different day and age, but the sin nature that defiled the people of Hosea’s day continues to haunt us and lead us astray. It’s as Robert Robinson wrote in his famous hymn “Come Thou Fount of Every Blessing,” we are “prone to wander” and “prone to leave” the God we love.\n\nYet as prone as we are to leave Him, God Himself—King Jesus—left the glories of heaven in order to come to earth as a man, live humbly as a servant, and ultimately, die upon a cross (Philippians 2:5–8). In His death and resurrection, Christ won the Church to Himself as His pure, spotless bride (Ephesians 5:25–27). The promise God offered His people in the book of Hosea is fulfilled once and for all time through Jesus Christ.\n\nBecause the gospel is true, the redeemed from all nations will be assembled together as “a bride adorned for her husband” (Revelation 21:2). Though we were faithless, Christ has been faithful. And because this is true, we will dwell with Him forever. The gospel is very good news, indeed, especially for those of us who are prone to wander.\n\nWritten by Davis Lacey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day47.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Kings 18:1-46, Proverbs 20:22",
    "devo_title": "Elijah",
    "devo_summary": "The showdown between Elijah and the prophets of Baal is arguably one of the most exciting stories in the Old Testament. A solitary man stands up against a group of false prophets and proposes a challenge that will prove who the true God is. Elijah was made for encounters like this. He did not accidentally find himself in this position; his whole life had pointed him in this direction.\n\nElijah lived as a man set apart, and John the Baptist in the New Testament lived a life that mirrored Elijah’s. Or perhaps the better way to say it is, Elijah’s life foreshadowed John the Baptist’s. They both wore coats of animal hair and leather belts (2 Kings 1:8; Matthew 3:4). They both fasted in the wilderness for long periods of time (1 Kings 19:8; Matthew 3:1). And they both called Israel to repent.\n\nElijah was a man set apart because his mission was to call Israel to live as a people set apart. His calling was to promote loyalty to God in a pagan culture. Elijah knew Israel had a purpose for existing: to worship God alone, and to make God known to the world. Part of Israel’s call to loyalty included the responsibility to preserve their one true faith. Preserving that faith meant opposing the infiltration of idolatry or the blending of their worship with pagan practices and traditions. This was Elijah’s fight, to preserve the purity of the covenant God established with His people.\n\nIn opposing false prophets, Elijah lived as someone who was always opposed. Apart from the protection of God, he would have been doomed. But as we see in his confrontation with the prophets of Baal, God displayed His power through Elijah’s ministry in ways that not only prevailed over the false prophets, but caused people to think twice before opposing Elijah.\n\nElijah came to be regarded as a symbol of continued faithfulness, a perception aided in part by his strange exit from this world. He did not depart in the traditional way, but was taken up to heaven in a whirlwind of fire. He went up, and he didn’t come down. Israelites anticipated his return. The prophet Malachi even prophesied his return (Malachi 4:5), which was fulfilled in the birth of John the Baptist, who came with a similar mission—to make straight the path of the Lord in a crooked world (Luke 1:17).\n\nElijah’s mission to call God’s people back to the Lord continues on through the finished work of Christ and the local church on earth. Elijah reminds us, as do John the Baptist and Christ Himself, that we are not free-floating in the cosmos, untethered from any sort of belonging. We were made for a relationship with God. It is as St. Augustine said: “Lord, you have made us for yourself, and our hearts are restless until they find their rest in you.”\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day46.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Kings 16:29-33, 1 Kings 18:1-6, 1 Kings 19:1-5, 1 Kings 21:1-29, Matthew 7:15-20",
    "devo_title": "Ahab and Jezebel",
    "devo_summary": "If you’re a sports fan, you know that this is the era of player safety. It’s a time of targeting calls, pitch counts, concussion protocols, and protecting the quarterback. You can call me soft if you want, but I’m glad. I don’t think it’s necessary to put a man’s well-being at risk for the sake of my entertainment. I’m as happy as the next guy when my team wins, but players should be treated as people, not cogs in some championship-producing machine. Changes made for the sake of safety safeguard us. After all, when we care too much about winning, whether in sports or in life, we can run over people on the way to achieving our goals.\n\nYou see, idolatry is inherently dehumanizing. King Ahab and Queen Jezebel are extreme examples, but they show us where our own false worship leads. In the midst of the great drought (1 Kings 17:1; James 5:17), Ahab took his servant Obadiah to search the kingdom and find what little water was left (1 Kings 18:1–6). “Obadiah was a man who greatly feared the LORD” (v.3), and his love for God overflowed into concern for people. He’d hidden a hundred of God’s prophets away in caves, providing them with food and water and protecting them from Jezebel’s madness.\n\nAhab, by contrast, could have cared less about his thirsty people. He searched the kingdom for grass and water so he could keep his horses and mules alive. This wasn’t some modern concern for animal welfare. No, this king cared for his animals, because they were the source of his military and financial strength. His words and actions showed what his heart truly loved. Winning was important. People were not.\n\nTreating people as a means to achieve our goals is evil. In the idol-worshiping lands of the ancient Near East, a king could seize property from any person he wanted. Prosperity was taken by political maneuvering or brute force. But in Israel, an inheritance was a sacred stewardship from God (Leviticus 25:8–17). Ahab’s neighbor, Naboth, knew this. When he rejected the king’s offer to buy his vineyard, he was expressing his faith. Sadly, he became a martyr to Ahab and Jezebel’s covetousness (1 Kings 21).\n\nAhab had a blatant disregard for human life, and he did more evil than any king before him (1 Kings 16:30). But it’s not uncommon for some of us to use degrading and dehumanizing language when talking about someone of another culture, gender, or political persuasion. Over the last couple of years, I’ve been convicted about the subtly dehumanizing words I’ve used to describe athletes. I now try to stop myself before I describe a running back as a “beast,” for instance. Comparing the man who carries the football to a beast of burden feels too much like the dictator’s “collateral damage” or the abortionist’s “tissue.” Maybe I’m overthinking it. Probably so. But my prayer is that God would keep my mouth from degrading speech and my heart from idols.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day45.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Kings 3:1-28, 1 Kings 8:54-66, 1 Kings 9:1-9, James 3:13-18",
    "devo_title": "Solomon",
    "devo_summary": "If you had three wishes for anything in the world, what would they be? Would you choose fame and fortune, perhaps pleasure, or a long life? The “genie in a bottle” scenario that we occasionally fantasize about is appealing. The fun is found in thinking through what we would really ask for. God’s question to Solomon was similar: “Ask. What should I give you?” (1 Kings 3:5). Omnipotent, almighty God offered a blank check. Nothing was beyond His power or ability to supply.\n\nWhat would you ask for?\n\nThe potent self-awareness of Solomon stands out to me. Instead of asking for wealth, long life, glory, power, or domination over his enemies, he asks for wisdom and understanding. He perceives his youthfulness as well as his position of responsibility, and so he asks for the practical discernment of wisdom to lead the people of God well. Most men I know would hardly make the same request if given the opportunity.\n\nSolomon, in these moments, stands as a helpful model for how we think and live. The choices we make have tremendous impact on our lives and on the lives of others. So are we choosing the best things?\n\nEven our small, seemingly inconsequential choices in everyday life are requests in some way. Our decisions reveal what we really value and see as a means to the good life. The route we take in day-to-day life shows what we believe about how we should get there. Will we choose the better things, like wisdom, faith, humility, patience, love, and mercy—or the immediate things, like money, power, and personal pleasure?\n\nWhen we choose to pursue and ask for the greater things, we find the grace of God moving to meet us in them. Solomon’s noble request for wisdom is met with God’s generous response: “I will therefore do what you have asked. I will give you a wise and understanding heart, so that there has never been anyone like you before and never will be again” (1 Kings 3:12).\n\nThis kind of gracious blessing is available for us today. As unique as Solomon’s story is, the wisdom God gave him is also available to us. First, in Christ, who is the wisdom of God, we have access to the fullness of God’s wisdom and understanding. Jesus is the greater Solomon, who reveals to us the wisdom of God. Second, all wisdom leads to glorifying God in all of life. Just as Solomon led Israel in worshiping God, so our wise actions lead us to lift up and exalt Him in all things.\n\nFinally, wisdom displays itself in our actions. The gift of God’s wisdom is “pure, then peace-loving, gentle, compliant, full of mercy and good fruits, unwavering, without pretense” (James 3:17). Let us ask for and pursue His wisdom today.\n\nWritten by Jeremy Writebol",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day44.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "2 Samuel 4:4, 2 Samuel 9:1-13, 2 Samuel 19:14-30, Luke 14:12-14",
    "devo_title": "Mephibosheth",
    "devo_summary": "Entitlement is a poison of the modern heart. The root is our sinfulness, but the winds of individualism stir our sense of deservedness to a place where we often don’t even recognize it. Oh, how we easily forget that everything we have comes from the hand of God.\n\nContentment is a struggle for many in our society, but contentment is most fully enjoyed by the humble of heart. Humility is a strange state to be pursued. As soon as a man claims to have found humility, he at once reveals his pride. The humble person doesn’t claim anything or demand to be noticed. The humble person is the one who doesn’t interpret every situation primarily by how it affects them. In 2 Samuel, Mephibosheth schools us in this kind of humility.\n\nAs Scripture informs us, Mephibosheth was the son of Jonathan, and the grandson of King Saul. When Mephibosheth was a small child, his father Jonathan was killed in battle. Fearing what the enemy would do to Jonathan’s son, a nurse fled with him to the royal palace in Gibeah. In her haste, the nurse dropped the young Mephibosheth, which resulted in the crippling of both his feet. Thus is the plight of a potential heir to the throne in Israel.\n\nMephibosheth’s humble physical state is often overshadowed by his humble heart, and rightly so. It is moving to consider that Saul’s rightful heir graciously submits to the new king, David. Given the context, these words from 2 Samuel 9 are strikingly beautiful: “So Mephibosheth ate at David’s table just like one of the king’s sons” (v.11).\n\nAt the king’s table. Let that settle in for a moment. He was where he didn’t deserve to be. His seat at the royal table and his presence in the palace weren’t the entitlement of inheritance, but the favor of another.\n\nAs the New Testament reminds us, the Lord shows favor to the humble. In fact, we are called to submit and humble ourselves “under the mighty hand of God, so that He may exalt us at the proper time” (1 Peter 5:6). Isn’t that a comforting promise? When Mephibosheth was stripped of his physical health and his family inheritance, he remained humble, and God providentially established his place.\n\nIn a society where everyone around us demands their wants and claims their felt rewards, where are the men of humble strength? In a culture of immediate-need pursuits, often at the expense of others, where are the men who are patient at heart? Our God is sovereign over all creation, and He is able to establish His will over the feeble plights of men. Patiently wait on the Lord, be strong and courageous (Psalm 27:14). As Jesus reminds us, “Everyone who exalts himself will be humbled, and the one who humbles himself will be exalted” (Luke 14:11).\n\nWritten by Matt Capps",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day43.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "2 Samuel 13:1-21, Psalm 55:1-23",
    "devo_title": "Tamar",
    "devo_summary": "Editor’s Note: Some passages in Scripture deal in subject matter which might be especially painful for some readers. Though many of the wounds we receive in this life are deeply personal and unimaginably painful, when they appear in God’s Word, we are reminded that He sees them. Whenever sin is addressed in Scripture—whether through teaching or story—it comes to us in the context of God’s unwavering commitment to bring an end to all evil in this world through the finished work of Christ (Revelation 21:3-4). We are praying for and with you as you read.\n\nAs readers of 2 Samuel, we are told about the lust and selfishness lurking in Amnon’s heart. We overhear Jonadab’s wicked advice to his friend. We know Amnon is only pretending to be sick in order to lure his sister into his bedroom all alone. We know the horrible violation that is coming, and it makes it no less difficult to read Tamar’s story.\n\nI’ve often wondered why this episode is included in Scripture. Sure, it’s a part of David’s story, and it sets the stage for Absalom’s rebellion—but is it necessary to understand redemption history? Would the story of Israel really be incomplete without Tamar’s devastation being repeated and rehearsed every time someone reads through the Old Testament?\n\nNot really.\n\nGod’s promises to Abraham and David would have come true in Christ, whether or not we had ever heard of Tamar. Sin would still be defeated on the cross, and the kingdom of God would still come, had Amnon never sunk to the depravity of demons. But Tamar’s story is there, black text against off-white paper in the middle of my Bible, inviting me to read and ask why God included it in His Word.\n\nBut that’s just it—God did include it in His Word. He breathed it out and made it sacred by incorporating it into Scripture. We should never doubt that God sees our greatest pain—those moments when we are trapped, all alone, without witness or defender. He sees the years that pass afterwards when memories of abuse drive us underground and away from others. He sees, and He is there, bottling up our tears, as the psalmist so poetically put it (Psalm 56:8). The record of 1 Samuel 13 leave us no doubt.\n\nTamar’s story is difficult to read, and I think that’s another reason why it’s included in Scripture. Too often, we flirt with sin, skirting just past the edges of God’s commandments. Other times, we race out head first. But Tamar’s experience puts the ugliness of sin on full display. She is, to use the Bible’s own words, made desolate by the sin of Amnon. And we are all, in one form or another, continually making each other desolate, one sin at a time. I don’t say that to minimize or trivialize the pain of Tamar or any other person who has been sexually abused or violently attacked. There is really no comparison between our everyday sins and tragedies like Tamar’s. My point is, rather, that our sin always has consequences, for ourselves and for the other people in our lives. The sins of others are wounding us, and our own sins are wounding others, all the time. In our sin, we are steadily bringing desolation to one another instead of life.\n\nAnd it is precisely for this reason that Jesus came—to replace desolation and pain with life and joy. During His earthly ministry, Jesus described a time in the future He called “the renewal of all things” (Matthew 19:28). On that day, “grief, crying, and pain will be no more” (Revelation 21:4) and “past events will not be remembered or come to mind” (Isaiah 65:17). That means the shame brought upon Tamar by her brother Amnon does not have the final word. It will, one day, be no more. And in that, there is hope, even in a story like Tamar’s.\n\nToday, let’s thank our God, whose goodness is deeper and wider than even the most abominable of sins our hearts can devise, and let’s pray together for every soul whose ever known the pain of Tamar.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day40.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "2 Samuel 11:1-17, 2 Samuel 11:26-27, 2 Samuel 12:7-25, 1 Kings 1:1, 1 Kings 1:5-31",
    "devo_title": "Bathsheba",
    "devo_summary": "Editor’s Note: Some passages in Scripture deal in subject matter which might be especially painful for some readers. Though many of the wounds we receive in this life are deeply personal and unimaginably painful, when they appear in God’s Word, we are reminded that He sees them. Whenever sin is addressed in Scripture—whether through teaching or story—it comes to us in the context of God’s unwavering commitment to bring an end to all evil in this world through the finished work of Christ (Revelation 21:3–4). We are praying for and with you as you read.\n\nThe story of David and Bathsheba is full of sin, bloodshed, and death—and the Bible gives a clear assessment of King David’s role in the matter. In his absence from the battlefield, in his adultery with Bathsheba, and in the cold-blooded murder of Bathsheba’s husband, Uriah, “the LORD considered what David had done to be evil” (2 Samuel 11:27).\n\nInterestingly, the Bible passes no such definitive judgment upon Bathsheba. Obviously, Bathsheba’s life was fraught with hardship and tragedy: uninvited sexual advances from the king, which she was powerless to refuse (11:4), an unplanned pregnancy with a man who was not her husband (v.5), the untimely death of her husband at the hands of the king (v.17), and the death of her infant child (12:18).\n\nThough the beginning of their marriage was less than ideal, Bathsheba received comfort from David after the death of their child, and the Lord ordained for her to bring forth another son into the world (12:24). \n\nThat son—Solomon—would later receive the throne of his father (1 Kings 1:30). Bathsheba advocated for her son in this regard, and when Solomon became king, she received the honor due the king’s mother.\n\nAs I read the details of Bathsheba’s life, I wonder what it all means. My own life is constructed of triumphs and tragedies that often seem devoid of greater meaning and purpose. To anyone who has joined me in wondering, What is the meaning of my life? or Why are certain things happening to me? the larger context of Bathsheba’s life offers very good news. \n\nThrough a union she never asked for, the Messiah came into the world; Matthew records that Jesus Christ was born David’s line through Solomon (Matthew 1:6). The Bible’s ultimate judgment upon the life of Bathsheba was that it was of monumental importance to the Father’s redemptive work, not because her triumphs outweighed her tragedies, but because her life was overseen by a Savior whose purposes are always good.\n\nThe same is true of your life as you walk with Christ. You are in His hands as He works through tragedy and triumph, and in all things in between (Romans 8:28). Life by life, the Father is redeeming and restoring the Creation He loves. Will you thank Him today for His faithfulness in all things?\n\nWritten by Davis Lacey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day39.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Samuel 25:1-44, Proverbs 15:1-4",
    "devo_title": "Abigail",
    "devo_summary": "Abigail’s story in Scripture is brief, but it reflects the ministry of Christ.\n\nWhen David and his men were in the wilderness hiding from King Saul, they sought refuge and food at the home of a man named Nabal. Nabal refused their request, insulting David and his men in the process. So David prepared to fight. When Nabal’s wife, Abigail, heard they were coming, she went out to intercept them—to give them supplies and apologize for her foolish husband.\n\nAbigail told Nabal what she had done. When he learned how David had planned to kill him, he had an apparent heart attack, or possibly a stroke, and died ten days later. When David heard about Nabal’s death, he married Abigail and took her into his home.\n\nMany Old Testament figures foreshadow Christ, meaning they illustrate His coming ministry. Abigail is one such person. Looking at this story through the lens of the gospel, David, the righteous and strong king, represents God. And Nabal, the obstinate and intoxicated property owner who was unwilling to welcome in the king—well, he represents us. Abigail, the one who interceded before the king on Nabal’s behalf, represents Christ.\n\nNabal represents the worst in us. The soon-to-be-king asks for food, and Nabal says, in effect, “No. Who does he think he is, asking me to share what’s mine?” He doesn’t just decline David’s request. He does so with contempt. The wage of Nabal’s sin, according to David, is death (1 Samuel 25:12–13).\n\nBut Abigail comes to David on Nabal’s behalf, offering a righteous recompense to atone for Nabal’s prior belligerence. She asks for mercy but also brings an offering to secure it. She says (my paraphrase), “I know my husband is a fool and a rebel, but I’m asking you to receive my offering on his behalf and forgive his trespass” (vv.23–25).\n\nThis is a picture of the work of Christ. The righteous one comes to us, asking for our fidelity and generosity, and we turn away in disgust at the very thought He has any claim on us. But He does have a rightful claim on us and regards our rejection of Him as outright rebellion. Christ intercedes on our behalf, offering His record of perfect righteousness to cover our iniquities, asking the Father to forgive us according to His sacrifice. God receives the offering of Christ on our behalf, and we are delivered.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day38.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Samuel 16:1-13, 2 Samuel 5:1-12, 2 Samuel 7:1-29, Acts 13:21-23",
    "devo_title": "David",
    "devo_summary": "Saul was the first Israelite king, but God rejected him and chose young David to replace him (1 Samuel 16:1–13; Acts 13:21–22). Soon Saul recognized David as a rival and a threat, and he mustered an army to smoke David out and destroy him (1 Samuel 22:8). Later, after Saul committed suicide to avoid capture by the Philistines, David ascended to the throne. King David defeated the Jebusites, conquering the fortress of Jerusalem (2 Samuel 5:1–12). After all this, God gave David rest.\n\nScripture says that King David got settled in his palace and God gave “him rest on every side from all his enemies” (2 Samuel 7:1). But David wouldn’t sit still. Alone in his palace, the man of action—a war hero without a war, a statesmen with no opponent—had time to think. Instead of laying back, David looked for the next hill to take. When the prophet Nathan came to visit, David started thinking out loud about his plans: “Look, I am living in a cedar house while the ark of God sits inside tent curtains” (v.2). It seemed strange. God is the great King of kings, so if the earthly king has a mansion, God should have a palace, right? Nathan agreed, “Go and do all that is on your mind, for the LORD is with you” (v.3).\n\nSometimes when circumstances are clear and our motives seem pure and selfless, it hardly seems necessary to pray and seek God’s guidance. It just feels more natural to get to work. David had experienced the high that comes with God’s blessing, but now his busy heart was in danger of getting ahead of God. So God gave Nathan a dream in the middle of the night, and then He sent the prophet back to reject David’s plan. “Are you to build me a house to dwell in?” God asked David (v.5). The implied answer was a clear “no.”\n\nFor David, this message from God must have been jarring. But in reality, it was a great kindness. David didn’t know it at the time, but he needed God to bring his heart peace in much the same way he’d brought peace to the kingdom. The Lord settled David’s heart with three truths.\n\nGod reminded David that He had been good to him:\n\n“I took you from the pasture, from tending the flock, to be ruler over my people Israel. I have been with you wherever you have gone, and I have destroyed all your enemies before you” (2 Samuel 7:8–9).\n\nGod told David He would be good to him again:\n\n“I will make a great name for you like that of the greatest on the earth” (v.9).\n\nGod promised David that He would always be good to him:\n\n“The LORD himself will make a house for you.… Your house and kingdom will endure before me forever, and your throne will be established forever” (vv.11,16).\n\nWe know this last promise was fulfilled in Jesus Christ. On busy days, when we’re anxious to work hard for God, let’s first settle our hearts in Christ. He has been good to us, and He will continue to be good to those who call Him Lord.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day37.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Samuel 10:1-27, 1 Samuel 13:1-14, Numbers 18:7",
    "devo_title": "Saul",
    "devo_summary": "When most of us think about Saul, there’s really only one word that comes to mind: failure. And with good reason. Saul was, to put it delicately, a hot mess. But he seemed to start out well, didn’t he?\n\nAfter Saul was anointed king, God’s Spirit filled him (1 Samuel 10:10), so it’s not as if God wasn’t invested in him. After Saul was presented as king, Samuel declared there was “no one like him among the entire population” (v.24). Saul accomplished a great deal of good early on; he won many battles for his people, leading his army into victory over Israel’s enemies. He had all this going for him—not to mention that he was apparently very handsome, a solid head taller than everyone else in Israel, and charismatic to boot. Yet, he was a complete and total failure.\n\nWhy? There are many reasons, but ultimately, it boils down to one thing: Saul was the king the people wanted. When Israel demanded a king, they wanted one like the kings of the other nations (1 Samuel 8:20), one who would fight their battles for them, rule over them, and act as their judge. But a king like those of the other nations would also be afraid of losing the authority and favor he had with his people.\n\nAnd that’s what Saul was more than anything: afraid to lose his power. He may have hidden among the supplies when he was named king (vv.21–22), but once he was in power, he did anything and everything to keep it—even violating God’s commands by offering a priestly sacrifice (1 Samuel 13:9; Numbers 18:7). As a result, the kingdom he hoped to keep forever was stripped away from him and handed over to another (1 Samuel 13:14).\n\nThere’s probably a warning for us in there, isn’t there? Saul’s failures were big, yes, but we’re no better than him. We can distort the things God has given us to steward. We can become proud and overconfident, fearful of losing our (real or perceived) influence. If we are unaware of our fear and pride, we can easily compromise the way Saul did, doing what is right in our own eyes in the name of serving Christ.\n\nBut Saul’s story is more than a “do better” morality tale with a message that simply says, “Don’t be like Saul.” We need to see his failures for what they are and be honest about our own temptations to do the same. Our failures should make us see our need for Jesus, the King who is better than all the kings of the nations. He is the King who is better than the best humanity has to offer. His kingdom will never fail and never end, because He is seated on His throne forever.\n\nWritten by Aaron Armstrong",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day36.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Samuel 2:12–26, 1 Samuel 3:1-21, Exodus 27:20–21",
    "devo_title": "Samuel",
    "devo_summary": "Before the day’s classes began, he took dishwashing soap and proceeded to pour it in several of the fish tanks in his high school biology department. By the time teachers and students arrived to take their places with bright, shining faces, the tanks were, shall we say, bubbly. And the fish, if not already belly-up, were headed to that great aquarium in the sky.\n\nAs is usually the case when it comes to antics like that, somebody who knew the culprit just couldn’t resist telling, and then that person told another, and so on, and so on. Later that day, this guilty guy was summoned to the principal’s office. After agreeing to make some specific amends, and “do some time” in detention, he was sent back to class. But before leaving the principal’s office, my now good friend told me he heard these words: “You know, you’ll never amount to anything.” As it turns out, my friend actually did amount to something; he’s become quite successful.\n\nEli the priest had two sons named Hophni and Phineas. They were both wicked, constantly treating “the Lord’s offering with contempt” and “sleeping with the women who served at the entrance to the tent of meeting” (1 Samuel 2:12,17,22). Needless to say, the behavior of Eli’s sons makes the fish-tank prank look like a Sunday picnic. Clearly, Hophni and Phineas “did not respect the Lord” (v.12). They truly would never amount to anything—at least in the eyes of God. Yet in the midst of this great evil being done among the people, “Samuel grew, and the Lord was with him, and he fulfilled everything Samuel prophesied” (1 Samuel 3:19).\n\nThe wickedness of Hophni and Phineas stands in stark contrast to Samuel’s goodness and receptivity to the voice of the Lord. On four occasions, the Lord summoned Samuel. The first three times, Samuel thought Eli was calling him. But by the fourth time, Samuel knew it was the Lord. Far from some “you’ll never amount to anything” message, the Lord told Samuel “I am about to do something in Israel that everyone who hears about it will shudder” (v.11). And they were going to hear about it by way of Samuel, the mouthpiece of God.\n\nThe young boy summoned by the Lord amounted to a great deal in the history of God’s people. “All Israel from Dan to Beer-sheba knew that Samuel was a confirmed prophet of the Lord” (v.20). In God’s economy, what matters most is our ability to listen and our willingness to obey. This truth offers hope for anyone with ears to hear, even for those of us who’ve had occasion to desecrate a fish tank or two.\n\nWritten by John Blase",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day33.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "1 Samuel 1:1-28, 1 Samuel 2:1-11, Philippians 4:4-7",
    "devo_title": "Hannah",
    "devo_summary": "There is no one like our God. His character is revealed to us in many forms, from the awe-inducing thunder atop Mount Sinai, to the gentle comfort He brings as He hears our prayers. He is compassionate and remains close to the brokenhearted (Psalm 34:18), and He is also holy, though not as a distant and standoffish deity. Yes, there is a complete otherness to our God, because there is no like Him. No one cares for the brokenhearted—the dejected, the disappointed, the distraught—like Him.\n\nHannah’s life is brutal. Her husband’s heart and life and bed are divided. She doesn’t have all of him. Imagine how crushing this must have been for her. Add barrenness and bullying to the picture and you can see why Hannah’s spirit and appetite were crushed. But the good news for Hannah is that there is a God who listens, and He is full of power, able to answer our prayers. No one is a rock for sinking souls like our God.\n\nIf you’ve never walked through a deep and dark valley, just wait—everyone does at some point (John 16:33). That’s life in a broken world. Doubt grows. Old fears and frustrations push to take up room in our hearts and minds. Suffering invades. I’ve been there, and have learned that there is only one way to keep going. To trust God with our hearts. To believe that, as Hannah prayed, “He guards the steps of his faithful ones” (1 Samuel 2:9). He’s got His people in His hands.\n\nHannah asked God for a son, promising to give him back to the glory and purposes of God. She vowed to give back the one thing she desired most in this world. Whether she ate, drank, or had a son, it was going to be to the glory of God (1 Corinthians 10:31).\n\nIs that your mode of operation? Your desires and your longings in this life—do they begin and end with you, or do they crest to the cause of our risen Christ? Hannah’s motives were pure. James tell us, “You ask and don’t receive because you ask with wrong motives, so that you may spend it on your pleasures” (James 4:3). Hannah wanted to spend her request toward the fame of God’s name because she believed there is none like Him. This wasn’t just something she knew to be true. It’s a belief she lived out, regardless of her circumstances. Hannah trusted God with her heart’s deepest longings, and she learned to rejoice in Him always and in all things (Philippians 4:4–7).\n\nWritten by J.A. Medders",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day32.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Ruth 1:1-21, Ruth 2:1-13, Ruth 2:18-20, Ruth 3:1-11, Ruth 4:13-17, Proverbs 31:10-31",
    "devo_title": "Naomi and Ruth",
    "devo_summary": "I was a kid when I first saw the movie Back to the Future. You probably know the film—Marty McFly travels back to 1955 in a borrowed time machine and accidentally keeps his parents from meeting and falling in love. He then has to figure out how to get his mom and dad together or else he’ll never be born. And he has to do this all the while trying to harness a bolt of lightning so that he and his DeLorean time machine can get back to the present.\n\nIt’s a great movie, but I sat in the back of a dark room alone and cried that first viewing. I had just found out my parents were getting a divorce, and so my fragile heart just couldn’t handle the idea of Marty racing against the clock to put his family back together, no matter how fantastical the premise of the movie. I’d have done anything to put my own family back together.\n\nCentral to the story of Naomi and Ruth is a broken family, though theirs was not broken by divorce or time travel. Instead, their husbands died in the land of Moab. Ruth, a Moabitess herself, left everything familiar behind to accompany her mother-in-law, Naomi, back to Bethlehem, the hometown of her deceased husband, Elimelech. But the two women were equally destitute. In those days, a woman without a father or a husband to provide for her was almost certain to spend the remainder of her days in abject poverty. Add to this the fact that this story takes place during the time of the judges, a period in which “everyone did whatever seemed right to him” (Judges 21:25), and it becomes plain: Naomi and Ruth were at the mercy of strangers.\n\nBut they were also at the mercy of God. And God is full of mercy.\n\nBoaz may have been the one to marry Ruth. He may have even been the one to restore the line of Elimelech. But it was God who redeemed the family. “The women said to Naomi, ‘Blessed be the LORD, who has not left you without a family redeemer today. May his name become well known in Israel’” (Ruth 4:14).\n\nWe are all part of a broken family—broken since the first bite was taken from the forbidden fruit in\n\nthe garden. In sin, we are alienated from one another and from our Father in heaven. But God provided a Family Redeemer for us in Jesus Christ. He has shown kindness to us in our desperation, and He is bringing restoration to our splintered family tree. “Look, I am making everything new,” He says (Revelation 21:5). Because of Jesus, we have a future filled with hope. No DeLorean or lightning bolt required.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day31.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Judges 6:11-23, Judges 6:33-40, Judges 7:1–23, Psalm 9:3-10",
    "devo_title": "Gideon",
    "devo_summary": "When I was seventeen, a pastor told me I reminded him of Gideon from the Bible. Looking back, I’m pretty sure he meant that God would use me to do big things, but at the time I could only remember the part of Gideon’s story where he asked God to perform a minor miracle with a fleece. In my mind, it showed a lack of faith on Gideon’s part, an audacious attempt to test God. I was naturally offended. \n\nI believed the gospel. I believed in the goodness and the power of God. I believed He had a plan for my life. And if He commanded me to do something—no matter how difficult or dangerous—I’d do it. No questions asked. I didn’t need God to show me any miracle as a prerequisite. I had faith.\n\nSince those obnoxious teenage years, I’ve wanted to wake up to sopping wet fleeces more times than I can count. I’ve been uncertain about God’s direction. I’ve wanted my doubts appeased. I’ve wanted to witness a miracle or two to quicken my wilting faith. Now, instead of seeing Gideon as weak, I see him as human—someone just like me.\n\nAfter those two nights with the fleece project, Gideon obeyed the Lord and did what he was told, even when it seemed silly (like the whole troop selection process that involved choosing men who drank their water like dogs). But nowhere in the story are we given permission to think that Gideon’s victory over the Midianites had anything to do with his own skill or strength. Gideon’s “army” of three hundred men defeated their enemies because God fought for them. Gideon’s obedience was not a condition for the saving of Israel, as if God needs any human being to accomplish His purposes. In that light, the episode with the fleece is an invitation, God saying, “Gideon, join me in what I am about to do!”\n\nI don’t believe we are supposed to read Gideon’s story as a template for discerning God’s will or learning to follow Him through life’s more difficult challenges. Rather, we are to read Gideon’s story for what it is: an account of the way God chose to meet one particular man at one particular time in history. The Lord knew Gideon’s mind and precisely what he needed to step out on the road before him. God granted Gideon a fleece (twice) because that was the way His perfectly good heart would best meet Gideon’s failing heart. But what is best for one person is not best for every person.\n\nGod is good all the time, and while He makes no promise of miracle-provisions to smooth over our doubts, He invites us to come to Him with our rough edges and our questions. As Jesus once told a group of scribes and Pharisees, “It is not the healthy who need a doctor, but the sick. I have not come to call the righteous, but sinners” (Mark 2:17). Thankfully, we serve a God who didn’t wait for us to have our acts together. \n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day30.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Judges 4:1-24, Judges 5:1-31, Deuteronomy 20:1-4",
    "devo_title": "Deborah and Barak",
    "devo_summary": "In college, I took a course on rhetorical theory. I honestly can’t recall why I signed up for this particular class; it must have fulfilled some core curriculum requirement. For the purposes of this story, I want to emphasize the theory part. There was never supposed to be any public speaking—just studying the classical forms of rhetoric and persuasive speech. But about two weeks after I could drop the class without consequence, the professor had a “wonderful idea” for an assignment that would really cement what we were learning in our textbooks: a speech in front of the whole class.\n\nI decided to make my ten-minute talk about the separation of church and state, and what that means for Christians in the public square. I spent hours in the library researching my topic and writing notes on index cards. By the day of my speech, I was sure I had my arguments nailed down. I was ready to go. But then, when I got behind the lecturn, I froze. I looked down at my cards and couldn’t read my own writing. In about three minutes flat, I stuttered, stumbled, and otherwise bumbled my way through the talk I’d prepared. I’m sure I left out several points I’d meant to make, and judging by the looks on the faces in that room as I walked back to my seat, I’m not sure what I said made any sense at all.\n\nThankfully, my professor was gracious in his grading, remembering that the initial syllabus for the course required no such public speaking. But the whole experience left me a bit shyer and more reserved. To this day, I don’t like speaking up in meetings unless I’m very comfortable with the other people in the room. When I’ve been asked to preach or teach, it takes every ounce of focus and energy I can muster to see it through.\n\nThis fear of failure has made me very sympathetic toward Barak. We’re not told precisely why he didn’t act when God called him to gather an army and face the Canaanites. We just know that Deborah called him out (Judges 4:6–7). Barak was reluctant but agreed to obey the Lord, but only if Deborah would go with him. Because of this request, Barak lost out on a blessing that could have been his. “‘I will gladly go with you,’ [Deborah] said, ‘but you will receive no honor on the road you are about to take, because the Lord will sell Sisera to a woman’” (v.9).\n\nIn the end, the victory was Barak’s and Deborah’s together. The song of praise that comprises chapter five of Judges credits them both: “Awake! Awake, Deborah! Awake! Awake, sing a song! Arise, Barak, and take your prisoners, son of Abinoam!” (Judges 5:12). And the chief prize, the defeat of Sisera, commander of the Canaanite army, was taken by Jael, a woman who knew two things: that it’s always wise to be on God’s side in any conflict, and… how to wield a tent peg.\n\nGod didn’t need Barak, or Deborah, or Jael to defeat the Canaanite army oppressing the Israelites. He could have obliterated it with a single thought. But like He has done throughout redemption history, He chose to use His human image-bearers to bring about His purposes. We may not be asked to stand down a thundering horde of chariots, but God has called us to advance His kingdom, testify to the truth of the gospel, and do good to everyone we meet. Let’s not hesitate. Let’s not be afraid of failure. God will still get the victory if we falter, but we might miss out on a blessing God has in store for us if our obedience is an afterthought rather than a reflex.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day29.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Joshua 2:1-24, Joshua 6:22-25, Matthew 1:1-6, Hebrews 11:1, Hebrews 11:31",
    "devo_title": "Rahab",
    "devo_summary": "One of the greatest biblical heroes of faith is a woman whom Scripture constantly names “the prostitute” (Joshua 2:1, 6:17,22,25; Hebrews 11:31; James 2:25). Though a woman of notorious disrepute in Jericho, Rahab became a recipient of the saving grace and mercy of God, and so served the purposes of God in delivering His spies and her own family. What was it that made the unlikely and unexpected difference in this woman’s life, enabling her to align herself with the people of God? In short, it was the message of God’s deliverance of His people from the bondage they experienced in Egypt.\n\nThe close connection between the exodus and the conquest provides the platform for understanding what God was doing in the life of Rahab, the prostitute. When the spies first entered the promised land, Rahab hid them from the king of Jericho. While hiding them, she said:\n\n“I know that the LORD has given you this land… For we have heard how the LORD dried up the water of the Red Sea for you when you came out of Egypt, and what you did to Sihon and Og, the two Amorite kings you completely destroyed across the Jordan. When we heard this, we lost heart, and everyone’s courage failed because of you, for the LORD your God is God in heaven above and on earth below” (Joshua 2:9–11).\n\nJames tells us that Rahab acted in faith in receiving, hiding, and sending the spies out another way (James 2:25). She heard about the God of Israel and believed that He was the God of saving deliverance. She trusted that He would give His people an inheritance in Canaan. In turn, God spared Rahab and her household.\n\nOne of the marvelous truths in redemptive history is that Rahab became the great-great-grandmother of King David—the covenantal progenitor of the Redeemer, Jesus Christ (Matthew 1:5–6). Jesus Christ, the sinless Son of God, who came into the world to secure the promises of God given to Abraham and to confer upon His people the everlasting inheritance (Luke 22:29), redeemed a broken woman like Rahab. Who among us can doubt the greatness of the mercy and grace of God in Christ! Truly we can conclude that where our sin increases, His grace is multiplied even more (Romans 5:21).\n\nWritten by Nick Batzig",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day26.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Joshua 1:1-18, Joshua 23:1-16, Deuteronomy 31:6-8",
    "devo_title": "Joshua",
    "devo_summary": "In just a few months I’ll be climbing one of the most iconic landmarks in the United States: Half Dome in Yosemite National Park. Just thinking about the climb, I feel anxious. I want to make it to the top. I want to remind my body that, even at 40 years old, I’m not done with significant physical endeavors. I want to be able to say that I have put my mind, body, and heart toward a significant goal, and have seen it all the way through. From the inception of the plan to its conclusion and success, I want to see this thing, this climb, all the way through.\n\nIn many ways, this is the story arc of Joshua. Although not a perfect man by any stretch, his life resonates with a theme Eugene Peterson described as, “a long obedience in the same direction.” As the torch of leadership in Israel is passed from Moses to Joshua, a daunting task stands in front of this new leader—to transition God’s people from the desert into the Promised Land. Joshua’s legacy stands or falls on his effectiveness in fulfilling this task.\n\nThat kind of immense responsibility would cause anyone to have anxiety, and maybe just a little heartburn. The responsibility of bringing God’s people into the rest of the promised land loomed large over Joshua’s life. Perhaps we can understand why he would feel timid and weak. Yet the responsibility of carrying out this feat wasn’t Joshua’s to accomplish on his own. Left to himself, Joshua most likely would’ve had about a zero percent chance of success. Yet the presence of God stood over him all the way along, just as God promised it would:\n\n“Haven’t I commanded you: be strong and courageous? Do not be afraid or discouraged, \n\nfor the LORD your God is with you wherever you go” (Joshua 1:9).\n\nWhen we read about Joshua’s success in Joshua 23, we need to remember that the victory was not brought about by his own ability or strength. Joshua’s success was the result of his faith in the promises of God and the assurance that He would be present with His people. Every one of His promises was fulfilled; not one of them failed (Joshua 23:14).\n\nReaching the finish line of our faith may feel like summiting a peak that’s just too tall. Yet Joshua’s life can deeply encourage us in our steps today. We can trust the promises of God to get us to the finish line. The encouragement to “be strong and courageous” comes with the empowerment of the gospel, that Christ has already climbed the mountain for us. The One who defeated sin and conquered death will be faithful to bring us into the kingdom He has prepared for us.\n\nBy trusting in the promises of God, we can take that next step in faith, in whatever situation or circumstance, knowing that Christ will not leave us or forsake us, but will bring us all the way to glory. So, believe! Be strong and courageous.\n\nWritten by Jeremy Writebol",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day25.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Exodus 31:1-11, Exodus 35:1-35, 1 Corinthians 12:4-7, 11, 2 Peter 1:3",
    "devo_title": "Bezalel",
    "devo_summary": "Jean de Chelles is a name not many were familiar with until April 15, 2019. On that day, due to the interconnectedness that social media allows, the watching world held its breath as a structure fire broke out beneath the roof of Notre-Dame Cathedral, the 850-year-old Gothic structure that is one of France’s most famous landmarks. Although any aspect of that architectural marvel that burned would constitute a loss, many were focused on the famed rose windows. The North Rose Window was constructed around 1270, and the architect was one Jean de Chelles.\n\nWhile interest in his name has resurfaced, it will no doubt fade again as restoration begins on the Cathedral and people return to their everyday lives. And this is okay. The legacy the artist left is not his name—it is the window.\n\nWhen’s the last time you heard a sermon, attended a Bible study, or sat in on a Christian conference session where the subject of discussion was a man named Bezalel? Yeah, me either. I think the answer is “never.” But the book of Exodus reminds us of this craftsman who God commissioned to bring his talents and skills to bear in the construction of the tabernacle. According to the text, Bezalel was quite the artisan, working in mediums of gold, silver, bronze, the cutting of stone, and the carving of wood. In other words, this guy was good, and understandably so, as God Himself “filled Bezalel with [His] Spirit, with wisdom, understanding, and ability in every craft” (Exodus 31:3).\n\nThese facts, plus a little family history—“the son of Uri, the son of Hur, of the tribe of Judah”—are all we know of this man. He did have a partner in this artistic endeavor, a man named “Oholiab, son of Ahisamach, of the tribe of Dan,” but we know nothing beyond that. But when it comes to the tabernacle, this physical dwelling place for God’s Spirit? Well, we know quite a bit, and this structure looms large in an understanding of God’s work in the Old Testament. Somewhat like de Chelles, Bezalel’s name is important, but the more important aspect is the work of art he was commissioned to contribute to the tabernacle.\n\nShould anyone think God doesn’t care about art and architecture, and furthermore about excellence in such matters, there are pages of Scripture which mention rather forgettable men who worked on unforgettable wonders. Bezalel is one of those men, a man filled with God’s Spirit and gifted with skills that would draw attention to the majesty and glory of God.\n\nWritten by John Blase",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day24.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Exodus 2:1-8, Exodus 14:1-31, Exodus 15:19-21, Isaiah 12:2",
    "devo_title": "Miriam",
    "devo_summary": "Front row seats are the best. I’ve only had them for a major occasion once or twice, but sitting close to the front at a sporting event or concert is my preference. The front row offers the best views. Sitting close lets me see in better detail the events in front of me. It also offers me the opportunity to be more involved in whatever it is I’m watching in some way. There’s a responsibility that comes with getting the front row seats.\n\nMiriam may be a rather obscure person in the Bible, but her contribution to the story of God and His people is significant. Her courage to stand and watch to see what would happen to her infant brother, Moses, as he floated in a small basket down the river shows us a woman of compassion (Exodus 2:4). Her boldness to approach Pharaoh’s daughter and ask if a Hebrew woman could nurse the baby for her, and then to get the baby’s mother to do so demonstrates wisdom in applying the providence of God to daily life (vv.7–8).\n\nYet, apart from this brief appearance in the beginning of Moses’s story we don’t hear much about Miriam. But she is there. Like the rest of Israel, Miriam endured the harsh conditions of Egyptian slavery. She saw the unparalleled power of God from the front row as the plagues descended upon Egypt, one after the other. She probably had meal-time conversations with Moses and Aaron about what God was doing in the midst of these monumental events. She trusted God in the midst of the Passover, posted the blood above her door, and was ready to leave Egypt as the command came. She marched with Israel on the way to the Promised Land while the great Red Sea stood in their path.\n\nExodus 14 tells us she was there when God ripped the sea in two and them to walk on dry ground with an ocean barrier in front and an Egyptian army behind. She was there when the water swallowed up her enemies. She sat on the front row as God powerfully poured out His mercy and grace on Israel and rescued them from their slavery. The details were riveted in her heart and mind.\n\nIt makes sense then that from the front row she led the Israelits in praise. Miriam may be one of the first worship leaders in the Bible. There, with tambourine in hand and a praise choir of women alongside, she sang a new song of worship to God: “Sing to the LORD, for he is highly exalted; he has thrown the horse and its rider into the sea” (Exodus 15:21). The front-row seat brought a great opportunity to participate in the moment of praise to God.\n\nMiriam’s life asks me (and perhaps you) this question: Where has God allowed me a front-row seat to see His glory and then offer Him praise, all because I’ve seen the details up close and perhaps better than anyone else? May we learn to worship and lead others to do the same, because we have seen Him do great and mighty things.\n\nWritten by Jeremy Writebol",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day23.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Exodus 4:27-31, Exodus 7:8-13, Exodus 32:1-6, Exodus 32:21-24, Leviticus 8:1-5, Leviticus 9:1-7, 1 Corinthians 10:7",
    "devo_title": "Aaron",
    "devo_summary": "Growing up, I thought people like Moses, Aaron, David, Samson, and Elijah were the heroes of the Bible. They are not. The Bible has one hero—Christ. All the other key characters God uses—and uses mightily to change the world, by the way—are filled with complex sin, moral collapse, and obtuse immaturity.\n\nAaron, Israel’s first High Priest, is no exception. We meet him when he becomes stammering Moses’s mouthpiece—speaking hard words to a hardened Pharaoh. He serves alongside Moses throughout the Exodus from Egypt, holding up Moses’ arms both literally and figuratively.\n\nAaron saw the power of God firsthand in ways few others in Scripture ever witnessed. God set Aaron and his family apart to serve as Israel’s priesthood—the people who would stand in as mediators between God and man. They were imperfect versions of what Christ would do perfectly.\n\nAaron’s failures were epic. He led the people in crafting a golden calf to worship when it seemed Moses would not be coming down from Mount Sinai any time soon. Then he denied personal responsibility with one of the greatest lines of obfuscation in Scripture, “I threw [the gold] into the fire, and out came this calf” (Ex 32:24).\n\nAnd yet, God continued to work through Aaron and his family. They continued to serve as priests for the people of God, offering sacrifices on Israel’s behalf, teaching them God’s Law, and maintaining a culture of worship.\n\nBut there was only so much an imperfect priest could do. They could warn Israel of their sin. They could remind them of their past histories with idolatry. They could take them through the stories of the generations before who had, without exception, all at one point or another embraced the gods of their neighboring countries. They could implore, threaten, pray, and appeal. They could pound their fists on their pulpit. They could plead from their knees. They could sing in the sweetest whisper of a lullaby.\n\nBut one thing they could not do. They could not make Israel holy. They could warn them of their proclivity to sin, but they could not take it from them. They could vividly predict their certain coming guilt, but the priest could not take it away. They could lead many of the sons of Israel to think, but they could not lead any sons to glory (Heb 2:9-10). Only Christ could do that—our truer and better High Priest, the hero of Scripture. And this is exactly what He does.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day22.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Acts 7:17-36, Exodus 3:1-22, Exodus 4:1-17",
    "devo_title": "Moses",
    "devo_summary": "In his final sermon, deacon and first Christian martyr, Stephen, described Moses as being “no ordinary child” (Acts 7:20, NIV), “beautiful in God’s sight” (CSB). You see, “Moses was educated in all the wisdom of the Egyptians and was powerful in his speech and actions” (v.22). Powerful in speech and actions! If you’ve read Moses’s story, those are amazing words.\n\nWhen God first called Moses at the burning bush, the Israelites were in great need of a deliverer. A new king had come to power in Egypt, one who dealt treacherously with the Israelites and oppressed them by forcing them to “abandon their infants outside so that they wouldn’t survive” (Acts 7:19). God explained that He would work through Moses to rescue the Israelites from slavery, but at that moment, Moses was far from powerful in his speech or action.\n\nGod’s call on Moses to speak for the vulnerable in the face of great political power left him afraid to say or do anything. Instead, he stammered and complained again and again, telling God he was not up to the task:\n\n“Who am I that I should go to Pharaoh and that I should bring the Israelites out of Egypt?” (Exodus 3:11).\n\nAnd—\n\n“What if they won’t believe me and will not obey me but say, ‘The LORD did not appear to you’?” (4:1).\n\nBut—\n\n“Please, Lord, I have never been eloquent—either in the past or recently or since you have been speaking to your servant—because my mouth and my tongue are sluggish” (v.10).\n\nMoses was a faltering mess, but God answered every one of his objections. He told Moses, “Now go! I will help you speak, and I will teach you what to say” (v.12). God kept that promise too. He gave Moses His Holy Spirit, who strengthened Moses to testify before the king and perform miraculous signs (Isaiah 63:12). Because of the Spirit’s work through him, Moses became the people’s public advocate, a prophet and leader who was truly mighty in word and deed!\n\nLater in his life, Moses predicted that God would raise up for the Israelites another prophet like him (Deuteronomy 18:15,18; Acts 7:38). Moses looked forward to Jesus, the greater prophet who was “powerful in action and speech” (Luke 24:19). When we were helpless, Jesus spoke up for us. When we were oppressed by sin and death, He went to the cross to deliver us.\n\nAnd now, by His Holy Spirit, we can speak up for and act on behalf of others as well. Just as God gave Stephen the strength to speak the truth and show compassion in the face of great hostility, the Spirit will also teach us what to say and fill us with His great mercy (Matthew 10:19–20) .\n\nFather, make us bold, powerful in speech and action. Amen.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day19.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Exodus 1:8-21, Psalm 34:1-22, Galatians 6:7-10",
    "devo_title": "Shiphrah and Puah",
    "devo_summary": "In our celebrity-driven, media-immersed culture, we need to be reminded that often the real heroes are those living faithfully in obscurity, enacting their faith in God in ways that are costly to them and unpopular in their culture. Such were Shiphrah and Puah, the two midwives who disobeyed the command of Pharaoh regarding the slaughter of the Israelites’ male infants. These two women defied the most powerful empire in the world at the time, because they feared God more than they feared Pharoah.\n\nIn every generation, believers are tempted to do things that are culturally acceptable, even “world changing” by earthly standards, without realizing that God may want them to stand against the masses and bring about change—which can sometimes mean doing some culturally unacceptable and very unpopular things.\n\nShiphrah and Puah must have felt an enormous temptation to compromise their integrity in exchange for perceived safety and security. If they defied Pharaoh, it could cost them their lives. However, Moses tells us these women “feared God” and refused to kill the male infants. They respected the preservation of life in their hearts and acted in faith, believing that the God of Israel would be faithful to them.\n\nThese women did not compromise or bend to the wicked dictates of Pharaoh, and the result of their faithful service is astonishing. Their actions resulted in the preservation of Moses, and ultimately, Jesus Christ—coming Messiah, new (and lasting) covenant Mediator, and Savior of the world. God also rewarded the midwives with families of their own (Exodus 1:22).\n\nThe Lord not only protected these courageous women, but also His promise to send a Redeemer into the world to rescue a people from every nation, tribe, and tongue (Revelation 7:9). May we also commit ourselves to doing the unpopular and costly acts of faithfulness, in the obscurity of our everyday lives and without an audience. We may never see the immeasurable fruit that God brings about on account of our courageous faithfulness, but we can be sure that He will be with us as we seek to live and act in faith according to His word and promise.\n\nWritten by Nick Batzig",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day18.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 39:1-23, Proverbs 24:15-16, Ephesians 5:1-4, 1 Thessalonians 4:1-8",
    "devo_title": "Potiphar’s Wife",
    "devo_summary": "The biblical text is brimming with names, many of them extremely difficult to pronounce. But the point is, there are specific names on almost every page of Scripture. So it always interests me when I come across a man or woman who is unnamed. That’s exactly what we find with the woman at the center of today’s story. She is only known in Scripture as “his master’s wife.” Joseph corresponds to “his,” and Potiphar is the “master”; she is simply “wife,” a woman with no name. But her story is far from simple. And should you choose to read it through some of the cultural filters at work in our day, the story grows even more complex.\n\nHere’s the CliffsNotes version: Potiphar was an Egyptian officer, a captain in fact. Though a slave, Joseph was an up and comer. “The LORD was with Joseph, and he became a successful man” (Genesis 39:2), and Potiphar took notice. So Potiphar put Joseph in charge of his household, everything that he owned. In that household was a wife who took a liking to “well-built and handsome” Joseph, and said to him, “Sleep with me.” She made the plea more than once, and each time Joseph refused. His question to her, in addition to breaking trust with Potiphar, was, “How could I do this immense evil, and how could I sin against God?” (v.9).\n\nFor God has not called us to impurity but to live in holiness (1 Thessalonians 4:7).\n\nThe final proposition scene ended with Joseph running out of the room while Potiphar’s wife was left holding his garment. Yeah, not a good look in biblical times or now. She accused Joseph of trying to take advantage of her, Potiphar believed his wife, and Joseph ended up in prison.\n\nIn one sense this could be the script for a made-for-TV movie. Pretty straightforward, really: It’s the story of a frustrated wife who is suddenly taken with the pool boy. The “he said, she said” game never ends well, for anyone involved. But this story contains a line seldom, if ever, heard in TV movies: “But the LORD was with Joseph.”\n\nAt first blush it appears a woman is at the center of this story. But upon closer inspection, it’s clear that a larger, grander character is the axis for these scenes. This character has a name: the LORD. Joseph’s life, though not without conflict and hardship, is kept secure in the LORD’s hands. And while the LORD does not bless him solely because of his integrity, Joseph’s refusal to undermine Potiphar’s trust and sin against God shows his steadfast devotion to the Name above all names.\n\nWritten by John Blase",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day17.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 37:1-13, Genesis 37:18-28, Acts 7:9-16, Genesis 50:15-21",
    "devo_title": "Joseph",
    "devo_summary": "Would ten-years-ago you believe what your life is like today? I know mine wouldn’t. He’d laugh, shake his head, pat me on the back and say, “Yeah, right, pal. You aren’t going to be a pastor. You aren’t marrying that girl from the coffee shop. Kids? You can’t even get to work on time. Good luck with that.” Of course, ten-years-ago me was a moron. He didn’t know what he didn’t know.\n\nThe dreams God gave Joseph set him on a winding, bumpy, spiraling path that led to rock bottom. Literally. From being thrown into a pit and sold into slavery, to being imprisoned in Egypt—Joseph’s life was the pits, but God was with him.\n\nThrough Joseph’s wisdom and gifting, he was eventually brought out of prison and promoted to be Pharaoh’s right-hand man. Do you think in-the-pit Joseph ever could have foreseen this? Sure, Joseph had seen a glimpse of what was in his future, because God had shown him in a dream. But he didn’t know how all the gaps would be filled in, what would happen in between prison and the vision God had given him. When a famine in the region led to Joseph’s family bowing down before him, honoring and thanking him for the provisions given to them, Joseph’s vision came true—but only because God is faithful.\n\nBrothers, there are all kinds of dreams and hopes we have for our lives. Some of them will come true. Many won’t. But God hasn’t promised to meet all of our wishes. He’s promised to love us. He’s promised to transform us into the image of His Son, the crucified and risen Lord (2 Corinthians 5:17). Trials happened to Jesus, so yeah, they will happen to us as well (John 16:33). Between the good and bad, the known and unknown, we need to learn to trust God with the gaps in our lives, come what may. He never forgets us. He is always with us.\n\nJesus was betrayed by one of His brothers, too—His disciple Judas. He was brought low and lifted up at the cross. Jesus was locked in the prison of death, but up from the grave He arose and ascended to the Father’s right hand, where He reigns and rules over the universe. What men meant for evil, God meant for good—in Joseph’s life, in Jesus’s life, and in our lives, too (Romans 8:28).\n\nWritten by J.A. Medders",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day16.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 28:10-22, Genesis 31:13, Genesis 32:3-32, Genesis 33:1-11, Genesis 35:9-15, John 1:43-51",
    "devo_title": "Jacob",
    "devo_summary": "If Jacob had played professional baseball, he’d have been the sort to use performance-enhancing drugs. If he were a pop star, the scandal might have been lip-syncing to someone else’s vocals. And if he were a businessman, no one would be surprised to read about charges of tax evasion in the Wall Street Journal. Jacob is a cheater, a schemer, a bender and breaker of the rules. He’s opportunistic, always looking out for number one. And yet, God chooses him to be the namesake and father of the twelve tribes of Israel.\n\nWhen we first encounter Jacob in the biblical narrative, he’s still in utero—and he’s already scheming to get ahead! He clutches his older brother’s heel, as if trying to keep Esau from being born first and receiving the corresponding privileges. This pattern continues throughout Jacob’s life, whether he’s serving up stew to trade for Esau’s birthright, tricking his father, Isaac, into giving him the blessing of the firstborn, or trying to one-up the deceitfulness of his father-in-law, Laban.\n\nIt is to this con artist that the Lord reveals Himself. At Bethel, when Jacob dreams of a stairway to heaven, God “was standing there beside him, saying, ‘I am the LORD, the God of your father Abraham and the God of Isaac’” (Genesis 28:13). This prompts Jacob to respond, “Surely the LORD is in this place, and I did not know it” (v.16).\n\nYears later, God visits Jacob again, this time in the form of a man who wrestles with him until daybreak. In this strange scene, the character of Jacob collides with the goodness of God. While Jacob says, “I will not let you go unless you bless me” (Genesis 32:26), the Lord does not overpower Jacob but gives him a loving reminder of this moment, when he came face to face with God (see v.30): He touches Jacob’s hip and leaves him with a life-long limp. With every step, Jacob would know that God is real—He had touched Him, heard His voice, and been blessed by Him. It was enough to turn Jacob, the “heel-grabber,” into Israel, the one who “struggles with God” (v.28).\n\nIt’s that struggle that sets Jacob apart. In the same way that he would do anything to get ahead, he would also do anything to receive the blessings of God. (Contrast this attitude to that of Esau, who sells his birthright for a quick meal.) Jacob’s actions and ethics for much of his life do not align with the will of God as later revealed in the law of Moses and Jesus’s Sermon on the Mount (Matthew 5–7). But Jacob is passionate about God’s favor, and in the center of that passion is faith. God uses that faith to make a nation to bless the whole world. In Jesus, we stand today as recipients of that blessing.\n\nJacob is no hero. God is the hero of his story, just as He is the hero of every chapter of the Bible. But Jacob is an example of tenacity. As I read the account of Jacob, I have to ask myself, How badly do I want the blessings of God—to know Him and walk with Him daily? There are few questions more important than this one.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day15.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 30:1-24, Genesis 35:16-20, Psalm 98:1-3, Hebrews 4:16",
    "devo_title": "Rachel",
    "devo_summary": "It doesn’t take a load of possessions in order for our hearts to become possessed by greed. We don’t need many gifts in order to convince ourselves that we are more blessed than others. This is so clear in Rachel’s disposition toward her sister, Leah. Both women, sisters bound to the same husband, lived in a constant state of competition with one another, each trying desperately to bear Jacob’s offspring.\n\nIn the race to bear children, Leah was clearly winning, having already brought forth sons for Jacob. Rachel, on the other hand, was in a state of discouragement and frustration because of her barrenness. Instead of trusting the Lord for children, she said to Jacob, “Give me children or I die” (Genesis 30:1). Like each of has at one time or another, Rachel was trusting in human strength for what God alone could give. Her complaint revealed the true condition of her heart.\n\nInstead of crying out to God to give her children, Rachel turned to her husband. She gave her handmaiden, Bilhah, to her husband, hoping she would be able to bear children in her place. After Bilhah bore Jacob a second son, Rachel confessed, “God has judged me, and has also heard my voice and given me a son” (v.6). Rather than appealing to the covenant-keeping name of God, Yahweh, she employed God’s generic name. This, too, revealed a lack of trust in the covenant God of promise.\n\nAgain, Rachel gave Bilhah to her husband, and again, the servant bore a child. Afterward, Rachel declared, “In my wrestlings with God, I have wrestled with my sister and won” (v.8). This may sound like a cry of triumph, but in reality, it is a cry of vengeance and pride. Theologian John Calvin described Rachel’s false sense of victory this way: “In Rachel the pride of the human mind is depicted… But they who are puffed up with pride have also the habit of malignantly depreciating those gifts which the Lord has bestowed on others, in comparison with their own smaller gifts.”\n\nThough most of us would insist that we would never say such a thing, we’ve all have made similar statements in one way or another. We’re all prone to trust in our own strength and plans rather than in the God of promise. When our chief desires are for success, status, satisfaction, or superiority, rather than God Himself, we’re tempted to boast in every small, weak, and inferior advancement we make in life. Rachel reveals the flaw in our thinking and the frailty of our sinful, human hearts. If left to ourselves, we so often settle for the lesser things in life when God offers so much more. He offers Himself to us through the Son of Jacob, Jesus Christ. May we to turn to Him, to the place where all our striving ceases and every longing is fulfilled.\n\nWritten by Nick Batzig",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day12.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 29:1-35, Psalm 63:1-4, Matthew 1:1-16",
    "devo_title": "Leah",
    "devo_summary": "It is the quintessential high school drama. Two teenage boys, friends, but both are infatuated with one girl. The girl chooses one, and passes over the other. It’s almost a rite of passage for young men, isn’t it, learning to deal with rejection? Coping with the sight of the girl you wanted to be yours, cuddling up beside your friend.\n\nThis situation plays itself out in dozens of ways throughout our lives. It happens when the coach benches you and plays someone else. It is experienced when a co-worker is offered the promotion or job that you so desired. This type of rejection can cause one to feel ignored, unwanted, or even unloved.\n\nThese life situations give us an experiential understanding of Bible narratives. These experiences help us to not only grasp the story on a deeper level, but they also help us feel the pain of those we read about. They help us enter into the story.\n\nAs we reflect on Genesis 29, it helps us read between the lines and anticipate what is going to happen next. The Scripture introduces the drama with clear indicators: “Now Laban had two daughters: the older was named Leah, and the younger was named Rachel. Leah had tender eyes, but Rachel was shapely and beautiful” (vv.16–17).\n\nFrom the very beginning of the story, Jacob was infatuated with Rachel. This makes perfect sense: Rachel was beautiful. But under the veil of night, Jacob was deceived into marrying Leah, the sister with tender eyes. It is made clear in the text that both Laban and Jacob favored Rachel.\n\nHowever, the Lord saw that Leah was hated. In the Old Testament the language “hated” often refers to being passed over and is not always an indicator of animosity. Even so, their treatment of Leah causes God to favor her over Rachel. Rachel is barren, but Leah becomes the mother of many tribes.\n\nWhat becomes abundantly clear in this story is the fact that God sees Leah’s neglect, He hears her cries, and He turns her sorrow into praise. Regardless of how Laban and Jacob treated her, Leah knew that God had shown her kindness.\n\nOur God is not a distant deity. We are often reminded of this comforting truth when no earthly comforts are afforded us. In fact, it is often the most bitter of circumstances that sweeten His presence all the more. When we cannot have the love we want, we are most deeply assured that God’s love is all we need.\n\nWhen we are passed over and rejected, it is important to remember that God has not left us or forsaken us. He may be doing something in and through our situation that we cannot imagine. But in time, we may be able to look back in retrospect and praise His name. The Lord has tender eyes for His troubled children.\n\nWritten by Matt Capps",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day11.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 25:27-34, Genesis 26:34-35, Genesis 27:1-46, Genesis 28:1-5, Hebrews 12:14–17",
    "devo_title": "Esau",
    "devo_summary": "Every day, people live their lives with no thought of God. They go through their days thinking that what they see in front of them is all there is to reality. Such a person might say, “It’s up to me to make my own way. I can do whatever I think is right.”\n\nEsau embodies this sort of godlessness. He grew up as Abraham’s grandson, a child of the promise who’d certainly heard about God’s call and miraculous leading firsthand. He was a man’s man, a skilled hunter, and a daddy’s boy—the favored son. He had everything going for him, but he forfeited it all. By selling the benefits associated with his firstborn status for a simple bowl of stew, Esau displayed contempt for God’s gifts (Genesis 25:34; Hebrews 12:16). And it didn’t stop there. Esau went further in his foolish disregard for God and His ways when he took two pagan wives; two women became burdens of grief for his parents (Genesis 26:34–35).\n\nAs Christians, we can be quick to judge folks like Esau who make up their own rules for life. But the truth is that even religious folk like us are tempted to live in godless ways. In Marilynne Robinson’s novel, Gilead, the old pastor, John Ames, laments the sort of religious person who, in his pride, works hard at defending the truth without having first experienced it. Ames says, “You can assert the existence of something… having not the slightest notion of what it is.” How often are we like that? How often do we speak up to defend the message of the cross but do so with snark or contempt for others who don’t live up to our standards?\n\nEsau moved through life without thought of God, and that resulted in foolish choices. It also led him to bitterness. When Jacob betrayed him and stole his blessing, Esau couldn’t handle the injustice, so he held a grudge (Genesis 27:41).\n\nWhen we see this part of Esau’s story, we should all take warning. Bitterness is what godlessness typically looks like in the heart of a religious person. Religious folks may not play the fool publicly, but we can certainly keep account when someone does us wrong. We might even feel justified in our grudge-holding. But bitter roots will defile us (Hebrews 12:15). When we hold a grudge, we’ve failed to acknowledge God’s goodness and providence over our lives. Even when the events of our lives don’t turn out in line with our hopes and expectations, we should trust that “for those who love God all things work together for good” (Romans 8:28). Submitting our life to God’s purpose will always be better than trying to live without Him.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day10.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 24:1-67, Genesis 25:19-26, Psalm 37:23-24",
    "devo_title": "Rebekah",
    "devo_summary": "To our modern ears, the story of Rebekah sounds a bit strange. The young woman meets a stranger by a well, gives the man and his camels some water, and before long she’s receiving a marriage proposal— though not from this stranger, exactly. He’s only a representative of her would-be father-in-law. But the strangest part of the story? She agrees to go with the servant and his camels to a place she’s never been and marry a man she’s never met.\n\nThis whole episode grates against much of what we believe about dating and courtship. Rebekah is given little information about Isaac—what he looks like, his personality type, his likes and dislikes. She doesn’t get to go on a series of blind dates. And she isn’t given a trial period to see if he’s a good fit for her. All she has is the servant’s word.\n\nBut that word is all that really matters. The camel-toting servant of Abraham tells Rebekah and her family that God has chosen her for Isaac. He then explains about Abraham’s charge, his own prayer on the journey, and the sign that Rebekah unwittingly gave him. It all starts smelling a lot like God’s plan. As Laban and Bethuel put it, “This is from the LORD; we have no choice in the matter” (Genesis 24:50). Only Rebekah does have a choice—to follow God’s direction or ignore it. Her father and her brother speak for her—”Rebekah is here in front of you. Take her and go, and let her be a wife for your master’s son, just as the LORD has spoken” (Genesis 24:51)—but the choice is still hers alone.\n\nIn faith, Rebekah decides to trust what she is hearing—to trust God. She leaves everything familiar behind. She follows a man she has just met to a place she’s never been, to meet another man she’s never met in order to become his bride. God took her faith and turned it into the story we know as the rest of the Bible. From Rebekah and Isaac came Jacob and Esau. From Jacob came the twelve tribes of Israel. And from that nation, from the line of Jacob, down through David, came Jesus, the Savior of the world.\n\nYou and I have much in common with Rebekah. If you’re a follower of Christ, then at some point someone gave you a message that demanded a response. That message was the gospel, and it required you to leave behind all that was familiar in order to commit yourself to a Man that, up until that point, you’d never met. But the God of Rebekah’s story is the God of ours as well. It is never a mistake to trust His Word. As we read the radical commands of Jesus in the Gospels, let us remember His words can be trusted. He knows the story He is writing, and He’s inviting us to be a part of it.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day9.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 22:1-19, Genesis 25:11, Genesis 26:1-5, Genesis 26:12-25, John 3:16-17",
    "devo_title": "Isaac",
    "devo_summary": "Parents often have to do the impossible. I’ve had to hold my daughter down, along with two other nurses, while another nurse gave her a shot in the leg, as tears rolled down her cheeks. We’ve all had to do difficult tasks because we knew they needed to be done.\n\nI can’t imagine what Abraham did. Can you? We read about it, sure; we can visualize it as our eyes zip past the words. But can you imagine being Abraham, putting your own son on the altar, and having a conversation with him in the middle of it all? How could Abraham go through with this?\n\nAbraham’s trust in God, at least here in Genesis 22, is the high watermark in his walk with God. He obeyed in the midst of confusion. He gathered every branch needed for the fire, bundled them tight, and placed them on his son’s back. He remembered to grab his knife. Every footprint Abraham left on that mountain was evidence of his faith in God, because he knew God’s promise to bless the nations through Isaac would stand, and he believed “God [was able] to raise someone from the dead” (Hebrews 11:19).\n\nAbraham knew God would provide (Genesis 22:8). Either an animal would be found at just the right moment or God would raise Isaac from the dead. And just at the right time, a substitute was provided for Isaac. God came through. Period.\n\nBrothers, do you believe that today? Whatever you are going through, whatever you have been through, or whatever is heading your way—God will provide. As the risen Lord Jesus told our brother Paul, “My grace is sufficient for you, for my power is perfected in weakness” (2 Corinthians 12:9).\n\nHere’s why His grace is sufficient for you: At the right time, Jesus was offered up for you. Jesus bore the weight of humanity’s sin—He did it for you and for me. The Lord provided. And His power is what we need in our weakness. It is resurrection power, and it can breathe life into what was once dead. God provides, always, and His timing is always right.\n\nWritten by J.A. Medders",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day8.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 17:15-22, Genesis 18:1-15, Genesis 20:1-18, Genesis 21:1-7, Philippians 1:6",
    "devo_title": "Sarah",
    "devo_summary": "Sarai’s womb was barren, and she was desperate for children. In her culture, she had been raised to understand that it was her honor and purpose to give her husband an heir, a son. But she couldn’t. For thirty years she had lived the life of a nomad’s wife because her husband believed the Lord was going to give them a son, and that through Him all the nations of the earth would be blessed.\n\nBut there was nothing Sarai could do about it. Nothing. The covenant God had made with her husband would require a miracle birth. For her to be able to give Abram a son, God would have to resurrect her womb from the dead. And that sort of thing simply didn’t happen.\n\nShe knew her barrenness wasn’t her burden alone. Her husband bore it too. So with all this talk of an heir and with her inability to deliver one, she came up with an idea: What about Hagar, the maidservant? Perhaps she could bear a child.\n\nSarai went to her husband and said, “Since the Lord has prevented me from bearing children, go to my slave; perhaps through her I can build a family” (Genesis 16:2). In what must have seemed like far too little time, Abram agreed to this, and Hagar bore him a son, Ishmael. Sarai got what she said she wanted, and she hated what she got (vv.3–6).\n\nBut Ishmael was not the son the Lord was talking about. Sarai was as much a part of God’s covenant as Abram was. God renamed the couple—Abram became Abraham, “the father of many nations,” and Sarai became Sarah, “princess.” These new names were appropriate, for the Lord intended to bless the earth through a child Sarah would bear for Abraham. She was to be the mother of the promise.\n\nI cannot imagine how frustrating this must have been, given her barrenness. So, when she heard the Lord say, “I will certainly come back to you in about a year’s time, and your wife Sarah will have a son!” she laughed (18:9–12).\n\nIt wasn’t just that her childbearing years were behind her. It was that they had never happened, and everything she tried to do to improve her situation only complicated her life. This shell of an old woman with this wisp of a husband were now going to succeed at what they had failed to do for so many years? And by this time next year? Really?\n\nThe Lord heard her laugh from outside the tent. He asked Abraham, “Why did Sarah laugh?”\n\nSarah lied, “I did not laugh.”\n\nBut the Lord said, “No, you did laugh” (vv.13–15). And He knew why. Her laugh was the laugh of turning away. She had reached her end. Surely God understood this.\n\nBut with His rebuke, He turned her back to face Him. The Lord would not permit Sarah to separate her heart from Him (Romans 8:38–39). The One who had read her mind could also open her womb.\n\nOne year later, Sarah laughed again (Genesis 21:6), perhaps as she crawled out of bed to feed her hungry, crying, rosy-cheeked baby boy. She named him Isaac, which means “laughter,” saying, “God has made me laugh, and everyone who hears will laugh with me” (Genesis 21:6–7).\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day5.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 16:1-16, Genesis 21:8-21, Psalm 56:8",
    "devo_title": "Hagar",
    "devo_summary": "One of the life-truths that all of us learn in some way or another is that the pain inflicted by others can be debilitating. If you have ever been treated harshly by other people, you know exactly what I mean. The heartbreak can be devastating and even tempt us to despair.\n\nNot too long ago, I was sitting with a friend as he recounted the story of being slandered by those he’d considered trusted friends. I’ve been there too. When the situation doesn’t resolve quickly enough for us, we can be tempted to wonder if God sees our pain or hears our prayers. It’s easy to revel in our pain and lose perspective.\n\nThankfully, the God of the Bible is the same yesterday, today, and forever (Hebrews 13:8). Genesis 16 is a good reminder of His providential care. You will remember when Sarai became impatient for God’s promised heir, she decided to take matters into her own hands by changing Hagar from a maidservant to a wife to her own husband, Abram.\n\nHowever, when Abram and Hagar bore a son, tension in their household heightened. Hagar’s ability to provide Abram a son caused Sarai to look down on her and treat her harshly. Understandably, Hagar fled from Sarai.\n\nIn the midst of this turmoil, we are reminded of God’s tender love and care for those who are afflicted. The angel of the Lord encouraged Hagar to return to Abram and Sarai, and even offered her the promise that her descendants would be numerous. It is no coincidence that God named Hagar’s son Ishmael, which means “God hears.” In response to God’s kindness, Hagar “named the Lord who spoke to her: ‘You are El-roi,’ for she said, ‘In this place, have I actually seen the one who sees me?’” God looked after Hagar, just as He does with us, even when we run.\n\nAs I reflect on the story, fleeing from the situation seems like an understandable response; it is difficult to imagine a servant confronting her master. However, we are also reminded by the apostle Paul that we are not to avenge ourselves, but to overcome evil with good (Romans 12:19–21). The foundational belief behind this courageous command is that God sees our situation and knows our anguish. God hears us. God looks after us.\n\nWhen we want to run from painful situations, we need to remember that God comforts, not by changing the circumstances of our lives, but by changing us through them, and eventually, perhaps even our attitude toward them.\n\nWhen you are struggling with hardship at the hands of others, remember that God has not abandoned you, but is with you. One day you will look back on your situation and have a powerful reminder that the living God sees you—just as He saw Hagar. Let your perspective stretch beyond your current pain. Remember God’s past mercies, and remember that they are new today and every morning.\n\nWritten by Matt Capps",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day4.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 11:27-31, Genesis 12:1-7, Genesis 15:1-21, Genesis 17:1-14, 23-37, Galatians 3:8",
    "devo_title": "Abraham",
    "devo_summary": "When my wife, Laurin, was just ten years old, she was part of a local summer swim league. The league had more of a summer-camp vibe than a competitive atmosphere, but Laurin is, and always has been, competitive (read: Don’t ever play Monopoly with her). She swam her heart out that summer and won races—lots of them. She was so good in the pool that her strokes caught the attention of the team’s coach. He asked Laurin if she’d like to be a part of a different kind of swim team, one that was year-round and much more competitive.\n\nThe only thing was, that team didn’t exist yet. This coach wanted to start a new team, with Laurin as his first athlete in training. That’s how the Marietta Marlins were born. Laurin became a Marlin and went on to swim competitively through high school, winning lots and lots of ribbons and trophies. She even qualified for Olympic trials one year.\n\nThat little swim team has grown over the years to become one of the premier leagues in the state. Lots of great swimmers have followed in Laurin’s wake, reaching new milestones every year. In fact, one of the Marlins’ current members is poised to make his Olympic debut in the 2020 Tokyo games.\n\nWe have no record of Abraham ever swimming a single stroke, but he was called to be the first member of something new God was doing. After the events surrounding the Tower of Babel in Genesis 11, when God scattered the nations across the known world, the Lord turned his attention to a nobody living in the backwater of Mesopotamia. God called Abraham to follow Him to a land He had never seen before. He promised to make Him into a great nation, to bless Him with descendants, land, and prosperity.\n\nAbraham isn’t remembered today for what he brought to the table. There was no special charisma or talent that caught God’s eye. He wasn’t winning the Bronze-Age equivalent of summer swim meets. Reading through Genesis with a careful eye reveals Abraham’s many mistakes (like the two—yes, two—times he nearly traded his wife, Sarah, to a foreign king in exchange for political favor [12:10–20; 20:1–18]). What makes Abraham worth remembering is his trust in God.\n\n“Abram believed the LORD, and he credited it to him as righteousness.” (Genesis 15:6). But the facts on the ground didn’t line up with God’s promises: Sarah was barren and beyond childbearing age, and the land of Canaan was in the possession of other nations, none of which appeared to be packing up and moving out anytime soon. But that’s what faith is all about—taking God at His word.\n\nWhen Abraham died, the only land in Canaan he owned was the small cave where he had buried Sarah (Genesis 23:20). And the only members of the “great nation” he had been promised were his son Isaac, Isaac’s wife, Rebekah, and his grandson Jacob. Abraham died in faith, still trusting that God would deliver on His promises. The author of Hebrews tells us that “although [he] had not received the things that were promised… [he] saw them from a distance” (Hebrews 11:13). What Abraham found as he waited in faith, though, was something far superior to land or descendants—he found a relationship with the living God. That’s the real blessing of faith.\n\nAs He did with Abraham, God has given us promises that must be taken on faith. Our new home is yet unseen, and our inheritance awaits us in heaven (1 Peter 1:4). But like Abraham, we have the privilege of walking with God right here and right now. And because of Jesus, Abraham is our father. We have been grafted into his family tree and are numbered among the many descendants he was promised.\n\nWritten by John Greco",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day3.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 5:28-29, Genesis 6:11-22, Genesis 7:1-12, Genesis 8:13-22, Genesis 9:1-17, Psalm 9:10, Romans 8:28-30",
    "devo_title": "Noah",
    "devo_summary": "What does believing in something invisible or impossible really look like? If you can’t see it or envision what it could be, how does “believing in it” actually demonstrate itself in your life?\n\nFrom time to time I like to “enliven” my son’s understanding of history by throwing in what I call “false facts,” to spice up the lessons. While I get a chuckle out of it, I’ve learned that it can be a bit of a problem for my son if I don’t make the line between make-believe and reality very clear. Case in point was the time my son announced that after Captain Cook sailed the Pacific Ocean, he took his fortune and invested in the business endeavors of his brother, one “Captain Crunch,” thus helping him to become one of the greatest cereal moguls of all time. The point is that my son actually believed my fable and was so confident in it, he repeated it and shared it with others. His belief translated into action.\n\nWhen we talk about trusting God, we can often come up against the same challenge. How does a man actually show that his “belief” has real bearing on the whole of his life, not merely his mind? The powerful life of Noah gives us the answer that shows a belief, or faith, that goes beyond mental agreement, displaying itself in every arena of life. Noah’s belief in God’s word to Him poured out of his life into confident action.\n\nWhen we find Noah in the Bible, just a few chapters into Genesis, we discover the comprehensive wickedness of the entire world. Everyone, everywhere, was corrupt. And then God speaks. The word of God declares a promise and a command for Noah to believe and obey (Genesis 6:11–18). How do we know that Noah really believes this word from God is true? It’s written all over his life. Trust in God shows itself in obedient action.\n\n“Rain will come and flood the earth, so build an ark with these specific blueprints.” Noah does it.\n\n“Go into the ark, you and your entire household, and all the animals I have commanded.” Noah does it.\n\n“Go out from the ark with all the animals and your entire family.” Noah does it.\n\nThe repetitive cycle is here shows us what faith really looks like. Belief is more than just mental agreement with a statement. True faith displays itself in the follow-through of obedience.\n\nThe contrast between Noah and the people of his day is staggering. Where the world raged in chaos and disobedience against the Lord, Noah stood firm with his trust in God. It was said that “Noah was a righteous man, blameless among his contemporaries; Noah walked with God” (Genesis 6:9).\n\nThe story of Noah shows us what a man of faith in action really looks like. It’s worth asking ourselves, What does faith in action look like in my life? How can I demonstrate my trust in God?\n\nNoah walked with God. May it be so with us.\n\nWritten by Jeremy Writebol",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day2.jpg"
  },
  {
    "book_title": "Men & Women in the Word: Old Testament",
    "devo_passages": "Genesis 1:27, Genesis 2:4-9, Genesis 2:15-25, Genesis 3:1-24, Joel 2:26-27",
    "devo_title": "Adam and Eve",
    "devo_summary": "There was a time, early in his musical career, when singer-songwriter John Mayer claimed, “James Taylor is the template.” Anyone with ears to hear can understand that, as the songs that made Mayer popular were all built on earnest crooning and guitar strumming—first think “Fire and Rain” (by Taylor), and then compare it to “Daughters” (by Mayer). Mayer has since changed his tune, so to speak, focusing on a more funk-soul-blues-oriented approach to his music. But way back when, in the beginning, when everything got started, the template was different.\n\nSo God created man in his own image; he created him in the image of God;\n\nhe created them male and female (Genesis 1:27).\n\nThe first few chapters in Genesis reveal the template, if you will, for everything. And that includes humanity. When God set about to create male and female, God used Himself as the template, or image. Truth is, there are truckloads of ideas and opinions as to what “in God’s image” means. Some of these are solid, and some are rather thin ice. But if you stick with the text and pay attention to the words that are used around Adam and Eve’s beginnings, the word “create,” or variations on that theme (e.g., naming and tending), is like a bell that just keeps ringing. To be made in God’s image is to join Him in the ongoing work of creation, bringing that which is “good” into this world.\n\nHave we changed our tune, so to speak, since then? Anyone with eyes to see would have to agree that we’ve strayed a little, if not a lot, from that original design. Adam and Eve disobeyed God’s voice, and that led to an un-creation of the original relationship God established with the first man and woman. Their decision and subsequent actions, what the Bible calls “sin,” unraveled something that was very good. The results were far-reaching, all in some way associated with pain—whether bearing a child, or working the ground, or remembering how good it was way back when, in the beginning.\n\nBut while we, sadly and often, break from that original image or design, God does not. He stays true to Himself, to His image. God’s template does not change. So even when we un-create things by way of sin, God is constantly at work re-creating, work Scripture elsewhere refers to as redeeming, and that’s good. Actually, that’s very good.\n\nAdam and Eve’s story, while being full of disappointments, is also brimming with that re-creating, redemptive creative work. God made clothing out of animal skins for the first man and woman, effectively preparing them for what was ahead. God did not abandon them. He “clothed” them, covering their shame and guilt, and took care of them, as He does us. This act, and every other work of redemption from God’s hand, points to Christ, who breaks the curse of sin and death, covers us with His own righteousness rather than animal skins, and makes a way for us to return to paradise with God. In doing so, He bears the image of God perfectly and invites us to follow Him so that we, too, might bring more of what reflects Him—more of what is “good”—into this world.\n\nWritten by John Blase",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2019/06/HRT-MWITH-Instagram-Day1.jpg"
  }
]