[
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:1-16, Psalm 19:7-8, Exodus 20:1-17",
        "devo_title": "Happy Are Those Who Keep His Decrees",
        "devo_summary": "\n\nBY Raechel Myers\n\nI used to really love the law (Exodus 20:1–17). I remember enthusiastically singing the Ten-Commandments song “The Perfect Ten” at school and church with the confidence of a child whose Christian walk was just beginning.\n\nNumber one, we’ve just begun: God should be first in your life!Number two’s the idol rule: those graven images aren’t nice.\n\nI’d assure myself as I sang…\n\nNumber three: God’s name should be never spoken in jest.Number four: the Sabbath’s for our worship and for rest.\n\nSo far, so good. Our family was known for nothing if not for our Sunday naps.\n\nNumber five: we all should strive to honor father and mother.Number six: don’t get your kicks from killing one another.\n\nSuccess!\n\nNumber seven: life is heaven when you’re true to your mate.Number eight: don’t steal and break this rule for goodness’ sake!\n\nNumber seven was easy—I didn’t even have a mate!\n\nNumber nine: don’t be the kind who goes around telling lies.Number ten: don’t covet when you see your neighbor’s house or wife!\n\nI was doing so well. It had never occurred to me to covet my neighbor’s wife. In my mind I would sing that song with a full band playing behind me—like a victory song. I was delighting in God’s law because it was just so keepable! But as I grew to understand the law, I began to understand how difficult it was to follow.\n\nI thank God that He brought me out of the age of check, check, check into the maturity of, If this is the measuring stick, I will never measure up. And even more, I’m thankful He didn’t leave me there with my checklist. When God mercifully, gradually granted me eyes to see how readily I broke His law by commission, omission, and flat-out rejection of Him, the big band musicians in my head began to slowly lower their instruments and solemnly take their seats. I wasn’t delighting in God’s law at all. I had been delighting in my “keeping” of His law.\n\nBut my delight hasn’t gone away; it has instead shifted and matured. Now, my soul finds rest in knowing that the law has been fulfilled by Christ on my behalf. Because of Jesus, the law no longer justifies or condemns us—it frees us and becomes our guide for thankful obedience to the One by whom we are justified.\n\nDo you get that? If the law is our measuring stick, every one of us will be found unrighteous. But Jesus kept God’s law perfectly, imparting His righteousness to us so that when we are measured, we, too, will be counted as righteous—as perfect law-keepers!\n\nNow, when I catch myself humming that childhood ten commandments tune (or teaching it to my children), I hear it differently. Not as a reminder of what I have to do, or even as a condemnation of what I can’t do. I hear it now as an assurance of what He has done, and as the kindest, clearest roadmap to the heart of the Father. He makes me righteous, and I delight in pleasing Him. “Oh that my ways may be steadfast in keeping [His] statutes!” (Psalm 119:5, ESV).\n\nLord, I love your law. “With my lips I declare all the rules of your mouth” (v.13, ESV).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-1-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:17-32, Joshua 1:6-8, Galatians 4:1-7",
        "devo_title": "Give Me Life Through Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nIn her essay called “The Wreck of Time,” Annie Dillard references the idea that when a single person dies, we treat it as a tragedy. But when a million people die, we treat it as a statistic.\n\nThis unsettling observation shows how inconsistent we humans can be concerning the value of a life. On the one hand, if a friend or relative or some other cherished person is taken from us, we are moved to deep and abiding sorrow. On the other hand, if a million lives with whom we share no personal connection are suddenly wiped out by a viral pandemic or natural disaster, any initial sadness and shock we feel can fade within weeks, and possibly within hours. The one who is close to us seems more precious even than the million who are further away.\n\nOur selective valuation of our fellow humans invites a haunting question: If the million don’t matter to us as much as the one, then can we honestly say that the one really matters at all? How precious are many lives, how precious is a single life, and how precious is my life… really?\n\nEach of us living today is one in seven billion. Of all the people who have ever lived, we are one in 107 billion. David hinted at this relative smallness of ours when he cried out to God, “What is a human being that you remember him, a son of man that you look after him?” (Psalm 8:4).\n\nThankfully, Scripture provides us with a strong and sure answer. David continued, “You made him a little less than God and crowned him with glory and honor” (v.5). The poet-king after God’s own heart is genuinely awestruck by the truth about all humans and about each individual human: We are made in the image of God (Genesis 1:27). Of all creatures everywhere, only humans are esteemed in this way.\n\nThis truth about our inestimable value becomes even more compelling when we realize that in Christ, we are the image of God but also much more: Scripture tells us we are the children of God. And as His children, He gives us life through His Word and teaches us His ways (Psalm 119:25–26). In his letter to the Galatians, Paul amplifies this astonishing truth by reminding us that through faith in Christ, God has adopted us, sent His Spirit into our hearts, invited us to call Him “Father,” and made us heirs of all that is His (Galatians 4:4–7).\n\nAs Brennan Manning has written, “Define yourself radically as one beloved by God. This is the true self. Every other identity is an illusion.”\n\nThe next time you look in the mirror, don’t for a moment think that you’re looking at a mere face in the crowd. Don’t for a moment think that you’re looking at a tragedy or a statistic. You have no true basis for looking at yourself in this way. Rather, you are looking at an esteemed crown of God’s creation, a beloved child of God, and a privileged heir of everything.\n\nThis is your true self. Every other identity is an illusion.\n\nScott Sauls is husband to Patti, dad to Abby and Ellie, and senior pastor of Christ Presbyterian Church in Nashville, Tennessee. Scott was also lead and preaching pastor at NYC’s Redeemer Presbyterian Church after planting two churches in the midwest. Scott has authored several books, including Jesus Outside the Lines and his most recent work, A Gentle Answer. He regularly blogs at scottsauls.com. His work has been featured in Christianity Today, Relevant Magazine, Qideas, Catalyst, Leadership Magazine, Outreach Magazine, annvoskamp.com, The Gospel Coalition, and several other publications. You can connect with Scott on Facebook or Twitter/Instagram at @scottsauls.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-2-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:33-56, 2 Timothy 3:16-17, James 1:16-25",
        "devo_title": "Teach Me the Meaning of Your Statutes",
        "devo_summary": "\n\nBY Jessica Lamb\n\nOne of my strongest memories from my sophomore year of high school is of a black, 5-inch thick three-ring binder I carried everywhere. I was part of the not-so-exclusive academic quiz bowl team at my school, and every few weeks, I would compete against other schools to see which team could “buzz in” first to earn points answering trivia questions. My binder was filled with the printed records of previous tournament questions and answers. Though questions were rarely repeated, I poured over that binder every opportunity I could find, hoping that my incessant studying might reveal recurring subject matter or a pattern in how questions are worded for tournaments to give me an edge over the competition. To this day, I’d still choose a trivia night at a local restaurant over almost any other activity.\n\nI used to think taking this same approach to Scripture was proof that I loved God’s Word. Studying the Bible—its words, history, cultural contexts, and languages—has been life-giving to my faith in my undergraduate and postgraduate studies, as well as in my career. But I have to be reminded that life as a follower of Jesus is so much more than just memorizing facts about God or storing up interesting trivia about the Bible. Our reading and study of Scripture should shape us and reorient our hearts as it shows us who He is and who we are in Him.\n\nI come back to the book of James over and over when I find my heart wanting to make a god of knowing about God, rather than truly knowing Him. The book is full of direct one-liners that cut right to the truth: truly delighting in God’s Word means living out what the Word teaches us. In the opening passage of his letter, James sums this up by telling believers that we must be “doers of the word and not hearers only” (James 1:22).\n\nHearing without acting is more than useless—it’s self-deception, because as believers, we are new people born of the gospel (v.22,18). James writes that God has implanted His Word in us (v.21). We miss the point if we are not willing to let its truth take root, growing and bearing fruit in us as we are changed and made more like Christ.\n\nEssentially, we are living out what the psalmist pleads with God to do: transform him so that he can keep God’s commands. By His Spirit and His Word, we’ve been made into new people. Unlike the person who looks in the mirror and responds, “I forget,” when asked what they look like (vv.23–24), we are called to remember who we are as we walk away from reading the Bible. If we go about our lives without acting on what it teaches, we live as fractured people, at odds with who we now are in Christ. Praise God, because He’s done the hardest work in giving us new hearts already!\n\nBeing in the Word of God every day equips us to live out the Word of God every day. It guards against forgetting what is true of our God and of ourselves. Let our prayer echo that of the psalmist as we come to the Bible each day: ”Teach me, LORD, the meaning of your statutes, and I will always keep them” (Psalm 119:33).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-3wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:57-72, Deuteronomy 6:6-9, Joshua 2:1-21",
        "devo_title": "I Have Promised to Keep Your Words",
        "devo_summary": "\n\nBY Guest Writer\n\nI remember listening to journalist Malcolm Gladwell interview Nashville legend and famed songwriter Bobby Braddock. Their conversation centered on what goes into writing a truly sad song, the kind of tune that finds you driving with one hand on the steering wheel so the other can be free to wipe the tears from your eyes.\n\nAs they talked, they decided that country music has a leg up on rock and pop when it comes to mournful tracks, but the question that lingered was Why? In the end, Braddock said it came down to details: “We cry when melancholy collides with specificity.” It’s one thing to sing about heartache, and another thing entirely to sing about standing by a lost friend’s grave and the angels’ faces delighting to welcome that friend home. Take a listen to “Go Rest High on That Mountain” by Vince Gill to hear what I’m talking about.\n\nThe reason that details help sad songs resonate with us is because they echo our own experience. We live in a world of details, not generalities. Somehow, the details make a thing more real. When it comes to God’s Word, I delight in the details. You see, in the ancient world, there was no paper. Instead, texts were written on papyrus, a material similar to paper but made out of certain flattened reeds—and papyrus wasn’t cheap. That means that everything included in God’s Word is important. There are no throwaway lines, no unimportant details.\n\nIn the story of Rahab, there’s a detail that jumps off the page for me. When she lets the two Israelite spies down through her window, she does so with a “scarlet cord” (Joshua 2:18). And it was this scarlet cord that would identify her home and keep her safe when the Israelites later attacked Jericho. It wasn’t brown or blue or white. It was a scarlet rope—and that makes all the difference in telling this story.\n\nFor those early Israelite readers of Rahab’s account, they would have connected the red color of the rope “dripping” down the window frame with the lamb’s blood a previous generation had brushed on the doorframes of their homes. While still slaves in Egypt, God had passed over the houses of the Hebrews on the night the firstborn in every household in the land had died (Exodus 12:23). The blood marked those inside as belonging to God. Rahab was a Gentile and a prostitute, but she, too, would be marked as one of God’s people. Though she was late to the party, so to speak, the “blood” of the scarlet cord would bring Rahab her own Passover moment.\n\nThe symbol, of course, is not as important as the thing it symbolizes. What set Rahab apart as a member of God’s family was not the red rope but her loyalty to Yahweh, based on the reports she had heard (Joshua 2:10–11). By helping the Israelites, she was committing treason, and she knew it. By earthly measures, the people of Jericho should have been able to withstand an attack by the Israelites. Rahab could have turned the spies over to the authorities and garnered herself the favor of Jericho’s king. But she believed what she had heard about the Lord, and she gave Him her allegiance, echoing with her life what the psalmist would later write: “The LORD is my portion” (Psalm 119:57).\n\nBut the scarlet cord doesn’t just point backwards to Passover; it also points forward to Christ. It is Christ’s red blood that now marks those who are members of God’s family. The Passover account had always foreshadowed the sacrifice of Jesus, and God had always planned on making one new people from Jews and Gentiles. Rahab’s story reveals this had long been in God’s heart to do. The prostitute-turned-daughter of the King is even honored with a place in Jesus’s family tree (Matthew 1:5).\n\nGod is the Author of Scripture. No detail is included by accident. Every last one is an invitation to thank Him for His faithfulness, our God who knows the end from the beginning (Isaiah 46:10).\n\nJohn Greco is a writer, editor, and Bible nerd. He and his wife, Laurin, live south of Nashville, where they daily wrangle their three small boys and dream of someday being the ones who get to take all the naps. You can find John at JohnGrecoWrites.com.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagra-4-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:73-88, Hebrews 4:12-13, Genesis 18:9-15, Genesis 21:1-7",
        "devo_title": "I Put My Hope in Your Word",
        "devo_summary": "\n\nBY Ellen L. Taylor\n\nI grew up going to church three times a week and met some of my closest friends (even to this day!) in youth group. Most of my Facebook statuses in high school were inspirational Bible verses that I hoped would encourage my friends at my public high school who weren’t believers. I went to a Christian university for my undergraduate degree, where mandatory chapel was held twice a week, and every student was required to take six semesters worth of Bible classes. I interned at a local church and even earned a minor degree in the Bible. And then, I went to graduate divinity school.\n\nBut somewhere along the way, I stopped delighting in Scripture. I saw it as something to be studied, but not something to be taken to heart. I began to think of God as something to learn about rather than someone to know. To date, this was one of the most confusing times in my life so far.\n\nAfter a time spent in this confusing season, I was given a special project at work; I was instructed to go through the entire book of Genesis, chapter by chapter, writing discussion questions along the way for kids aged eleven to fifteen.\n\nI don’t know the last time you read through the book of Genesis (maybe in January when we read it together, as an SRT community), but there are some stories in that book that are, well, a little less than age-appropriate for young teens. As I was going through some of the trickier passages, the discussion point I kept coming back to was that God keeps His promises to His people. His people keep turning away from Him, not believing Him, disobeying Him and turning to other gods, but God is consistently faithful to His promises.\n\nOne of the passages that fell into this category was the story of Sarah and her pregnancy with Isaac. When God told her she would become pregnant in her old age, Sarah laughed at the very thought (Genesis 18:9–15). But God kept His promise to her, and she bore a son (Genesis 21:1–7). After reading and working through the rest of the book of Genesis, I went into my friend’s office exasperated and frustrated with myself because I couldn’t find anything else for the discussion questions. She encouraged me to keep at it and do my best, and reassured me that maybe it was okay if God keeping His promises was the main theme of the project.\n\nSoon after completing the project, I realized that what had been frustrating me about the book of Genesis was exactly what I needed to hear and understand about God in a season of my own confusion and doubt: God keeps His promises to His people. He keeps His promises when your world seems to come crashing down. He keeps His promises when your best friend betrays you, when a dear family member falls ill, when the plans you had for your life have suddenly fallen to pieces around you. I know He does because I’ve seen it in my own life. His promises to His people are true. We can put our hope in Him to do so (Psalm 119:81). What a beautiful gift.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:89-104, Isaiah 40:6-8, Isaiah 41:17-20",
        "devo_title": "Your Word Is Forever",
        "devo_summary": "\n\nBY Amanda Bible Williams\n\nHis photo was taped to my computer monitor at work and to the refrigerator door at home—a three-year-old boy with olive skin, black hair, deep brown eyes, and a dimple above each cheek. He was a child of God with no earthly mama or baba to call his own, and I wanted so badly for him to be ours.\n\nI’ve said that adoption feels as miraculous as childbirth, a million little pieces that must fall perfectly into place for that blessed homecoming to occur. It seemed all but impossible in the beginning—too much paperwork, too much money, too many unknowns. And then there was his heart. This image-bearer was created by God with a very special heart, one that somehow managed to channel blood throughout his small frame despite missing some very important vessels. He’s been a miracle from the start.\n\nSomewhere in those early days of wondering if this beautiful, brokenhearted boy could be our son, I read a passage from Isaiah 41 that made my own heart beat loud and fast.\n\n“I am the LORD, the God of Israel. I will not abandon them…I will open rivers on the barren heights, and springs in the middle of the plains.I will turn the desert into a pool and dry land into springs…So that all may see and know, consider and understand,that the hand of the LORD has done this,the Holy One of Israel has created it” (Isaiah 41:17–18,20).\n\nI taped those words to my computer monitor, right next to that dimpled smile. It was a promise from God to His people, and it became my prayer in the joy and hope and helplessness of the days and months ahead.\n\nLord, do what we cannot. Be who we cannot. Create vessels where there are none, and a road home for this boy of ours, if indeed he’s ours. Create what only you can create, as only You can. May all who see it know that You and You alone bring life and hope.\n\nPsalm 119:89 says that God’s Word is forever, “firmly fixed in heaven.” But the concept of an unbreakable thing is difficult to understand when you yourself are broken. The idea that something lasts forever feels like fiction when the world we live in is filled with people, places, and promises that fade. But God’s Word is both unbreakable and everlasting. Tethering my heart to it changes the way I walk through this wounded, temporary world. So, I grabbed hold of that Isaiah passage, and I still haven’t let it go.\n\nOur son did come home, despite all the obstacles. And after his first heart catheterization here, the surgeon showed us images we’d prayed for, but never dreamed we’d see: vessels where there once were none, tangible hope created from nothing. But would God have been good if that catheterization had found nothing new, no surgical path forward? A resounding, Yes. Because our hope is not in healed hearts or an oasis planted in the desert; our hope is in the One who speaks arteries and myrtle trees into existence, whose Word never fades or fails, even when our bodies most certainly will.\n\nThose verses I stared at day after day in that season—the same ones I clung to by his hospital bed in the year that followed—do not guarantee an outcome. They guarantee God’s goodness. He is bigger than outcomes, even when our circumstances shift and our hearts ache. We can trust the God who makes all things new.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:105-120, Proverbs 19:21, 1 Chronicles 28:9-20",
        "devo_title": "Your Word Is a Lamp for My Feet",
        "devo_summary": "\n\nBY Ryan Myers\n\n“Okay. What have you learned from this?”\n\nThis phrase, spoken by my father, was a mainstay of my growing up. I heard it one summer afternoon when I was eight years old, following my sheepish confession that I’d accidentally shot my neighbor, Mr. Horner, with my BB gun. I heard it late one snowy Michigan night, when my car came to rest against a chain-link fence—after I’d impatiently tried (unsuccessfully) to maneuver it between a ditch and another parked car in my girlfriend’s driveway—resulting in a phone call to my dad, asking him to come help me dig my car out of a snowdrift. And I’ve uttered that same question to myself countless times since, even as I’ve grown older and the learning opportunities have evolved with time and age.\n\nAlways spoken in love, and almost always received with humility, it’s a phrase so simple, yet it resounds with the essence of the relationship between a dad and a son. I’m deeply grateful to fall into the increasingly receding percentage of men whose fathers are truly fatherly.\n\nWe might not expect to find such a rare, human moment between father and son within Scripture. While God’s Word is relatable and relevant across time, I still struggle sometimes to grasp the idea that these words were written to real people who existed in a real time and place. But that wasn’t the case for me when I read David’s words to his son, Solomon, in 1 Chronicles 28. His words could’ve just as easily been written to me in a text message from my dad on any given Monday morning:\n\n“As for you, Solomon my son, know the God of your father,and serve him wholeheartedly and with a willing mind,for the LORD searches every heart and understands the intention of every thought.If you seek him, he will be found by you” (v.9).\n\nI can almost picture the memories and hard-won lessons flashing before David’s eyes as he distills his life into just two simple sentences, passing down parting wisdom to his son. After charging Solomon with the great responsibility of building the temple and outlining the requirements of the job, David’s parting words to his son, and some of his last we read in the Bible, include loving encouragement that ultimately points Solomon to a present, secure, steadfast God. He tells Solomon to “be strong and courageous, and do the work… for the LORD God, my God, is with you. He won’t leave you or abandon you until all the work for the service of the LORD’s house is finished” (v.20).\n\nWhat a delight it is to be offered wisdom by those who’ve come before us, and in turn, to offer guidance to those who will come after us. But isn’t that what this entire book, the Bible, is about? It’s a lamp to lead our feet along the path of life (Psalm 119:105). It gives guidance from a loving Father through stories of His own and others’ that are full of grace and love, that shape us and call us to grow. May we honor the same Father of David and Solomon, feel loved by Him, and love like Him every day.\n\nRyan Myers is Chief Operating Officer of She Reads Truth, He Reads Truth, and Kids Read Truth. Ryan and his wife, Raechel, live with their two children in Nashville, Tennessee.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:121-144, Romans 15:4, 1 Corinthians 13:1-13",
        "devo_title": "Your Decrees Are Wondrous",
        "devo_summary": "\n\nBY Bailey Gillespie\n\nReading the Bible has always been hard for me. That may sound strange coming from someone who works for a company with the motto, “Women in the Word of God every day.” Over the years, being in the Word has proved tricky for several reasons, one of which is its familiarity. I’ve read Scripture my whole life, yet the transformative stories and commands lose their potency when I grow used to their rhythms and cadence, to the way the words sound when they roll off my tongue.\n\nLet me be clear: Scripture can’t lose its power or potency. But I can diminish its work in my life through my own apathy. I can choose not to slow down and really open myself to the text or the Holy Spirit who speaks through it.\n\nA decade ago, I walked through a situation that required me to love a friend and leader in our church community with what the Bible calls agape love—a love that seeks someone else’s wellbeing. Since I could no longer speak with this person directly, the development of this love had to take place solely between God and me. So, my best friend and I made a pact to read 1 Corinthians 13 every day for a whole year. The love passage. This well-known chapter was the best model we could find for the altruistic, Christlike, agape kind of love.\n\nJust because it was a well-known chapter didn’t mean it was easy to put into action. By focusing our attention on one passage for an extended period of time, the purpose was long-term, personal transformation. I began reading it to myself out loud, as if to absorb into my very being. I can still hear the lines echoing through my car, as I read it aloud each morning:\n\n“Love is patient, love is kind. Love does not envy,is not boastful, is not arrogant, is not rude,is not self-seeking, is not irritable,and does not keep a record of wrongs” (1 Corinthians 13:4–5).\n\nThese aren’t just eloquent lines of verse or truisms to tuck away in our back pocket. They’re the living, active words of God. My friend and I didn’t set out to memorize the chapter, but within a couple weeks it was buried inside us. I found that my heart had been softened toward God’s Word and toward this person from our community. And even though it may not have redeemed the situation, it changed my heart.\n\nAs Psalm 119 says, “Your decrees are wondrous; therefore I obey them” (v.129). Let’s obey God’s decrees by burying them inside us, even if that means reciting them aloud for 365 days. When our hearts have a chance to catch up with our minds, we begin to embody truth and become not a clanging cymbal but a transformed child of God (1Corinthians 13:1).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-10-wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:145-160, Romans 2:12-13, Ecclesiastes 2:24-25",
        "devo_title": "I Have Not Forgotten Your Instruction",
        "devo_summary": "\n\nBY Kara Gause\n\nIt was the first time I’d ever stood up in front of our church congregation, some fifteen years ago. Alongside our fellow “new members,” my husband and I looked out over the church body we were joining, as our pastor read our favorite Bible verses aloud and introduced us by name. Never one to go first, I listened from the end of the line as one inspirational verse after another was read into the microphone, each one offering another shade of affirmation, encouragement, and faith. But as I listened for the first time to the verses of other new congregants, I felt panic set in: Had I misunderstood the instruction? The sound of my blood pumping in my ears grew louder, nearly drowning out my pastor’s voice completely, until my husband gently squeezed my hand to hear my own “favorite verse” from Scripture:\n\n“There is nothing better for a person than to eat, drink, and enjoy his work.I have seen that even this is from God’s hand,because who can eat and who can enjoy life apart from him?” (Ecclesiastes 2:24–25).\n\nYup.\n\nIn all of Scripture, with its sweeping poetry and prose, that was “my verse”—is my verse, I should say. In that moment of pride, I began to doubt my seemingly simple choice. I was afraid that, out of context, it misrepresented my faith and understanding of the gospel and downplayed my affection for God. I’ve since come to realize just how accurately it still reflects my relationship with Him and the sin that so often distracts me from Him: my heart’s unfortunate tendency to wander.\n\nI’m easily distracted, you see. By work. By striving. By perfectionism of the textbook-definition variety. And when I get caught up in working and worrying, spinning myself into a cycle that pushes God away from the center of my heart’s affections—that’s when He reminds me of what’s true. He gently squeezes my heart in such a way that I’m forced to acknowledge the emptiness I’m feeling, the deep ache I work so hard to numb with the distraction of productivity, when I try to live my life with my gaze affixed on anyone or anything “apart from him” (John 15:5).\n\nThe Westminster Shorter Catechism posits that “the chief end of man is to glorify God and enjoy him forever.” In my own walk with God, I’ve tended to focus on the first part, on what it might mean to glorify Him. I’ve twisted the idea of bearing His image into a works-based, legalistic, shallow religion that has very little to do with my God.\n\nBut to enjoy Him. To be satisfied in Him. To delight in His Word. To stop and savor His provision and the work He’s called me to, not just for what they might become in the future, but for what they are today—well, that sings of enjoying relationship with my very relational God, the one who is ready to answer when we call out to Him, when we seek Him with all our heart (Psalm 119:145). His Word is a very precious gift that instructs us on how to best live this life He’s given us (v.153). And it is clear: in knowing Him, being in His presence, there is abundant joy and eternal pleasure. But apart from Him, we will never be satisfied (Psalm 16:11). This is the instruction my wandering heart so desperately needs.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-11-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:161-176, Ecclesiastes 12:12-14, John 21:1-19",
        "devo_title": "My Heart Fears Only Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nChristians don’t just read the Bible. We enter into a life-long relationship with it. We read it over the course of a lifetime, knowing we will never exhaust all there is to know or glean from God’s Word. Often, when we return to passages we’ve read before, we come to them having changed since the last time we spent time with those verses. We go through things that shift how we see the world—vocational upheaval, marriage, divorce, parenthood, miscarriage, life-altering diagnoses, unexpected windfalls of good-fortune, and the like.\n\nAs we experience more of the joys and heartaches associated with living in this world, we look at Scripture through different eyes. Sometimes a theological idea we thought we had wrapped up in a tidy bow suddenly becomes shot through with questions we never thought to ask when we were younger and had not suffered much.\n\nThis is one of the reasons I am so drawn to the story of Peter’s reinstatement in John 21:1–19. Here we find Simon Peter, who was one of Jesus’s closest friends, sitting with the fact that he had denied Jesus in His greatest hour of need. He had done so exactly as Jesus predicted he would, even though he swore this sort of failure wasn’t something he was capable of (Mark 14:31).\n\nI love the story because it’s about someone who appeared to have as good of a relationship with Jesus as anyone could have, and yet he himself was weak. When Jesus appeared on the shore cooking breakfast for His friends, and caused their empty nets to be filled with more fish than they could handle, Peter recognized Jesus, because this is the same way Jesus first called Peter—with a miraculous catch of fish (Luke 5:1–11).\n\nWhen Peter jumped out of the boat and cast his drenched and dripping self at the feet of Jesus, he had no relational ground to stand on. He’d betrayed his best friend, his Lord. And yet, Jesus asked Peter the most simple and searching question imaginable: “Do you love me?” And Peter, paradox that he is, answered truthfully. He did love Jesus. He did. When Jesus said, “Feed my sheep,” He was hearkening back to when He first called Peter and told him He would make him a fisher of men. Peter’s failure did not disqualify him from Jesus’s love, or from Jesus’s call on his life.\n\nI love this passage because it offers so much hope to people who go through seasons of struggle and failure and wonder if they have lost the love of God. Peter could do nothing but receive from Jesus. On that shore, he had nothing to offer. And yet, he longed to be near his Lord and friend. We know this because earlier, before Jesus was crucified, He taught that people would ultimately need to be nourished by His flesh and blood. It was a teaching many found too difficult to embrace, and they left. But when Jesus asked His disciples if they, too, would leave, it was Peter who said, “Lord, to whom will we go? You have the words of eternal life” (John 6:68).\n\nPeter’s story reminds us that the thing we must cling to most, and fear above all else, is the Word of Christ (Psalm 119:161). Though our circumstances change, and even we change, He does not (Hebrews 13:8). Where else can we go?\n\nRuss Ramsey and his wife and four children make their home in Nashville, Tennessee, where he is the pastor of Christ Presbyterian Church Cool Springs. Russ is the author of the Retelling the Story series and Struck: One Christian’s Reflections on Encountering Death. You can follow him on Facebook, Twitter, and Instagram.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-12-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:1-16, Psalm 19:7-8, Exodus 20:1-17",
        "devo_title": "Happy Are Those Who Keep His Decrees",
        "devo_summary": "\n\nBY Raechel Myers\n\nI used to really love the law (Exodus 20:1–17). I remember enthusiastically singing the Ten-Commandments song “The Perfect Ten” at school and church with the confidence of a child whose Christian walk was just beginning.\n\nNumber one, we’ve just begun: God should be first in your life!Number two’s the idol rule: those graven images aren’t nice.\n\nI’d assure myself as I sang…\n\nNumber three: God’s name should be never spoken in jest.Number four: the Sabbath’s for our worship and for rest.\n\nSo far, so good. Our family was known for nothing if not for our Sunday naps.\n\nNumber five: we all should strive to honor father and mother.Number six: don’t get your kicks from killing one another.\n\nSuccess!\n\nNumber seven: life is heaven when you’re true to your mate.Number eight: don’t steal and break this rule for goodness’ sake!\n\nNumber seven was easy—I didn’t even have a mate!\n\nNumber nine: don’t be the kind who goes around telling lies.Number ten: don’t covet when you see your neighbor’s house or wife!\n\nI was doing so well. It had never occurred to me to covet my neighbor’s wife. In my mind I would sing that song with a full band playing behind me—like a victory song. I was delighting in God’s law because it was just so keepable! But as I grew to understand the law, I began to understand how difficult it was to follow.\n\nI thank God that He brought me out of the age of check, check, check into the maturity of, If this is the measuring stick, I will never measure up. And even more, I’m thankful He didn’t leave me there with my checklist. When God mercifully, gradually granted me eyes to see how readily I broke His law by commission, omission, and flat-out rejection of Him, the big band musicians in my head began to slowly lower their instruments and solemnly take their seats. I wasn’t delighting in God’s law at all. I had been delighting in my “keeping” of His law.\n\nBut my delight hasn’t gone away; it has instead shifted and matured. Now, my soul finds rest in knowing that the law has been fulfilled by Christ on my behalf. Because of Jesus, the law no longer justifies or condemns us—it frees us and becomes our guide for thankful obedience to the One by whom we are justified.\n\nDo you get that? If the law is our measuring stick, every one of us will be found unrighteous. But Jesus kept God’s law perfectly, imparting His righteousness to us so that when we are measured, we, too, will be counted as righteous—as perfect law-keepers!\n\nNow, when I catch myself humming that childhood ten commandments tune (or teaching it to my children), I hear it differently. Not as a reminder of what I have to do, or even as a condemnation of what I can’t do. I hear it now as an assurance of what He has done, and as the kindest, clearest roadmap to the heart of the Father. He makes me righteous, and I delight in pleasing Him. “Oh that my ways may be steadfast in keeping [His] statutes!” (Psalm 119:5, ESV).\n\nLord, I love your law. “With my lips I declare all the rules of your mouth” (v.13, ESV).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-1-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:17-32, Joshua 1:6-8, Galatians 4:1-7",
        "devo_title": "Give Me Life Through Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nIn her essay called “The Wreck of Time,” Annie Dillard references the idea that when a single person dies, we treat it as a tragedy. But when a million people die, we treat it as a statistic.\n\nThis unsettling observation shows how inconsistent we humans can be concerning the value of a life. On the one hand, if a friend or relative or some other cherished person is taken from us, we are moved to deep and abiding sorrow. On the other hand, if a million lives with whom we share no personal connection are suddenly wiped out by a viral pandemic or natural disaster, any initial sadness and shock we feel can fade within weeks, and possibly within hours. The one who is close to us seems more precious even than the million who are further away.\n\nOur selective valuation of our fellow humans invites a haunting question: If the million don’t matter to us as much as the one, then can we honestly say that the one really matters at all? How precious are many lives, how precious is a single life, and how precious is my life… really?\n\nEach of us living today is one in seven billion. Of all the people who have ever lived, we are one in 107 billion. David hinted at this relative smallness of ours when he cried out to God, “What is a human being that you remember him, a son of man that you look after him?” (Psalm 8:4).\n\nThankfully, Scripture provides us with a strong and sure answer. David continued, “You made him a little less than God and crowned him with glory and honor” (v.5). The poet-king after God’s own heart is genuinely awestruck by the truth about all humans and about each individual human: We are made in the image of God (Genesis 1:27). Of all creatures everywhere, only humans are esteemed in this way.\n\nThis truth about our inestimable value becomes even more compelling when we realize that in Christ, we are the image of God but also much more: Scripture tells us we are the children of God. And as His children, He gives us life through His Word and teaches us His ways (Psalm 119:25–26). In his letter to the Galatians, Paul amplifies this astonishing truth by reminding us that through faith in Christ, God has adopted us, sent His Spirit into our hearts, invited us to call Him “Father,” and made us heirs of all that is His (Galatians 4:4–7).\n\nAs Brennan Manning has written, “Define yourself radically as one beloved by God. This is the true self. Every other identity is an illusion.”\n\nThe next time you look in the mirror, don’t for a moment think that you’re looking at a mere face in the crowd. Don’t for a moment think that you’re looking at a tragedy or a statistic. You have no true basis for looking at yourself in this way. Rather, you are looking at an esteemed crown of God’s creation, a beloved child of God, and a privileged heir of everything.\n\nThis is your true self. Every other identity is an illusion.\n\nScott Sauls is husband to Patti, dad to Abby and Ellie, and senior pastor of Christ Presbyterian Church in Nashville, Tennessee. Scott was also lead and preaching pastor at NYC’s Redeemer Presbyterian Church after planting two churches in the midwest. Scott has authored several books, including Jesus Outside the Lines and his most recent work, A Gentle Answer. He regularly blogs at scottsauls.com. His work has been featured in Christianity Today, Relevant Magazine, Qideas, Catalyst, Leadership Magazine, Outreach Magazine, annvoskamp.com, The Gospel Coalition, and several other publications. You can connect with Scott on Facebook or Twitter/Instagram at @scottsauls.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-2-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:33-56, 2 Timothy 3:16-17, James 1:16-25",
        "devo_title": "Teach Me the Meaning of Your Statutes",
        "devo_summary": "\n\nBY Jessica Lamb\n\nOne of my strongest memories from my sophomore year of high school is of a black, 5-inch thick three-ring binder I carried everywhere. I was part of the not-so-exclusive academic quiz bowl team at my school, and every few weeks, I would compete against other schools to see which team could “buzz in” first to earn points answering trivia questions. My binder was filled with the printed records of previous tournament questions and answers. Though questions were rarely repeated, I poured over that binder every opportunity I could find, hoping that my incessant studying might reveal recurring subject matter or a pattern in how questions are worded for tournaments to give me an edge over the competition. To this day, I’d still choose a trivia night at a local restaurant over almost any other activity.\n\nI used to think taking this same approach to Scripture was proof that I loved God’s Word. Studying the Bible—its words, history, cultural contexts, and languages—has been life-giving to my faith in my undergraduate and postgraduate studies, as well as in my career. But I have to be reminded that life as a follower of Jesus is so much more than just memorizing facts about God or storing up interesting trivia about the Bible. Our reading and study of Scripture should shape us and reorient our hearts as it shows us who He is and who we are in Him.\n\nI come back to the book of James over and over when I find my heart wanting to make a god of knowing about God, rather than truly knowing Him. The book is full of direct one-liners that cut right to the truth: truly delighting in God’s Word means living out what the Word teaches us. In the opening passage of his letter, James sums this up by telling believers that we must be “doers of the word and not hearers only” (James 1:22).\n\nHearing without acting is more than useless—it’s self-deception, because as believers, we are new people born of the gospel (v.22,18). James writes that God has implanted His Word in us (v.21). We miss the point if we are not willing to let its truth take root, growing and bearing fruit in us as we are changed and made more like Christ.\n\nEssentially, we are living out what the psalmist pleads with God to do: transform him so that he can keep God’s commands. By His Spirit and His Word, we’ve been made into new people. Unlike the person who looks in the mirror and responds, “I forget,” when asked what they look like (vv.23–24), we are called to remember who we are as we walk away from reading the Bible. If we go about our lives without acting on what it teaches, we live as fractured people, at odds with who we now are in Christ. Praise God, because He’s done the hardest work in giving us new hearts already!\n\nBeing in the Word of God every day equips us to live out the Word of God every day. It guards against forgetting what is true of our God and of ourselves. Let our prayer echo that of the psalmist as we come to the Bible each day: ”Teach me, LORD, the meaning of your statutes, and I will always keep them” (Psalm 119:33).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-3wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:57-72, Deuteronomy 6:6-9, Joshua 2:1-21",
        "devo_title": "I Have Promised to Keep Your Words",
        "devo_summary": "\n\nBY Guest Writer\n\nI remember listening to journalist Malcolm Gladwell interview Nashville legend and famed songwriter Bobby Braddock. Their conversation centered on what goes into writing a truly sad song, the kind of tune that finds you driving with one hand on the steering wheel so the other can be free to wipe the tears from your eyes.\n\nAs they talked, they decided that country music has a leg up on rock and pop when it comes to mournful tracks, but the question that lingered was Why? In the end, Braddock said it came down to details: “We cry when melancholy collides with specificity.” It’s one thing to sing about heartache, and another thing entirely to sing about standing by a lost friend’s grave and the angels’ faces delighting to welcome that friend home. Take a listen to “Go Rest High on That Mountain” by Vince Gill to hear what I’m talking about.\n\nThe reason that details help sad songs resonate with us is because they echo our own experience. We live in a world of details, not generalities. Somehow, the details make a thing more real. When it comes to God’s Word, I delight in the details. You see, in the ancient world, there was no paper. Instead, texts were written on papyrus, a material similar to paper but made out of certain flattened reeds—and papyrus wasn’t cheap. That means that everything included in God’s Word is important. There are no throwaway lines, no unimportant details.\n\nIn the story of Rahab, there’s a detail that jumps off the page for me. When she lets the two Israelite spies down through her window, she does so with a “scarlet cord” (Joshua 2:18). And it was this scarlet cord that would identify her home and keep her safe when the Israelites later attacked Jericho. It wasn’t brown or blue or white. It was a scarlet rope—and that makes all the difference in telling this story.\n\nFor those early Israelite readers of Rahab’s account, they would have connected the red color of the rope “dripping” down the window frame with the lamb’s blood a previous generation had brushed on the doorframes of their homes. While still slaves in Egypt, God had passed over the houses of the Hebrews on the night the firstborn in every household in the land had died (Exodus 12:23). The blood marked those inside as belonging to God. Rahab was a Gentile and a prostitute, but she, too, would be marked as one of God’s people. Though she was late to the party, so to speak, the “blood” of the scarlet cord would bring Rahab her own Passover moment.\n\nThe symbol, of course, is not as important as the thing it symbolizes. What set Rahab apart as a member of God’s family was not the red rope but her loyalty to Yahweh, based on the reports she had heard (Joshua 2:10–11). By helping the Israelites, she was committing treason, and she knew it. By earthly measures, the people of Jericho should have been able to withstand an attack by the Israelites. Rahab could have turned the spies over to the authorities and garnered herself the favor of Jericho’s king. But she believed what she had heard about the Lord, and she gave Him her allegiance, echoing with her life what the psalmist would later write: “The LORD is my portion” (Psalm 119:57).\n\nBut the scarlet cord doesn’t just point backwards to Passover; it also points forward to Christ. It is Christ’s red blood that now marks those who are members of God’s family. The Passover account had always foreshadowed the sacrifice of Jesus, and God had always planned on making one new people from Jews and Gentiles. Rahab’s story reveals this had long been in God’s heart to do. The prostitute-turned-daughter of the King is even honored with a place in Jesus’s family tree (Matthew 1:5).\n\nGod is the Author of Scripture. No detail is included by accident. Every last one is an invitation to thank Him for His faithfulness, our God who knows the end from the beginning (Isaiah 46:10).\n\nJohn Greco is a writer, editor, and Bible nerd. He and his wife, Laurin, live south of Nashville, where they daily wrangle their three small boys and dream of someday being the ones who get to take all the naps. You can find John at JohnGrecoWrites.com.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagra-4-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:73-88, Hebrews 4:12-13, Genesis 18:9-15, Genesis 21:1-7",
        "devo_title": "I Put My Hope in Your Word",
        "devo_summary": "\n\nBY Ellen L. Taylor\n\nI grew up going to church three times a week and met some of my closest friends (even to this day!) in youth group. Most of my Facebook statuses in high school were inspirational Bible verses that I hoped would encourage my friends at my public high school who weren’t believers. I went to a Christian university for my undergraduate degree, where mandatory chapel was held twice a week, and every student was required to take six semesters worth of Bible classes. I interned at a local church and even earned a minor degree in the Bible. And then, I went to graduate divinity school.\n\nBut somewhere along the way, I stopped delighting in Scripture. I saw it as something to be studied, but not something to be taken to heart. I began to think of God as something to learn about rather than someone to know. To date, this was one of the most confusing times in my life so far.\n\nAfter a time spent in this confusing season, I was given a special project at work; I was instructed to go through the entire book of Genesis, chapter by chapter, writing discussion questions along the way for kids aged eleven to fifteen.\n\nI don’t know the last time you read through the book of Genesis (maybe in January when we read it together, as an SRT community), but there are some stories in that book that are, well, a little less than age-appropriate for young teens. As I was going through some of the trickier passages, the discussion point I kept coming back to was that God keeps His promises to His people. His people keep turning away from Him, not believing Him, disobeying Him and turning to other gods, but God is consistently faithful to His promises.\n\nOne of the passages that fell into this category was the story of Sarah and her pregnancy with Isaac. When God told her she would become pregnant in her old age, Sarah laughed at the very thought (Genesis 18:9–15). But God kept His promise to her, and she bore a son (Genesis 21:1–7). After reading and working through the rest of the book of Genesis, I went into my friend’s office exasperated and frustrated with myself because I couldn’t find anything else for the discussion questions. She encouraged me to keep at it and do my best, and reassured me that maybe it was okay if God keeping His promises was the main theme of the project.\n\nSoon after completing the project, I realized that what had been frustrating me about the book of Genesis was exactly what I needed to hear and understand about God in a season of my own confusion and doubt: God keeps His promises to His people. He keeps His promises when your world seems to come crashing down. He keeps His promises when your best friend betrays you, when a dear family member falls ill, when the plans you had for your life have suddenly fallen to pieces around you. I know He does because I’ve seen it in my own life. His promises to His people are true. We can put our hope in Him to do so (Psalm 119:81). What a beautiful gift.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:89-104, Isaiah 40:6-8, Isaiah 41:17-20",
        "devo_title": "Your Word Is Forever",
        "devo_summary": "\n\nBY Amanda Bible Williams\n\nHis photo was taped to my computer monitor at work and to the refrigerator door at home—a three-year-old boy with olive skin, black hair, deep brown eyes, and a dimple above each cheek. He was a child of God with no earthly mama or baba to call his own, and I wanted so badly for him to be ours.\n\nI’ve said that adoption feels as miraculous as childbirth, a million little pieces that must fall perfectly into place for that blessed homecoming to occur. It seemed all but impossible in the beginning—too much paperwork, too much money, too many unknowns. And then there was his heart. This image-bearer was created by God with a very special heart, one that somehow managed to channel blood throughout his small frame despite missing some very important vessels. He’s been a miracle from the start.\n\nSomewhere in those early days of wondering if this beautiful, brokenhearted boy could be our son, I read a passage from Isaiah 41 that made my own heart beat loud and fast.\n\n“I am the LORD, the God of Israel. I will not abandon them…I will open rivers on the barren heights, and springs in the middle of the plains.I will turn the desert into a pool and dry land into springs…So that all may see and know, consider and understand,that the hand of the LORD has done this,the Holy One of Israel has created it” (Isaiah 41:17–18,20).\n\nI taped those words to my computer monitor, right next to that dimpled smile. It was a promise from God to His people, and it became my prayer in the joy and hope and helplessness of the days and months ahead.\n\nLord, do what we cannot. Be who we cannot. Create vessels where there are none, and a road home for this boy of ours, if indeed he’s ours. Create what only you can create, as only You can. May all who see it know that You and You alone bring life and hope.\n\nPsalm 119:89 says that God’s Word is forever, “firmly fixed in heaven.” But the concept of an unbreakable thing is difficult to understand when you yourself are broken. The idea that something lasts forever feels like fiction when the world we live in is filled with people, places, and promises that fade. But God’s Word is both unbreakable and everlasting. Tethering my heart to it changes the way I walk through this wounded, temporary world. So, I grabbed hold of that Isaiah passage, and I still haven’t let it go.\n\nOur son did come home, despite all the obstacles. And after his first heart catheterization here, the surgeon showed us images we’d prayed for, but never dreamed we’d see: vessels where there once were none, tangible hope created from nothing. But would God have been good if that catheterization had found nothing new, no surgical path forward? A resounding, Yes. Because our hope is not in healed hearts or an oasis planted in the desert; our hope is in the One who speaks arteries and myrtle trees into existence, whose Word never fades or fails, even when our bodies most certainly will.\n\nThose verses I stared at day after day in that season—the same ones I clung to by his hospital bed in the year that followed—do not guarantee an outcome. They guarantee God’s goodness. He is bigger than outcomes, even when our circumstances shift and our hearts ache. We can trust the God who makes all things new.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:105-120, Proverbs 19:21, 1 Chronicles 28:9-20",
        "devo_title": "Your Word Is a Lamp for My Feet",
        "devo_summary": "\n\nBY Ryan Myers\n\n“Okay. What have you learned from this?”\n\nThis phrase, spoken by my father, was a mainstay of my growing up. I heard it one summer afternoon when I was eight years old, following my sheepish confession that I’d accidentally shot my neighbor, Mr. Horner, with my BB gun. I heard it late one snowy Michigan night, when my car came to rest against a chain-link fence—after I’d impatiently tried (unsuccessfully) to maneuver it between a ditch and another parked car in my girlfriend’s driveway—resulting in a phone call to my dad, asking him to come help me dig my car out of a snowdrift. And I’ve uttered that same question to myself countless times since, even as I’ve grown older and the learning opportunities have evolved with time and age.\n\nAlways spoken in love, and almost always received with humility, it’s a phrase so simple, yet it resounds with the essence of the relationship between a dad and a son. I’m deeply grateful to fall into the increasingly receding percentage of men whose fathers are truly fatherly.\n\nWe might not expect to find such a rare, human moment between father and son within Scripture. While God’s Word is relatable and relevant across time, I still struggle sometimes to grasp the idea that these words were written to real people who existed in a real time and place. But that wasn’t the case for me when I read David’s words to his son, Solomon, in 1 Chronicles 28. His words could’ve just as easily been written to me in a text message from my dad on any given Monday morning:\n\n“As for you, Solomon my son, know the God of your father,and serve him wholeheartedly and with a willing mind,for the LORD searches every heart and understands the intention of every thought.If you seek him, he will be found by you” (v.9).\n\nI can almost picture the memories and hard-won lessons flashing before David’s eyes as he distills his life into just two simple sentences, passing down parting wisdom to his son. After charging Solomon with the great responsibility of building the temple and outlining the requirements of the job, David’s parting words to his son, and some of his last we read in the Bible, include loving encouragement that ultimately points Solomon to a present, secure, steadfast God. He tells Solomon to “be strong and courageous, and do the work… for the LORD God, my God, is with you. He won’t leave you or abandon you until all the work for the service of the LORD’s house is finished” (v.20).\n\nWhat a delight it is to be offered wisdom by those who’ve come before us, and in turn, to offer guidance to those who will come after us. But isn’t that what this entire book, the Bible, is about? It’s a lamp to lead our feet along the path of life (Psalm 119:105). It gives guidance from a loving Father through stories of His own and others’ that are full of grace and love, that shape us and call us to grow. May we honor the same Father of David and Solomon, feel loved by Him, and love like Him every day.\n\nRyan Myers is Chief Operating Officer of She Reads Truth, He Reads Truth, and Kids Read Truth. Ryan and his wife, Raechel, live with their two children in Nashville, Tennessee.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:121-144, Romans 15:4, 1 Corinthians 13:1-13",
        "devo_title": "Your Decrees Are Wondrous",
        "devo_summary": "\n\nBY Bailey Gillespie\n\nReading the Bible has always been hard for me. That may sound strange coming from someone who works for a company with the motto, “Women in the Word of God every day.” Over the years, being in the Word has proved tricky for several reasons, one of which is its familiarity. I’ve read Scripture my whole life, yet the transformative stories and commands lose their potency when I grow used to their rhythms and cadence, to the way the words sound when they roll off my tongue.\n\nLet me be clear: Scripture can’t lose its power or potency. But I can diminish its work in my life through my own apathy. I can choose not to slow down and really open myself to the text or the Holy Spirit who speaks through it.\n\nA decade ago, I walked through a situation that required me to love a friend and leader in our church community with what the Bible calls agape love—a love that seeks someone else’s wellbeing. Since I could no longer speak with this person directly, the development of this love had to take place solely between God and me. So, my best friend and I made a pact to read 1 Corinthians 13 every day for a whole year. The love passage. This well-known chapter was the best model we could find for the altruistic, Christlike, agape kind of love.\n\nJust because it was a well-known chapter didn’t mean it was easy to put into action. By focusing our attention on one passage for an extended period of time, the purpose was long-term, personal transformation. I began reading it to myself out loud, as if to absorb into my very being. I can still hear the lines echoing through my car, as I read it aloud each morning:\n\n“Love is patient, love is kind. Love does not envy,is not boastful, is not arrogant, is not rude,is not self-seeking, is not irritable,and does not keep a record of wrongs” (1 Corinthians 13:4–5).\n\nThese aren’t just eloquent lines of verse or truisms to tuck away in our back pocket. They’re the living, active words of God. My friend and I didn’t set out to memorize the chapter, but within a couple weeks it was buried inside us. I found that my heart had been softened toward God’s Word and toward this person from our community. And even though it may not have redeemed the situation, it changed my heart.\n\nAs Psalm 119 says, “Your decrees are wondrous; therefore I obey them” (v.129). Let’s obey God’s decrees by burying them inside us, even if that means reciting them aloud for 365 days. When our hearts have a chance to catch up with our minds, we begin to embody truth and become not a clanging cymbal but a transformed child of God (1Corinthians 13:1).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-10-wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:145-160, Romans 2:12-13, Ecclesiastes 2:24-25",
        "devo_title": "I Have Not Forgotten Your Instruction",
        "devo_summary": "\n\nBY Kara Gause\n\nIt was the first time I’d ever stood up in front of our church congregation, some fifteen years ago. Alongside our fellow “new members,” my husband and I looked out over the church body we were joining, as our pastor read our favorite Bible verses aloud and introduced us by name. Never one to go first, I listened from the end of the line as one inspirational verse after another was read into the microphone, each one offering another shade of affirmation, encouragement, and faith. But as I listened for the first time to the verses of other new congregants, I felt panic set in: Had I misunderstood the instruction? The sound of my blood pumping in my ears grew louder, nearly drowning out my pastor’s voice completely, until my husband gently squeezed my hand to hear my own “favorite verse” from Scripture:\n\n“There is nothing better for a person than to eat, drink, and enjoy his work.I have seen that even this is from God’s hand,because who can eat and who can enjoy life apart from him?” (Ecclesiastes 2:24–25).\n\nYup.\n\nIn all of Scripture, with its sweeping poetry and prose, that was “my verse”—is my verse, I should say. In that moment of pride, I began to doubt my seemingly simple choice. I was afraid that, out of context, it misrepresented my faith and understanding of the gospel and downplayed my affection for God. I’ve since come to realize just how accurately it still reflects my relationship with Him and the sin that so often distracts me from Him: my heart’s unfortunate tendency to wander.\n\nI’m easily distracted, you see. By work. By striving. By perfectionism of the textbook-definition variety. And when I get caught up in working and worrying, spinning myself into a cycle that pushes God away from the center of my heart’s affections—that’s when He reminds me of what’s true. He gently squeezes my heart in such a way that I’m forced to acknowledge the emptiness I’m feeling, the deep ache I work so hard to numb with the distraction of productivity, when I try to live my life with my gaze affixed on anyone or anything “apart from him” (John 15:5).\n\nThe Westminster Shorter Catechism posits that “the chief end of man is to glorify God and enjoy him forever.” In my own walk with God, I’ve tended to focus on the first part, on what it might mean to glorify Him. I’ve twisted the idea of bearing His image into a works-based, legalistic, shallow religion that has very little to do with my God.\n\nBut to enjoy Him. To be satisfied in Him. To delight in His Word. To stop and savor His provision and the work He’s called me to, not just for what they might become in the future, but for what they are today—well, that sings of enjoying relationship with my very relational God, the one who is ready to answer when we call out to Him, when we seek Him with all our heart (Psalm 119:145). His Word is a very precious gift that instructs us on how to best live this life He’s given us (v.153). And it is clear: in knowing Him, being in His presence, there is abundant joy and eternal pleasure. But apart from Him, we will never be satisfied (Psalm 16:11). This is the instruction my wandering heart so desperately needs.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-11-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:161-176, Ecclesiastes 12:12-14, John 21:1-19",
        "devo_title": "My Heart Fears Only Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nChristians don’t just read the Bible. We enter into a life-long relationship with it. We read it over the course of a lifetime, knowing we will never exhaust all there is to know or glean from God’s Word. Often, when we return to passages we’ve read before, we come to them having changed since the last time we spent time with those verses. We go through things that shift how we see the world—vocational upheaval, marriage, divorce, parenthood, miscarriage, life-altering diagnoses, unexpected windfalls of good-fortune, and the like.\n\nAs we experience more of the joys and heartaches associated with living in this world, we look at Scripture through different eyes. Sometimes a theological idea we thought we had wrapped up in a tidy bow suddenly becomes shot through with questions we never thought to ask when we were younger and had not suffered much.\n\nThis is one of the reasons I am so drawn to the story of Peter’s reinstatement in John 21:1–19. Here we find Simon Peter, who was one of Jesus’s closest friends, sitting with the fact that he had denied Jesus in His greatest hour of need. He had done so exactly as Jesus predicted he would, even though he swore this sort of failure wasn’t something he was capable of (Mark 14:31).\n\nI love the story because it’s about someone who appeared to have as good of a relationship with Jesus as anyone could have, and yet he himself was weak. When Jesus appeared on the shore cooking breakfast for His friends, and caused their empty nets to be filled with more fish than they could handle, Peter recognized Jesus, because this is the same way Jesus first called Peter—with a miraculous catch of fish (Luke 5:1–11).\n\nWhen Peter jumped out of the boat and cast his drenched and dripping self at the feet of Jesus, he had no relational ground to stand on. He’d betrayed his best friend, his Lord. And yet, Jesus asked Peter the most simple and searching question imaginable: “Do you love me?” And Peter, paradox that he is, answered truthfully. He did love Jesus. He did. When Jesus said, “Feed my sheep,” He was hearkening back to when He first called Peter and told him He would make him a fisher of men. Peter’s failure did not disqualify him from Jesus’s love, or from Jesus’s call on his life.\n\nI love this passage because it offers so much hope to people who go through seasons of struggle and failure and wonder if they have lost the love of God. Peter could do nothing but receive from Jesus. On that shore, he had nothing to offer. And yet, he longed to be near his Lord and friend. We know this because earlier, before Jesus was crucified, He taught that people would ultimately need to be nourished by His flesh and blood. It was a teaching many found too difficult to embrace, and they left. But when Jesus asked His disciples if they, too, would leave, it was Peter who said, “Lord, to whom will we go? You have the words of eternal life” (John 6:68).\n\nPeter’s story reminds us that the thing we must cling to most, and fear above all else, is the Word of Christ (Psalm 119:161). Though our circumstances change, and even we change, He does not (Hebrews 13:8). Where else can we go?\n\nRuss Ramsey and his wife and four children make their home in Nashville, Tennessee, where he is the pastor of Christ Presbyterian Church Cool Springs. Russ is the author of the Retelling the Story series and Struck: One Christian’s Reflections on Encountering Death. You can follow him on Facebook, Twitter, and Instagram.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-12-1024x1024.jpg"
    },
      {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 1:1-5, John 1:14-18, Luke 4:16-30, Matthew 16:13-20, Matthew 17:1-7, Mark 15:1-5, Mark 15:16-39, Matthew 28:1-10, Matthew 28:16-20, Colossians 1:15-20, John 21:25",
    "devo_title": "Jesus",
    "devo_summary": "\n\nBY Amanda Bible Williams\n\nJesus in 500 words or less. Is that even possible? After all, the apostle John ended his Gospel by stating that the world is not big enough for all the books that could be written about this man, Jesus Christ of Nazareth (John 21:25). And if John says it can’t be done, who am I to try?\n\nThe daunting task reminds me of those blue test booklets in school, the ones designed to hold handwritten answers to essay questions, paragraph after painful paragraph to prove how much we did—or didn’t—know about the subject at hand. I love words and I liked school, but even I hated those blue booklets. They symbolized a reckoning none of us could escape, the teacher acting as the sole judge of whether our finite knowledge was enough.\n\n“Who do you say that I am?” (Matthew 16:15). Jesus quizzed His disciples after yet another encounter with the religious leaders who were constantly trying to corner Him, embarrass Him, and discredit Him. But His question isn’t only for the Twelve; it’s also for us.\n\nWho is Jesus? He is God incarnate, the very fullness of God in the form of a man. John described Him this way: “The Word became flesh and dwelt among us. We observed his glory, the glory as the one and only Son from the Father, full of grace and truth” (John 1:14). Jesus was present at creation when the earth was formed and the first man and woman were made in the image of God. “He was with God in the beginning,” John writes. “All things were created through him, and apart from him not one thing was created that has been created” (John 1:2–3).\n\nNot one thing was created apart from Jesus. “He is before all things, and by him all things hold together” (Colossians 1:17). And yet, Jesus came to walk the very earth He formed, becoming a real human being who talked and laughed and ate breakfast and felt physical pain. He came to dwell among us—to live and die and rise again as the Savior of the world.\n\nWho is Jesus? God the Father answered the question as His only Son stood high on a mountain, three of His friends beside Him and two ancient fathers of the faith looking on. “This is my beloved Son, with whom I am well-pleased” (Matthew 17:5). God then followed that statement with a not-so-subtle command: “Listen to him!”\n\nWho is Jesus? He is the Son of God who reveals the Father, full of grace and truth (John 1:18). He is the Lamb of God who fulfilled the law we could not keep and took the punishment for our sins on Himself (Romans 8:3–4). He is the risen Savior who reconciles us to God and gives us peace (Colossians 1:19–20).\n\nAll of Scripture points to Jesus. Every story is about Him. And though we may not be able to explain this reality in any number of blue test booklets, we can know it in our bones all the same. As we read the stories of women and men in the New Testament, I pray that we see Jesus. May we stand with Peter and profess: “You are the Messiah, the Son of the living God” (Matthew 16:16).\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-1-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 1:5-25, Luke 1:57-66, 1 Samuel 1:9-18, Psalm 113:5-9",
    "devo_title": "Zechariah & Elizabeth",
    "devo_summary": "\n\nBY Erin Davis\n\nIn our broken condition, even mustard-seed faith is often hard to muster. Take Zechariah, for example. In the first chapter of his Gospel, Luke records that Zechariah had many reasons to trust God. He came from a family of priests who had served God for generations. Surely, the stories of God’s faithfulness had trickled down through Zechariah’s family line. Or maybe through the line of his wife, Elizabeth, who was also from the line of Aaron.\n\nAaron—Who was Israel’s first high priest (Numbers 17:8–18:1).Whose feet had felt the dry sand at the bottom of the Red Sea (Exodus 14:15–31).Who tasted manna with his own taste buds (Exodus 16).Who entered the holy of holies and saw God appear in a cloud above the mercy seat (Leviticus 16:2–3).\n\nWhat stories of God might they have heard?\n\nZechariah was a praying man who had asked the Lord for a child, and Scripture tells us God heard that prayer (Luke 1:13). Since Zechariah and his wife were “well along in years” (v.18), we can assume they had been praying for a long time, likely decades. Hadn’t Zechariah kept praying in faith? Hadn’t he asked, expecting God to respond? Luke reveals that as Zechariah entered the temple to offer the incense offering, “the whole assembly of the people was praying outside” (v.10). Was his faith strengthened by the image of an entire assembly seeking the Lord?\n\nWith a heritage of faith, a history of God’s faithfulness, and the prayers of the people ringing in his ears, you’d think that trusting God would come naturally to Zechariah. Except, of course, it didn’t in this moment. When Gabriel announced that God heard Zechariah’s prayers and was about to do all that Zechariah asked and more, Zechariah replied, “How can I know this?” (v.18). From my own human experience, what I hear in his words is this: “How can I know for sure?” It seems Zechariah was overcome with doubt, not faith. Though he had so many reasons to stand tall on his trust in God, the legs of Zechariah’s faith wobbled. The angel struck him mute as a result (vv.19–20).\n\nBecause our hearts are still bruised from the fall, unwavering faith is hard won. Despite all that God has given us, do you, like Zechariah, still doubt that He will come through? Me too. When my need leads me to the intersection of fear and faith, I look at God’s promises and think, How can I know for sure?\n\nLean in. Listen to the angel’s answer.\n\n“You will become silent and unable to speak until the days these things take place,because you did not believe my words, which will be fulfilled in their proper time” (v.20).\n\nThough God certainly calls us to trust Him, we can read Zechariah’s story and find hope. Zechariah’s weak faith did not weaken God’s power. His doubt didn’t stop John, the forerunner to Jesus, from being born. When your own legs of faith start to wobble, take courage, because nothing can stop the plans of God.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-2-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 1:26-38, Luke 2:1-7, John 2:1-12, John 19:25-27",
    "devo_title": "Mary of Nazareth",
    "devo_summary": "\n\nBY Ellen L. Taylor\n\nWhen I was young, my church put on a Christmas pageant every year. At age 8, I was given the extreme honor of performing a solo for that year’s pageant. My shining moment came as Mary and Joseph were traveling to Bethlehem, looking for somewhere safe to stay so Mary could give birth to Jesus. As Mary and Joseph came upon the inn my character was “working” at, I burst into song, repeating over and over, “No room. No room.”\n\nThat’s it. “No room.” My twenty seconds of fame. (Twenty might be generous.)\n\nThis follows the story I learned about Mary growing up: She is visited by an angel and told she will give birth to Jesus. She is afraid Joseph, her fiancé, will leave her, but he is visited by an angel too! They travel on a donkey to Bethlehem for a census, and while they are there, the time comes for Mary to give birth. But there isn’t anywhere for them to stay! (Time for my solo—“No room. No room.”) And so when Jesus is born, He is laid in a manger, a food trough for animals. He grows up, and that’s when the story really begins.\n\nFor the most part, this was all I’d really learned about Mary. But one of the best parts of Mary’s story actually comes at the very beginning, when she is first visited by the angel. When the angel tells her she will be the mother of Jesus, God’s own Son, she is quick to question, ”How can this be, since I have not had sexual relations with a man?” (Luke 1:34). Mary was likely confused and concerned, given her engagement to Joseph, as any young woman would be upon receiving such news. But the angel counters her confusion and fear with a reminder of the power of the Lord her God. He tells Mary that the child she is carrying will be called the Son of God. And then he reminds her of her cousin Elizabeth, and the son she is now carrying after years of infertility. Nothing is impossible with God.\n\nMary’s response to the angel is simple and powerful: “I am the Lord’s servant… May it happen to me as you have said” (Luke 1:38). Before Jesus was even born, His mother was committed to being a servant of the Lord. Even though her life was being turned upside down, her own plans disrupted, and she was unsure of the future she thought she would have with Joseph, one thing remained true: she was a servant of the Lord. And because she trusted in the Lord, she knew that His plans for her life were better than the ones she had herself.\n\nIn moments of uncertainty, when we’re told that something will likely turn our life upside down, we may try to cope with it by hanging on to whatever sense of control we think we have at that time. We try to keep a tight, white-knuckled grip on what we think we know to be best for us; those are easy reactions that offer a false sense of security. But Mary does the exact opposite—she lets go. And with open hands she gives herself to God’s plan.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-3-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 2:21-38, Isaiah 9:1-7, 1 Peter 2:4-10",
    "devo_title": "Anna & Simeon",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nKeeping promises is tricky business. We like the concept. But sticking to our word can prove a bit more difficult. As kids, we try setting ourselves up for a better success rate by creating failsafes, like the infamous “pinky promise.” Because, as everyone knows, if it’s a pinky promise, it can’t be broken.\n\nI know some people who are really good at keeping their word. Their promises aren’t unrealistic because they recognize their own limits, but the ones they do make are meant to make a difference. I promise to support you in any way I can. I promise to hold you accountable. I promise to let you know if there’s anything you can do for me. These statements reflect more about the person’s commitment than their ability to carry it out. After all, even the best of friends can’t keep a perfect record.\n\nSimeon’s story is a beautiful account of someone who not only received a very personal promise from God, but also had the joy of seeing it fulfilled during his lifetime. He is depicted as a sort of spiritual elder, being ”righteous and devout” and “looking forward to Israel’s consolation” (Luke 2:25). With tenderness, we see Simeon take the object of his affection into his arms and say to the Lord, “You can dismiss your servant in peace, as you promised. For my eyes have seen your salvation” (vv.29–30). He was one of the first to recognize Jesus for who He really was.\n\nCan you imagine the joy, as well as the relief? The Holy Spirit’s promise was that Simeon would pass away only after seeing the Messiah, and he responded to this promise with trust (v.26). Although seeing the Messiah with his own eyes didn’t mean he was doomed to die the next day, it did mean God’s promise had been fulfilled. Simeon’s trust in this promise had been rewarded. Even if he didn’t live long enough to see how his words of prophecy played out, he was blessed to know that the consolation of Israel was here.\n\nThe same was true for widowed Anna, the prophetess who was “well along in years” (v.36). She stayed in the temple, serving God day and night. Though it is unlikely she lived to see the redemptive story of Jesus unfold, we do know she joyfully bore witness to the Christ child in her advanced age (vv.36–38).\n\nRemembering that God is the one who makes and keeps the biggest promises—including the ones that will outlast us—helps to strengthen our hope for today. In what ways do you need to trust in Him today? Grab hold of His promises. Even when we can’t see the full picture, God is our great Keeper of Promises.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-4-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Matthew 3:1-17, Matthew 11:1-15, Matthew 14:1-12",
    "devo_title": "John the Baptist",
    "devo_summary": "\n\nBY Rebecca Faires\n\nSomehow, I cannot picture John the Baptist as a multitasker. I don’t imagine he was smooth at dinner parties. I don’t reckon he cared much for distractions. He strikes me as someone who knew the one thing he was about, and he was deeply invested in that one thing. He was called to prepare the way of the Lord (Matthew 3:3), and by the grace of God, he was able to go about his business with that singular focus.\n\nThe life of John the Baptist is such a brilliant reminder to bring us back to the one thing we are about. And I don’t mean writing that novel, or going on a trip, or even perfecting our relationships. I’m talking about the one thing we are all, first and foremost, supposed to be about: the person of Jesus Christ.\n\nJohn fixed his sights wholly upon proclaiming the coming kingdom. His wilderness living was not just a weird lifestyle choice, but an unbending commitment to prayer and the Word of God. His devotion to Christ and His kingdom are particularly evident in two defining features of John’s life, and these two features should drive us to the same wholehearted seeking of God’s kingdom.\n\nFirst, John’s humility provokes us to bend our knees before the lordship of Christ. John was the greater Elijah, indeed, and according to Jesus, John was the greatest man to have yet walked the earth (Matthew 11:11). Yet John’s chief calling was to point the way to Christ who would bring the kingdom of heaven along with Him. Though John himself was the greatest of the prophets, he did not yield to the temptation of pride. Instead, he declared to his followers:\n\n“I baptize you with water for repentance,but the one who is coming after me is more powerful than I.I am not worthy to remove his sandals.He himself will baptize you with the Holy Spirit and fire” (Matthew 3:11).\n\nJohn further displayed this kind of humility when his own disciples began to abandon him to follow after Jesus, acknowledging: “He must increase, but I must decrease” (John 3:30). If John, the greatest of the prophets, so readily yielded up everything to Christ, how much more ought we do the same? The humility of John the Baptist is a reminder of the greatness of Christ.\n\nSecond, John’s courage provokes us to honor the lordship of Christ in faith-filled obedience. John did not hesitate to proclaim the gospel. His cry was continual: “Repent, because the kingdom of heaven has come near!” (Matthew 3:2). He offended the selfish pride in the hearts of the Pharisees and Sadducees, calling out their sin and declaring that they, too, must bow the knee to the true Lord of heaven and earth (vv.7–10).\n\nHe declares the same thing to us: Repent, for the kingdom of heaven has come! He proclaimed this message of the gospel—both its condemnation of sin, and its offer of salvation—even in the face of death. He called sin, sin, a thing we are often hesitant to do in this day and age. And he boldly proclaimed Christ as both Lord and Savior. Such courage only comes from knowing that Christ is Lord over all, and therefore, we need not fear the powers of earth. Such courage only comes from knowing that Christ is the Lamb of God, and therefore, we rest secure in the salvation He has purchased.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-5-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 3:1-21, Numbers 21:1-9, John 7:45-52, John 19:38-42",
    "devo_title": "Nicodemus",
    "devo_summary": "\n\nBY Guest Writer\n\n“There was a man from the Pharisees named Nicodemus, a ruler of the Jews” who knew the law (John 3:1), but had yet to encounter love Himself. That is, until the night he came to see Jesus. For Nicodemus, faith was synonymous with his pharisaical practices. His belief system was built on the foundation of strictly adhering to the rules and doing good works to please God. Faith in the person of Jesus was hard to make sense of beyond the law. So when Nicodemus sought Him out, Jesus told him the truth:\n\n“Truly I tell you, unless someone is born again,he cannot see the kingdom of God” (John 3:3).\n\nJesus told Nicodemus he was blind! This Pharisee had heard God’s Word, but did not recognize the person of Jesus standing before him. Without believing in Jesus and being “born of the Spirit,” Nicodemus would stand “condemned” (vv.8,18). Nicodemus must have walked away confused and conflicted. Yet, after Nicodemus personally met with Jesus, something in him changed.\n\nAs we follow his story, we see Nicodemus courageously confront the other Pharisees who tried to condemn Jesus unjustly (John 7:45–52). Later, he joined Joseph of Arimathea to anoint Jesus’s body for burial with aloe and myrrh—more than a thoughtful gesture, considering Nicodemus would have known that myrrh was used to anoint high priests and kings (John 19:38–42). Were his actions implying he now understood Jesus’s true role?\n\nAs we reach the end of Nicodemus’s story, I am led to believe that Nicodemus knew Jesus, not as a distant ideology, but as a personal Savior. We see his faith, though not instantaneous, refined over a series of choices to honor Jesus as more than a teacher: a King.\n\nThis is what happens when we meet the person of Jesus—we’re given life, again! Though we may not be physically reborn, we are forever changed. A personal encounter with Jesus opens our eyes and beckons us to turn and look at “the Son of Man… lifted up” for who He truly is (John 3:14). And by believing in Him, we receive the gift of eternal life (v.15). Now we have assurance of seeing the kingdom of God—not by anything we have done, but by what Jesus has done for us.\n\nWe can now come into the light of this saving truth, no longer hiding behind our seemingly good religious deeds. Instead, we continue to practice what Scripture instructs us to do—things like giving generously to the local church, honoring our parents, obeying God by sharing the gospel, fighting against injustice, remaining faithful to our spouses, or keeping the Sabbath—knowing that our faithfulness points to our God (John 3:21). And when we are tempted to earn our salvation, may we remember that Jesus invites us to seek Him and His kingdom (Matthew 6:33), whether in the middle of the night like Nicodemus or first light of day, at work or at home, in the classroom or the car. What He has for us is not just a set of rules, but a relationship. Not just the law, but a life-changing love.\n\nWriter and speaker Bailey T. Hurley is everyone’s favorite cheerleader for godly friendships. With a life-long heart for hospitality, Bailey offers simple friendship habits to help women build meaningful, lasting relationships. She’s written for publications like Deeply Rooted Magazine, Grit and Virtue, and Salvation Army’s Peer Magazine. She loves podcasts, and you can find her on Sally Clarkson’s “Life with Sally,” Kristin Schell’s “At the Turquoise Table,” and a dozen more. Bailey holds an MA in Leadership from Denver Seminary. She currently lives in Denver, Colorado, with her husband, Tim, and kiddos, Hunter and Liv. Learn more at baileythurley.com.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-8-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 5:1-11, Matthew 4:18-22, Matthew 14:22-32, Matthew 16:13-20, Luke 22:54-62, John 21:15-19",
    "devo_title": "Peter",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nDo it scared. This is a popular phrase today, one that shows up in books, podcasts, and hashtags. When I read the story of Peter fighting his way through the wind and waves, I’m reminded of this phrase and how it characterizes Peter’s faith-inspired action. But was “doing it scared” enough to sustain him on the water?\n\nIn this story, the disciple second-guesses his decision to join Jesus after observing the strength of the winds (Matthew 14:30). What was I thinking? That’s what I imagine him asking himself. No doubt, those winds felt stronger out on the surface of the water than back in the security of the boat. Wild and tempestuous, the winds circle the disciple, and his own fragility overtakes him. “Lord, save me!” he cries, feet plunging below the surface of the sea (v.30).\n\nNotice how it isn’t the lack of steady ground that Peter fears most. After all, he’s the one who asks Jesus to invite him onto the water, after seeing Jesus model the physics-defying act. Only after venturing out onto the water does Peter’s confidence begin to waver, as he notices just how powerful the wind’s ability to topple him actually is. Although Peter trusts the Lord enough to risk walking on water, that same trust doesn’t sustain him once the obstacles around him begin gaining power.\n\nBut it took a lot of faith for Peter to step out of the boat, right? When Jesus says, “You of little faith, why did you doubt?” (v.31), we might think to ourselves, Goodness, that’s a lot more faith than I would have had. Can’t we give this guy a break? But Jesus’s words don’t appear to be accusatory. They are an expression of His care. After rescuing Peter by reaching out His hand, Jesus continues to invite the disciple into a life of deeper connection and trust as they journey together.\n\nI’ll be the first to confess that I am forever taking my eyes off Jesus when I find myself in the midst of daunting situations. It’s easier to focus on the situation itself until it robs me of the very gifts meant to sustain me. You probably have your own courageous story of a time when you followed God, trust and confidence levels high, only to be met with fear and doubt further down the road.\n\nChrist not only strengthens us to follow Him, but His strength can also keep us steadfast in the face of peril. We do have permission to cry out when we need help, though. Sometimes He intercedes immediately and calls the surrounding elements into submission—like the salty wind and cold and choppy waves. But sometimes He allows the environment to persist without plucking us from it because it has the ability to form us into His likeness.\n\nNo matter what is going on in your life, Christ knows when and how to save you. His rescue is not delayed. Like Peter, when we cry out, He will answer. Carry God’s strength with you today as you “do it scared,” and trust that He is enough to sustain you against the fury of a thousand winds.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-9-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 5:21-43, Leviticus 15:25-27, Revelation 21:4",
    "devo_title": "Jairus & His Daughter",
    "devo_summary": "\n\nBY Melanie Rainer\n\n \n\nStories like those from today’s passage of Jairus’s daughter and the bleeding woman aren’t just about miraculous healings. They also reveal to us what radical love for our neighbor looks like, what it means to deny social norms, and how legalism is disrupted—things Jesus embodied when He walked on the earth. Everything Jesus does is radical, but this particular passage alights something deep within my soul. I am just bowled over by the goodness of our Savior. This passage shows us how everything takes a backseat to the divinity and radical love of Christ.\n\nA woman with a twelve-year-long menstrual discharge, which has made her ceremonially unclean (Leviticus 15:25–27), goes into public looking for Jesus, believing He can heal her—if only she can touch the hem of His robe (Mark 5:25,28).\n\nA leader in the local synagogue (Jairus) comes looking for Jesus, begging Him to heal his daughter (Mark 5:22–23). Jesus goes to the man’s house and touches his dead daughter, and miraculously, she is healed (Mark 5:41).\n\nHe healed the woman and He raised the girl from the dead, even though in doing so, He has also made Himself “unclean,” according to levitical law. He does not call attention to Himself, shouting from the rooftops, “Look what I’m doing! Healing WOMEN! Touching the UNCLEAN! Breaking the LEVITICAL LAW! And in the house of a SYNAGOGUE LEADER!” Instead, He speaks with gentleness: “Don’t be afraid. Only believe” (Mark 5:36). He instructs those present not to tell anyone what He’s done (v.43).\n\nFollowing the rules did not save Jairus’s daughter, nor did visiting the experts stop the woman from bleeding. But belief did—faith that Jesus was who He said He was and would do what He said He would do. Jairus and the bleeding woman did not let fear cover them, but rather an insistent, consuming faith.\n\nEven as I type this, my heart is beating faster than it normally does, anxiety swelling up inside me for so many reasons. I’m worried about health, finances, my church family, the aftermath of tornadoes that touched down in our city in early spring, a global pandemic and resulting quarantine, the need for racial reconciliation within the Church and the country and around the world—and so much more. I fear death. I fear pain. I want to hunker down on the couch and never leave my house again.\n\nBut Jesus has two lessons for me from today’s reading in Mark. First, He calls me to live and love as radically as He did. Jesus denied custom and law to touch the sick and heal them. Throughout the Gospels, Jesus prioritizes the weak, the poor, the outcast, the suffering. As I seek to follow Him, I must do this too.\n\nSecond, I long for faith and love to chase away fear (1John 4:18), to trust the character of Jesus, to believe that He will accomplish all He has promised to do. I long to believe that the promise revealed to John in Revelation 21:4 is true: “He will wipe away every tear from their eyes. Death will be no more; grief, crying, and pain will be no more, because the previous things have passed away.” His words are my only hope in life and in death: “Don’t be afraid. Only believe.”\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-10-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 4:1-42, Jeremiah 17:9-13, Revelation 21:6, Revelation 22:1-5",
    "devo_title": "The Woman at the Well",
    "devo_summary": "\n\nBY Ellen L. Taylor\n\nI start every day with either a cup of coffee, a glass of orange juice, or a cup of tea. The variation depends on a few factors—weather, season, and hour—but the principle is the same: a quick beverage before I get my day started. But when I’m really, truly thirsty, the only thing that will satisfy that craving is plain old water. I prefer mine chilled, while others prefer room temperature. And some people will tell you that bubbly water hydrates you all the same, but I’m not convinced. I just want water.\n\nThe woman at the well might have thought the same thing when Jesus came to her as she was drawing water; she just wanted to get some water to drink. Jesus, exhausted from His travels, wanted the same thing. But the water that Jesus offers the woman is different from just normal water. He tells her that if she drinks this water, she will never be thirsty again (John 4:14).\n\nIt’s hard to comprehend a water that quenches thirst even more so than what we’re used to. But the woman, tired of coming to draw water from this physical well, is eager to hear what Jesus has to say about His water. According to societal norms, as a Jewish man, Jesus should not have even been associating with this woman, a Samaritan—and one who has had five husbands at that. But Jesus, in keeping with His way of reaching out to those who are cultural outcasts, sees her and offers her eternal life. Jesus, the Messiah, offers her living water.\n\nHave you ever seen a child come in from playing outside, grab a plastic cup of water, and gulp it down ferociously, with deep breaths after every sip? There’s nothing quite like that quenching of thirst. It provides almost instantaneous relief, and gives the child enough energy to run back out the door and keep playing. That’s how I imagine the promise of living water to be: instantaneous relief, courage to keep going, and knowledge that the thirst will not creep back up on you.\n\nThe living water of eternal life is offered to us now because of the death and resurrection of Jesus Christ. He has extended this grace to us, promising to never again leave us thirsty again. There will be a “well of water springing up” within us (John 4:14). When we drink from it, we experience the joy found in life with Christ. Come and drink, friends. Let us share in the goodness of living water.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-11-1-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 6:1-14, John 6:22-40, 2 Kings 4:42-44, Matthew 5:6",
    "devo_title": "The Boy With Fish and Loaves",
    "devo_summary": "\n\nBY Melanie Rainer\n\nOn my birthday, my team at work went to lunch. After the burgers and fries, and while I sipped a delicious peanut butter milkshake, they asked me the annual “birthday questions”: What surprised you most this year? What was the hardest part of the year? The best? What did you learn about the Lord this year?\n\nI’ve learned many things about the Lord this year, but when I surveyed the last 365 days, it was encouraging and humbling to see a silver thread, a theme woven throughout the choices and challenges my family had made and experienced in 2019. The thread? His provision. His bountiful, beautiful, magnificent provision. He made a way in every desert (Isaiah 43:19). Every valley had a way out, every mountain had a gentle slope down.\n\nJesus provides beautifully and bountifully in today’s story about the boy who had five loaves and two fishes. We discover very little about the boy from the text itself, just that he was young (anywhere from a child to a man in his twenties), and that he was likely poor because the bread is described as being made of barley, which was common to the poor. But there’s another interesting detail tucked in there: it was almost Passover (John 6:4)—the Jewish holiday and feast celebrating God’s provision as He delivered His people from Egypt, the manna and quail they feasted on in the desert, and the promised land they inherited.\n\nBread is a silver thread running through Scripture, a reminder of God’s provision: manna in the desert (Exodus 16), Elisha’s miracle (2 Kings 4), and the provision of wheat for Ruth (Ruth 2). This event with the boy’s bread and fish took place shortly before Passover, and afterward, Jesus taught that He was the bread of life, sent from heaven (John 6:35). “This is the work of God,” Jesus said, “that you believe in the one he has sent” (v.29).\n\nA few chapters later, during Passover, Jesus and His disciples broke bread together (John 13). While John doesn’t record the conversation where Jesus blesses the bread and the wine and institutes the Lord’s supper, the other three Gospels do. Jesus, who had a short time before taught His disciples that He is the very bread of life, now broke a loaf, blessed it, and shared it with them.\n\nAnd he took bread, gave thanks, broke it, gave it to them,and said, “This is my body, which is given for you.Do this in remembrance of me” (Luke 22:19).\n\nAfter He is risen, He provides again through bread. He walks the Emmaus Road with two disciples, who do not recognize Him, and they invite Him to stay with them that night. And “it was as he reclined at the table with them that he took the bread, blessed and broke it, and gave it to them. Then their eyes were opened, and they recognized him” (Luke 24:30–31). The disciples race to Jerusalem to find the rest of the disciples, describing “how he was made known to them in the breaking of the bread” (v.35).\n\nHow many times throughout Scripture has God made Himself known through the breaking of bread? The Israelites, wandering through the desert with more manna than they could eat. Widowed Ruth’s overflowing baskets of wheat. Elisha’s miracle. A poor boy and his five loaves, multiplied to feed thousands.\n\nJesus is the bread of life, and He died on the cross in the ultimate act of bountiful and beautiful provision. And we, the communion of saints, have the privilege of sharing in that bread every time we partake in the Lord’s Supper. May Christ, our bread of life, always be made known through the breaking of the bread, the sign of God’s abundant provision to His people, throughout history and today.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-12-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 8:1-3, Mark 15:37-47, John 20:1-18, Colossians 1:9-14",
    "devo_title": "Mary Magdalene",
    "devo_summary": "\n\nBY Erin Davis\n\nAs a little girl, bad dreams always drove me to make a beeline for my parents’ bedroom in the middle of the night. I’d wiggle my tiny body in between my mom and dad, and only then would my racing pulse steady. As I listened to the rhythms of my parents’ breathing, or saw the silhouettes of their faces in the moonlight, the memories of my nightmare would begin to fade. They didn’t even have to wake up for me to feel comforted. It was their presence that made the difference.\n\nMary Magdalene was a woman who sought the presence of Jesus. When Jesus traveled from town to town delivering the good news, Mary traveled with Him. As Jesus hung on the cross, Mary stood nearby. After His death, while His disciples scattered and hid, Mary stayed close to her Savior. She watched as Christ’s body was placed in a borrowed tomb.\n\nThough Mary’s conversion is mysterious, we know she knew the sorrows that result from a life lived far from God. And if the nightmares of that previous life came howling, I imagine she found comfort in the nearness of her Savior, even after His death.\n\nOn the first day of the week Mary Magdalene came to the tomb early,while it was still dark (John 20:1).\n\nI wonder what Mary experienced after Jesus’s death. Perhaps she tried to sleep but couldn’t. Perhaps images of her bruised and bloodied Healer rushed to the surface every time she closed her eyes. Maybe she’d spent the moonlit hours pacing, trying to shake the hopelessness that wanted to settle into the deepest crevices of her heart. Did she allow herself to think about life without Him and sigh, distraught?\n\nBefore the sun even dared to rise, Mary joined Salome and Mary, the mother of James, to anoint Christ’s body with spices (Mark 16:1). She wasn’t in denial about His death; she’d seen His lifeless body tucked into the dark tomb. But she felt compelled to join the other women in this act of care, and so she went to Him again, all the while wondering who would roll away the stone blocking them from His body. When she arrived, what she found was an empty tomb—and there, she met her risen Savior, before turning on her heel and running away to declare to the disciples, “I have seen the Lord!” (John 20:18).\n\nHow does a demon-possessed woman become the first proclaimer of the resurrection? She had been with Jesus. What was true of Mary is true for each of us: we all need the presence of Jesus. In His presence is peace and abundant joy (Psalm 16:11). May we seek and pursue Him as relentlessly as Mary did, confident His nearness will provide the comfort we crave.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-15-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 9:1-8, Mark 10:35-45, 1 John 1:1-4, Revelation 1:9-20",
    "devo_title": "John",
    "devo_summary": "\n\nBY Melanie Rainer\n\nThe four Gospels tell the story of Jesus: His life, teachings, death, and resurrection. But the Gospels also tell the stories of the men and women who followed Him. The story of John, one of the twelve disciples, is traced through all four Gospel accounts, and is a story of beautiful transformation in the heart of someone who followed Him.\n\nA fisherman by trade, John was the brother of James, the son of Zebedee (Mark 1:19–20). Paul describes him as a “pillar” of the church (Galatians 2:9). He wrote the Gospel of John, the books of 1, 2, and 3 John, and Revelation. Within the pages of the book of John, he is referred to as a beloved disciple, or “the one Jesus loved” (John 13:23; 20:2).\n\nJohn was one of three disciples who witnessed the transfiguration of Jesus (Mark 9:2–3). Along with James and Peter, John saw a truly extraordinary event: Jesus transformed into His heavenly person, clothed all in white. The passage in Mark 9 echoes back to Moses’s encounter with God, when he came down from Mount Sinai and his face was still shining “as a result of his speaking with the LORD” (Exodus 34:29). Having been there from early on in Jesus’s earthly ministry, John knew Jesus was God’s beloved Son (Matthew 3:17), and having witnessed His transfiguration, he heard what Jesus would ultimately do (die and rise again), though John, along with James and Peter, wondered what this meant (Mark 9:7–10).\n\nLater, when Jesus further explained to His disciples that He would die and rise again, brothers James and John immediately took Him aside to ask if they might sit on His right and left hand in heaven, wanting the glory and honor represented by those positions (Mark 10:35–40). But Jesus flipped that idea on its head, telling them:\n\n“Whoever wants to become great among you will be your servant,and whoever wants to be first among you will be a slave to all.For even the Son of Man did not come to be served,but to serve, and to give his life as a ransom for many” (vv.43–45).\n\nThroughout the Gospels, we read of John’s own transformation from fisherman to follower of Jesus, from power-seeking to power-giving, testifying to Jesus’s lordship, “so that [others] may also have fellowship… with the Father and with his Son, Jesus Christ” (1John 1:2–3). Transformed by that fellowship, he became one of the New Testament’s most prolific writers, receiving God’s revelation of the future, fully realized kingdom of God (Revelation 1:9–11).\n\nGrace, redemption, and change—John, Peter, Matthew, and others are recorded as having their lives turned upside down by Christ. We are invited into the same transformation, and called to the same self-sacrifice as Jesus’s beloved disciple, John. It is a gift and grace to be called by Jesus, and a deep mercy to be transformed by His love, as John was.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-16-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 10:46-52, Psalm 146:1-10, Isaiah 42:1-8, Romans 4:3-5",
    "devo_title": "Bartimaeus",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nWhen you’re an adult, the question “What do you want for Christmas?” gets a lot harder. The things that make it on your list usually become more humanitarian, like social justice in your city, the health of your family, revival in the Church, and sure, maybe even a substantial tax return. Like an expectant child on Christmas morning, you hope against hope that your desires will come to pass. But they’re more like prayers now, and as we all know, prayers aren’t the same as a shopping list for gifts.\n\nWhen you read today’s story, did you ponder your own answer to Jesus’s question? At first glance, when Jesus asks the blind beggar Bartimaeus what he wants Jesus to do for him, it might seem like a trick question (Mark 10:51). Does Jesus really want to know our wants?\n\nThough the first part of the phrase, “What do you want,” may seem to lend itself to opening a can of self-indulgent responses, it’s the second part, “me to do for you,” where Christ’s heart really lives. He really does want to know what we want. (And let’s be honest, He already knows anyway.) But when I read the rest of His question, I see Him using it as an opportunity for building a bridge toward relationship.\n\nBartimaeus didn’t accost Jesus with a list of things he wanted but rather cried out, “Have mercy on me, Son of David!” (Mark 10:48). Bartimaeus wanted what so many of us take for granted: to see with his eyes (v.51). Having one of his core faculties restored was the beggar’s biggest need, and this encounter was a chance for Jesus to display His heart of generosity and kindness for one of His children.\n\nPrayer doesn’t work like a Christmas list, nor is it just a string of idealistic hopes. We can’t manipulate God into giving us what we want. But we do have the promise that He hears us, and the intimacy that is deepened during those moments of vulnerability when we express our felt needs to the Lord are worth everything.\n\nLike Bartimaeus, let’s ask for Christ to show mercy to us—and not just us but in all the realms that we hope for. We are already in His hands, the best possible place to be. Let’s trust that, whatever He chooses to do, God knows what is best for us and will act accordingly and in His perfect time. May we be brave enough to answer the same question posed to Bartimaeus: What do you want Jesus to do for you?\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-17-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 10:17-31, Luke 12:16-21, Ecclesiastes 5:8-20",
    "devo_title": "Rich Young Ruler",
    "devo_summary": "\n\nBY Guest Writer\n\nOur little Jonah is Tigger personified—a bouncy and sweet, rambunctious five-year-old. That means that at our house, there’s usually some kind of ball being thrown somewhere. With our high living room ceilings, the constant air assault, and the dodging, our house can feel a lot like a middle school gym class.\n\nOne ball has always been Jonah’s favorite: a foam mini football. He threw it so often that it ripped and busted out of its fabric casing. Jonah didn’t care. He kept throwing it until it was just an oblong sphere of stuffing barely holding together. For months, he refused to throw anything else.\n\nThrowing and bouncing and catching is Jonah’s love language. One day, I decided to embrace it full force. You know those huge bouncy balls from big box stores, the ones in bins at the end of the aisle? I got him one. I got him the biggest, 18-inch, bright red, nearly-half-his-size ball.\n\nI didn’t think a little face could contain that much joy. He’s since played with it for hours and hours. Believe it or not, the old foam football (which we’ve since replaced with a new one) hasn’t seen much playing time lately. Nothing captures Jonah’s heart like his massive, red, bouncy ball. He didn’t know something so wonderful existed.\n\nThere was a young man in Scripture who was holding on to something tightly, yet God wanted to bless him beyond his understanding. When the rich, young ruler came to Jesus and asked Him what he needed to do to gain eternal life, he and Jesus first discussed obeying some of the Ten Commandments. The man assured Jesus that he had followed them, and Jesus didn’t disagree. Then Scripture describes a deeply beautiful moment: “Looking at him, Jesus loved him” (Mark 10:21). Oh, the eyes of our Savior, showering love on this young man. Then Jesus said:\n\n“You lack one thing:Go, sell all you have and give to the poor,and you will have treasure in heaven.Then come, follow me” (Mark 10:21).\n\nThis is the only time in the Gospels that Jesus makes such a demand of a potential disciple. Scripture tells us Peter owned a house (Matthew 8:14), so following Jesus doesn’t necessarily mean leaving behind all of our earthly possessions. So why did Jesus make such a high demand? Because He knew that the young man’s wealth had his heart—it had his heart so deeply that the thought of giving his wealth away grieved him (Mark 10:22). Jesus knew He had something in store for the young man that was far beyond what he could comprehend: Himself. And so He told the young man to let go of what was keeping him back, and to follow Him instead.\n\nThe man walked away sad. We don’t know whether or not he ever decided to follow Jesus. We only have a Polaroid snapshot of this single moment in time. I hope we’ll meet this young man in heaven one day and he’ll say, “That moment was a turning point for me. Jesus’s loving gaze undid me. So after a time, I let go—of everything—and I grabbed on to Him. I thought I was rich before, but my heart couldn’t even comprehend the depths of the riches of knowing Jesus. He is my greatest treasure.”\n\nWe know that richness, don’t we? We are those who have been looked on and loved by our Savior. May His kindness lead us to pray: Jesus, if our hearts, prone to wander, start pining after lesser treasures, may Your love undo us and call us back to You.\n\nLaurin Greco is an author, editor, and mommy who lives in the Nashville area with her author/editor husband and her not quite author/editor three young sons. Laurin is the author of the Discover God’s Heart Devotional Bible and The Storybook of God’s Great Love: The Old Testament and The New Testament. When the house is quiet, she loves to quilt, but mostly she collects fabric for that one-day quilt she’s going to make.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-18-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 19:1-10, Leviticus 6:1-7, Matthew 6:19-24, Hebrews 13:5, Galatians 3:7",
    "devo_title": "Zacchaeus",
    "devo_summary": "\n\nBY Ellen L. Taylor\n\n“Zacchaeus was a wee little man/ And a wee little man was he. / He climbed up in a sycamore tree / For the Lord he wanted to see.”\n\nIf you grew up in Sunday school classes like I did, it’s likely that you sang this song surrounded by Cheerios and orange juice. For me, it was also the only thing I knew about Zacchaeus until I reached adulthood. Zacchaeus was short, he wanted to see Jesus, and he climbed a tree in order to see Him. End of story—Everyone grab your coloring pages and some crayons!\n\nBut reading Zacchaeus’s story now paints a different picture entirely. Zacchaeus was a tax collector, meaning he got rich off of everyone else’s money, which likely meant those people didn’t like him very much. He was an outcast, a loner. And just like everyone else in the town, he wanted to see Jesus. He wanted to find out more about this man people were talking about, this man who promised eternal life. So Zacchaeus climbed up a sycamore tree to be able to see, and when Jesus passed, He told Zacchaeus to come down because He was going to be staying at his house (Luke 19:5).\n\nAll the people in the town who overheard this were shocked. But Jesus, as He often does, was spending time with the people who were regularly looked over and cast aside. He was spending His time with the marginalized. After Jesus reached out to Zacchaeus in kindness, aligning Himself with the tax collector, Zaccheus became convicted of his sin and was then led to repent (Romans 2:4), declaring that he would give half of his possessions to the poor, and return extorted money four times over (Luke 19:8). In the eyes of everyone else, Zacchaeus was merely a rich, greedy man, but Jesus saw him as a man to invite into conversation, into community and relationship. Jesus told Zaccheus:\n\n“Today salvation has come to this house…because he too is a son of Abraham.For the Son of Man has come to seek and to save the lost” (Luke 19:9–10).\n\nJesus came to earth to save the lost. He came for Zacchaeus. Jesus saw him up in the tree, and Jesus saw him when he came down. He saw Zacchaeus for who he truly was: a child of God, one of the very reasons He’d left a heavenly kingdom in order to bring the good news of salvation and His kingdom to us (Matthew 6:10).\n\nFrom that day on, Zacchaeus chose not to serve the gods of money and wealth, but to serve the God who saved him from himself. His heart turned from a love of money to a love of Jesus and His message (Matthew 6:24)—all because Jesus saw him in the midst of his sinfulness and chose to love him anyway. Jesus does the same for us.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-19-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 11:1-18, John 11:28-44, 1 Corinthians 15:12-18, 1 Corinthians 15:55",
    "devo_title": "Lazarus",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nLately, I’ve been considering how necessary it is to have friends. Long distance friends are great, of course. It’s crazy that we live in a world where we can pick up a device and have a real-time conversation while living on another continent, or even a mile away. But there’s something essential about the everyday friends you can text last minute when your car engine dies. Friends you can grab ice cream with on the hardest of days. Friends who don’t mind lingering in the living room because you both just really need to talk—about that one guy or interview or the latest book you bought on Amazon.\n\nChristians often say that all we need is Jesus. While I understand where this sentiment comes from regarding Jesus, Scripture all tells us that our Triune, relational God created us for relationship (Genesis 1:26; 2:18), calls us His friends (John 15:15), and asks us to be His own hands and feet (1 Corinthians 12:4–12, 27). So, although it’s true that “Jesus and…” doesn’t accurately reflect how salvation works, it does reflect how community works. Even Jesus didn’t choose to minister in isolation. He allowed people to provide Him with food and relational support. Even Jesus had His own set of friends, one of them being Lazarus.\n\nWe don’t learn much about Lazarus firsthand from Scripture. We never “hear” him speak. Instead, we learn about him through the words and emotional responses of his sisters and his friends. “Lord, the one you love is sick,” said Mary and Martha in a concerned message about their brother (John 11:3). Jesus is equally troubled when he hears that his close friend has died. His emotional reaction gives away the depth of His affection, as the Jews watch tears fall from Christ’s face (vv.33–36).\n\nYou see, the centerpiece of this story isn’t Lazarus—it’s Jesus. The whole story is funneled through the lens of Christ’s love. Our Savior, the One who gave up life itself for three days, first experienced what it was like to give up His own friend. He was well-acquainted with loss, an experience that allowed Him to sympathize with us on a visceral, human level.\n\nRevisiting the sentiment “All we need is Jesus,” maybe a better way to look at it is this: “Jesus is the only way to salvation, but we need each other to flourish in our God-given identity.” It’s not as snappy, but at least it’s true.\n\nRemember that Jesus calls you His friend. You know that one person who will sit with you in your pain until you’ve exhausted every word in the English language? Or the one you can steal away to your favorite hiking spot with? Not only is Jesus your High Priest and Redeemer, but He is also that sort of friend.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-22-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Luke 10:38-42, John 11:19-27, John 12:1-8, Psalm 16:1-11, Psalm 27:4",
    "devo_title": "Martha & Mary",
    "devo_summary": "\n\nBY Abby Flynn\n\nDo you ever lay in bed at night and worry? Between moving to a new city, the coronavirus pandemic, and having a newborn, in the last few months, I’ve probably done enough worrying for it to be my full-time job.\n\nSometimes I remember to stop, pray, and give it to the Lord. And sometimes, I stay up way too late, writing endless lists of the things I can do to make life feel a little more under control.\n\nHave you ever been there? No? Just me, then?\n\nIf you grew up in Sunday school, at some point, you were probably taught to, “Be a Mary, not a Martha!” And though I’ve always related to Martha, she definitely gets a bad rap. When Jesus came to visit Mary and Martha in Luke 10, Mary sat at Jesus’s feet and listened to His every word. Meanwhile, Martha cleaned the kitchen; I sometimes imagine her banging pots and pans around passive-aggressively, annoyed that her sister couldn’t bother to help out, especially when company is in the house.\n\nAfter hearing Lazarus is sick, Jesus waits two days before going to see him (John 11:6–7). When He arrives, Mary sits and waits for Him at the house, while Martha runs out to meet Him. “Lord,” she tells Him, “if you had been here, my brother wouldn’t have died” (v.21). But despite this conviction, Martha still has trouble believing Jesus when He tells her Lazarus will rise again; it’s difficult to believe beyond what she sees with her own eyes in that moment (v.24).\n\nFinally, in John 12, we see a dinner given for Jesus before the Passover. At the dinner, Martha stays busy serving everyone, Lazarus reclines with Jesus, and Mary anoints Him with expensive perfume, filling the room with its fragrance.\n\nOur girl Martha is busy! She worries a lot. Knowing her so well, loving her as only He can, Jesus seems to address this head on:\n\n“Martha, Martha, you are worried and upset about many things,but one thing is necessary. Mary has made the right choice,and it will not be taken away from her” (Luke 10:41–42).\n\nThrough these small glimpses into Martha’s life, we see her cleaning, running a household, and serving. Martha strived to honor the Lord with her actions, but it was often at the expense of actually spending time in His presence. Meanwhile, Mary sat, listened, and anointed Jesus. While both women wanted to honor, serve, and love Him, in the end, it is Mary who “made the right choice.”\n\nIt’s easy for us to glorify Mary and berate Martha, but we all have a little Martha inside of us. She was distracted by her many tasks. But how many of those tasks did she feel like she was doing for the kingdom? How many times was she consumed by doing “all the things” instead of focusing on the one, most important thing?\n\nJesus looked at Martha, really saw her, and said, “You are worried and upset about many things.” Is this true of you today? Have you brought those things to the feet of Jesus? Have you laid them down, and taken time to sit and listen to what He has to say? Or are you busy, working, running around in a flurry, and getting angry at others for not noticing just how hard you’re trying? (I’m speaking to myself here, too.)\n\nWhat is God doing right now, in this moment? And what does He want to reveal to you about Himself? Is it time for you to sit down, stop striving, and finally rest? Mary chose the one thing, the good part, the better portion. And we would be wise to do the same.\n\nAbby Flynn is a wife, mom of two, and freelance copywriter living in Charlotte, NC. She loves bargain hunting and house hunting. On an average day, you can find her listening to great music, hosting a girls’ night, discovering new coffee shops, or watching the same Paw Patrol episode over and over again with her toddler.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-23-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Matthew 10:1-4, Luke 22:1-6, Matthew 26:17-25, John 13:2-29, Matthew 26:47-50, Matthew 27:3-10, Romans 2:5-8",
    "devo_title": "Judas Iscariot",
    "devo_summary": "\n\nBY Ellen L. Taylor\n\nHave you ever been betrayed by someone you love? I know I have. And I’ve been on the other side, too. Betrayal seems to be woven into the thread of humanity after the fall; we disappoint others and turn our backs on them, and they do the same to us. Oftentimes apologies and reconciliation follow, but sometimes the cut is just too deep to heal without an ugly, nasty scar on the relationship.\n\nJudas and Jesus were friends. Judas was one of Jesus’s twelve disciples, the group of men who traveled around with Him as He taught and preached. These disciples had great responsibility—they were chosen by Jesus to be fishers of men, to be by His side as He worked to spread the good news. They were even with Jesus during His last days on earth.\n\nThe story of Judas betraying Jesus is familiar to me. I heard it all the time growing up, particularly around Easter time while studying the crucifixion and resurrection of Jesus. Wicked Judas, betraying his Teacher for thirty pieces of silver. There are a couple of things that prick my heart every time I read this story. The first is that Judas tells the chief priests that the one he kisses is the person to arrest. A kiss, a sign of affection, turned on its head and used for unspeakable means. And even more poignant is that in the midst of betrayal, Jesus calls Judas “friend” (Matthew 26:50). Jesus knew exactly what Judas was there to do—He even hinted at it during the Last Supper in the upper room (vv.20–25). Jesus knew He would be betrayed, and He knew Judas was going to do it.\n\nThese two things—the kiss and the use of the word “friend” to describe Judas—communicate to the reader that Jesus was being betrayed by someone who He’d been in relationship with. Jesus’s disciples saw Him in some of His darkest moments on earth. They were with Him when He went to raise Lazarus from the dead (John 11:11–16) and when He ate His last meal (Matthew 26:26–35). Friendship is an intimate, sacred thing, but in the end, Judas betrayed his friend.\n\nAnd when Judas led the chief priests and elders to Jesus, greeting Him with a kiss and setting His arrest into motion, that is how Jesus addressed him:\n\n“Friend,” Jesus asked him, “why have you come?” (Matthew 26:50).\n\nJesus knew exactly why Judas had come, yet He called Judas “friend”—perhaps giving him a chance to choose differently, to choose reconciliation instead of betrayal, though we may never really know. What we do know is that the character of Jesus does not change (Hebrews 13:8). And while you and I and all of humanity were still sinners and enemies of God—that is when Jesus died for us (Romans 5:8–10).\n\nHe died for our reconciliation to God. He died to bring us into a right and lasting relationship with the Father, so that we could be called “friends” of God (John 15:15).\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-24-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 18:28-40, John 19:1-22, Psalm 2:1-12",
    "devo_title": "Pilate",
    "devo_summary": "\n\nBY Patti Sauls\n\n“Oh, I just can’t wait to be king!” declares the lion cub, Simba, in the 1994 movie, The Lion King. Simba struts as he sings of all the power and advantages he will enjoy when he inherits his father’s throne. The royal cub’s swagger is short-lived, though, as tragedy and trials arise. No spoiler alert needed—it’s obvious that young Simba is clueless about what it really means to be king.\n\nThroughout His ministry, Jesus was surrounded by others’ confusion about what it means to be King. Many people were drawn to His teaching and were convinced by His miracles that He was the long-awaited Messiah who would rule as King in Jerusalem and restore the Jewish nation. Just days before His arrest and crucifixion, jubilant crowds waved palm branches and proclaimed: “Hosanna! Blessed is the one who comes in the name of the Lord! Blessed is the king of Israel!” (John 12:13)\n\nBut not everyone wanted to crown Him King. The Jewish leaders were suspicious of Jesus’s growing influence, threatened by His miracles, and outraged by His claims of being united with God. All of this could disrupt their religious power dynamic. How would it affect their status if this man from Nazareth gained power?\n\nThe chief priests wanted to eliminate this threat by executing Jesus, but they knew that only Roman authorities could implement the death penalty (John 18:31–32). So, they arrested Him and charged Him with claiming to be “King of the Jews.” They hoped this would force the Roman governor of Judea, Pontius Pilate, to declare Jesus a political rebel and sentence Him to death. The stakes were high. Some crowds wanted Jesus to be king. Others, riled up by the Jewish leaders, wanted Him killed. As governor, Pilate was tasked with keeping the peace between his territory’s people and the rule of Rome.\n\nPilate knew the leaders wanted Jesus executed, but he couldn’t reconcile the calm, quiet man before him with such fierce allegations of rebellion. Three times Pilate insisted that he saw no basis for a criminal charge, but the unrelenting crowds threatened, “If you release this man, you are not Caesar’s friend. Anyone who makes himself a king opposes Caesar!” (John 19:12). Seeing the crowd’s mounting frenzy and fearing Roman backlash, Pilate buckled under the pressure and condemned Jesus to a torturous death on a cross.\n\nThe sign that Pilate fastened to Jesus’s cross stated, “JESUS OF NAZARETH, THE KING OF THE JEWS” (John 19:19). This was no ordinary notice of a criminal’s name and offense. It should stop us in our tracks because it was, and forever will be, a revelation of who Jesus really is. Jesus is the King who secures restoration and redemption for His people. He is the King who deflates status-seeking and disrupts self-centered living.\n\nPilate had this sign written in Aramaic, Latin, and Greek so that all could read it (John 19:20). Jesus died and rose again so that we, too, could have the eyes of our hearts opened. We don’t have to wait for Jesus to be an earthly king. We see and recognize that our King has come. Hosanna! Blessed is the King of Israel!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-25-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Matthew 27:15-31, Acts 3:1-16",
    "devo_title": "Barabbas",
    "devo_summary": "\n\nBY Erin Davis\n\nThe crowds were right: somebody needs to pay. We all want justice, and the craving for it is a righteous one. Sin cannot go unpunished, “for the wages of sin is death” (Romans 6:23).\n\nIn Matthew 27 we read the account of Jesus and Barabbas, two men paraded before an angry crowd under the watchful eye of Pontius Pilate. A strange custom was unfolding; mob mentality was both judge and jury. Given the choice between two prisoners, the crowds got to decide who walked away a free man.\n\nBarabbas was guilty, and no one was denying it. His crimes were “notorious,” widely known (Matthew 27:16). Jesus, on the other hand, was innocent. Still the crowds looked at Him and screamed, “Crucify him!” (v.22). They were not blind to Barabbas’s guilt—they simply failed to recognize their own. Spiritual blindness kept them from seeing how much they needed the Savior standing right in front of them.\n\n“You denied the Holy and Righteous Oneand asked to have a murderer released to you.You killed the source of Life,whom God raised from the dead;we are witnesses of this” (Acts 3:14–15).\n\nThe crowds allowed the guilty man to walk in freedom. Is this ringing any bells? We are all Barabbas. All of us “have sinned and fall short of the glory of God” (Romans 3:23). When it comes to sin, we’re guilty, notorious sinners who cannot stand against the holy scrutiny of God.\n\nThough I’d love to read this passage and villainize Barabbas, I can’t, not really. He is the poster child for the good news, a symbol of the atonement Jesus made for us all. True, Barabbas was guilty, but there’s no use in pointing fingers. In one way or another, we are all guilty.\n\nFor soon after Jesus took Barabbas’s place before the crowds, He took our place at Calvary. This is the gospel! Jesus chose the cross. He walked toward it willingly so that the guilty—like Barabbas, like you, like me—could be spared the punishment we deserve and walk away in freedom.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-26-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "John 14:1-11, John 20:24-29, Hebrews 10:36-39, Hebrews 11:1-2",
    "devo_title": "Thomas",
    "devo_summary": "\n\nBY Rebecca Faires\n\nSome things seem just too good to be true. But there’s hope, even for doubters.\n\nThomas was a practical man. He needed to know how things were going to work before he would assent. Is He really risen? Show me the nail scars. How will we get to heaven? Well, someone will need to give directions or scribble down a map. Abstract concepts didn’t seem to be working for him (John 14:5). He needed the concrete facts—that’s just how Thomas thought. Actually, it’s how we all tend to think. Why walk by faith, when you can walk by carefully peer-reviewed sight? (Goodness, Thomas would have loved the fantastic process of academic peer review!) The truth is, most of us are predisposed to doubt just like Thomas.\n\nWhat then are we to think of Thomas’s faith? We must not make the mistake of thinking Thomas was totally devoid of it. He did believe. Yes, he doubted until the moment He saw Christ appear before him, but Christ Himself still recognized that Thomas believed. Perhaps we could say he was a man of slow, or maybe even weak, faith. Thomas is all of us; while we say, “I do believe,” we must also cry, “help my unbelief!” (Mark 9:24).\n\nThomas’s life is a reminder of the incredible mercy of God. Jesus had spent years walking with His disciples, teaching them, explaining to them what would happen: how He would be arrested, crucified and buried, and how He would rise again. Thomas had heard all of it, again and again. But the death and resurrection of Christ was a wholly new concept, not unlike how we are slow to understand a color that’s left of red or right of indigo on the spectrum. When the fulfillment came, Thomas fled before Jesus’s captors. He had seen Jesus’s terrible death, yet he still could not come to accept that the rest would come true—that ultimately, it would end, not in sorrow, but in resurrection. It was too good to be true.\n\nBut, when at last the Savior stood before him, Jesus did not rebuke Thomas. Instead, He reassured him. He gently encouraged the doubter (John 20:27). What tender mercy! What abounding grace! It feels too good to be true.\n\nAs with Thomas, our own common sense and practical realism are often a barrier to deep faith. As with Thomas, we also often walk by sight, instead of believing that God will do just as He said. But for us, as for Thomas, there is grace. God is not threatened by your doubts, or undone by your hesitations. He is gentle and lowly of heart (Matthew 11:29). In His great patience, He calls us into the rest that He gives. The Lord, the Resurrected One who has conquered sin and death, is yet so gracious that He offers comfort to slow and foolish hearts such as ours.\n\n“Oh, the depth of the riches and the wisdom and the knowledge of God! How unsearchable his judgments and untraceable his ways!” (Romans 11:33). Despite our skepticism, He gently chides us, saying, “Blessed are those who have not seen and yet believe” (John 20:29), and then also offers us ever-increasing evidence of His faithfulness and truth. He offers mercies that are new every morning (Lamentations 3:22–23), that we may daily repent of our doubting hearts, and run to Him again in faith. The answer to all our doubts, as it was for Thomas, is Christ Himself. Fix your eyes upon Him, because the gospel is true, and our God is so very good.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-29-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 6:1-15, Acts 7:1-60, Psalm 23:4",
    "devo_title": "Stephen",
    "devo_summary": "\n\nBY Erin Davis\n\nGod’s people are to be filled people. Not barely-enough people or just-a-trickle people, but filled to overflowing. The apostle Stephen knows what I mean.\n\nPerhaps your frame of reference for him is “Stephen the Martyr,” the one who died at the hands of an angry religious mob just as the Church was being birthed. I don’t dispute the facts; Stephen did, in fact, become the first Christian martyr when he was mercilessly killed for his faith. It’s Stephen’s legacy I take issue with. As I look again at the details of Stephen’s life, recorded in Acts 6–7, it’s not his death that reaches through the pages and grabs my heart. It’s his life—his filled-to-overflowing life.\n\nScripture records that Stephen was a man “full of faith and the Holy Spirit” (Acts 6:5). He didn’t have a teensy measure of faith, or enough faith to get by. Stephen was full of faith, and because of his faith in Jesus, he was also full of the Holy Spirit. Fast forward a few verses and we read that Stephen was “full of grace and power” (v.8), and again, the image is more than enough.\n\nWhen pressed by the religious leaders, Stephen started preaching. Boy howdy, did that boy preach! His powerful words show us that he was full of wisdom and full of the truth found in Scripture. When his opponents became enraged and moved to silence once and for all, Scripture records:\n\nStephen, full of the Holy Spirit, gazed into heaven.He saw the glory of God, and Jesus standing at the right hand of God.He said, “Look, I see the heavens openedand the Son of Man standing at the right hand of God!” (Acts 7:55–56).\n\nAs he breathed his final breaths, Stephen cried out, “Lord Jesus, receive my spirit!” and asked that God would “not hold this sin against” those who’d killed him (vv.59–60). Sound familiar? If so, that’s because they echo the words Jesus uttered as He hung and died on the cross (Luke 23:46, 34). It’s as if Stephen was so filled with God’s words that they were at the very surface of his heart. When Stephen was squeezed, it was Jesus’s words that spilled out.\n\nOh, do not picture our brother Stephen buried and bloodied, for that is not all he was. Stephen’s heart was filled with love for his Savior because he was running over with wisdom, grace, and power. Because of Christ’s work for us and in us, we can be filled up too. Didn’t the apostle Paul urge us to “be filled with the Spirit”? (Ephesians 5:18). Doesn’t Scripture record that we can be “filled with encouragement” and “overflowing with joy [even] in all our afflictions”? (2Corinthians 7:4). Didn’t the prophet Micah proclaim that he was “filled with power by the Spirit of the LORD”? (Micah 3:8). Yes, God’s people are to be filled people.\n\nLord Jesus, make us more like Stephen, filled to overflowing with you.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-30-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 8:5-8, Acts 8:26-40, Isaiah 56:1-8, 1 Peter 2:9-10",
    "devo_title": "Philip & the Ethiopian Official",
    "devo_summary": "\n\nBY Guest Writer\n\nAs one of the seven deacons chosen to care for the poor, Philip had a good reputation in the community and was full of wisdom and the Holy Spirit (Acts 6:3, 5). Philip followed the movement of the Holy Spirit with obedience and devotion to what God was doing through him. When the Spirit redirected his plans by leading him to a specific ministry opportunity, he followed with enthusiasm and was God’s vessel for showing the “immeasurable riches of his grace through his kindness to us in Christ Jesus” (Ephesians 2:7).\n\nThese two stories from today’s reading contrast God’s pursuit of many and of one, both in surprisingly bold yet gentle ways. Through Philip, God reaches down into the territory of Samaria, and purposefully chooses to make the lame, paralyzed, and demon-possessed a people for His own possession (Acts 8:5–8; 1Peter 2:9). But remember that at that time, “Jews [would] not associate with Samaritans” (John 4:9). This is the shocking grace and kindness of God’s upside-down kingdom on display.\n\nLater, Philip came across an Ethiopian official, who was also a eunuch, heading home in his chariot after worshiping in Jerusalem. He sat with a copy of the book of Isaiah open, reading the prophet’s words aloud. God orchestrated a divine meeting and chose to use Philip as His hands and feet, delivering the gospel message to the Ethiopian man. His position in life meant he was not welcome to worship with Jews (Deuteronomy 23:1), yet he was still determined to know God (Acts 8:31). Philip, led by the Holy Spirit, “proceeded to tell him the good news about Jesus, beginning with [the] Scripture” he’d been reading (v.35), which said:\n\nHe was led like a sheep to the slaughter,and as a lamb is silent before its shearer,so he does not open his mouth.In his humiliation justice was denied him.Who will describe his generation?For his life is taken from the earth (Acts 8:32–33).\n\nAfter hearing Philip’s explanation of the passage and understanding that the good news of Jesus was for him, too, everything changed for this man, leading him to excitedly ask to be baptized at the first sight of water (Acts 8:36). Reconciliation through Jesus Christ meant that he would never again have to be separated from God (Isaiah 56:4–5). He was welcomed into the family of God. Like the Ethiopian official, these shocking promises of grace and kindness in God’s upside-down kingdom should bring us great joy and peace.\n\nIn both of these accounts, Philip was led by the Holy Spirit to faithfully testify to the power of God through Jesus Christ, which has come to claim all people for His glory. And while Philip is an example of a faithful servant of God fulfilling the Great Commission, ultimately, the story of Philip is not really about Philip at all; his story points to an otherworldly mercy that claims us as God’s own, calling us out of darkness and into His eternal light (1 Peter 2:9–10).\n\nBrooke Kocher is a wife and mother of three. She is a Southern girl at heart and a recent transplant to the Pacific Northwest.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-31-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 9:1-30, Acts 13:1-12, 2 Corinthians 11:18-31, 2 Timothy 4:6-8",
    "devo_title": "Paul",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nHave you ever been to a gym with a coaching program that promises personal transformation? I’ve known people who have signed up for those, and it often works. Over the course of six weeks, their bodies went from looking like they had never set foot in a gym to approaching model-worthy. Unfortunately, most of the time, the results didn’t last. Because the thing with transformation is that it requires you to stay committed far beyond the accountability that a six-week program offers.\n\nUnlike a fitness routine, Paul’s inner transformation was lasting. It was so quick it’s almost unbelievable. If we didn’t have his full ministry story, thanks to the New Testament, we might be more skeptical. Who is this guy who suddenly decided he was on the same team as Christ’s followers? One day he’s breathing threats and murder and the next he’s proclaiming Jesus in the synagogues (Acts 9:1, 20). What made the difference?\n\nChrist made the difference. His calling on Paul’s life is what changed him, as God commissioned him to be a “chosen instrument” and take His name to “Gentiles, kings, and Israelites” (Acts 9:15), when Paul encountered a light from heaven. Once he’d encountered the true, living Christ, Paul never went back to his old ways of living.\n\nUnderstandably, Paul received distrust from those who only knew him as a murderer, and so he had to rest in the knowledge that God knew his heart and its transformation. That’s what mattered most. God was his defender and advocate and, as we see from Barnabus’s response, He sent people from Paul’s community to advocate for him too (Acts 9:27). No matter how unbelievable it looked, the apostle’s transformation was real.\n\nWe are human beings who will inevitably fall short. There is grace for that. When it’s merely our own resolve that gets us into the gym or prompts us to give up something, the results may or may not be what we’d hope for. But when it’s God who calls us into something, there is a much better success rate. When it comes to that kind of supernatural spiritual transformation, He alone completes the work and deserves all the glory (2Corinthians 11:30–31).\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-32-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 9:36-42, Romans 6:4-5, Ephesians 2:1-10, Proverbs 11:24-25",
    "devo_title": "Tabitha",
    "devo_summary": "\n\nBY Guest Writer\n\nThe book of Acts describes Tabitha as a disciple who “was always doing good works and acts of charity” (Acts 9:36). When Tabitha died, Jesus’s followers in Joppa sent men to Peter who urged Him to not delay in coming with them to see her (v.38). They expected the Lord to do mighty things, and He did: through Peter, God raised Tabitha from the dead, and “this became known throughout Joppa, and many believed in the Lord” as a result (v.42).\n\nSometimes my heart is numb or my head is distracted when I read God’s Word, and mighty works like this one from today’s reading roll past my heart without registering the awesome power of our God. Not only that, but when I read about these expectant disciples in Joppa, I realize I don’t often expect God to do mighty things. “But God”—what a beautiful phrase of grace—“who is rich in mercy” awakened my heart today (Ephesians 2:4), reminding me that He most definitely continues to display His power throughout and within His creation. For just as God raised Tabitha from the dead, He raised us too! We were once dead in our sin, but “because of his great love that he had for us, [He] made us alive with Christ… [We] are saved by grace!” (vv.1, 4–5).\n\nI’ll most likely be trying to wrap my head around this truth until I’m home, in heaven. It wasn’t because we were “always doing good works and acts of charity” that God saved us. No, it is by His power and His grace, and because of His unimaginable love for us that He willingly went to the cross.\n\nWherever you are and whatever your worries, struggles, uncertainties, hardships, sufferings today—stop, be still, and meditate on what is true: the God whose power is so mighty that He is able resurrect people like Tabitha from the dead, is the same God who pursues you and me. Whatever your current circumstances look like, whether they stir up fear or thanksgiving in your heart, remember this:\n\nThe LORD your God is among you,a warrior who saves.He will rejoice over you with gladness.He will be quiet in his love.He will delight in you with singing” (Zephaniah 3:17).\n\nIf you are in Christ, your eternal life is secure because of Jesus. His blood has made this possible, but it was His love for you that led Him to the cross. He has raised you to “walk in newness of life” (Romans 6:4). Rest in His mighty love for you today, for you are truly beloved indeed.\n\nKimberly Girard is a well-loved child of God, wife of an extraordinary man, mother of three amazing kids, and writer living in Pittsburgh, Pennsylvania. You can find her at Loud Singing and on Twitter.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-33-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 10:1-48, Galatians 3:27-29 ",
    "devo_title": "Cornelius",
    "devo_summary": "\n\nBY Rebecca Faires\n\nWhat is the answer to inequality?\n\nWe clamor for solutions for true freedom, equality, individual rights, ethnic and racial tensions, and economic disparity. By themselves, our ideas and even our very best intentions are not enough. But really, we do know the ultimate answer to things like lasting change and reconciliation: the gospel of grace.\n\nCornelius’s life is a reminder of the great mystery of the gospel. In that day and age, there were distinct lines drawn between Jews and Gentiles, separating them by belief and ceremony, and many other practices, both cultural and religious. And so Cornelius’s story is a reminder that salvation belongs to our God, and the gospel is freely given to all who choose to receive it (Revelation 7:10; Matthew 10:8). From the beginning, the only answer to the tumult of human struggle, to the walls of social division, to the lines of entrenched hatred, is the gospel. God alone can do something new, transformative, and lasting, making “a way in the wilderness, rivers in the desert” (Isaiah 43:19). As the first Gentile to put his trust in Jesus, Cornelius was forever changed by a visit from an angel at three o’clock in the afternoon, a vision that put him on a journey that completely reframed his entire worldview.\n\nPeter also had a vision around that same time, and the clean and unclean animals are a reminder of this truth. This was not chiefly a social realization; it was the direct act of a gracious God who, in His own time, opened the eyes of man to see exactly what Christ’s coming truly meant: that sinners of every race, clan, tongue, and nation, could be made new and holy by faith in Jesus Christ. God sent a vision to Cornelius, even as He sent the vision to Peter. However, the chief character in this story is not Cornelius, nor is it Peter—it is God Himself. In the same way, we do not receive salvation by our own actions or merit, but because of the merit and actions of Christ Himself. In each case, it is God who calls and justifies, sanctifies and glorifies. Our salvation and reconciliation to God are not of ourselves.\n\nA remarkable scene ensues after Peter agrees to go to the house of Cornelius. We are told that Peter stands and begins to deliver the message of the gospel to the Gentiles assembled there, and “while Peter was still speaking… the Holy Spirit came down on all those who heard” (Acts 10:44), making the message very clear: the salvation of man is not of man, but wholly of God—in God’s time, in God’s way, by God’s own doing. “What God has made clean, do not call impure” (v.15).\n\nLike Peter, we need to remember that we are all human, but that through Jesus Christ alone, we all have access to salvation (vv. 36). We can join with all the people of the world, united in our calling to be about the business of “declaring the greatness of God” to a world that desperately needs to hear it (v.46), just like you and I do.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-36-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Mark 6:1-3, Mark 3:20-21, John 7:1-5, 1 Corinthians 15:3-7, Acts 15:1-21, James 1:1, James 1:19-27",
    "devo_title": "James",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nGrowing up, my family teased my brother about how he should run for president. He had the brains and the vision, and we even created a fun Facebook page with a 2028 campaign that gained a decent following of friends. He used to laugh it off and roll his eyes every time a ghost writer posted an update, while never actually denying the fact that he would make a good candidate. I’m still holding out that our playful digital campaign efforts sweep the house in 2028. Can you imagine if one day your brother became president?\n\nEven more so, can you imagine if your brother claimed to be the Messiah? I mean, I love my brother more than anything, but that’s on a whole other level. A bold move like that would no doubt give me serious cause for concern. Even if I were familiar with Old Testament prophecies and could vouch for the integrity of my sibling, I would have all sorts of questions, namely: Of all the people out there, how could the Messiah be my brother?\n\nI imagine that James, the brother of Jesus, wrestled with a question like this. We aren’t given a substantive origin story for James all in one place, so we have to weave together a few distinct verses like a patchwork quilt to gain a glimpse of the life of this man. We’re told that Jesus had four brothers: James, Joses, Judas, and Simon, and at least two sisters (Mark 6:2–3). We know that, after watching his brother attract a following in the synagogues while simultaneously offending the Nazarene crowds, Jesus’s family declared Him to be “out of his mind” and tried to restrain Him (Mark 3:20–21). We know that James and his brothers mocked Jesus, and didn’t believe in Him during His earthly ministry (John 7:1–5).\n\nBut then something happens. After His resurrection, Jesus appeared to James (1Corinthians 15:6–7). While Scripture doesn’t give us specific details about this story, it’s evident that at some point after the resurrection, James became a convert and disciple of Jesus. I imagine that after experiencing the trauma of having a brother crucified and buried, you start to listen to what He has to say after His lungs are filled with life again.\n\nJames became a leader of the church in Jerusalem (Acts 15:13–29; Galatians 1:18–19). He wrote the book of James—and in it, he says, “Everyone should be quick to listen, slow to speak, and slow to anger” (James 1:19). More than any other New Testament book, the teachings that fill these pages mirror the teachings of Jesus and His signature Sermon on the Mount (Matthew 5–7). And it makes sense that Jesus would have influenced James’s communication and storytelling techniques. They were brothers, after all.\n\nBefore Jesus’s death, James didn’t understand Jesus and His ministry. But after bearing witness to His sacrificial death and resurrection, he was changed forever.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-37-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 18:1-4, Acts 18:18-28, Romans 12:3-8, Romans 16:3-4, 1 Corinthians 16:19, Proverbs 10:17",
    "devo_title": "Priscilla & Aquila",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nMy friend and I were having one of those classic, two-hour conversations that happens in your car long after the coffee shop closes. Through a series of events, God chose to make us companions and accountability partners during this current stage of life, and because we’re so different, we can usually offer a good counterbalance to whatever headspace the other is in. It goes something like this:\n\n“Don’t believe that narrative. That’s a lie straight from the enemy.”\n\nTonight, it was me who needed those words. Next week, it could be her. Often it’s both of us, and we end up serving words of truth back and forth like a round of tennis. As I’m sure you’ve experienced, these sorts of pep talks can be an hour-by-hour exchange, as we navigate the way of Jesus together with those around us.\n\nAquila and Priscilla are one of the Bible’s power couples. When they offer Apollos constructive feedback on how he can explain God “more accurately,” we see what it looks like for believers to hold each other accountable without taking offense (Acts 18:26). Instead of being reactionary and letting his ego get the better of him, Apollos receives their correction and continues arguing his case for the Messiah. Because Aquila and Priscilla were obedient in exercising their gifts, Apollos became even more effective for the kingdom.\n\nIt’s such a great story, right? Whether or not his pride was hurt, it doesn’t interfere with the ministry Apollos is leading. His response is a beautiful illustration of Proverbs 10, which says, “The one who follows instruction is on the path to life, but the one who rejects correction goes astray” (v.17).\n\nIn Romans, Paul warns us against seeing ourselves as more important than others, because every part of the Body of Christ has a unique role (Romans 12:3–8). Each gift we possess is equally valuable, yet these gifts are also strengthened and nourished by others. When we sharpen and correct, we help each other flourish.\n\nIt’s interesting how it wasn’t enough for Apollos simply to be “competent” with Scripture (Acts 18:24). Notice how the text doesn’t say he was teaching inaccurately. Apollos was already familiar with the way of the Lord and was bold in sharing it. But his knowledge was somewhat limited. According to Acts, he “knew only John’s baptism” (v.25), so Aquila and Priscilla believed it was their responsibility to take him aside and fill in the gaps.\n\nCompetency is never a stopping point in the kingdom of God because He is always calling us into a deeper relationship with Him and one another. Through the Body of Christ, He partners with us to encourage each other more, teach each other more, and hold each other more accountable. We can count this as an honor. When we are obedient in exercising our spiritual gifts—especially when they stretch us outside of our comfort zones—we are grown and blessed as both the gift-bearer and the recipient.\n\nWhere can you speak truth in love? Who can you receive truth from in humility? Whether in the workplace or a car parked outside a coffee shop, there is life waiting for you. There is more.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-38-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Acts 16:1-5, 2 Timothy 1:1-5, 1 Corinthians 4:17, Philippians 2:19-24, 1 Thessalonians 3:1-6, Psalm 133:1-3",
    "devo_title": "Timothy",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nAround the age of eighteen, I remember praying for a mentor. I had no idea where to look for one, so soliciting God’s help felt like the right thing to do. Fast forward a few years, and I still hadn’t found one—at least not the formal, “let’s grab coffee every week and come with questions prepared” kind of relationship.\n\nA few weeks after visiting a new church, a lady who always gave out hugs and smelled like flower blossoms befriended me. She led the women’s ministry and loved hosting people around her dining table for prayer, Bible study, and honest conversations about wrestling through everyday life. Often, I would linger after everyone else went home, as we kept talking or laughing or drinking tea. There was nothing weird or formal about it—just normal time spent with someone who was genuinely interested in my life and relationship with Jesus.\n\nWe all need mutually life-giving spiritual friendships, and the apostle Paul was no exception. One reason why Paul hand-picked Timothy to be his companion was because of his top-notch reputation in the community. The young man was also a third-generation believer, resulting from a lineage of not one but two God-fearing female figures—a mother and grandmother (2Timothy 1:5). Having a mother who was Jewish positioned him well for ministry in a multicultural region of both Jews and Gentiles.\n\nI’m sure the legacy of Timothy’s faith was an advantage to being chosen as a companion, but it wasn’t enough simply for him to be familiar with Scripture (2Timothy 3:15); he needed to own his faith for himself. Later on in their partnership, Paul saw firsthand how the man had been personally transformed, and said, “I recall your sincere faith that first lived in your grandmother Lois and in your mother Eunice and now, I am convinced, is in you also” (2Timothy 1:5).\n\nFor being just one man, his influence on Christianity and the canon of Scripture is pretty astounding. Being so interconnected to Paul’s ministry, Timothy either co-wrote or co-labored with his friend during the experiences captured within Paul’s letters. Ultimately, it was Timothy’s proven, trustworthy character and unmatched integrity that led Paul to trust him enough to lead and teach in his place (Philippians 2:22). They supported and helped each other grow, just as they did for the Church. This is why Paul referred to him as his “dearly loved and faithful child in the Lord” (1Corinthians 4:17).\n\nTimothy is a vibrant example of what it looks like to be mentored in the faith. The companionship we see modeled by these two men inspires us to seek out our own fellow sojourners in the faith, and in turn ask ourselves, Who am I investing in spiritually? Who am I allowing myself to be mentored by? How might God use my relationships for the flourishing of His Church? Spiritual mentorships don’t have to be rigid or classified as anything formal. They just have to draw us closer to Jesus and to one other.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-39-1024x1024.jpg"
  },
  {
    "book_title": "Men & Women in the Word: New Testament",
    "devo_passages": "Philemon 1:1-25, Colossians 3:22-25, Colossians 4:1-9, Romans 12:9-13",
    "devo_title": "Philemon & Onesimus",
    "devo_summary": "\n\nBY Patti Sauls\n\nScripture Reading: Philemon 1:1-25, Colossians 3:22-25, Colossians 4:1-9, Romans 12:9-13\n\nWhen I engage with Paul’s letter to Philemon—a Christian who is also a slave owner—I want to be shielded from jarring talk of slavery, especially in the Bible. But nothing shielded the millions enslaved, past or present. We can’t look away from this brokenness in the world. We must consider what God is revealing through this letter about a runaway slave returning to his master.\n\nPaul was imprisoned in Rome when he wrote to Philemon, a friend and ministry partner in Colossae. Paul knew bondage and he knew the source of true freedom in Christ. He also lived in a time and place where slavery was society’s norm. Nearly one third of the Roman population was enslaved, which means master-slave dynamics were unavoidable. It’s essential to note that while Paul was describing and addressing an interpersonal conflict within the context of slavery, he was neither prescribing the system of slavery nor endorsing it as a good or godly practice.\n\nPhilemon’s runaway slave, Onesimus, had become a Christian through Paul’s ministry. He also became a faithful friend to Paul and could have continued living on the run, yet was compelled to return to Colossae and face his master. In preparation for Onesimus’s risky return, Paul sent Philemon a tactful letter, thanking him for being a faithful brother in Christ, and pressing him to further exercise his faith by extending brotherly love and acceptance to Onesimus.\n\nPaul urged Philemon to recognize and welcome Onesimus “no longer as a slave, but more than a slave—as a dearly loved brother” (Philemon 16). Requesting that the slave be treated as a brother was radical. Legally, Philemon could punish Onesimus or even kill him for running away. No one would expect him to treat his runaway slave with kindness, let alone regard him as kin. But the gospel calls for deep reconciliation that gives birth to liberation.\n\nAs Paul wrote to the church in Galatia, “There is no Jew or Greek, slave or free, male and female; since you are all one in Christ Jesus” (Galatians 3:28). All believers in Christ are family. None is superior to another, and none can “own” another. Furthermore, each of us has been on the run. Each of us has been a slave to sin. Each of us has been forgiven and reconciled to God through Jesus and set free. May this truth refresh our hearts (Philemon 20). Jesus is not ashamed to call us kin (Hebrews 2:11), and He welcomes us into a right, good, and eternal relationship with Him. May we also remind each other that we abide in this space together as equals, sisters and brothers united in Christ.\n\nPatti Sauls lives in Nashville, Tennessee, with her husband Scott and daughters, Abby and Ellie, where they serve alongside the people of Christ Presbyterian Church. Prior to living in Nashville, the Sauls planted churches in Kansas City and Saint Louis and served at New York City’s Redeemer Presbyterian Church. A trained speech therapist, Patti also enjoys serving behind the scenes, hiking with friends, and reading good books.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2020/06/SRT-WMITWnt-Shareimages-40-1024x1024.jpg"
  }
]