[
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 6:10-24, Romans 13:8-14, 2 Corinthians 10:3-4, 1 Timothy 6:11-12",
    "devo_title": "Ready For Battle",
    "devo_summary": "\n\n                    \n\n                    The beaches at Normandy, Helm’s Deep, Gettysburg—these are places where great battles were fought. But the battles were not ultimately about those places. We are like this. Our hearts are battlefields, but the aim of the devil’s warring isn’t ultimately about us. What is he after? God’s glory. It has always been this way (see Ezekiel 28).\n\nSo why are we who are flesh and blood in this fight? Because Scripture teaches us that we exist to glorify God and enjoy Him forever (1 Cor. 10:31, 1 John 1:3), and the devil wants more than anything to render us irrelevant when it comes to living this sort of life.\n\nHow does the devil go about this? There is an old Scottish proverb that says, “The Devil’s boots don’t creak.” The devil is subtle. Why? Because we don’t fight what we don’t notice. The Apostle Paul wants us to notice we are in a fight.\n\nThe devil’s tactic isn’t to block the glory we strive to give to God as much as it is to take from us the desire to give God glory in the first place. He does this not by turning our focus from God and onto himself, but by turning our focus from God and onto ourselves.\n\nWhat does it look like to live as men obsessed with our own glory? It can look like an obsession with our weight or appearance. It can look like pettiness because self-love makes contempt come easy. It can look like a critical spirit when we determine to find our worth in how we stack up against others. It can look like a drive to manipulate because we’re afraid of anything we can’t control. What would you add to this list?\n\nWhat are we to do about this?\n\nGod gives us everything we need for everything He has called us to do and be. He has equipped us with armor and with access to His presence. We cannot fight this battle without Biblical truth and prayer, but the good news of the gospel is that we have been given access to God’s Word and His throne of grace, before which even the most weary and defeated disciple can fall and find help.\n\nScripture tells us who we are when our faith is in Christ. We are redeemed by blood of Jesus. We are heirs of God’s kingdom. We are agents of redemption in this world. So may God, by the power of His spirit, uncover the lies we believe and the accusations we wilt under. May He show us the devil’s schemes at work in our lives. And may God be glorified in and through our lives.\n\nWritten by Russ Ramsey\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/10/HRT-Ephesians-instagram12.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 5:22-6:9, Genesis 2:4-25, Matthew 19:13-15, Colossians 3:23-24",
    "devo_title": "Christ and His Church",
    "devo_summary": "\n\n                    \n\n                    She laughed. \n\nIt was a proper response from my wife when I told her I was writing on Ephesians 5. I followed her lead and rolled my eyes. I know why she laughed. And she knew precisely why I rolled my eyes as I moved quickly away to my writing nook. \n\nThis series of passages often gets abused in the church. There isn’t really a better way to say it. In some cases, it has made tyrants out of men. We may read the entirety of Ephesians and come to a screeching halt at the words “submit” and “slave.” Sometimes when reading Scripture we are tempted to scrap the big picture for a small one. Today, let’s make sure we have the bigger picture in focus first.\n\nUp to this point, Paul has built a simple yet beautiful theology around the ascended Jesus. It is in the ascended Jesus that we find our truest identity. In other words, we see what it is to be fully human as God desires us to be fully human. We see our calling, our destiny, and our glory all summed up in the reality that Jesus is seated on the throne in heaven at the Father’s right hand (Revelation 3:21). A better way to say it is this: in Jesus, heaven and earth are in their fullness. \n\nThe problem is that we don’t see the ascended Lord. This reality is hidden from our eyes. It is hidden from the world’s eyes. So, as we remind ourselves of Christ’s prayer to the Father, we have that one little phrase, “on earth as it is in heaven” (Matthew 6:10). \n\nHow will people know that Christ and the Father are one? How will they know the depths of that beautiful relationship? The Church, and how it manifests its life in the most basic of relationships, points us to the oneness of God the Father and the Son (Ephesians 1:22-23). Paul isn’t giving instructions to the Church so that its members will live out some strict moral code. No, Paul is instructing the Church how to embody, in the power of the Spirit, the marvelous relationship between the Father and the Son. He is inviting them into the divine life of the ascended Lord and to reveal that life to the world around them. \n\nEverything Paul asks of his hearers is rooted in the nature of Christ: Submit. Love. Obey. The ascended Lord is revealed to the world when we— all of us— submit ourselves to one another in Christ (Ephesians 5:21). \n\nThese texts are rich and beautiful. They take the most simple of relationships and form them into the light of Christ. In embracing their true meaning, we begin to get a glimpse into the Lord’s prayer for us: on earth as it is in heaven.\n\nWritten by Father Aaron Wright\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram11.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": " Ephesians 4:17-5:21, Romans 1:18-21, 2 Corinthians 5:17, 1 John 1:5-10",
    "devo_title": "Children of Light",
    "devo_summary": "\n\n                    \n\n                    The problem with rules is they’re impossible to keep. I have high cholesterol, so my doctor says, “Don’t eat ice cream!” But I love ice cream, and now that he’s told me “no,” I want it all the more. Like Paul says in Romans 7:15, “I do not understand what I am doing, because I do not practice what I want to do, but I do what I hate.”\n\nOur passage today takes us into the realm of dos and don’ts. Some think that’s all the Christian life is, and so they want nothing to do with it. After all, this list Paul gives the Ephesians is pretty overwhelming, even to the most disciplined believer.\n\nThankfully, Paul’s list does not stand alone but comes after Chapters 1-3, making it clear that dos and don’ts are not the heart of the gospel. In the Christian faith, the indicatives (what is true about me in Christ) always come before the imperatives (how we then live). I’ll explain what I mean.\n\nOn the way to school I often ask my 5-year-old and almost-3-year-old boys this question: “Boys, who do you belong to?” They’ve learned that the answer to this odd question is, “God, Mommy, and Daddy.” It’s not a control freak question, but rather one of identity. The point is, if we belong to the Henderson family, we should think, speak, and act in accord with the beliefs and traits of our family, never forgetting who we are. In the same way, if we belong to the family of God, we should act like children of God. Identity informs lifestyle.\n\nPaul has spent three chapters of his letter telling the church who they belong to. They—and we—are those for whom God moves heaven and earth to make them his children. His Son gave His life to save us. His Spirit lives within us as a seal of proof and a deposit, guaranteeing the promises to come. Chapter four begins a shift. Paul essentially says, If this is true about you, then live this way. It’s as if he’s asking us, “Children, who do you belong to?”\n\nScripture tells us there has been a shift in the heart of every follower in Christ from darkness to light (Ephesians 5:8), from pagan ways to the Christian lifestyle. This is not as a result of rules but out of joy for what Christ has done for us!\n\nIf my core identity is that I am a son of the living God, then I want to live that way. Being in Christ doesn’t guarantee my faithfulness—this world will bring challenges and temptations. But in Christ I am a new creation, and I can choose to live as a new creation. Yes, this will require a power outside of myself. But good news! His Spirit fills me, transforming me day by day and empowering me to live out my true identity in Christ.\n\nMay we not buy into the idea that the Christian life is a moral straitjacket, but live in the reality that it is a path of flourishing for all who find their identity in Christ.\n\nWritten by David Henderson\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram10.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 4:1-16, Philippians 1:27, Romans 12:1-2, 1 Corinthians 12:4-13",
    "devo_title": "Unity and Diversity",
    "devo_summary": "\n\n                    \n\n                    There are differing opinions as to what it means to be a Christian man. Some would say Christian culture has emasculated men, leaving them weakened or tamed. Others might say the definition of a Christian man has been made so specific it alienates those with different giftings. Why such division? If we are brothers in Christ, why does our family seem so dysfunctional?\n\nIn this passage from Ephesians, Paul once again addresses unity in the midst of diversity,  urging believers to walk worthy of their calling in Christ. I don’t know about you, but I tend to have selective hearing. If you give me five compliments and one criticism, I seem to only hear the one criticism. Though Paul’s focus is a bit more instructional in this passage, we must be careful not to forget the context of grace that permeates his message, even when that message intersects the practical topic of our works.\n\nWith grace as the context, we are challenged to walk in and live out the calling we have received. Paul exhorts us to do this with all humility and patience, accepting one another in love, while diligently keeping the unity of the Spirit as the peace that binds us (Ephesians 4:1-2). Might Paul’s focus on humility and peace reflect our tendency toward comparison and competition over unity and acceptance?\n\nPaul goes on to list several gifts and roles within the body of believers, stating the purpose of the various gifts is “to build up the body of Christ, until we all reach unity in the faith and in the knowledge of God’s Son, growing into a mature man with a stature measured by Christ’s fullness” (Ephesians 4:12-13). When we do not live in the unity of the Spirit, we corrupt our gifts of ministry into idols of competition.\n\nCompetition strips the body of Christ of peace and unity. We will not be vulnerable, open, and honest if we feel like we have to earn our place of significance. At the same time, we should not deny our gifts or act as if everyone is created with the same gifts. God has displayed Himself uniquely in us all. We are all His poiēma (Ephesians 2:10), yet we are not all duplicates. We are created to fit together to accomplish what He has called and prepared for us to do.\n\nGod gives us each talents, abilities, and perspective. If we are to live out God’s call in the culture He has placed us in, then each talent, ability, and perspective is valuable, not just those that are the loudest or strongest.\n\nTo restore function to our dysfunctional family of faith, we must embrace the unity of the body of Christ that Paul preached to the Ephesians. To restore a healthy view of true Christian masculinity, we must stop competing and comparing, focusing on the Kingdom instead of on ourselves.\n\nWe are called to more, and in the unity of the Spirit, by the grace of Christ Jesus, we will achieve it.\n\nWritten by Britton Sharp\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram9.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 3:14-21, Philippians 4:12-13, 1 Corinthians 13:1-7, 13, 2 Corinthians 9:8",
    "devo_title": "Established In Love",
    "devo_summary": "\n\n                    \n\n                    Power and love. These two forces are locked in a tug-o-war, shaping our world, our politics, our families, and our lives. How many wars have been fought, refugees created, and lives degraded because of the love of power? And how many offenses have been forgiven, orphans adopted, outsiders welcomed in, and lives transformed because of the power of love? \n\nWhat happens when these two forces cease the back and forth we’re used to and come together in embrace? What would that look like? What would be the effect in our world and in our lives?\n\nIn God the Father, love and power are perfectly mingled together. Paul’s prayer for the Ephesian church is that they would understand and live from the depth of the Father’s love for them, namely that love as found in Christ Himself.\n\nThe language we get here is both agricultural and architectural. Paul’s desire is for these Ephesian believers to be rooted and established in love. The first metaphor elicits a picture of a tree sending roots deep into the soil and drawing upon its rich nutrients, as we are to put deep roots in Christ, being nourished by His constant flow of love. The second metaphor paints the picture of building a structure on a solid foundation, just as we are to build our lives on the unshakeable foundation of the love of Christ. This rootedness and grounding is the result of Christ dwelling in our hearts by the power of the Holy Spirit.\n\nPower and strength are both mentioned twice in this passage. As followers of Christ, we are not only grounded in Christ’s love for us, but we are empowered to understand the magnitude of this reality and to let His love permeate and energize our lives. Paradoxically, we are to “know the love of Christ” that “surpasses knowledge” (v. 19). We are to know the unknowable. This speaks to the incredible depth and breadth of Christ’s love for us, such that we have to authentically experience it to understand it. This is no mere head knowledge, but interactive relationship with the One who demonstrated His love for us by giving up power and dying on the cross.\n\nThere is a goal, an end to which Paul is praying: that we would be filled with all the fullness of God. As followers of Jesus, our lives are to burn and brim with the power and love of God. Indeed, power and love have come together in embrace in Christ and His finished work of the cross, and the sons of God in Christ are enveloped in it.\n\nMay the power and love of God take shape in our lives as we are firmly established in Christ’s love.\n\nWritten by Chris Comstock\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram8.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 3:1-13, Romans 11, Revelation 7:9-12",
    "devo_title": "Incalculable Riches",
    "devo_summary": "\n\n                    \n\n                    Ever heard the old saying, “Hidden in plain sight?” \n\nSometimes, in our Christian language, we can say something so many times that we forget what we are actually saying. I know this takes place when we say the Nicene Creed every Sunday. We say something so many times (which is a wonderful practice) that we can forget what it is we are actually confessing. One of those parts that we tend to say without fully grasping the reality of it is the part about Jesus ascending. The Creed states, “He ascended into Heaven and is seated at the right hand of the Father.”\n\nYou just read one of the thickest, richest portions of Holy Scripture you will ever read.  However, it can be easy to miss; not because it is hiding from us, but because we typically don’t bring the right kind of lens to the reading. We don’t read it through the lens of the Ascended Lord. We have typically narrowed the Gospel message to crucifixion and resurrection. Crucifixion reveals and deals with our sin. Resurrection gives us victory over it.  But ascension shows us where we belong, who we are called to be, what God’s plan has been all along. God and man were meant to dwell together. Christ is still human and divine. He is in the throne room with God.  \n\nTo read Ephesians without the Ascension front and center is to miss Ephesians altogether. Look how Paul has set this up: read Ephesians 1:9-12, 1:20-23, and 2:6-10. God’s plan is to make us co-heirs with Christ, who is seated above all things, and for us to be seated with Him. Christ has made a way for humanity and God to dwell together because He is fully human and has the authority in Heaven to gather all things into Himself.  \n\nIt is for this reason that Paul has become a prisoner. What Paul has discovered through the Holy Spirit is that Christ holds all of humanity within Himself. Not only Jew, but also Gentile. So through Jesus—the ascended, human Jesus— we have been brought near to God if we are in Him. And we have become members of His body— His Ascended Body. This is not some ethereal reality, this is tangible. We are Christ’s body and Christ’s body is ascended. So, when Paul comes to the end of this portion of Scripture, he reminds us that God’s eternal purpose has been carried out in Christ Jesus. Now we have access to God in boldness and confidence through the faithfulness of Christ.  \n\nAs you go about your day, thankful for the crucifixion and resurrection, remember that you have already been brought near to God through Christ. The Ascended Lord has gathered you up in His body, the Church, and is already giving you a foretaste of the heavenly life.\n\nWritten by Father Aaron Wright\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram5NEWONE.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 2:11-22, Galatians 3:23-29, Galatians 6:15,  Psalm 118:22, 1 Corinthians 3:16",
    "devo_title": "He Is Our Cornerstone",
    "devo_summary": "\n\n                    \n\n                    The news can be really hard to watch. Tension, war, division, oppression, suffering— they overwhelm us, and the combination can overshadow our lives and our faith.  \n\nThe Ephesians knew this tension too. Paul’s letter was written to be circulated among small groups of believers scattered throughout what is now modern-day Turkey. It was a culturally diverse area, and the tensions that came with this inherent diversity may have easily overshadowed the small churches there.\n\nYesterday, we read that we are God’s workmanship, His poiēma. Lest we be too individualistic, in today’s reading, Paul calls us back to the reality of the body of Christ. We are different, but we are one.\n\nPaul draws out two key factors of this unity.\n Christ brings peace where there was division. \n\nIn verse 13, he states, “But now in Christ Jesus, you who were far away have been brought near by the blood of the Messiah.” “Messiah” was a Jewish term; however, Paul was writing to an ethnically mixed audience of both Jews and Gentiles. He points out that Christ Jesus brings the two together. Not only this, in the following verse he says that Christ is our peace and has torn down the walls of hostility (Ephesians 2:14). We are not called to be homogenous, we are called to peace—peace made possible in Christ.\n\nThis is a daunting task, but God always provides where He has called. In verse 18, we see the unifying power and work of the Spirit. In the magnitude of the gospel, differing cultures and ethnicities are made fellow citizens by the unifying and redeeming work of Christ Jesus. Unity comes by His provision, but it is also part of His provision. We need the body of Christ to fulfill the call of Christ.\n\n Christ is our cornerstone. \n\nPaul then illustrates that each of us, as God’s workmanship, is part of the grander work of the Kingdom. Christ Jesus is the cornerstone on which this work is built. \n\nThe gospel is about the redemption of all things in Christ. Our personal salvation is a critical part of this great work, but not the only part. The gospel is much bigger than us— it’s about all things being reconciled in Christ. As believers we are “being built together for God’s dwelling place in the Spirit” (Ephesians 2:21).\n\nWe are all made one to glorify the One who redeems and reconciles us, who has crafted us into His workmanship. May we strive towards this unity, for in it we find the provision to live as God has called us.\n\nWritten by Britton Sharp\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram4.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 2:1-10, Ezekiel 36:26-27, John 3:16-21, 1 John 5:1-5",
    "devo_title": "From Death to Life",
    "devo_summary": "\n\n                    \n\n                    I was going to start this by saying, “We tend to forget where we came from…” But, if I am being candid, I don’t forget it— I would just rather ignore it. \n\nEphesus was a booming city and commercial crossroads (think: the culture of New York or LA), and the Ephesian church contained a lot of diversity. The stories of the believers there were must have been a vast array of redemption at work, a passing from death to life. Yet, I wonder if at times they, too, ignored their past. Personally, often due to shame, I don’t always want to remember that I was dead in my sin. God’s mercy is rich, and so often I long to share it with others— yet, at the same time, I want to deny the reality of my bankruptcy. We love to give, but there is often an unhealthy shame in needing to receive.\n\nMaybe the Ephesians thought the teaching of the gospel was juvenile and they had moved on to grander theological debates. Or, perhaps they became distracted, the beauty and tangibility of the city enticing them away from the gospel that changed them.\n\nIt’s been said that early in life we are astronauts, looking to the stars and endless possibilities. But as we age, we become archeologists, looking for the significance and meaning of what has already happened. As believers, we are called to embrace both. We must be willing to acknowledge our need for the gospel in our past, while also following it in our future.\n\nEphesians 2:10 is one of my all-time favorite verses. It says: “For we are His creation (poiēma in Greek), created in Christ Jesus for good works, which God prepared ahead of time so that we should walk in them” (HCSB).\n\nThe word poiēma is rich with meaning. It is can be translated “handiwork,” “masterpiece,” “workmanship,” and “creature.” It is a deep word, suggesting more than just an impulse or whim, but something created with meaning, purpose, and intent.\n\nWhen you look at a piece of art, you don’t just look at one part of it—the background, for example. You see how the whole of the piece works together. We must balance seeing our past with seeing our purposeful hope of the future. If we only focus on our past, we could struggle with shame; if we only focus on our future, we may find ourselves alienated and unrelatable. To focus on one aspect only is to miss the composition of redemptive grace in the entire piece.\n\nLest we become puffed up, Paul reminds us that we are God’s creation and nothing good is of our own doing. Our God-given purpose is to do good works, that He has prepared beforehand. This is a mic drop moment if you get the fullness of it.\n\nYou are created to do God’s good works that He has prepared beforehand, that you should walk in them.\n\nEvery step you will take for the rest of your life, God has gone before you and prepared the way. The rest of your life, then, is choosing whether to walk in His ways and provision or to try your own way.\n\nMay we live in the reality that we are His poiēma, displaying the gospel to the world around us.\n\nWritten by Britton Sharp\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram3.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 1:15-23, Philemon 1:4-7, 2 Corinthians 4:3-6, Psalm 8:1-9",
    "devo_title": "Immeasurable Greatness",
    "devo_summary": "\n\n                    \n\n                    It’s been said that the longest distance in the world is the distance between our head and heart. Though close in proximity, head knowledge and heart knowledge can stand miles apart. \n\nHosea 6:3 says, “Let us know; let us press on to know the Lord.” But what is knowing? On one hand, it simply means gathering data, like this: My name is David, I am six feet tall, I have hazel eyes and brown hair. Now you know me. Google and smartphone apps allow us to know almost anything within seconds.\n\nBut it is a vastly different sense in which I know my wife. I know what she looks like, but I also know what she likes and dislikes, what she needs and doesn’t need. I know her personality type—how it meshes with my own and how our differences sometimes bring us into conflict. I know what makes her feel happy and loved, fearful and ashamed. I know what brings her life.  I know her spiritually—why she loves Jesus and how she engages with Him. I know her physically, even intimately.\n\nI have a deep relationship with my wife. I truly know her. I know her in many ways that I do not know, nor care to know, the celebrity on my television screen. I know about celebrities, but I know my wife.\n\nThis is the sense in which the word “know” is used in the Bible. It is not mere knowledge about something. It is intimate, relational knowledge.\n\nPaul has just finished telling the Christians in Ephesus about all the spiritual blessings they have in Christ Jesus. They know it. And they are living it out through “faith in the Lord Jesus and love toward all the saints” (Ephesians 1:15). They get it, but they don’t. And neither do we. It is the Ephesian church that Jesus Himself will rebuke in Revelation 2:4: “But I have this against you, that you have abandoned the love you had at first.” How could a group of people get it but not get it, know it but not know it? Because all too often head knowledge trumps heart intimacy.\n\nWe know random details about every friend on Instagram, but we know few, if any, of those friends on a heart level. We know theology but not the “theos” Himself. We know Scripture but not the God of Scripture intimately.\n\nWhat is the cure for this heart forgetfulness? Paul prays. He seeks the Lord, praying for a heart enlightenment. He prays for knowledge of Him who gives us hope in despair, whose salvation is sure. He prays that we would know we are His treasure. He prays for knowledge of Him whose resurrection power works in us to transform us into the image of His Son.\n\nWhen we are adopted by the Father through the Son, God gives us a new identity. He gives us hope, and empowers us with His very own Spirit. If we know this within our hearts, it will change our lives. Pressing on to know this God of immeasurable greatness is our life’s goal.\n\nWritten by David Henderson\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram2.jpg"
  },
  {
    "book_title": " Ephesians",
    "devo_passages": "Ephesians 1:1-14, John 1:12-13, Colossians 1:16",
    "devo_title": "Every Spiritual Blessing",
    "devo_summary": "\n\n                    \n\n                    The letter from the Apostle Paul to the Ephesians opens with a command: Praise the God and Father of our Lord Jesus Christ. \n\nWhy? That question is what the rest of the letter endeavors to solve. But Paul summarizes the answer in verse 3: praise God because He has blessed us with every spiritual blessing in the heavens.\n\nHere’s the thing: if God hasn’t blessed us in Christ with every spiritual blessing, then both the teachings of the rest of this letter and their applications are out of our reach. We may as well put the letter away. But what Paul says in this first verse is that, when our faith is in Christ, the riches of life in Christ are ours. \n\nThe problem is that we often still live as spiritual paupers. Why do we do this? One reason is because we often do not understand the foundation under such a promise. So Paul opens this letter by pouring some heavy theological footings on which our hope in Christ stands. How heavy? Let’s look.\n\n1. God chooses man.  Paul says in vs. 4 “He chose us,” and in vs 5, “He predestined us.” Throughout Scripture, you see God choosing people—Abraham, Isaac, Jacob (Israel), and Joseph. Moses. David. Jesus chose his apostles, even Paul. Though we, from our earthbound perspective, struggle to understand reality, Jesus taught, “No one can come to me unless the Father who sent me draws him” (John 6:44).\n\n2. God’s redemption is accomplished by the unmerited grace of Jesus. God’s choosing His people is neither deserved nor earned by those He has chosen. The basis of our salvation is “in Christ” (Ephesians 1:3-9). Salvation, from beginning to end, is an act of God’s undeserved grace.\n\n3. God calls His people into a relationship with Him that is intimate. Why does God call His people? Are we just His worker bees? No, God chooses His people so they might spend eternity in intimate proximity with Him. “He predestined us for adoption as sons through Jesus Christ” (Ephesians 1:5).\n\nWhen we put these opening verses together, what do we get? God chose His people before the foundation of the world, according to His mercy and grace and not by any work of our own, in order that we might know Him as our Father, and know ourselves as His beloved children.\n\nThis, Paul says, should draw from us a response of praise. Why? Because a great darkness has been pushed back. The breathtaking beauty of God choosing us in Him before the foundation of the world to be His adopted children is that, had He not, ours would only be a story of perishing in the wreckage of our sin. But praise be to God: He has intervened. God doesn’t rescue us to give us a second chance. He saves us from spiritual death and then gives us a new identity as His adopted sons.\n\nWritten by Russ Ramsey\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2015/09/HRT-Ephesians-instagram1.jpg"
  }
]