[
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 6:10-24, Isaiah 59:12-17, 1 Thessalonians 5:5-11",
    "devo_title": "Christian Warfare",
    "devo_summary": "We often remember great battles by where they were fought: Gettysburg, Helm’s Deep, Pearl Harbor. But the battles were not ultimately about those places; they were about a greater desire, a deeper principle. The same is true about spiritual warfare. Our hearts are where spiritual battles are fought, but the aim of the devil’s warring isn’t ultimately about us. What is he after? God’s glory. It’s always been this way (Ezekiel 28).\n\nSo why are we, humans who are flesh and blood, engaged in conflicts in the spiritual realm? Because, as the Westminster Catechism says, we exist to glorify God and enjoy Him forever, and the devil wants more than anything to render us irrelevant when it comes to living this sort of life.\n\nHow does Satan go about this? There is an old Scottish proverb that says, “The devil’s boots don’t creak.” Our enemy is subtle because we don’t fight what we don’t notice. In today’s passage from Ephesians, Paul wants us to notice that we are in a fight. The devil’s tactic isn’t to block the glory we want to give to God as much as it’s to take away our desire to give Him glory in the first place. He does this by turning our focus not from God onto himself, but from God onto ourselves.\n\nWhat does it look like to live as men consumed with our own glory? It can look like an obsession with our appearance. It can look like pettiness; self-love fosters contempt for others. It can look like a critical spirit stuck in a life-sucking spiral of comparison. It can look like a drive to manipulate because we’re afraid of anything we can’t control. What would you add to this list?\n\nWhat can we do about this? Today’s text tells us God has given us everything we need for everything He has called us to do and be. God has equipped us with both spiritual armor and access to His presence. We are called to “put on the full armor of God so that [we] can stand against the schemes of the devil” (Ephesians 6:11). We simply cannot fight this battle without biblical truth and prayer, but the good news of the gospel is that we have been given access to God’s Word and His throne of grace, before which even the most weary and defeated disciple can fall and find help.\n\nSo may God, by the power of His Holy Spirit, expose the lies we believe and the accusations that cause our hearts to fail. May He show us the devil’s schemes at work in our lives. May we remember that though these spiritual battles are fought in our hearts, we are not Satan’s ultimate prize—God’s glory is.\n\nGod’s Word tells us who we are when our faith is in Christ. That’s what Paul’s letter to the Ephesians is all about. We are redeemed by the blood of Jesus. We are heirs of God’s kingdom. We are agents of redemption in this world. He is at work in us and through us. So as we fight, may we remember that He has given us both armor and access to His presence, and may God be glorified in and through our lives.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-19-wordpress.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 6:5-9, Galatians 3:27-29, Philemon 1:8-22",
    "devo_title": "Slaves and Masters",
    "devo_summary": "Of all the teaching of Scripture, those passages about the institution of slavery are among the most difficult to navigate. The challenge is heightened by the tendency we all have to read the Bible through the lens of contemporary historical currents and movements. Nevertheless, the relationship between slaves and masters is carefully defined in both the Old and New Testaments. So what are we to make of Paul’s teaching in Ephesians 6:5–9?\n\nFirst, we need to recognize that God forbids the owning or selling of a kidnapped individual. In Exodus 21:16, we read, “Whoever kidnaps a person must be put to death, whether he sells him or the person is found in his possession.” Any form of slavery that involves the unlawful servitude of another image-bearer is an egregious sin. This must be clearly taken into account when we are considering the teaching of the New Testament on the institution of slavery.\n\nSecond, we must give consideration to the redemptive historical nature of the slavery that God permitted in the law in the Old Testament. An indentured servant, together with his family, was to be set free in the seventh year (Exodus 21:2–4). This was meant to remind Israel of what God had done in setting them free from their bondage in Egypt. That, in turn, serves as an Old Testament picture of the redemption that sinners experience through the death and resurrection of Jesus Christ.\n\nIn fact, we might go so far as to say that the institution of voluntary indentured servitude enables us to understand better what Jesus Christ has undertaken for our redemption. As minister and writer Phil Ryken explains, “We serve a Master who has made himself our slave, taking on the very nature of a servant (Philippians 2:7). This is the story of our salvation, that the Son of God ‘did not come to be served, but to serve, and to give his life as a ransom for many’ (Mark 10:45)…. The greatest service of all was his death on the cross.”\n\nSo, when we come to this passage in Ephesians 5, we are then to understand that the relationship between an indentured servant and his master was one in which the relationship between Christ and those He had spiritually redeemed was in view. This is why the apostle could say, “Slaves, obey your human masters with fear and trembling, in the sincerity of your heart, as you would Christ…. do God’s will from your heart…. And masters, treat your slaves the same way, without threatening them, because you know that both their Master and yours is in heaven, and there is no favoritism with him” (Ephesians 6:5–6,9).\n\nThough we do not have an institution of indentured servitude in our day and age, we do have other working relationships with a hierarchy. The same principles that apply to the relationship between servants and their masters apply to us in our vocations. When we come to realize these principles, we come to understand that our work, regardless of position, must be motivated by a desire to honor Christ.\n\nWritten by Nick Batzig",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-18.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 6:1-4, Exodus 20:12, Matthew 15:1-9",
    "devo_title": "Children and Parents",
    "devo_summary": "I am so grateful for our children. We have six and each child gives us unique hope (and sometimes worry) for the future. We’re in a season where we cut baked sweet potatoes into tiny, appealing bites, and we also stay up late to encourage our teenager that she is not alone. We’ve been parenting for over a decade, and it’s been the topic of many of our prayers and conversations together.\n\nAs a father, I really like the import of the fifth commandment. Admittedly, I am often tempted to invoke it before my children with an attitude of self-justification, rather than with pure motives. I can selfishly bristle at challenges to my authority.\n\nOf course, children who know their scriptures may be tempted to do the same thing with Paul’s injunction to fathers: “Don’t stir up anger in your children, but bring them up in the training and instruction of the Lord” (Ephesians 6:4). We can probably all remember being 14 years old and knowing basically everything, and bristling at any parental critique. If you’ve got kids of your own, you know that the same “I’ll do it my way” attitude shows up in their earliest years. It’s as if children are made of the same stuff their parents are, struggling with the same sin.\n\nWe all like to put ourselves at the center of life and expect others to bow to our whims. But in Ephesians, both commands are the same and should cut us to the quick and unseat our self-inclined hearts. Both parents and children are called into obedience to Christ. Why should children obey their parents? Because it is right. How are they to obey? In the Lord. How are parents to raise their children? In the nurture and admonition of the Lord. In each case, the central figure is not the parent or the child, but the Lord Himself. God does not call parents to mere child-pleasing. He does not call children to mere parent-pleasing. He calls both to be God-pleasing.\n\nThis should come as both a conviction and a relief to all of us. Parents, the duties and success of your parenting are not about you; your human will is not the final law. You also can take yourself out of the center, letting go of the frustrations and failures of your own work. Fix the work of your parenting in Christ alone. Turn your children’s eyes toward His law. Set before them the hope they have in Him.\n\nIn the same way, the duties and obedience of childhood are about God. Children must be led to desire God’s will and to trust His wisdom rather than their own. Frustrations and shortcomings can be handed over to the God who cares for them far more than their own parents ever could. When taught to fix their hearts on Christ Jesus, their gaze moves to obeying His law, which will result in honoring their parents as well. Parents and children alike struggle with the same sin of self-worship. But in the end, God calls us to the same thing He always calls us to: the love of Christ.\n\nWritten by Caleb Faires",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-17.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 5:22-33, Genesis 2:4-25, Colossians 3:18-25",
    "devo_title": "Wives and Husbands",
    "devo_summary": "Here is a passage many find controversial. It is vital to read not only this text, but all Scripture, in context. We have to deal honestly with what it is saying and not saying. So let’s talk about this passage that uses the word “submit.” What is Paul teaching? What is he not saying?\n\nTo get our bearings, we must remember that in the verses immediately before this passage, Paul calls all believers to submit to one another out of love for Christ. Before he says a word about the intimate union of two individual people, he tells all believers that our posture toward one another should be self-emptying. If we read Paul’s words about marriage through the filter of trying to maintain our individual rights at all costs, we will not only misread this passage, but the entire gospel, which teaches us that there is no greater love than to lay down our lives for those we love (John 15:13).\n\nThe picture in Ephesians 5 is that marriage would be a relationship that sanctifies husbands and wives who would freely offer their lives for the Christlikeness of the other. It’s a dance. Submission is necessary in any dance. He cannot lead if she will not submit, and she cannot follow his steps if he will not lead. But in a dance, both people are doing the same thing together, and they’re doing it in step, in harmony, for the sake of the beauty they create as they’re moving together. So what does that dance look like in the context of marriage?\n\nFor a wife, what does it mean to “submit to your own husband as unto the Lord?” First, this is a Godward statement. “As unto the Lord” means that in marriage, the ultimate authority is not the husband but the Lord. If a husband leverages his power to control or abuse his wife in an ungodly way, he has violated the relationship, and she should not submit to his abuse. This passage assumes both people in the marriage desire to grow in unity and faith.\n\nSecond, it is an intimate statement. “Your own” means the submission Paul is talking about here is not every woman to every man, but specific to one couple. This passage calls a husband to love his wife in such a way that he becomes a sacrificial, humble, strong leader who wants nothing more than for his bride to become radiant, holy, secure, missional, and strong. Her call is to love him with a kind of affectionate depth she will not find in any other earthly relationship, but will overflow into and shape every other relationship she ever knows.\n\nFor a husband, this passage calls the man to love his wife in such a way that she becomes a radiant, holy ally in his life who will daily hold up the mirror to reflect his call to live and model the love, sacrifice, humility, and resolve of the sacrificial, self-emptying love of Christ. His call is to love her with a sort of intimate depth he will not find in any other earthly relationship, but will spill into and influence every other earthly relationship he ever knows.\n\nThis text is intimate. It tells husbands and wives to empty themselves for the sake of the other’s holiness, purity, and purpose in life. Marriage is a love story. It isn’t two people trying to find mutually exclusive happiness. It is two people seeking to find their joy in becoming one. It’s a dance. One leads, the other follows, but they’re both doing the same thing. And this, Paul says, is nothing less than a picture of Christ’s love for the Church.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-16.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 5:15-21, Amos 5:4-15, Colossians 3:12-17",
    "devo_title": "Consistency in the Christian Life",
    "devo_summary": "I often find myself praying for wisdom. It is a prayer I think many of us pray because we encounter daily challenges and conundrums that require careful discernment. Sometimes, what I’m really seeking are simple solutions to complex challenges. But Scripture proclaims a wisdom that doesn’t bow to my desire for easy answers.\n\nPaul’s first words to the Ephesians were a reminder of the riches and position we have in Christ (Ephesians 1:3–4). Paul is essentially declaring: You have received everything in Christ! Therefore live as His workmanship! (Ephesians 2:10). We have been changed by the gospel, and so our lives should be different, look different—a total life transformation from the inside out. The exhortation to wisdom in Ephesians 5 is the direct overflow of this change, but Paul doesn’t provide an easy answer to complex problems, though he provides a clear reminder of what wisdom is.\n\nFirst, wisdom is circumspect: it calls us to pay careful attention to how we live (Ephesians 5:15). In a busy world it can be so easy to get distracted, even by good things, and fail to attentively walk with Christ. In contrast, the unwise are not paying attention. Their eyes do not see where their feet wander, and they stray quickly, flocking after the attractions and distractions of the world, preoccupied with self.\n\nSecond, wisdom is quietly industrious. Paul urges that we make the most of the time (Ephesians 5:16), to wisely use all the resources God has given us. Paul follows this call with a line from Amos 5:13: “for the days are evil.” The wise use their time well, bearing with the days of toil and tribulation with patient endurance, devoting their attention to what God has called them to do.\n\nThird, wisdom is not foolish. Paul clarifies that folly is distracted, wasteful, and ignorant: it does not “understand what the will of the Lord is” (Ephesians 5:17). But we can know and understand His will by knowing His Word—the lamp for our feet and guard against temptation (Psalm 119:105,11).\n\nFourth, wisdom is Spirit-filled. The contrast Paul offers is that of dissipation, or drunkenness, when a man turns over the control of his life to desire, to appetite, to some other idol. These are the ways of the flesh. The Spirit-filled, inward life should affect every aspect of our outward lives. When we walk in His Spirit, our lips will be filled with His Word. The same Word that we are to hide in our hearts should also dance on our tongues in psalms, hymns, and spiritual songs (Ephesians 5:19).\n\nI think this is an often neglected aspect of wisdom: the idea that wise men are somber and woeful. Rather, they are full of praise and thanksgiving. This is part of making the most of the time. Though the days are evil, the voice of praise and thanksgiving should never be silenced. Thanksgiving is always right; even in the hardest of circumstances, we should not cease giving thanks.\n\nScripture is a two-edged sword. I find in it both the conviction of my shortcomings, and also the inspiration and encouragement to walk anew. Because Christ has won every heavenly blessing for me, I need not wallow in my own inabilities, but can rise and walk in His sufficiency and strength. He has done everything. Thanks be to God for the opportunity to walk in wisdom and newness of life!\n\nWritten by Caleb Faires",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-15-wordpress.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 5:6-14, Psalm 36:9, 1 John 1:5-10",
    "devo_title": "Light Versus Darkness",
    "devo_summary": "I am the father of three small children. Among other things, this means that when I attempt to navigate my house in the darkness of night it is inevitable that I will step on a doll, a ball, or one of those tortuous devices often referred to as building blocks. We’ve lived in this house for years. I know every room and every hallway from experience. But in the darkness, I cannot always anticipate what waits in my path to trip me up. If you are a parent, I imagine you can relate to this. This common experience is also a great metaphor for the spiritual life of a Christian.\n\nIn Ephesians 5, Paul reminds believers of how far Christ has brought them, saying, “For you were once darkness, but now you are light in the Lord. Walk as children of light” (Ephesians 5:8). In the light, you don’t stumble. In the light, you know what is ahead. In the light, unforeseen obstacles do not trip you up. As Christians, God has saved us from the blindness of sin and the consequences of giving in to the temptations of this dark world. God has saved us from the darkness, but the command to live as children of the light calls us to shine the light of Christ in a dark world.\n\nGod is light, “and there is absolutely no darkness in Him” (1John 1:5). We might ask, “How are we to reflect His light in the world?” Darkness can still creep into our hearts, and the temptations of this world can pull our gaze toward things that are not of God. And so He sent His Son to be the light of the world, and then gave us His Spirit, to open our eyes to see the light of Christ’s glory.\n\nAs Christian men, we must be diligent to shine the light of the Word on our hearts. In our weakness, we must depend on the light of Christ, and walk in the light of the Spirit. The good news of the gospel is that God “has rescued us from the domain of darkness and transferred us into the kingdom of the Son he loves” (Colossians 1:13).\n\nConsider again my opening illustration. You might ask, “Why don’t you turn the light on instead of walking through a dark house where obstacles await to take you out?” The same question can be asked of each of us spiritually. Why attempt to walk through a dark world without the light of God’s Word to show us the way? Why try to fight the darkness by any other means than walking in the light of the Spirit? In our own strength we cannot, and so we must remind one another that the Lord, our light, goes before us and will show us the way.\n\nWritten by Matt Capps",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-12.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 4:17-5:5, Hosea 1:10, James 3:1-18",
    "devo_title": "Living the New Life",
    "devo_summary": "I put my pants on one leg at a time just like every other man. This act is almost thoughtless. We all do it everyday without giving it too much reflection. Interestingly enough, the apostle Paul uses the idea of “putting on” as one of his favorite metaphors in the Christian life; in fact, you can find it in almost all of his letters. For example, Paul tells us in Ephesians 4 to “put on the new self, the one created according to God’s likeness in righteousness and purity of the truth” (v.24). This is a striking image of the closeness that exists between the new self and Jesus—not unlike putting on one’s clothes.\n\nThe idea of “putting on” implies several things. First, it speaks to our identity. If you imagine putting on the new self as if putting on new clothing, then what we put on should tell others a little bit about us. Our clothing is like a uniform that identifies us with certain groups by indicating gender, social class, cultural affinity, or even nationality. Therefore, to command us to put on the new self, Paul is teaching us that our ultimate identity is found not in worldly classifications, but in Christ.\n\nSecond, the idea of putting on the new self speaks to our intimacy with Christ. He has given us our new self by grace. It’s much like your clothes, which are kept closer to you than any other possession you have. You rely on clothes to cover you every moment of the day; the command to put on your new self implies moment-by-moment intimate closeness and dependence on Jesus.\n\nFinally, in the same way that clothing is worn as adornment to cover our nakedness, putting on the new self reminds us that in God’s sight, we are loved and accepted by God because of Jesus’s work on the cross. There is an expectation as well, that we will live in line with our new identity; our obedience to God flows from the “new self” He has given us. We love as Jesus loved. We speak in a way that honors God. We treat others with the same amount of grace that we have received from Christ.\n\nSo while you may put on your clothes like every other man, as Christians we are called to put on the new self as a way to stand out from other men. This is a high calling! At the same time, there is great comfort in knowing that what we put on protects us and shields us. Moreover, we should thank God that by His grace, He has granted us this new self that brings us protection and identity, but more importantly, brings Him honor and glory.\n\nWritten by Matt Capps",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-11.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 4:1-16, Acts 2:42-47, 1 Corinthians 12:12-27",
    "devo_title": "Unity and Diversity in the Body of Christ",
    "devo_summary": "Have you ever considered how miraculous the composition of the Church is? It is made up of different people, often with different ethnicities, socioeconomic status, and preferences. And yet, the Church is unified under the banner of Christ. The Church really is unique when compared to other gatherings of people in our society. Unlike groups that are organized by a single interest or shared hobby, the Church is multifaceted. And, unlike other things that gather people into groups in our society, the message of the gospel reaches into every area of life.\n\nFor this reason, the writers of the New Testament often speak of the Church using the metaphor of the Body. Not unlike the human body, the Church is made up of various parts, but all the parts work together so that the whole functions properly. Not only is the Church gathered under the one message of the gospel, but it is also the dwelling place of the Holy Spirit. As Paul writes to the Ephesians, “There is one body and one Spirit—just as you were called to one hope at your calling” (Ephesians 4:4).\n\nWhen I reflect on the local church that I am a member of, I am amazed at how God has brought each individual in to be a part of the collective work He is doing throughout our community. Our church is full of handymen, cooks, teachers, administrators, medical professionals, salespeople, engineers, stay-at-home moms, public servants—the list goes on and on. It is truly inspiring to see people use their God-given gifts, natural abilities, and learned skills to advance the mission of God through our congregation. Moreover, each person has been gifted by the Spirit to serve the Body as a whole. Many times, these spiritual giftings, natural abilities, and learned skills converge into areas of service that are necessary for the Body to flourish.\n\nTake a moment to reflect on the people God has placed in your life and in your church. Have you thanked God for how they have served you in a time of need? Have you praised God for how all have worked together to allow the Church to meet the needs of the community and advance the gospel in the world?\n\nThe Body of Christ is truly a gift from God. When we enter into His salvation as individuals, we also have the benefit of becoming one with those who are in Christ. The grace of the gospel is received individually, but the implications of the gospel are lived out in community. Christianity does not preach “every man for himself”; instead, it’s every man together for Christ. We are one in Him, but we are not one in the same. We celebrate our unity in salvation, even though there is not uniformity in our gifting to serve. What a multifaceted experience of God’s wisdom and provision!\n\nWritten by Matt Capps",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-10.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 3:14-21, Psalm 103:1-22, Philippians 4:12-13",
    "devo_title": "Prayer for Spiritual Power",
    "devo_summary": "In the 19th century, emancipation, reconstruction, and urbanization forever changed the lives of Black Americans. It was a time of freedom, upheaval, and then social hostility. Those who were free before the end of slavery and those recently freed found themselves in a brave new world. Jim Crow laws and racist ideologies limited opportunities for Black Americans, particularly in the South. So they responded by creating institutions that were parallel to those from which the White majority had excluded them: independent churches, schools, banks, burial societies, and clubs for social reform.\n\nAfrican American women founded many of the most important social reform clubs. Many of these clubs focused on education. Josephine St. Pierre Ruffin, Mary Church Terrell, and other women formed kindergartens across the South, often in association with Black colleges like Hampton in Virginia and Tuskeegee in Alabama. These mothers of the faith saw the next generation as the community’s hope for the future, and they were convinced that literacy, basic education, and Christian love were the necessary foundation for equipping this next generation to succeed.\n\nPaul wrote to the Ephesians to encourage Gentile believers that they were sharers in the same spiritual blessings God had given to Jewish Christians. Christ tore down the division between them, making what was once two groups of people into one Church of believers (Ephesians 2:13). Now both Jews and Gentiles share a common inheritance in the Church and the gospel (Ephesians 3:6). But to live with confidence in these new realities, Paul knew that the next generation of believers would need a firm foundation to persevere.\n\nSo, Paul gets on his knees. He pleads to the Father—the Father of both Jews and Gentiles, “the Father from whom every family on heaven and earth is named” (v.15)—asking Him to strengthen the Ephesians with power so that they will trust Christ more. He wants the Savior’s indwelling presence to control their attitudes and behavior (vv.16–17). Paul prays that the Ephesians would be rooted and grounded in Christ’s love.\n\nChrist demonstrated His love for us by dying for us when we were still His enemies (Romans 5:8). Looking back to that love poured out at the cross is where the power to live with Christian freedom and maturity comes from. Our Savior is like a compassionate parent. He forgives our sins and cares for our basic needs, teaching us everything we need to grow up in the faith (Psalm 103:13). Christ’s love is an abundant foundation for us! As we grow in our knowledge of the height, breadth, width, and depth of His love, He promises to do glorious things through both us and the generations that follow us—so much more than we could ask or imagine (Ephesians 3:18–21).\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-9.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 3:1-13, Romans 11:1-36, Colossians 1:24-29",
    "devo_title": "Paul’s Ministry to the Gentiles",
    "devo_summary": "On April 17, 1960, Dr. Martin Luther King, Jr., appeared on NBC’s Meet the Press. There, King famously said, “I think it is one of the tragedies of our nation, one of the shameful tragedies, that eleven o’clock on Sunday morning is one of the most segregated hours, if not the most segregated hour, in Christian America… Any church that stands against integration… is standing against the Spirit and the teachings of Jesus Christ, and it fails to be a true witness.”\n\nSadly, Sunday mornings haven’t become much more integrated over the past sixty years. For the most part, American churches remain homogeneous. This testifies to our failure to fully understand a beautiful mystery revealed in Jesus Christ. Paul describes this mystery in Ephesians 3: “This mystery is that through the gospel the Gentiles are heirs together with Israel, members together of one body, and sharers together in the promise in Christ Jesus” (v.6, NIV, emphasis mine).\n\nTogether… together… together. Jews and Gentiles, Black and White, Asian and Arab, rich and poor—if we are believers in Christ, we have been given everything in common. By the gift of His grace, we are all now united in our service to the gospel (Ephesians 3:7). In God’s family, we have the same inheritance. We’re members of the same Body. We all mutually and equally share in God’s promises and blessings.\n\nRevealing that mystery was at the heart of Paul’s apostolic calling. He was a Jew, but God sent him across racial lines. This was dangerous and difficult work; breaking down ethnic barriers always is. Preaching a Jewish Messiah in Gentile lands often put Paul’s life at risk. But he wasn’t any safer when he returned to his home culture.\n\nPaul most likely wrote his letter to the church at Ephesus while imprisoned in Rome, and it wasn’t lost on him how he got there. It shouldn’t be lost on us either. Paul was arrested after the religious establishment in Jerusalem accused him of bringing a Greek—Trophimus, the Ephesian—into the temple to defile the sanctuary (Acts 21:29). Later, when the Jewish leaders brought even more charges against him, Paul appealed to Caesar, the Gentile king. While awaiting trial in Rome, Paul wrote his letter to the Ephesian church to encourage believers there. He wanted them to be confident that God had blessed them together with the same blessings He’d given to all Christians. “I ask you not to be discouraged over my afflictions on your behalf,” Paul writes, “for they are your glory” (Ephesians 3:13).\n\nWhat gave Paul the faith to speak with boldness across racial and ethnic barriers? Simply this: Paul knew that putting Jews and Gentiles together was in accordance with God’s multifaceted wisdom and eternal purposes in Christ Jesus. He knew that everyone who puts their faith in Jesus has confident access to the Father (Ephesians 3:12). He knew that the ground is level and truly equal at the foot of the cross.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-8-wordpress.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 2:11-22, Psalm 118:22, Romans 12:1-8",
    "devo_title": "Unity in Christ",
    "devo_summary": "From 1928 to 1929, Dietrich Bonhoeffer served as assistant pastor for a small German congregation in Barcelona, Spain. Young Bonhoeffer taught his parishioners to be patriotic. Echoing German preachers of his time, he touted the importance of protecting Germany’s national interests, even if it meant sacrificing the interests and lives of others.\n\nThe next year, Bonhoeffer’s faith began to change. He spent the 1930–1931 academic year as a postdoctoral student in New York. Bonhoeffer found a home at Abyssinian Baptist, a Black church in Harlem. There, he taught children’s Sunday School alongside his new friend, Albert Fisher. Bonhoeffer also visited church members’ homes and helped out with a weekday church school. In the Black church, Bonhoeffer encountered people who remained faithful to Christ though they were the objects of racism. In a new way, he learned how Christ identifies with the oppressed. Later, Bonhoeffer would say that at Abyssinian, “the gospel of Jesus Christ, the Savior of the sinner, is really preached.”\n\nIn Ephesians, Paul writes to a group of people who had been outsiders. The “uncircumcised” Ephesians were separate from Christ, excluded from citizenship in Israel, and foreigners to the covenants of promise. They were “without hope and without God in the world” (Ephesians 2:11–12). But now, through Christ’s sacrificial blood, those who were once far away have been brought near (v.13). Jesus Christ is peace for Jews and Gentiles—just as He is for all peoples divided by race, culture, or socioeconomic class. In Jesus Christ, the wall of hostility that divides us is broken down. Through Him, we all have access by one Spirit to the Father (vv.14–18). In Him, we are built together as one multi-ethnic temple (vv.19–21).\n\nExperiencing this good news at Abyssinian Baptist, and in his friendship with Fisher, changed Bonhoeffer. When he returned to Germany, he stood against the nationalistic impulses he’d once embraced. Though his countrymen thought him unpatriotic, he wrote the following in As You Believe, So You Receive (1931): “God has arranged it so that all races of humanity of the earth come from one blood (Acts 17:26). Therefore, a defiant ethnic pride in flesh and blood is a sin against the Holy Spirit… Even here the commandment of love urges the Christian to stand up for his neighbor.”\n\nWith these newfound convictions, we come to the part of Bonhoeffer’s story that is most well-known. In love, he ministered to the poor in Germany and stood against the Nazi party for his Jewish neighbors until death. It’s only the unity believers have in Christ, our “fellow citizenship” in spite of our ethnicity or background, that can empower such sacrificial love. Christ’s love breaks down every wall and compels us to love one another in the face of our differences.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-5.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 2:1-10, John 3:16-21, 1 John 5:1-13",
    "devo_title": "From Death to Life",
    "devo_summary": "No introduction is needed for this passage. Does the Grand Canyon need an illustrative runway to help us see it? Are sunsets incapable of stopping us in our tracks unless we connect to a funny story? I’m a preacher and a writer, so I know how helpful a good illustration can be for some passages. But brothers, this one needs no introduction. We are staring into the radiating wonder of the gospel of grace.\n\nPaul’s been preparing us for this passage, hasn’t he? Think about the previous readings, especially Ephesians 1:15–19, when Paul prayed for our hearts to see the glory of God. Like a dad telling us to get ready to see the Grand Canyon, it’s as if Paul is saying, “Get ready to enjoy it. Drink it in.” Now, we’ve pulled up to Ephesians chapter 2, and it’s time to really look.\n\nYou were dead in your sins. Not sick and in need of a lozenge or some vitamin C. You were a spiritual corpse, unable to do anything but continue in the deadness of sin. And if that wasn’t bad enough, the ancient serpent slithered around you, coddling your corpse to continue in sin.\n\nBut God—these are perhaps the greatest coupling of words in the Bible.\n\nBut God, who is rich in mercy, because of his great love that he had for us, \n\nmade us alive with Christ even though we were dead in trespasses. \n\nYou are saved by grace! (Ephesians 2:4–5).\n\nYou were dead. But God…\n\nYou were enslaved to sin. But God…\n\nThe rich-in-mercy God, brimming with love for you, made you alive in Jesus despite your moral wreckage. You didn’t deserve it. God saw our sorry selves and saved us by pure grace—it’s an undeserved salvation. Our sins were placed onto Jesus there at the cross, and He paid for them in full. He didn’t ask us to leave a tip for the server. He signed for it all. Jesus rose from the dead, raising us sinners up with Him, and it is a 100%-free gift of God. We receive this salvation by faith and trust that Jesus really went to the cross, the grave, and then to the throne for us, exchanging our sins for His righteousness, and giving us a whole new life.\n\nDo you ever wonder why He would do such a thing? Paul points it out to us in verse 7: “So that in the coming ages he might display the immeasurable riches of his grace through his kindness to us in Christ Jesus.” We are displays of his grace and his kindness. Another way to answer: God is gracious and kind, and He endured the cross for the joy set before Him (Hebrews 12:2)—He endured it for us. That’s our God. That’s our message, too; no matter the mess we find ourselves in, God can save each one of us through Jesus. He is alive today, and we are living proof.\n\nWritten by J.A. Medders",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-4.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 1:20-23, Psalm 8:1-9, Isaiah 11:1-9",
    "devo_title": "God’s Power in Christ",
    "devo_summary": "If you grew up as an evangelical Christian in the 1990s, then I bet you saw The Power Team. In the 90s, these tank-topped and muscled-up Christian men were ripping phone books in half, cracking Louisville sluggers on their foreheads, and obliterating towers of ice blocks. Their muscles had muscles. Who doesn’t want to see power on display?\n\nThat’s why Paul tells us about the immeasurably great power of God, displayed in God ripping His Son from the bonds of death and obliterating the curse of sin. “He exercised this power in Christ by raising him from the dead and seating him at his right hand in the heavens”(Ephesians 1:20). Talk about a display of power!\n\nAfter Jesus died for our sins on the cross, He became a lifeless corpse, held up by Roman nails. His body was no longer powered by blood, oxygen, and the brain. But on Easter Sunday, the power came back on. Jesus Christ was raised back to life, and He reigns to this day as the King of all. No one outranks Jesus in this world or the world to come. As Eugene Peterson paraphrased in The Message:\n\nGod raised him from death and set him on a throne in deep heaven, \n\nin charge of running the universe, everything from galaxies to governments, \n\nno name and no power exempt from his rule. And not just for the time being, \n\nbut forever. He is in charge of it all, has the final word on everything (Ephesians 1:20–23).\n\nThat’s power. None of our attempts at power displays can compare to the resurrecting power of God—a true “flex,” as they say. The risen Christ is a living billboard of God’s power, but not power for power’s sake. It’s for you and it’s for me. This is the level of power that is at work in every Christian. No protein powder can match the power that is at work in you this very second. You are on the same team as the one who is in charge of the universe, and you are on His mind, His heart, His daily schedule. The risen Lord is ready to lead us, grow us, and transform us by His power. Rejoice. Rest. Run your race.\n\nWritten by J.A. Medders",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-3.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 1:15-19, Proverbs 2:1-11, Romans 8:18-27",
    "devo_title": "Prayer for Spiritual Insight",
    "devo_summary": "Remember when people used to use the hashtag “#SquadGoals” on social media? It was usually partnered with a heart-warming picture, like an elderly married couple dancing alone in their living room, or a gang of siblings working together to get those forbidden oatmeal-chocolate chip cookies from the top of the fridge. Squad goals—it’s what we say when we see something worth emulating, what we would like to have in our lives, in our futures, in our present. When we read this section from Paul, how can we not think #SquadGoals?\n\nThe apostle Paul had heard about the Ephesians’ resilient faith in the crucified and risen Lord Jesus—that and their love for other Christians. The Ephesian church serves as a model reminder for essential biblical spirituality: loving God and loving one another. We never move on from these ingredients; they are the salt and pepper of genuine Christian spirituality.\n\nPaul’s goals for the Ephesians (and all believers) continue to build, layer after layer. And this is why he was led to write to them, saying: “I pray that the eyes of your heart may be enlightened” (Ephesians 1:18). He’s praying for this squad of saved sinners’ hearts to be enlightened, illuminated, dialed up. Paul asks the Father of lights to turn up the wattage of gospel glories in their hearts so they can know more fully what is theirs in King Jesus. He asks that their “hearts will be flooded with light so that [they] can understand the confident hope he has given to those he called—his holy people who are his rich and glorious inheritance” (Ephesians 1:18, NLT).\n\nWhat a great prayer! Paul wants us to know how good we have it in Jesus. Our God isn’t a cheapskate. He doesn’t save us but then limit our access to a thrift-store franchise of the throne room. No way. Do we know the wealth, the infinite abundance that is our inheritance in Christ Jesus? As believers, we have a never-ending glory headed our way. But do we go garage-sale shopping for hope instead? Rummaging around headlines and digitized bodies, under the effects of social media or hops and barley? Dimmed hearts don’t easily remember their great hope. Paul prays for the light in our hearts to go all the way up so we can see, know, hope, and believe again in God’s immeasurable, peer-less power at work in us. It’s true.\n\nIt’s easy to get discouraged in our day-to-day lives. Paul prays against that for the Ephesians, and this is something we need to pray for ourselves and others. Ask the “light of the world” to shine on your heart (John 8:12), enabling you to not only see but to ooh and ahh over His great power that is at work in you. Pray this for yourself, your church, your community. His transformational power on display in us and through us, bringing Him glory—that’s the goal, the hope we have in Jesus.\n\nWritten by J.A. Medders",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-2.jpg"
  },
  {
    "book_title": "Ephesians",
    "devo_passages": "Ephesians 1:1-14, John 1:12-13, 1 Peter 1:18-21",
    "devo_title": "God’s Rich Blessings",
    "devo_summary": "Remember playing hide-and-seek as a kid? My friends and I tried so hard to not be found, but have you ever had the experience of hiding too well? Have you ever hidden so well that you never “got found,” only to have a strange and lonely sorrow come over you when reality set in: you’d hidden so well that the seekers had given up and stopped looking for you?\n\nOver the course of a lifetime, we can become expert hiders; we find hiding places so good that the people closest to us don’t even know we’ve been hiding in plain sight. Paul’s letter to the Ephesians draws us out of the darkness of hiding and into the light of truth, and it opens in verse 3 with a command: “Blessed be (or “give praise to”) the God and Father of our Lord Jesus Christ.” Why should we praise Him? That question is what the rest of the letter lays out, but Paul summarizes the answer in the second half of that same verse: because he “has blessed us with every spiritual blessing in the heavens in Christ.”\n\nWhen we look at what Paul says in these opening verses, what do we see? God chose His people before the foundation of the world (vv.4, 1–12), according to His mercy and grace and not by any work of our own (vv.7–10), in order that we might know Him as our Father and know ourselves as His beloved children (vv.5, 13–14). This, Paul says, should draw from us a response of praise. Why? Let’s focus on two reasons.\n\nFirst, a great darkness has been pushed back. The breathtaking beauty of God choosing us in Him before the foundation of the world to be His adopted children is that, had He not, ours would only be a story of perishing in the wreckage of our sin. We would forever remain hidden and alone. But praise be to God, He has intervened. Because of Christ, we rejoice in the light that has pushed back so great a darkness, but even more, we delight in the God who has done it.\n\nSecond, our God has come looking for us. God doesn’t just rescue us to give us a second chance. He saves us from spiritual death and then gives us a new identity: adopted sons. God has taken our game of hide-and-seek and turned it into a game of sardines. When Paul says we’re adopted through Jesus Christ, he’s telling us Jesus didn’t just find us; He came to where we were hiding and hid with us in such a way that you and I would never be found alone again. To find us now would be to find us together with our big brother.\n\nIf this is all true, what else is there to do but praise Him? Praise God for the sake of the means by which He has done all of this. He has given us His Son, that our lives might be hidden in His.\n\nWritten by Russ Ramsey",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2020/08/HRT-Ephesians-Instagram-1.jpg"
  }
]