[
  {
    "book_title": " Mark",
    "devo_passages": "Mark 10:45",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\n                    \n\n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing the key verse for the gospel of Mark.\n\n“For even the Son of Man did not come to be served,\n\nbut to serve, and to give his life as a ransom for many.”\n\n—Mark 10:45\n\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/4-HMark3n.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "1 Peter 2:7",
    "devo_title": "Grace Day",
    "devo_summary": "\n\n                    \n\n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \n\n“The stone that the builders rejected has become the cornerstone.”\n\n—1 Peter 2:7 \n\n\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Mark-Instagram20.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 16:1-20, Acts 1:6-11, Isaiah 53:4-6",
    "devo_title": "Risen and Ascended",
    "devo_summary": "\n\n                    \n\n                    “Just one date.”\n\nI begged my now wife for just one date. And when she granted me that date, which went very well, I had more hopes and fears about my future than I had ever had before. Hope for happiness. Fear of how she felt about me and if she would continue to have feelings toward me. Hope and fear were colliding.\n\nFear is not flat. There are many different kinds of fear. And even within our varied fears there are emotions and dispositions that may take a lifetime to plumb the depths of. Fear rarely pounds against the insides of our hearts without confusion, excitement, anger, or hope beating in time and alongside.\n\nThis would explain the reaction of these three women when they went to Jesus’ tomb. \n\nThey were already sad. It is easy to imagine this was no ordinary grief. They had lost a friend and a Messiah. It is one thing to lose someone you love, knowing they will no longer be with you. But to lose hope would be even harder.\n\nTo compound that grief, they were preparing to show care and respect by anointing Jesus’ body. I assume this would make the grief even sharper, much like when we go to a funeral and look upon the lifeless body of a loved one. When both of my parents died in the course of two years, this was hard: seeing them look nothing like the laughing and loving people I’d known all my life. Their lifelessness added, if not insult, certainly more pain. Fear was at my elbow, as I am sure it was for these three women.\n\nThe women also worried they’d not be able to anoint Jesus because the stone blocking the entrance was too heavy. It’s that feeling anyone driving to a funeral can relate to: You want to pay your respects, but on another level, you don’t want to say goodbye. There is even an edge of fear in this.\n\nAnd then, a glowing man. And everything was reversed. \n\nThe stone was rolled away. Jesus was not there. He had risen and was now in Galilee. Not in heaven, but in Galilee—which is a real geographical place, like Montgomery. \n\nImagine showing up at a funeral and the body is not there. The funeral director tells you, “He is not here; he is down the road a bit. He has risen.” Hope? Yes. But also fear, because this is not what was expected.\n\nIt would be easy to read into how these women didn’t tell anyone what they had seen, even after the angel instructed them to tell the disciples. But their world just tilted on its axis. The thoughts and feelings and fears these women had going to the tomb were now mixed with new hope, eclipsing whatever plans they had otherwise made—possibly even affecting their ability to think straight. \n\nI have to wonder if a version of the moment these women had at Jesus’ tomb is coming for all whose faith is in Christ—a reckoning where all our fears and hopes are met with the reality of the risen Christ. I look forward to that day. I look forward to the moment when “the hopes and fears of all the years are met in Thee tonight.” \n\nWritten By Matthew B. Redmond\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/09/HRT-Mark-Instagram19.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 15:1-47, Psalm 38:20-22, Hebrews 5:7-10",
    "devo_title": "The Crucifixion",
    "devo_summary": "\n\n                    \n\n                    “Were you there when they crucified my Lord?\nWere you there when they crucified my Lord?\nO, sometimes it causes me to tremble! tremble! tremble!\nWere you there when they crucified my Lord?”\n\nI don’t think I really understood those words as a child. But I do remember a handful of Sundays when we’d waltz into the little stained glass sanctuary and I’d be pleased to see hymn #172 on the board alongside a few others.\n\n“O, sometimes it causes me to tremble! tremble! tremble!”\n\nAs a boy, the story of Jesus’ death made me sad. I’m not entirely sure why, but perhaps it was because while I knew that something incredibly broken had been made right, it came at a great cost.\n\nNow though, I do tremble. I tremble and quake at the thought of our crucified God. What kind of God lets Himself be killed? A loving God; a very loving God indeed.\n\nJesus Himself declared, “greater love has no man than this, that he lay down his life for his friends” (John 15:13). Friends, Jesus laid down His life for us.\n\n \n\nHere is what I’ve come to believe:\n\nI was there when they crucified my Lord.\nYou were there when they crucified your Lord.\nWe all were there when they crucified our Lord.  \nWe were all represented there in the crowd. And as much as we might like to think we would’ve been the one centurion crying out, “truly this man was the Son of God,” that’s likely not the case. What’s more likely is that we would have been among the crowd, jeering, spitting, and yelling, “Crucify Him, crucify Him” (Mark 15:13, 39) \n\nThe fullness of the cross is a mystery. But what we do know is this: to experience resurrection, we must move through the cross. Jesus carried what we never could—the full weight of our sin. To know the fullness of forgiveness that He purchased through His death and resurrection, we, too, must die to self. \n\nI know I was there. I know I was there when they crucified my Lord. You were too. There’s no doubt about it. The good news is that, while complicit in His death, by grace we are completely released from condemnation. Even better, we gain the Kingdom of God through faith in His resurrection. \n\nWhat’s holding you back? Is anything keeping you from participating in the fullness of His mercy? The hard work, the heavy lifting has all been completed on your behalf. All you need to do is surrender; surrender to a God who was willing to die on your behalf and in your place. \n\nHe’s calling with His clear and gentle way: “The stone was rolled away, son.”\n\nWritten By Andrew Stoddard\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram18.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 14:1-72, Isaiah 53:2-3",
    "devo_title": "The Lord’s Supper",
    "devo_summary": "\n\n                    \n\n                    My parents divorced when I was in my early teens. I don’t remember much about our family dynamics, but there was one constant event that sticks in my mind—eating dinner together. Every single night, no matter what else happened, my family sat around the same table and ate dinner. In a sense, the dinner table was an opportunity to recommit to one another, to look across the table and say, “That’s my father, mother, and brother.”\n\nNot long before His crucifixion, Jesus sat around a table with His family—that ragtag group of disciples He called His brothers. They broke bread and sipped wine, to remember Jesus’ soon-to-be broken body and poured-out blood (Mark 14:24-25). When they looked around at one another, they were bonded together as brothers under the covenant that Jesus’ blood would establish. Christians are bound together by that same blood today.\n\nSunday morning worship services are more than a time to “get something” from a pastor or worship band; they’re dress rehearsals for eternity. In the final act of God’s story, His family will gather around one table, feasting and giving thanks for Jesus’ broken body and shed blood (Rev. 19:7-10). We rehearse like those disciples, and we look forward to the Last Supper when Jesus returns to make all things right.\n\nWhile we weekly highlight preaching and music in Sunday morning gatherings (for good reason!), we must not forget the Lord’s Supper, “for as often as you eat this bread and drink the cup, you proclaim the Lord’s death until He comes” (1 Cor. 11:26). When we praise God through the preaching of His Word, the singing of hymns and songs, and partaking in the Lord’s Supper, we present to the world that multi-sided prism of the ways God is worshiped in eternity.\n\nWhen we gather around the Lord’s table, our eating and drinking is a recommitment. We look at our brothers and sisters in Christ, and remember that we’re one family, one body. We may go our separate ways throughout the week, visiting each other here and there, but we always come back to the same table. We collectively hold the bread and wine or juice and look upward to our Father in heaven, who sent His Son for us.\n\nJesus came into the world to save it, and yet He was despised and rejected (Isa. 53:3; Matt. 27:15-44; John 19:1-7). He was nailed to a cross, dying the death we deserved. His cross seemed like an upright coffin, but was actually a victory chariot. Three days after His crucifixion, His heart kick-started and He walked out of the grave, prevailing over the sin and death that nailed Him to the cross.\n\nThe Lord’s Supper is a beautiful, powerful, tangible reminder of that victory. Because of Jesus, we are sons and daughters, adopted by the Father (Gal. 4:4-7). Take a seat at the table with your brothers and sisters, and proclaim what He has done.\n\nWritten By Brandon Smith \n\n \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram17.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 13:1-37, Jeremiah 31:35-37, Isaiah 51:6",
    "devo_title": "Things to Come",
    "devo_summary": "\n\n                    \n\n                    Be alert. Stay awake. You don’t know when life as you know it will end.\n\nWhat lulls you to sleep? What causes you to get lost in the weeds of the tyranny of the urgent? What takes your eyes off of the future glory promised to those who follow after Christ? And what are you to do about it?\n\nThe truth is, many of the things that compete for our attention are good things—things we can’t forsake, like our jobs, relationships, marriages, children, ministries, and causes. Though the Christ-follower’s eternal destiny is a glorious one, the trails we follow through this life to that glory often demand a lot from us.\n\nI am a hiker. I love going deep into the mountains, far from civilization, with everything I need in a pack on my back. I love climbing up to vistas that are only made sweeter because the difficulty required to get there. When I finally get to the top of a mountain and drop my pack on the ground and take in the view, I am overwhelmed with a sense of awe and worship. Up there I see the beauty of creation with clear eyes and a full heart. Up there I always feel that I was made to take in far more glory than I do.\n\nBut it seems the higher the summit, the steeper the trail. On the steep trails, I find that I cannot walk and take in the views at the same time, lest I stumble and fall. I must watch my feet. I must read the terrain right in front of me. If I don’t, I will break an ankle or lose my way. There is so much glory to see on the way up, but I dare not try to take it in as I hike.\n\nI have hiking buddy, Nick, who does a good job of making us stop and look around as we climb. I’ll hear him say, “Man, look at that.” By this he means, “Look at all of it.” We’ll stop, catch our breath, and look around before putting our heads back down to study another stretch of the trail. This pattern eventually leads us to the summit.\n\nI don’t think Jesus’ call to be alert and stay awake is a call to only be concerned with the future glory that awaits. We go through seasons where the trail in front of us demands our attention. I believe what He is saying is that, along the way, we need to regularly stop and look at the bigger reality surrounding us. We need to remember that the path we follow leads to inevitable glory and that before we know it, that glory will be all we know.\n\nIt would be a shame if we walked this entire path and never stopped to notice the beauty around us and the heights of glory ahead.\n\nSo be alert. Stay awake. Stop and look around you. You’ll only be on this path for a while.\n\nWritten By Russ Ramsey\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram16.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 12:1-44, Isaiah 5:1-5, 1 Peter 2:4-8",
    "devo_title": "The Chief Cornerstone",
    "devo_summary": "\n\n                    \n\n                    The Pharisees and Sadducees of Jesus’ day had no hesitation in calling Him “teacher.” It was very clear to them that Jesus knew His stuff when it came to the ways of God. Today’s verses tell us as much, as we read them and shake our heads at those Pharisees and Sadducees and think, Wow, how could you guys be so blind?\n\nLike all great teachers, Jesus was also a great storyteller. Mark 12 begins by describing Jesus as such. And the culture of our day, at least the cross-section of our culture that is interested in spiritual matters, has no problem giving Jesus credit for being a good storyteller. It’s clear He knew how to tell a tale. We the people are all about story, and narrative, and parable, and the hero’s journey, and, well, you get the point. But if we’re not very careful we can be just as sightless as those blind guys from Jesus’ day.\n\nAnd how, you ask, could that happen?\n\nIs Jesus the most excellent Teacher? Yes. Is Jesus the grand Storyteller? Yes again. But there was and is a greater identity that Jesus came to reveal: He is the great I AM—the subject of His own teaching, the Hero of the big story. If we the people hold the pieces of Jesus we prefer to the exclusion of the whole, then we’re no better off than the Pharisees and Sadducees of way back when. Oh sure, we’ve got iPhones and cars that parallel park themselves, but in terms of what eternally matters, we still lack vision and understanding.\n\nJesus didn’t say, “I’m sorta like the Father.” No, His claim was, “I and the Father are one” (John 10:30). In other words, “If you want to know what God looks like, look at me.” And it was that kind of truth-talk that drove the Pharisees and Sadducees nuts back in Jesus’ day. And it’s that same kind of truth-talk that separates the sheep and the goats today.\n\nThis chapter ends with the humbling story of the poor widow and her two cents. In a way, she represents us, for that’s essentially what believers have to share with the world—our two cents: that Jesus is the God we are to love with all our heart, mind, soul, and strength. \n\nBut the poor widow reminds us that the gospel is more than a story we tell or a lesson we learn. Telling and living the story of Christ will cost us more than all the others put together. It demands of us an extravagance, that we give our all. Why? Because it is more than a story we tell. It is the story we are in. May we never become blind to that.\n\nWritten By John Blase \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram15.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 8:36",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\n                    \n\n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing this question from Jesus: \n\nFor what does it profit a man to gain the whole world and forfeit his soul?\n\n—Mark 8:36\n\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/4-HMark2.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Daniel 7:14",
    "devo_title": "Grace Day",
    "devo_summary": "\n\n                    \n\n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\n\nHis dominion is an everlasting dominion\n\nthat will not pass away,\n\nand His kingdom is one\n\nthat will not be destroyed.\n\n—Daniel 7:14\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram13.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 11:1-33, Zechariah 9:9, Psalm 118:25-26",
    "devo_title": "Our King",
    "devo_summary": "\n\n                    \n\n                    I’ve met plenty of dog lovers, cat lovers, horse lovers, and even reptile lovers, but I’ve yet to meet a donkey lover. Frankly, donkeys are just not highly sought after animals. They are the animal equivalent of the Datsun. You’ll never hear a child say, “I really want a donkey this Christmas.” \n\nAnd yet, it was a donkey that our Lord rode into Jerusalem. Zechariah prophesied that Israel’s King would come “lowly and riding on a donkey” (Zech. 9:9). What has often been called “the triumphal entry” might just as soon be called “the humble entry.” This was to highlight the humble means by which the Kingdom of God advances, as well as the humble King through whom it advances.\n\nThe German theologian, Frederick Krummacher—in his marvelous work, The Suffering Savior— made an interesting observation about the manner in which Christ comes as King and the way in which His kingdom advances through the Church. He wrote:\n\nThe whole scene of the entrance of Jesus into Jerusalem… gives us a hint in what manner Christ, for centuries together, will manifest Himself on earth until His second coming… Zechariah, confirms and attests this, in the words, “Behold thy King comes unto you, lowly…” a word that describes at the same time the idea of an entire absence of display, pomp, and dignity; and this is the attribute which is peculiar to His government to this hour.\n\nThe Kingdom of God advanced, in the days of Christ, with our Lord riding on the back of a donkey. The Kingdom advanced in lowliness and in unassuming ways. It did not advance by human wisdom and insight. It did not advance in any external attraction. \n\nIf it were left to men, the King would have ridden to power on a war-horse. But He didn’t. \n\nHe rode to the cross on the lowliest of animals. Lowliness and gentleness were the two personal attributes to which Christ appealed. When He called sinners to Himself, He did so by saying, “Come unto Me all you who labor and are heavy laden and I will give you rest; take My yoke upon you and learn of Me for I am gentle and lowly hearted and you will find rest for your souls” (Matt. 11:28-29).\n\nToday, as in the days of Christ’s earthly ministry, the Kingdom of God advances through God’s use of humble people who spread the knowledge of Christ through the proclamation of the King who was crucified for our sins. It continues to advance through the foolishness of preaching by weak individuals. It advances by unassuming means. \n\nGod’s Kingdom advances now as it did then—through humility. May we never forget this most important lesson from the life our Lord.\n\nWritten By Nick Batzig\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-instagram12.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 10:1-52, Isaiah 51:17, 1 Peter 4:13",
    "devo_title": "Two Kingdoms",
    "devo_summary": "\n\n                    \n\n                    Sometimes Jesus intentionally frustrates us. This is what He did with the Rich Young Ruler, who was trying to live in two kingdoms at the same time.\n\nThe Rich Young Ruler embodies everything our culture prizes: he is rich, young, and powerful. On top of that, he cares about spiritual matters and conducting himself in an upright way. He has life this side of the grave pretty well buttoned up. He is a devoted Jew—someone who knows and swears he upholds God’s Law. He is a good guy. His life is full of good things of his own making. And he knows it. In fact, he banks on it.\n\nBut something is bugging him. Something moves him to go to Jesus and say basically this: “I’ve done everything right. I’ve succeeded economically, socially, morally, and even religiously. Teacher, I’ve heard you are wise—and look, I even seek out wisdom. What I’m wondering is this: Is there something I’ve overlooked?” \n\nOf course there is something he has overlooked. We don’t ask questions like this unless there’s something nagging at us.\n\nHow does Jesus respond? He frustrates the man: “Here’s what you lack: sell all you have. Give it all to the poor and trust that your treasure will be in heaven. Then come follow me” (Mark 10:21, my paraphrase). In other words, Jesus is calling this man to lay down his entire approach to security.\n\nAt this, the young man walks away sad. Jesus’ counsel is too rich for his blood.\n\nWas Jesus just trying to show this man up? Humiliate him? No, that’s not Jesus’ way. In fact, our text tells us that when the young man asserted that he’d kept the Law of God since the time he was a boy, Jesus “looked at him and loved him” – a detail given to tell us this is exchange is not acrimonious (v. 21).\n\nJesus frustrates the man for the same reason He sometimes frustrates us—to show us how tight our grip is on the things of this world that have nothing to do with the next. It isn’t the young man’s wealth Jesus objects to. It is his need of that wealth.\n\nI love that we’re not told the rest of this story. Did the young man walk away sad, never to return? Or did Jesus’ words stick in him like a splinter, infecting his false sense of security until he came back to ask the Great Physician for help? We’re not told. But I know many people who found mercy and grace as a result of being frustrated by truth.\n\nWhere are you walking away sad from a confrontation with Truth? May the Lord use our sorrow to loosen our grip on anything we cling to for life that only leads to death.\n\nWritten By Russ Ramsey\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-instagram11.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 9:2-50, Philippians 1:15-18",
    "devo_title": "Jesus’ Glory Revealed",
    "devo_summary": "\n\n                    \n\n                    If the disciples have shown anything to this point in Mark’s Gospel, it is that they just don’t quite get who Jesus is. They say the right things. They even preached some sermons and did a few miracles. But they’re still missing it. So Jesus moves from subtlety (if you can call walking on water or feeding thousands “subtle”) to clarity. He shows His glory. Quite literally.\n\nOn the top of a mountain Jesus reveals a side of Himself to Peter, James, and John – His three closest friends – that no human being had ever seen. He “transformed in front of them” into a dazzling, magnificent, indescribable being and along side Him were Moses and Elijah, the two greatest prophets of Israel’s history. \n\nIn a moment, these disciples caught a glimpse of divine glory, and in that moment were given an understanding that Jesus was the beautiful fulfillment of all Moses, Elijah, and every other prophet had stood for. He was the embodiment of their prophecies, their leadership, their sacrifice, their message, and martyrdom. And if that was not enough for the terrified, overwhelmed disciples, suddenly a voice boomed from heaven, “This is my beloved Son; listen to Him!” God Himself glorified Jesus in that moment.\n\nCan you imagine what the trip down that mountain was like? What thoughts were the disciples having? Thoughts of power? Utter confusion? Certainty that Jesus would rise up and bring His kingdom to bear against Rome that very day? \n\nWe can’t know, but you can be sure that what happened when they arrived at the foot of the mountain was not what they expected.\n\nFirst, Jesus cast a demon out of a boy that nobody else had been able to cast out, showing His power over the forces of evil once again and in the process showing compassion for the fragile faith of the boy’s father. \n\nBut then Jesus did something decidedly un-glorious. He predicted His own death. He explicitly said He would be killed. That is not what glory looks like.\n\nAnd then He explained that the greatest must be the least, the servant of all. The greatest must become like a child. That is not what glory looks like either.\n\nExcept that it is. Glory, in God’s economy, looks like sacrifice and humility and servanthood. Jesus showed this throughout all of His life and death. What Jesus revealed on the mountain and in His life was the road to glory: humility leading to glorification. \n\nIn this life we are called to serve and sacrifice, and to do so at any cost so that we neither stumble nor cause another to fall. We are called to lay down our lives. This is the way to glory. This is the example of Jesus – the glorified Son of God.\n\nWritten By Barnabas Piper\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram101.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 8:1-38, Mark 9:1, 2 Samuel 7:14-16, Daniel 7:13-14",
    "devo_title": "Jesus the Messiah",
    "devo_summary": "\n\n                    \n\n                    I don’t really know what Peter was thinking when he confessed that Jesus was “the Christ.” Sometimes I read this story straight, like I did as a kid, and think that Peter and the rest were starting to get what Jesus’ disciples on this side of the empty tomb can see. But there are times when I read this story and all the unbelief surrounding his confession makes we wonder if he said it with a question mark in his mind.\n\n“We hope you are the Messiah. Please be the Messiah.”\n\nAll of chapter 8 really is a summation of the life of Jesus. Think about it. He feeds people miraculously. The Pharisees demand a sign because they do not believe Him. His disciples worry about having enough to eat in the wake of watching Him feed all those people with the equivalent of a Happy Meal. He heals a blind man. Peter makes the great confession of belief that Jesus is the Messiah they have been waiting for. Jesus foretells His death and resurrection for which Peter rebukes Him. There’s a lot in there.\n\nWhile Peter was right about Jesus being the Messiah, all the surrounding unbelief causes me to look sideways at his great pronouncement of faith. And to be fair, it causes me to look sideways at my own great pronouncements of faith too. I sometimes look at the religious world (the Pharisees) and the irreligious world (Herod) and, with great conviction, make certain pronouncements about my own faith and convictions – noble claims of wisdom and maturity.\n\nBut sometimes when I do, I look sideways at myself. Why do I do that?\n\nBecause for all my displays of confidence, when I’m down to one loaf of bread, I wonder how I’m going to eat. We have a nice house with a full pantry and a full fridge. Actually we have two refrigerators. And the second is for the overflow. \n\nThis fact alone makes me suspect that my version of unbelief believes that more than enough is not enough.\n\nThe disciples should have said, “We have one loaf of bread and the Messiah. And that is more than enough.” But they had forgotten how Jesus had provided sufficiently with so little before. One loaf of bread with Jesus is more than plenty.\n\nEven with all I have, I forget this. I look at the future and worry about my family, wondering if we have enough. What if things go bad and the pantry goes bare? It’s happened before. There was a time when we had so little we had to say, “all we have is…” But we knew we had the Christ. And we watched Him take care of us in some lean times.\n\nGrand pronouncements are great. But what I really need, and what you really, need is a faith that looks at what we have, no matter how much or how little, and says, “One loaf of bread and Jesus is more than enough.”\n\nWritten By Matthew B. Redmond\n\n \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram9.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 7:1-37, Jeremiah 17:9-10, Hebrews 8:6-7, Hebrews 8:10",
    "devo_title": "Jesus Interprets the Law",
    "devo_summary": "\n\n                    \n\n                    Robert Murray M’Cheyne declared, “It is not great talents God blesses so much as likeness to Christ.” \n\nThe greatest scholarship, prominence of position, even the ear of the multitude, are no proofs of the quality or genuineness of our witness. In fact, these are often simply the clever traps of the devil, who is quite practiced in ensnaring the hearts of men; he would supplant genuine Christ-likeness in exchange for a pseudo-righteousness built on human traditions.\n\nTo make matters more difficult, our own hearts are deceitfully wicked, and hypocrisy is perhaps the easiest of sins to fall into. John Owen, the great Puritan minister, once observed, “No man preaches his sermon well to others if he doth not first preach it to his own heart.” \n\nYet we are quick to ignore our own faults and find faults of others. We are prone to assume as faults those things which only disagree with our own pride, with our own faulty measure of righteousness. We hold in high esteem those who think as we do, those who tickle our ears, who make us feel high and holy, who praise our accomplishments. Desiring to justify ourselves, we elevate our own righteousness, and pass it off as God’s confirmation of our goodness, our worthiness, our fitness, because, after all, this position of wealth, influence, and respect I enjoy is because I’ve done something good. Right? \n\nOur hearts are deceitfully wicked. Like the Pharisees, we have a fine way of rejecting the commandment of God in order to establish our own traditions. Yes, and many such things we do (Mark 7:13).\n\nBut Christ does not measure by outward forms, by the appearance of righteousness, or even by the applause of many good believers. No. Instead, He declares: “From within, out of the heart of man, come evil thoughts, sexual immorality, theft, murder, adultery, coveting, wickedness, deceit, sensuality, envy, slander, pride, foolishness. All these evil things come from within, and they defile a person” (Mark 7:21-23).\n\nDo you see yourself in this list? I see myself. By Christ’s interpretation of the law, we are all weighed, measured, and found grossly wanting, for He searches the heart and tests the mind (Jeremiah 17:10).\n\nYes, our hearts are desperately sick (Jeremiah 17:9). Christ, therefore, bids us look to nothing else but Him. He alone does all things well. May we fall at His feet, and may Christ Himself open our eyes, our ears, and our hearts that we may draw near to Him.\n\nWritten By Caleb Faires\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-instagram8.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 2:17",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\n                    \n\n                    Memorizing Scripture is a way to carry God’s Word with you wherever you go, keeping God-breathed instruction, reproof, and truth in your heart and mind each day. This week, we’re memorizing a verse that summarizes the gospel:\n\nOn hearing this, Jesus said to them, “It is not the healthy who need a doctor, but the sick. I have not come to call the righteous, but sinners.”\n\n—Mark 2:17\n\nWrite this verse down, keep it in your wallet, post it on your mirror or at your desk — anywhere you will see it often. Save the image below as a lock screen on your phone so you can read the verse throughout the day.\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/4-HMark1.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Amos 4:13",
    "devo_title": "Grace Day",
    "devo_summary": "\n\n                    \n\n                    Take this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \n\nHe is here:\n\nthe One who forms the mountains,\n\ncreates the wind,\n\nand reveals His thoughts to man,\n\nthe One who makes the dawn out of darkness\n\nand strides on the heights of the earth.\n\nYahweh, the God of Hosts, is His name.\n\n—Amos 4:13\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram6.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 6:1-56, 2 Kings 2:11",
    "devo_title": "Belief and Unbelief",
    "devo_summary": "\n\n                    \n\n                    “I remember when you were just a little tyke! You used to cruise around this neighborhood on your bike and cause all sorts of trouble.”\n\nOne visit to the town you grew up in and you’ll hear something like this. It even happened to Jesus. The problem was that Jesus wasn’t just in town for the holidays; He was on a mission to save the world and He wanted to begin with those He knew and loved most. \n\nInstead, all He got was “Isn’t that Mary’s boy? I think He made me my end table a while back.”\n\nThe closeness of the people in Nazareth to Jesus blinded them to His identity. They could not hear the truth or power of His words, and He could not do any miracles there, because of their unbelief. All they could see was the son of the carpenter. \n\nSo Jesus gathered His twelve disciples and commissioned them to take His mission to other parts of Israel. And did they ever – preaching with power, seeing people repent, and even casting out demons in Jesus’ name.\n\nIt was a shame that the people of Nazareth missed out, but the story turns here. The mission is progressing nicely. Right? Well, about that…\n\nIn a remote place, Jesus preached to a crowd of 5,000 men and likely as many women and children. They are hungry; so He told His disciples, those same twelve, to feed the people and they panicked. “How can we? Should we spend half a year’s salary on food?” So Jesus miraculously provided. Only this time, it was the disciples who did not believe.\n\nHours later, as they sailed to their next stop through high seas and strong winds, Jesus came walking across the water toward them. When they panicked and cried out, “It’s a ghost!”, Jesus reassured them. Still, the disciples did not believe.\n\nIt’s easy to look at the people of Nazareth and shake our heads at their hard hearts. It’s easy for us to look at the disciples and tsk tsk just a little. How could they preach and perform miracles and still not believe? What we should see is ourselves. We should see our own blindness and unbelief and our own ability to overlook the great things Jesus has done. We, too, see miracles and brush them off or fail to understand. We see them in Scripture. We see them in our own salvation. Yet still we panic. We doubt. We wander.\n\nThankfully, Jesus provides and reassures and draws us close to Himself. He continues to reveal Himself to those seeking to believe, so that over time we truly can.\n\nWritten By Barnabas Piper\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-instagram5.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 5:1-43, Acts 9:39-41",
    "devo_title": "Jesus’ Authority",
    "devo_summary": "\n\n                    \n\n                    I’ve heard variations of this phrase since I was a kid, but I confess to preferring this one regularly used by the writer Mary Karr: All hat and no cattle. It refers to someone who’s all show—maybe a big Stetson, fancy boots, and a starched snap shirt. He looks the part, and may even sound the part. But when approached for help finishing up some ranch chore, you’d discover lickety-split that he doesn’t know squat about actual cowboying. There’s the appearance of authority, but when pressed, he’s all hat and no cattle.  \n\nMark 5 presents three instances of Jesus going all hat and all cattle—the appearance and authority. But in the case of Jesus, the appearance was not due to fancy boots or some external marker, but rather the sum total of His divine/human presence.\n\nIn all three episodes in this chapter, the main characters “see Jesus” and recognize that He’s no ordinary man. How did they know this? Well, I don’t know; the text says they simply did. But that’s not hard to imagine, right? We’ve all had the experience of someone walking into a room, and without saying a word their presence relays the message, “Here comes the boss.”\n\nFirst, Jesus frees a lonely man from a legion of demons, and sends that hell to the pigs, literally. The evil knew who Jesus was, and that He meant business when it came to liberating the captives. The next two instances are brief encounters Jesus has with a leader of men and a woman out of options. They, too, “saw Jesus,” and they were so taken with His magnificence that Jairus trusted Jesus simply to speak healing authority laden words, even from a distance, while the woman bet it all on being able just to brush against the robe that wrapped the Son of Man.\n\nThe authority Jesus carried in His human frame was something the world had never seen. In the case of Jairus’ daughter, Jesus raised that little girl from the icy grip of death. And in the case of the woman (whom Jesus addressed as “daughter”), Jesus raised her to stand upright, no longer shame-bent, but now whole and healed.\n\nIt’s not reflected in the text, but something tells me Jesus walked away from those three moments, and all the people said, “All hat and all cattle.” Why? Because that same power of presence draws people to Him still.\n\nWritten By John Blase\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram4.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 4:1-41, Amos 4:13",
    "devo_title": "Parables",
    "devo_summary": "\n\n                    \n\n                    I’m not much of a farmer. Never have been and probably never will be. But I did have a vegetable garden once. It was my family’s when I was a kid. My father would lead us along the winding path through the trees to a clearing in which we had built a small plot. Each season we’d enjoy its yield of zucchini, squash, lettuce, tomatoes, and a few spicy peppers. (We tried watermelon once, but I don’t think it ever produced fruit.)\n\nMaybe the warmth of those summers and the sweetness of those harvests has lead me to romanticize the farming life. Or perhaps I’ve just read too much Wendell Berry. Either way, my great-grandfather was a lifelong career farmer, and a handful of conversations with his side of the family has helped dispel the myth that the farm life is pure laid-back country bliss. It certainly has its perks and joys, but I’ve come to accept that it’s not “Green Acres” all the time. It’s a lot of hard work, sweat on your brow, and pain in your back.\n\nThis is not to diminish the goodness and richness of a life spent working the land, but rather to point out that, as a child, I experienced the joys of planting and harvesting with minimal effort beforehand or in between those two seasons.\n\nYou see, I never really saw all of the work that went into preparing the soil, or all of the effort spent by my folks as they weeded and watered and pruned. My parents did all the heavy lifting on the front end, and then my brothers and I had a lot of fun planting the seeds when the time was right. Same with the harvest. Our folks took care of the majority of daily maintenance while we kids experienced the joy of reaping rich fruit.\n\nI’ve heard the Parable of the Sower preached a variety of ways in my lifetime, usually with one of two emphases. The first asks the congregation to examine their hearts and determine what sort of soil they are; “are you the rocky soil?!” The second is typically a call to evangelism; “you need to be sowing those seeds!”\n\nI’ve always had a tough time with that second application. Not because I think it’s wrong, but because it’s difficult to live out, and even more difficult to know if it’s working or if you’re doing it right.\n\nHere’s the good news though: many times, the conversations you have with those around you are really acts of tilling and preparing the soil. You may not know it, and they may not know it, but the time and energy you’re investing will be realized later. This is all important work.\n\nIn Mark 4, Jesus is tipping off His followers that not everyone who hears the message is ready to receive it. And many who hear His words won’t be able to hold onto them. The good news for us is that we don’t have be able to know which soils are which. All we have to do is to be faithful to our calling. Sometimes this means tilling, sometimes it means planting. Other times it may mean harvesting.\n\nAs individuals, we do not carry the full weight of another’s conversion. We may share the gospel with someone for years and never see them come to faith in Christ. But that doesn’t mean our efforts are in vain. Perhaps we are the ones God has called to till the soil and help prepare it so that it can eventually receive and hold onto the word of God. \n\nWhether tilling, or sowing, or harvesting, we are called to be faithful. God will handle the rest. \n\nWritten By Andrew Stoddard\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-Instagram3.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 2:1-28, Mark 3:1-35, Hebrews 2:11-12",
    "devo_title": "Jesus Forgives and Heals",
    "devo_summary": "\n\n                    \n\n                    Don’t we all have a tendency to make ourselves look good? Aren’t we often the heroes of our own stories?\n\nI’ll come home and tell my wife about an interaction or altercation I had that day, and the whole point of the story is what a big dummy the other person is or was. If she starts to even barely insinuate that I might have done something wrong, I get defensive. I want to be the hero!\n\nAs we pull out of Mark 1 and into Mark 2 and 3, we start to see Jesus preaching, healing, and forgiving. He’s setting all things right. Jesus is about the work of the Kingdom, restoring broken creation to Himself. If you scan over chapters two and three, you see Jesus with a paralytic, a tax collector, the Pharisees, a man with a withered hand, a great crowd, the disciples, and His mother and brothers. What a great Savior in the midst of His people—all different types of people!\n\nWhere might you find yourself in that crew?\n\nLook at the first narrative, where several men bring their friend to Jesus through the roof of the house where He’s speaking. They’re committed. They’re full of faith. They’re a band of brothers. They are strong and resourceful, if perhaps not respecters of the property of others (since they destroy the roof). I naturally think of how I need to and want to bring others to Jesus like this.\n\nBut.\n\nBut what if I’m the paralyzed man? What if I’m the one depending on help? What if I’m the tax collector, someone who is despised? What if I’m most often a rule follower, someone who loves to argue with Jesus? I may call it asking a good question, but I’m suspicious of any answer He gives me that butts up against my preconceived theological and practical opinions.\n\nWhat if I am not the hero of my own story? What if I need healing and forgiveness? What if I need to follow Jesus, no matter where He leads me?\n\nThe good news is that the Son of Man forgives sins. He is the Great High Priest. He says I can be washed clean by His atoning sacrificial blood. I can be set free, and I can also be healed.\n\nHe’s calling us to Himself. But we won’t make it on our own merit. This must be His work. We’re sick. We’re malformed. We’re not the righteous. We’re sinners. We need His Word and His deeds, His parables and His miracles. We need the Great Physician. We need Jesus.\n\nThe good news of the gospel is that He is the hero of the story. Always.\n\nMay we learn to find our story in His.\n\nWritten By Doug Serven\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-instagram2.jpg"
  },
  {
    "book_title": " Mark",
    "devo_passages": "Mark 1:1-45, Nahum 1:15, Malachi 3:1",
    "devo_title": "Jesus’ Ministry Begins",
    "devo_summary": "\n\n                    \n\n                    Repent.\n\nHow does it hit you when someone tells you to repent? Is your first thought, “This is miserable. You mean I need to admit my faults in front of others and endure their disapproval?” Or is it something more like, “This is terrific! I’m being invited into a process of restoration, which my wayward heart desperately needs”?\n\nGospel repentance is always the latter. In Christ, the call to repent is always a call to enter into the joy of being restored.\n\nI bring this up because Jesus’ first statement in Mark’s Gospel is exactly that—a call to repent. “The time is fulfilled, and the kingdom of God has come near. Repent and believe in the good news!” (v. 15).\n\nWhat is He saying?\n\nIt’s a pretty audacious way to start. When Jesus stepped onto the scene, the first thing He did was essentially say, All of history has been waiting for Me to arrive. The Kingdom of God has stepped into your world in the form of a man. What you’ve needed most since the fall of man has come—Me.\n\nThen He says, “Repent and believe the gospel.” This is a twofold call—repent and believe. Let’s break that call down by starting with the second half first: believe the gospel. The word gospel literally means “news that brings great joy.” So Jesus’ implication here is that His message is “news”—something as yet unheard and unknown—which should draw from us a response of joy. What is that joy about? The first part of His call tells us: it is the joy of being restored.\n\nThe news that brings great joy calls us to repent, which is to recognize that we have reason to admit fault, confess sin and brokenness, and literally “reverse course.” \n\nThe gospel of Jesus Christ is a liberating insult to our pride. We are called, here at the start, to lay down our sin and arrogance, relent of our stubbornness and fear, and trust that repentance will not lead to condemnation, but to joy.\n\nIn Christ, this is what repentance is all about—entering into joy. The reason we repent is not to convince God to do something gracious so that we might come to know Him. It is because He already has. The Kingdom of God is at hand in Christ. The call to repent is always a call into the joy of the gospel that bears His name.\n\nWhat Jesus is telling us in His call to repent and believe in Him is that there is no other way to find the life we were made to live outside of a relationship with God, and that the only way to have that relationship healed, which is otherwise broken, is through faith in Christ. This is the message of Mark’s entire Gospel.\n\nYou were meant to live in right relationship with your Maker. The call to repent is the call to examine your heart before God and enter into the joy being restored to Him. So, hear that call. Examine yourself before Him. Repent. Believe. And read on.\n\nWritten By Russ Ramsey \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2016/08/HRT-Mark-instagram1.jpg"
  }
]