[
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 1:1-22, Exodus 2:1-25, Exodus 3:1-22, Exodus 4:1-31",
        "devo_title": "Chapters 1-4",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 5:1-23, Exodus 6:1-30, Exodus 7:1-25",
        "devo_title": "Chapters 5-7",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 8:1-32, Exodus 9:1-35, Exodus 10:1-29, Exodus 11:1-10",
        "devo_title": "Chapters 8-11",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 12:1-22, Exodus 13:1-25, Exodus 14:1-31, Exodus 15:1-27",
        "devo_title": "Chapters 12-15",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 16:1-36, Exodus 17:1-16, Exodus 18:1-27",
        "devo_title": "Chapters 16-18",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 19:1-25, Exodus 20:1-26, Exodus 21:1-36",
        "devo_title": "Chapters 19-21",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 22:1-31, Exodus 23:1-33, Exodus 24:1-18",
        "devo_title": "Chapters 22-24",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 25:1-40, Exodus 26:1-37, Exodus 27:1-21",
        "devo_title": "Chapters 25-4",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 28:1-43, Exodus 29:1-46, Exodus 30:1-38",
        "devo_title": "Chapters 28-30",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 31:1-18, Exodus 32:1-35, Exodus 33:1-23",
        "devo_title": "Chapters 31-33",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 34:1-35, Exodus 35:1-35, Exodus 36:1-38",
        "devo_title": "Chapters 34-36",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Exodus",
        "devo_passages": "Exodus 37:1-29, Exodus 38:1-31, Exodus 39:1-43, Exodus 40:1-38",
        "devo_title": "Chapters 12-15",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Leviticus",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Numbers",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Deuteronomy",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "1 & 2 Chronicles",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Ezra",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Psalm",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Isaiah",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Jeremiah",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Lamentations",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Ezekiel",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Philemon",
        "devo_passages": "",
        "devo_title": "Chapters ",
        "devo_summary": "",
        "img_url": ""
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 21:6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n\n                    \n\n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the key verse for the book of Revelation.\n\nThen he said to me, “It is done! I am the Alpha and the Omega, the beginning and the end.”\n\n—Revelation 21:6\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/4-HRTRevelation-3.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Psalm 113:1–3",
        "devo_title": "Grace Day",
        "devo_summary": "\n\n                    \n\n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nHallelujah!\n\nGive praise, servants of the LORD;\n\npraise the name of the LORD.\n\nLet the name of the LORD be blessed\n\nboth now and forever.\n\nFrom the rising of the sun to its setting,\n\nlet the name of the LORD be praised.\n\n—Psalm 113:1–3\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day20.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 22:1-21, Psalm 12:6, Ezekiel 47:1-12",
        "devo_title": "The Source of Life",
        "devo_summary": "\n\n                    \n\n                    There’s a phrase we use in our house often. My kids can recite it by heart. It first came about when my son asked me if Indiana Jones got crushed by the giant boulder. He had never seen Raiders of the Lost Ark, a problem I remedied as quickly as possible. But he knew Indy had to run from a boulder, and he wanted to know how that ended. I refused to tell him, saying he needed to discover that on his own. He said, “Why won’t you just tell me?” My answer, and the phrase we’ve all since memorized, was this: “Let the storyteller tell the story in the way they want to tell it.”\n\nIn other words, let’s not spoil the ending. Let’s get there honestly. Let’s let others do the same. If you jump to the ending, you may discover what happens, but you will have missed so much of the context for why it matters.\n\nHere we are, in the last chapter, not only of Revelation, but of the entire Bible. Revelation 22 tells us that Jesus is coming again, and soon (vv.7,20). With that promise comes a call for believers to “keep the words of the prophecy of this book” (v.8). Those two details carry so much importance in light of the context of the book of Revelation, and the whole of Scripture. How so?\n\nJesus is coming again. When we go all the way back to the beginning of the Bible, we find God at work creating everything we know and calling it good. We see Him make mankind in His image, and we see humanity rebel against Him. Then we hear the clink of the flaming swords of Eden as our first parents are cast out of the garden. What follows is an ongoing struggle between God and His people. Will we ever be reconciled? Will that reconciliation be the kind that lasts? Revelation 22 reveals the answer: Yes.\n\nUntil that day, we are to “keep the words of this book” (v.9). What will God’s reconciling work in Christ look like? Will it be empty tolerance, or intimate affection? The call to obey Scripture reassures us that God’s eternal plan for His people is one of relational intimacy. We are not merely tolerated by God. We are loved. We are kept. We will live in an ongoing eternal relationship with Him, and in this life, we practice the life to come by seeking to live according to the Word of our God, who does not change.\n\nThis is how the Storyteller has told the story. We are called to persevere in obedience and live in light of the reality that Jesus is coming back, knowing that when He does, it will be as a Bridegroom coming for His Bride. And all will be well. Forever.\n\n“Amen! Come, Lord Jesus!” (Revelation 22:20).\n\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day19.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 21:1-27, 1 Corinthians 15:42-49, Colossians 3:1-4",
        "devo_title": "The New Creation",
        "devo_summary": "\n\n                    \n\n                    Do you watch Jeopardy? You know, it’s the quiz show where the answer is provided, and the contestant’s job is to guess the question. Let’s play.\n\nAnswer: “Then the one seated on the throne said, ‘Look, I am making everything new’” (Revelation 21:5).\n\nQuestion: What has the entire story of Scripture been building up to since the garden of Eden and the fall of man?\n\nThis might just be my favorite verse in the entire Bible, when John writes about the loud voice he hears from the throne of heaven proclaiming the renewal of all things. When the One seated on the throne—the risen Jesus—says that He is making all things new, He is addressing the undoing of all that was lost when our first parents turned away from God in Eden. He is proclaiming the reach of His redemptive work. He is celebrating the power He alone wields. And He is giving those who believe in Him the greatest assurance we could ever hope to hear—that every struggle, weakness, grief, and cause for suffering will be done away with, once and forever.\n\nI read an article the other day where a seminary president said it wasn’t necessary to believe in a literal bodily resurrection, and that the purpose of Easter was to inspire us all to be better people to one another. What an empty take on the finished work of Christ. And what a tragic omission of the testimony of Scripture. John’s vision in Revelation is far from metaphorical. Sure, some of the imagery carries metaphorical meaning, but the end of the story is anything but metaphor. Everything will be made new. The old order of things will pass away. Forever. For real.\n\nOne of the marks of this new creation will be the presence of Christ Himself in the middle of it all. He will be the light, the ruler, the King. This will not be a metaphorical presence, but the most vivid, actual, tangible presence any of us has ever known. How it will all work is veiled in mystery, but what the book of Revelation labors to make plain is that when Christ ushers in His eternal kingdom, it will be real, eternal, glorious, and perfect.\n\nAnd it will be the perfect conclusion to the unfolding drama of the human story—the fall of humanity undone by the finished work of Christ. On that day, all of God’s people will be restored to face-to-face relationship with our Creator God, the one we were meant to know and enjoy forever. This is what’s coming. To God be the glory.\n\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day18.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 19:1-21, Revelation 20:1-15, Isaiah 25:6-9, Isaiah 54:5-7, Ephesians 5:25-27",
        "devo_title": "Celebration in Heaven",
        "devo_summary": "\n\n                    \n\n                    I am a pastor, and every week in our church we come to the communion table. Though I sometimes feel an internal pressure to try to keep my words fresh and the invitation to the table interesting, I find that I return to a few key ideas that I express in roughly the same way every week. One of those truths comes from today’s text.\n\nAs we prepare to rise from our seats to come forward to receive the bread and cup, I remind the congregation that this table won’t last forever. One day, the communion table will become a relic of a bygone era—something we used to do. Why? Because of what we read in Revelation 19:6–10. The communion table will be replaced by the marriage supper of the Lamb. Instead of a single bite and tiny sip, a feast will spread out before us. Instead of having our appetites awakened by the tease of the bread and cup, we will have our appetites satisfied by an unimaginable banquet spread, never to hunger again.\n\nThe host of the meal will be the same—Christ Jesus. And the people gathered around the table will also be the same—all believers everywhere. But the nature and meaning of the meal will shift, or maybe a better way to say it is that it will reach its fulfillment.\n\nChristians are a people in waiting, a Bride expecting the final return of the Bridegroom. Now we gather in worship, come to the communion table, and pray as our Lord taught us: “Your kingdom come, Your will be done on earth as it is in heaven” (Matthew 6:10). But one day, Christ will come, and His return will kick off a wedding feast the likes of which this world has never seen.\n\nThe Church is the Bride, and because of Christ we are clothed in purity, with nothing held against us, nothing preventing us from looking our Redeemer fully in the eye. It is difficult—no, impossible—to fully imagine His coming glory from where we’re sitting now. But when John heard the angel describe it, he fell down in awe. Imagine what it will be like in person!\n\nThe communion table is not the only thing that will reach the end of its usefulness. So will our wandering, our duplicitous hearts, our finicky appetites, and our wavering devotion. We will be changed, draped in the glory of Christ, and given a place in His eternal presence as His beloved. If you are a believer in Christ, there is no reality more certain than this.\n\nWritten by Russ Ramsey\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day17.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 18:1-24, Isaiah 52:11, Jeremiah 51:47-50 ",
        "devo_title": "The Fall of Babylon",
        "devo_summary": "\n\n                    \n\n                    In the fall of 2008, I was a senior in high school applying to colleges and looking for scholarships. Right before Christmas, I decided to attend a private Christian college near my hometown instead of a public state university a few hours away. I knew that the Christian college was going to be a lot more expensive, but my parents said that as long as I earned enough scholarship money, they would be able to afford it.\n\nThen, in January 2009, just a few months after I’d decided to attend the expensive school instead of the more cost-effective one, my dad lost his job. He had worked at IBM for more than 25 years. Why did a manager at one of the top companies in the world lose his job in 2009? The same reason a lot of his peers did: the Great Recession.\n\nThe recession of 2008–2009 affected the lives of millions of Americans. Over the course of the recession, nearly nine million Americans lost their jobs, and about 818,000 of them lost their jobs in a single month—January 2009, when my dad lost his.\n\nThe Great Recession showed America and the world that even the biggest companies can be toppled by forces beyond their control. No one is untouchable. Revelation 18 reminds us of a similar truth. Even the greatest worldly powers will not stand against the rule and reign of Almighty God when all is said and done.\n\nThe prostitute in Revelation 17 is now called “Babylon the Great” here in Revelation 18. And it is in this chapter that John tells us of her demise. He says, “Then I heard another voice from heaven: ‘Come out of her, my people, so that you will not share in her sins or receive any of her plagues. For her sins are piled up to heaven, and God has remembered her crimes’” (vv.4–5).\n\nRegardless of what we may believe about the literal meaning of Babylon the Great, this principle is true: the fall of Babylon shows us that even the strongest, most powerful worldly structures will crumble and fall at the feet of Jesus.\n\nBabylon opposed the work of Christ in the world. In human terms, Babylon seems impenetrable and all-powerful. Yet, when God pours out His wrath, even this seemingly invincible entity cannot bear the weight.\n\nWe must resist the temptation to seize power and control in the world around us as an act of disobedience to God our Father. In our sin, we will be tempted to build our own empires in our lives, ones we want to rule apart from, and therefore in opposition to, the rule and reign of God. But no system we create, business we launch, or family we grow is more important than the family and mission of God.\n\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day16.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 17:1-18, Psalm 90:1-17, 1 Timothy 6:11-16 ",
        "devo_title": "The Woman and the Scarlet Beast",
        "devo_summary": "\n\n                    \n\n                    “These will make war against the Lamb, but the Lamb will conquer them because he is Lord of lords and King of kings. Those with him are called, chosen, and faithful” (Revelation 17:14).\n\nPower is our ability to make change, to make a difference, for good or for bad. In the wrong hands, it can be dangerous, even deadly. But if the one wielding power is good, trustworthy, and just, incredible things are possible. In his book, Playing God, Andy Crouch states that power is “both better and worse than we could imagine… Power, the truest servant of love, can also be its most implacable enemy.”\n\nAs human beings, we often crave power, because with power comes control. With control comes the ability, or, perhaps more appropriately, the illusion of the ability to determine our life’s outcomes. We believe a lie that says the more power we acquire, the more likely we are to achieve our own idea of success, whatever that may be. The problem is, seizing power to yield success doesn’t ever work out the way we think it should. Our sinful hearts want to hijack that power for our own gain, however pure we believe our motives. Revelation 17 shows us how this story ends.\n\nWithout getting caught up in the identity of the prostitute, the beast, or the meanings of their descriptions. What’s important for us to take away from Revelation 17 is this: Worldly power is dangerous, and our pursuit of it can lead to our ultimate destruction. Too often, our pursuit of power is rooted in selfish purposes.\n\nWe want power to gain money.\nWe want power to gain control.\nWe want power to make life easier.\nWe want power to gain fame.\nWe want power to benefit ourselves instead of others.\n\nGod demonstrated His power by sending His Son to die for us. The most powerful action in the history of the universe is seen in Jesus’s death and resurrection. He took the throne by dying, not killing.\n\nOur understanding of how power is acquired and our reasons for wanting it are both warped by our sin. If we pursue power for ourselves through worldly means, it will be our destruction. By “winning” in this way, we will inevitably lose. Worldly power is fleeting and dangerous. But one day Jesus, the Lamb, will conquer all rulers and kingdoms, and His followers will share in His victory. It is through our weakness that Christ’s perfect power is realized (2 Corinthians 12:9–11). It is in His victory that we, too, are victorious. “To him be honor and eternal power. Amen” (1 Timothy 6:16).\n\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day15_.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 16:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n\n                    \n\n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize a reminder of God’s power and justice.\n\nYes, Lord God, the Almighty,\n\ntrue and just are your judgments.\n\n—Revelation 16:7\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/4-HRTRevelation-2.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Psalm 107:1-3",
        "devo_title": "Grace Day",
        "devo_summary": "\n\n                    \n\n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nGive thanks to the LORD, for he is good;\n\nhis faithful love endures forever.\n\nLet the redeemed of the LORD proclaim\n\nthat he has redeemed them from the power of the foe\n\nand has gathered them from the lands—\n\nfrom the east and the west,\n\nfrom the north and the south.\n\n—Psalm 107:1–3\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day13.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 15:1-8, Revelation 16:1-21, Exodus 15:1-18",
        "devo_title": "The Seven Bowls",
        "devo_summary": "\n\n                    \n\n                    This time of year always reminds me of the Memorial Day Weekend tornado that hit my Northeast Indiana hometown when I was a kid. Spring and summer brought severe weather to the area from time to time. I remember this tornado because it was one of the only tornado warnings that led us to go to our basement for cover. We were often warned about tornadoes in the springtime, but rarely did those warnings result in an actual tornado on the ground anywhere near our house. This one, however, touched down on one of the major thoroughfares in our small city, about five miles away from my house. It was for real, and the sky was as black as I have ever seen it. I remember looking out my front door toward the direction of the tornado before we shuffled down into the basement.\n\nTornadoes always make me think of the wrath of God. We don’t see any explicit examples of God using tornadoes in the Bible as a demonstration of His wrath, but we see plenty of examples of Him demonstrating His lordship over creation by how He pours out His wrath on the rebellious. Revelation 15–16 gives us some of the clearest biblical examples this.\n\nIn chapter 15, John describes a vision in which he sees a group of seven angels with the last seven plagues, through which the wrath of God will be completed (v.1). In addition to those angels, John sees “those who had won the victory over the beast… standing on the sea of glass with harps from God” (v.2). They sang a song to God, telling of His holiness and declaring that all nations will one day come and worship Him. Then out of the temple came the seven angels with the seven plagues in seven bowls, representing the ways God would pour out His wrath on the wicked for a final time.\n\nThe message of chapter 16 is clear: those who worship anyone but Yahweh will experience the wrath of God. One day, when His wrath is complete, “all the nations will come and worship before [Him]” when His righteous acts are revealed (v.4).\n\nGod’s righteous wrath displays His majesty and power, and He justly pours it out on all who have rebelled against Him in their worship of other gods. Inherent in each one of us is the desire to worship, but we are too easily satisfied by worshiping something or someone other than God. This sin separates us from the Lord, and it condemns us to experience His wrath instead.\n\nBut the story doesn’t end there.\n\nGod’s majesty is also on display in the tremendous sacrificial love He has shown us in the sacrifice of His Son. By sending His Son to live the perfect life we couldn’t live, die the death we deserve to die, and rise from the dead, God’s majesty is displayed in His gracious deliverance of His people. When we trust God and believe that our salvation relies completely on the finished work of Christ and not our future obedience, we are rescued from the wrath of God and freed to live in His presence. Thanks be to God!\n\nWritten by Chris Martin\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day12.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 14:1-20, Psalm 107:1-3, Hebrews 12:18-24",
        "devo_title": "The Proclamation of Three Angels",
        "devo_summary": "\n\n                    \n\n                    Revelation 14 is a chapter of extremes. It opens with the Lamb standing on Mount Zion with 144,000 men, pure and undefiled, and it ends with God’s enemies being judged, their mingled blood rising to the level of a horse’s bridle for a hundred and eighty square miles. Revelation is a book of symbols and metaphors, so it may be that John’s visions have been painted with a broad brush intentionally. We don’t necessarily have to take every word as a literal depiction of events that have unfolded or may yet unfold.\n\nFor example, there is nothing in Scripture that requires perpetual virginity in order to be considered clean before God, yet the 144,000 are said to be “ones who have not defiled themselves with women, since they remained virgins” (Revelation 14:4). It could be that virginity is being used as a symbol of devotion to God, something that we should all strive for, regardless of our marital status. The number 144,000 is also likely to be emblematic, since it’s the sum of twelve times twelve times a thousand. Twelve is the number of tribes in Israel and also the number of Jesus’s apostles, and a thousand is often used in Scripture to signify vastness. In addition, it is unlikely that the judgment of the wicked will take place in an actual winepress.\n\nReading this chapter through, I am struck by how perfectly understandable it all is, despite it being about as clear as mud! What I mean is that even though all the details are mysterious and perplexing, I know exactly where everyone stands. The 144,000 are followers of Jesus, faithful and true. And the grapes harvested and crushed in the winepress of God’s wrath? They’re those who have rejected Christ, who have delighted in wickedness and scoffed at the gospel of peace.\n\nIt’s fitting that between these two portions of Scripture there is a gospel proclamation delivered by an angel: “He spoke with a loud voice: ‘Fear God and give him glory, because the hour of his judgment has come. Worship the one who made heaven and earth, the sea and the springs of water’” (v.7). This angel is followed by two more: one with a declaration of Babylon’s destruction (v.8) and another with a summary of the punishment that will befall all those who worship the beast and take his mark (vv.9–11). There is God and life in the one hand, the beast and death in the other. Despite the confusion that surrounds the symbolism of this chapter, the angels have made the choice before every person quite clear.\n\nThis same decision stands in front of all the complex issues we face—theological, social, political, and everything in between. Before we answer any other questions, we must answer the most important one: Whose side am I on? The answer to that question will inform all the others, and it’s one we must continue to ask ourselves. It’s no wonder one of the angels says, “This calls for endurance from the saints, who keep God’s commands and their faith in Jesus” (v.12). Brothers, let us endure, for the way we answer this most important of questions has the power to shape every minute of every day for the rest of our lives.\n\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day11.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 13:1-18, Proverbs 1:7, Hebrews 10:32-39",
        "devo_title": "The Beast from the Sea and the Beast from the Earth",
        "devo_summary": "\n\n                    \n\n                    A much older friend once told me that when barcodes and checkout scanners were first introduced, she abandoned an entire shopping cart full of groceries at the front of the line and walked out of the supermarket. Back then, she was deeply engaged in popular end-times theology teaching and when she saw the new scanning technology being used, she feared it might somehow be related to the mark of the beast mentioned in Revelation 13:18.\n\nMy friend smiles at this today, as UPCs have become commonplace and proven themselves to be an innocuous bit of technology that saves us all time at the checkout counter. Even so, for centuries the mysterious reference to the mark, or number, of the beast has left Bible readers scratching their heads.\n\nMany people have tried to crack the code of six-sixty-six by calculating the names of various world leaders using numbers as stand-ins for letters. Others have seen the number as purely symbolic, representative of evil and chaos. One thing is for certain, the beast from the sea and the beast from the earth described in Revelation 13 are not our friends. They are in league with Satan himself and are intent on bringing harm to humanity.\n\nOne of the ways they do this is by deceiving people into worshiping the first beast (Revelation 13:8,12). The second beast is even said to perform “great signs, even causing fire to come down from heaven to earth” (v.13). If you’re familiar with the Old Testament book of 1 Kings, you’ll recognize that Elijah called down fire from heaven in his showdown with the prophets of Baal (1 Kings 18:30–40). At the time, the falling fire was a sign that Yahweh alone was God. But here in Revelation, it is a false prophet who calls down fire from heaven to “prove” the beast from the sea is worthy of worship. It’s no wonder people are deceived!\n\nAs John writes, “This calls for endurance and faithfulness from the saints” (Revelation 14:12). To stand strong in the midst of such deception, we must be anchored in the Word of God. We need to know the truth so we don’t fall for a lie when it is wrapped in persuasive arguments or false signs and wonders. That’s why it’s so important to be students of the Bible—not just for a season or when it fits into our busy schedules, but every day and for the rest of our lives.\n\nWe must be immersed in the truth, going deeper and wider all the time. It’s the only way to cultivate a discerning mind in a world bent on drawing us away from Christ. As an added benefit, being rooted in God’s Word will keep us from falling for every end-times fad, whether it’s an updated take on a Y2K scenario, mysterious Bible codes, or the barcode on the bottom of your cereal box.\n\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day10.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 12:1-18, Genesis 3:1-15, Colossians 2:13-15",
        "devo_title": "The Woman, the Child, and the Dragon",
        "devo_summary": "\n\n                    \n\n                    “There weren’t any dinosaurs at the manger,” my four-year-old, Jonah, argued. His younger brother Jude had begun mixing random toys into our VeggieTales nativity set, including one mean-looking stegosaurus. I didn’t have the heart to tell Jonah there probably weren’t any talking cucumbers in Bethlehem either.\n\nRevelation 12 doesn’t offer us a typical Christmas scene, but the chapter does include the birth of Christ, and there’s even a dinosaur—er, dragon. John sees a sign in the sky: a woman about to give birth and a fiery red dragon waiting to devour her Child. Clues in the text invite us to see the woman as Israel, the sun, moon, and stars being an early image of God’s people (see Genesis 37:9–11). The Son born to the woman is Jesus, the Messiah. The iron rod is the clue there (see Psalm 2:6–9). Finally, there is the dragon, whom John identifies as “the ancient serpent, who is called the devil and Satan, the one who deceives the whole world” (Revelation 12:9).\n\nJesus’s birth, life, death, resurrection, and ascension unfold quickly—so quickly in fact that a lot of readers miss it (see v.5). Unlike in the Gospels, the Revelation account of Jesus’s ministry is focused not on earth, but on what took place in the unseen realm.\n\nJesus paid the price for our sins on the cross, and when He walked out of the empty tomb on Easter morning, He triumphed over death. He did these things for us—on our behalf. As a result, the devil no longer has any claim on God’s people, no reason left to accuse us. We have been justified, made clean, forgiven. The price has been paid. As a result, Satan lost his place as prosecutor in God’s heavenly court (vv.8,10). Therefore, the archangel Michael and God’s angel armies waged war against the devil and his angels, and threw them down to earth. Satan has now been forced to change his strategy—from accusing God’s people to waging war against them (v.17).\n\nThat sounds like bad news at first, doesn’t it? We have an enemy who’ll stop at nothing to destroy us. But that’s not the way John frames it. In the middle of the action he includes a victory cry from heaven:\n\n“The salvation and the power \nand the kingdom of our God \nand the authority of his Christ \nhave now come, \nbecause the accuser of our brothers and sisters, \nwho accuses them \nbefore our God day and night, \nhas been thrown down” (Revelation 12:10).\n\nJesus has defeated Satan. Good has triumphed over evil. It’s the end of the story we’ve been waiting for. Only it isn’t the end.\n\nYou and I live between this great victory and the final battle, after which Satan will be thrown into the lake of fire (20:10). But we have been given this glimpse behind the veil separating heaven and earth so that when we hear the forces of evil roar, we might remember all is not lost. In fact, everything—absolutely everything—has been won, because of what Jesus accomplished. Satan’s time is short (12:12), and our redemption is near.\n\nWritten by John Greco\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day9.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 10:1-11, Revelation 11:1-19, Psalm 2:1-12, Daniel 2:36-44",
        "devo_title": "The Seventh Trumpet",
        "devo_summary": "\n\n                    \n\n                    Don’t put all your eggs in one basket.\n\nThe idiom is familiar to most of us, as is its meaning: if you depend completely on one thing and that thing doesn’t work out, then you’ve lost everything. The worldly wise spread things around a little—a single egg in this basket, two eggs in that one, a half dozen in this one over here. That way, if something goes wrong—and something usually does go wrong—you’ve got other eggs to fall back on, so to speak.\n\nMakes sense, doesn’t it? And so we diversify everything from our portfolios to our allegiances. A little faith in family and friends over here, and then maybe a little in politics over there. It just makes sense, except when it comes to God and His kingdom. As the apostle Paul reminds us in 1 Corinthians 3: “For the wisdom of this world is foolishness with God” (v.19).\n\nGod’s Word is clear. One of these days, one that is definitely not confined to our timetables, there will be a sudden realization, when “the kingdom of the world has become the kingdom of our Lord and of his Christ, and he will reign forever and ever” (Revelation 11:15).\n\nEverything we just knew was so certain and secure, like nations and kingdoms and political leaders and princes, will be revealed to have been temporary. Their power and rule, which often feels so comprehensive to us, is only effective here and now. Their power has boundaries, like the edges of one of our egg baskets. The kingdom of God, on the other hand, encompasses both heaven and earth. It knows nothing of boundaries or baskets. In fact, when it comes to all the plans of the rulers of the kingdoms of this earth, the psalmist shocks us by writing that “the one enthroned in heaven laughs” (Psalm 2:4).\n\nWhen it comes to something like our financial eggs, for example, yes—it is wise to diversify. But when it comes to our loyalties, true wisdom means placing our faith in the King who will reign forever. Until His kingdom comes in its fullness, we are to “serve the LORD with reverential awe and rejoice with trembling” (Psalm 2:11).\n\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day8.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 7:10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\n\n                    \n\n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the proclamation of the multitude in white.\n\nSalvation belongs to our God,\n\nwho is seated on the throne,\n\nand to the Lamb!\n\n—Revelation 7:10\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/4-HRTRevelation-1.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "1 Corinthians 15:54-57",
        "devo_title": "Grace Day",
        "devo_summary": "\n\n                    \n\n                    Use this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nWhen this corruptible body is clothed with incorruptibility, and this mortal body is clothed with immortality, then the saying that is written will take place:\n\nDeath has been swallowed up in victory.\n\nWhere, death, is your victory?\n\nWhere, death, is your sting?\n\nThe sting of death is sin, and the power of sin is the law. 57 But thanks be to God, who gives us the victory through our Lord Jesus Christ!\n\n—1 Corinthians 15:54–57\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day6.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 8:1-13, Revelation 9:1-21, 1 Peter 3:8-12, 1 Corinthians 15:51-52",
        "devo_title": "The Trumpets",
        "devo_summary": "\n\n                    \n\n                    I was raised the first-born son of a Southern Baptist preacher. There was a memorable season in my boyhood when my father preached through the book of Revelation, chapter by chapter, verse by verse. This undertaking was no doubt spurred on by questions his congregation had regarding some popular writings of the era, the 1970s. I remember him delivering passionate sermons backdropped by a huge timeline chart on the wall, which gave structure to the events of the last days.\n\nWhen I was a boy, I thought as a boy. So most of what I remember of that time is my father’s physical presence behind a pulpit and the incredible imagery of this final book of the Bible. My mind was captured by visions of blood reaching up to a horse’s bridle, seals opened and trumpets blasting, lakes of fire—to name a few. And then there’s this:\n\n“The smoke of the incense, with the prayers of the saints, \n\nwent up in the presence of God from the angel’s hand” (Revelation 8:4).\n\nAnd while my father had a particular interpretation of it all, the most important thing impressed upon me was the need to make sure I was on God’s side in the apocalypse. The alternative, to my boy’s mind, was chilling.\n\nToday, I look at the book of Revelation a bit differently than my dad did back then. But the impression he made on me? I remain held in its grip to this day. I confess I do not understand all that’s going on in John’s vision. Some of it is possibly historical, some possibly literal, some no doubt figurative and poetic, and some of it yet to come to pass. All of it remains quite chilling.\n\nRegardless of how you approach this book, it’s difficult to deny that everything in the vision moves toward a clear loser and clearer winner. The revelation is God Himself, and here’s the good news: He wins. And here’s one impression we should each walk away with: our only hope—quite literally, in the culmination of all things—is Jesus. It is good to ensure we are on God’s side, not just in the already-has-been or yet-to-come apocalypse, but also in the very real right here and now. And right now, “the eyes of the Lord are on the righteous and his ears are open to their prayer” (1 Corinthians 15:52). While we wait for His return, we have His ear, His attention. But does He have our hearts?\n\nFor we know the rest of the story: God wins. The trumpet will blow. And in a moment, in the twinkling of an eye, at the last trumpet… we will be changed” (1 Corinthians 15:51–52).\n\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day5.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 6:1-17, Revelation 7:1-17, Psalm 13:1-6, Ephesians 1:11-14",
        "devo_title": "How Long, O Lord?",
        "devo_summary": "\n\n                    \n\n                    One click. That’s all it takes, and what I want (maybe even need) will be delivered to my doorstep. How long will this take? Two days. Forty-eight hours. Even sooner, if I’m willing to pay a little more. This option exists for almost any item imaginable, from roller ball pens to car batteries to groceries. The latest app trends for takeout aren’t just for fast-food but also restaurant fare, delivered right to my door. And how long will this take? Some services have set the bar at less than twenty-eight minutes—just 1,680 seconds. That’s crazy fast. But that’s the world we live in today.\n\nFifty-eight. That’s the number of people killed in the Las Vegas shooting in 2017. Remember that one? Add to that number the ongoing death and suffering of school shootings, natural disasters, disease and sickness, hunger and poverty, wars and rumors of wars—the tally is overwhelming. We look for something to click, some app to engage with to bring quick relief from the reality of pain, all the king’s horses and men—but there’s nothing. That’s also the world we live in. If we’re honest, it’s gotten a little old; the numbing feels empty. And still we cry, “Lord, how long…? Forever?”\n\nIt’s hard to hold on to hope in these competing worlds. The easy way out, the broad road? Give in to the one-click reality and numb ourselves as much as possible with whatever we can get. But the narrower way—the way that leads not just to a fix here and there, but to the full redemption of all things, including us—that’s what I call one-day living. It requires a dogged patience and trust in the Lord’s promises that one day, He will make all things right. One day…\n\nThey will no longer hunger;\nthey will no longer thirst;\nthe sun will no longer strike them,\nnor will any heat.\n– Revelation 7:16\n\nThat is not the world we live in right now. But it is the world that is coming. We need patience as we await our full redemption, but it’ll be worth the wait. How long will this take? That’s God’s call. Ours is to keep faith and to wait until we see.\n\nWritten by John Blase\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day4.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 4:1-11, Revelation 5:1-14, Isaiah 6:1-6, Ezekiel 1:26-28",
        "devo_title": "The Lamb Is Worthy",
        "devo_summary": "\n\n                    \n\n                    I love when it’s my birthday, but I don’t love when it’s time for everyone to stare at me and sing. What am I supposed to do? Sit there and soak in the awkwardness? Make a joke? Sing along? That small moment of super-concentrated attention is just too much. It’s odd to have everyone focused on you and singing to you, about you, for you. But it’s not odd for Jesus.\n\nThe angels and elders singing to Jesus, about Jesus, and for the glory of Jesus is exactly what Jesus deserves. This moment in Revelation isn’t too big for Him; He is worthy of it and so much more.\n\nThe apostle John sees what we need to see and believe again and again: Jesus is worthy of all praise, glory, honor, blessing, and power. He is worthy of it all, and He deserves it from all people. Many people are fine saying that Jesus is worthy of affirmation and honor, on the same level as other religious teachers. Revelation 4–5 says otherwise. Jesus is worthy to reign over the universe, bring history to its conclusion, and usher in the new heavens and the new earth. He is worthy of all that is worthy of God.\n\nAnd there’s more we need to see here.\n\nJesus is worthy of receiving glory, praise, and honor from us, brothers. Right now. Today, tomorrow, and for the rest of your life on into eternity. Jesus is worthy. Give Him praise. He was slaughtered for your sins, rose in victory, and loves you relentlessly. Anything you detect in your life that is dishonoring to Christ, repent of it today. Turn from it. Relent and give honor to Christ.\n\nWe may believe that Jesus is worthy, but do we live like we know it is true? All hail the Lamb who takes away our sin!\n\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day3.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 2:1-29, Revelation 3:1-22, Matthew 22:34-39 ",
        "devo_title": "The Seven Churches",
        "devo_summary": "\n\n                    \n\n                    Our ideas for what church should be like should not be trusted. At least not totally. We can dream up all kinds of helpful strategies, plans, and programs, but we cannot overlook the all-important question: What does Jesus want for His Church? Today’s reading points us in the right direction.\n\nJesus dictated these letters to John and wanted them sent to the actual churches in these actual places in Asia Minor. And they stand today as ever-relevant words from Jesus about what He wants in all of His churches—in every place, every time, every nation.\n\nWhen we think about the kind of church we want to be a part of, what Jesus says in these seven letters should inform our search criteria. As we serve in our local churches, these letters offer the vision we should have for our churches. Jesus’s plan for His Church is far more significant than any conference, book, or pastor’s five-year goals. Jesus bought the Church with His own blood. Your church is His Church.\n\nSo what does Jesus want us to be?\n\nChrist wants Christ-centered churches (Letter to Ephesus). He wants churches that will endure the pressure and persecution from the surrounding culture (Letter to Smyrna). He wants churches committed to sound, healthy, biblical doctrine (Letter to Pergamum). The Lord wants churches that don’t minimize sin and worldliness (Letter to Thyatira). The risen Christ wants churches that avoid hypocrisy like we avoid the slow lane on the highway (Letter to Sardis). Jesus wants His churches to hold fast in ministry and endure till the end (Letter to Philadelphia). And finally, Jesus wants His Church to be a repenting Church, one that constantly returns to Him (Letter to Laodicea).\n\nThese letters are given to specific churches, but they are also for all churches, for all time. That’s why Jesus said, “Let anyone who has ears to hear listen to what the Spirit says to the churches” (Revelation 2:29). He wants us to listen, to learn, to repent and turn back to Him, our first love (v.4).\n\nWritten by J.A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day2.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Revelation 1:1-20, 1 Corinthians 15:54-57, 1 Thessalonians 4:13-17\t ",
        "devo_title": "The Living One",
        "devo_summary": "\n\n                    \n\n                    Imagine the smell of diesel smacking on concrete. Remember a time you opened the lid to your grill and the heat cocooned inside slammed into your face. (You probably lost some arm hair too.) Think about that one thunderclap you heard, then felt, in the middle of the night. These events and the vision of Jesus in Revelation chapter 1 all have something in common.\n\nPower. Awe. Fear.\n\nThe apostle John’s vision, also known as the Revelation of Jesus Christ, kicks off with exactly that: a vision of Jesus Christ. But this experience of Jesus is different than the one that prompted John to write the Gospel that bears his name. This vision of Jesus is cranked to eleven—eleven-hundred volts of power and glory.\n\nRevelation opens with a picture of Jesus that should wake us up, jolt us. It ought to make us sit back in awe and lean forward in thanksgiving. The one whose eyes are like a flame of fire (all-seeing), the one who has a sword coming out of this mouth (His words pronounce judgments), and the one whose hair is a brilliant white (totally wise)—He is the one who loves us, who saved us, the one who has made us His own.\n\nJohn’s vision of the risen Lord Jesus reminds us of something we are prone to forget—Jesus is full-strength God. Just because Jesus was crucified, don’t think He’s a pushover. He’s not weak. He tells us: “I am the First and the Last, and the Living One. I was dead, but look—I am alive forever and ever, and I hold the keys of death and Hades” (Revelation 1:17–18). He is in charge. He alone oversees the living and the dead for all eternity.\n\nJesus is more than a great speaker. He’s more than some kind of guru who gives out sage advice for how to live well on this planet. He is the First. The Last. It’s all about Him. Is this how you view Jesus? Is this how you treat Jesus? Is this how you worship Jesus? Do you have this kind of faith and trust and dependency on the one whose voice is like the sound of rushing waters? (14:2). Look to Him again. Let the heatwaves from Revelation 1 revive your heart for Jesus again.\n\nWritten by J. A. Medders\n\n                ",
        "img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day1.jpg"
    },
    {
        "book_title": "Jude & Revelation",
        "devo_passages": "Jude 1:1-25",
        "devo_title": "Chapter 1",
        "devo_summary": "",
        "img_url": ""
    }
]