[
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 24:1-33, Deuteronomy 7:9, Romans 8:28",
    "devo_title": "Israel Renews Their Covenant Commitment",
    "devo_summary": "By Russ Ramsey\n\nHave you ever gotten excited about a new thing, and instantly imagined it would be in your life forever from that point forward—maybe a diet, exercise regimen, or a way of keeping a clear inbox? You know the feeling, right? “This is great. I’m gonna do this every day!”\n\nWhat usually happens? Usually, the plan falls apart. The newness wears off. The difficulty of the task mounts. You get bored, perhaps. And before you know it, you’ve got ten thousand unread emails stacked up in your inbox and you just don’t care anymore. I have good news for you. God knows we are prone to this, and He loves us anyway.\n\nToday we come to the end of the book of Joshua, in which the Lord rehearses for Israel the journey they’ve been on up to this point. It’s been a complex, difficult, glorious road. Joshua walks through the stories of their forefathers—Abraham, Isaac, Jacob, and Joseph. He reminds them of their slavery in Egypt and the exodus. He recounts their time in the wilderness with Moses, and their conquest of the promised land.\n\nThrough it all, the Lord remained faithful to His people, and here at the end of the book, Joshua calls Israel to renew their fidelity to God by loving, serving, and worshipping Him only. They are to purge their cities and homes of idols and set their affection on the Lord.\n\nThe people respond like I often do when I get all worked up and excited about something. Joshua says, “Fear the Lord and worship Him in sincerity and truth” (Joshua 24:14), to which the people essentially respond with, “No problem! That’s exactly what we’ll do! Forever.”\n\nAppreciate the honesty about the human condition this chapter shows. When the people swear they will love God fully every day, Joshua says, “No you won’t.” They double down, “Oh, but we will. You wait and see.” And they make a monument to validate their vow to remain faithful, no matter what—a literal promise set in stone.\n\nWe know how this turns out. They abandon their commitment before they even make it home, and the monument they’ve built testifies against their empty promises (Joshua 24:25–27). It is important for us all to recognize the truth here about our condition. We are promise-breakers, especially when it comes to doing things perfectly. We just can’t do it.\n\nThe infidelity of our hearts is important to see because it shows us that if we are to be in a covenant relationship with God, and we are prone to wander as the old hymn says, then our only hope for salvation is if God keeps hold of us. And that is the reason for the life, ministry, death, and resurrection of Jesus—to bind our wandering hearts to Him. This is what He came to do, and it is what He has done. To God be the glory.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-26.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 23:1-16, Matthew 22:37-40, Philippians 1:6",
    "devo_title": "Joshua’s Farewell Address",
    "devo_summary": "By Alex Florez\n\nThink of all Joshua accomplished, from leading his people across the Jordan River to razing the walls of Jericho. He saw the sun stand still, dethroned kings, and divided up the newly conquered land among the tribes of Israel. As he prepared to walk off into the sunset, he could have sung his own praises, listing his accolades for hours on end. But instead, he gives a pretty simple, very direct address to summarize his parting thoughts. I can almost hear him say, “If you remember nothing else, remember these things.”\n\nPerhaps because of its relative brevity, I can’t help but wonder if the text of Joshua 23 is an exact transcript of the speech Joshua gave, or if there was even more. We’ll never be certain. What we do know for sure is that what we have before us now are the divinely inspired, God-breathed words that constitute the permanent record for countless generations of believers. What we meditate on today is what the author of this particular section of Joshua wanted us to know, or to be more precise, what the Lord wanted us to hear.\n\nIn his farewell address to Israel, Joshua lays it all out, imparting and recapping for them what is most important with regard to being in a covenant relationship with the Lord. First and foremost, God’s people are to remember all that He has done for them, everything they have witnessed and experienced in and by His presence. They are to remember all the ways their God has fought for them and how He has revealed Himself and His power to them. And just as God has continued to be faithful to them, they are called to be faithful and devoted to Him, to keep His law out of loving response to all He has done. God alone is worthy of this kind of devotion, and He alone can offer the peace and rest His people need.\n\nAt the heart of Joshua’s appeal is this: “I am going the way of the whole earth, and you know with all your heart and all your soul that none of the good promises the LORD your God made to you has failed. Everything was fulfilled for you; not one promise has failed” (Joshua 23:14).\n\nNow, think about these words in light of your own journey of faith. What good things has the Lord provided you? I bet the list is long. What promises has He fulfilled? Consider the assurance of salvation in Jesus. What master has seen you through despair or presented you as pure and blameless in the sight of the Lord? Surely, only Jesus has been faithful, while the idols of your heart have let you down time and time again. Think on the good and wonderful things He’s done for you. Praise Him for His unswerving dedication to your eternal soul. Submit to His authority and guidance. Always remember; never forget.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-25.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 22:1-34, Psalm 7:8-10, 2 Corinthians 1:21-22",
    "devo_title": "An Altar of Witness",
    "devo_summary": "By Caleb Faires\n\nWe moved recently, so I suppose that I could use that as an excuse for the sparseness of our walls. As an artist, I expected that I’d have plenty of artwork to hang about the rooms and hallways, but the walls are still mostly empty. I think I enjoy the simplicity, like the simple possibilities of a blank canvas. Whether we’ve been intentional or not, our walls and bookshelves, our cupboards and our dashboards, quickly become a curation of the things we’ve given our lives to. It might be the pursuit of peace, of comfort, of distraction, or of excitement, but we’re all busy building ebenezers.\n\nWhen Reuben, Gad, and Manasseh crossed over the border into their homeland with the spoils of war, they were not about to allow the clutter of victory to distract them from their true priorities. They took very seriously the exhortation of Joshua: “Only carefully obey the command and instruction that Moses the LORD’s servant gave you: to love the LORD your God, walk in all his ways, keep his commands, be loyal to him, and serve him with all your heart and all your soul” (Joshua 22:5). In their zeal, they erected an ebenezer, an altar of witness as a reminder for future generations. Israel mistakenly took offense at Reuben, Gad, Manasseh, believing that they had built an altar of idolatry.\n\nThe three tribes established on the other side of the Jordan might have been offended by the allegations presented by their fellow Israelites. Instead, they received the rebuke of their brothers and dispelled their concerns. They offered an explanation for why they built the altar, out of concern for continued unity between future generations of the tribes (Joshua 22:26–29). Their explanation was accepted, and the conflict resolved peaceably. God’s people blessed Him and celebrated His presence among them (vv.30,33). And the altar erected by Reubenites and Gadites was named for its intended purpose: “It is a witness between us that the LORD is God” (v.34).\n\nThis altar of witness is also for us, that we would not forget who our God is, that we would not turn from true worship to idolatry. The zeal of Israel for the glory of God and the preservation of true worship is to be the defining pursuit of our lives. Whether our walls are bare or crowded, we are called to be zealously intentional like the Israelites. May every corner of our lives be marked by the ebenezers of this truth: He is our God, and Him we will serve.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-24.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 20:1-9, Joshua 21:1-45, Exodus 21:12-14, Hebrews 4:14-16",
    "devo_title": "The Lord Fulfills His Promises",
    "devo_summary": "By Cameron Thomas\n\nThere is nothing like the relief of completing a task, being able to check another thing off of that to-do list. God had promised Joshua, “You will distribute the land I swore to their fathers to give them as an inheritance” (Joshua 1:6). And after years of battle and combat, Joshua was finally able to obtain the promise from his initial call that their conquest will yield them a land of rest and serenity.\n\nThe process of getting to this promised destination was not without losses and calamity, but God promised that this day would come. Like many of us, Joshua has had to explore unknown terrain with simply a directive from God, whose promises may seem prolonged or even unobtainable from time to time. Yet, He remains trustworthy and unchanging in His faithfulness. Joshua experienced doubt and delay but neither of these things hindered God’s plan; He orchestrated all of the details and took into consideration every aspect of life for the children of Israel. And after everything they had experienced with Him, “The LORD gave them rest” (Joshua 21:44).\n\nFrom our limited perspective, we will never truly know the full revelation of God’s character. You and I must become aware, even in our own personal life, that the God who directs and instructs, whether through His Word or by His Spirit, is also the God who delivers on His promises. It is worth examining our own, personal experiences with God and asking this question: Has God changed in the midst of changing circumstances? Believers must be willing to rest and trust in the character of God, the one who invited us along this faith journey into our own hearts and into the world around us. So, has God’s character changed since these events took place in Scripture, when God brought His people to the promised land? Not at all.\n\nThe memories of military battles and trials propel God’s people to a moment of rest. Rest provides an opportunity for reflection, the chance to remember God’s goodness and presence in the past, which can reframe our perspective on the journey before us. Whatever trials have led to this moment in our lives, be they numerous and diverse, God has brought us through them. Sickness, betrayal, and defeat may have led to this place, but they do not dim or extinguish God’s character. No matter what our own stories may tell, God always brings us to a place of rest, which we can only truly experience in His presence.\n\nGood deeds or merit do not grant us exemption from pain, but the Master’s promise holds us together when we feel like we’re falling apart. The promises of God usher us through the darkness and anchor us in times of turbulence. We cannot tell the story of Joshua and the conquest of Canaan without also telling of God’s faithfulness. May it be said of our own lives that our story is permeated and directed by the faithful hand of God, the One who keeps His promises.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-23.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 18:1-28, Joshua 19:1-51, Acts 13:16-23, Romans 4:16-22",
    "devo_title": "Joshua Divides the Land",
    "devo_summary": "By David Chaniott\n\nWhen I was eight years old, the United States fought in the Persian Gulf War. When the war ended, my whole city exploded with yellow ribbons. They were everywhere, on every door and mailbox, wrapped around trees like Christmas decorations. No business was caught without a yellow wreath hung over the entrance. My mom explained them to me. She told me about the Tony Orlando song, “Tie a Yellow Ribbon Round the Old Oak Tree,” about a soldier coming home from war, wondering if his family still has a place for him. Of course, he finds hundreds of ribbons to welcome him home.\n\nIsrael has their own yellow ribbon moment in Joshua 18. The text takes its time to lovingly spell out each tribe’s allotment. After generations of slavery, wanderings, and war, the land that was promised was finally theirs. The Israelites were home.\n\nGod’s covenant with Abraham was not only to bring Israel into that place, but to bless every nation. Joshua draws to a close at a huge milestone, pointing down a road that leads to Christ. Throughout their history, Scripture reminded God’s people of this exact, triumphant moment. After the Savior came, Paul and the other early Church preachers turned back and showed how God kept His promises as an encouragement that one day, Christ would return. Joshua did not live to see Jesus, and Abraham did not live to see his descendants receive the land. I do not assume there is any reason I will live to see Christ return. But I have the same faith as Abraham that, “What God [has] promised, he [is] also able to do” (Romans 4:21).\n\nThere may be days when we feel as though we’re adrift, wandering in the wilderness. We will be called to have faith even when it feels like we are hoping against hope, like Abraham. He was called to trust God’s goodness and believe that His promise to bring about a great nation would be fulfilled. Each of these stories from Scripture is an encouragement to our faith. Our God calls things into existence that do not exist and makes a way where there is none—like establishing a home in hostile land, and giving life to the dead. The victory in Canaan was a stop on the way to Christ, and that is a cause for triumph and celebration, both today and in the day to come.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-22.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 16:1-10, Joshua 17:1-18, Psalm 2:8, 1 Peter 1:3-5",
    "devo_title": "Joseph’s Inheritance",
    "devo_summary": "By Matt Capps\n\nOur four-year-old daughter has become surprisingly afraid of walking into any dark room by herself in our house. As her father, it is somewhat disappointing. It’s not her fear that surprises me, but her lack of trust in my word. It doesn’t matter how many times I tell her “you will be perfectly fine” or “there is nothing in that room waiting to overcome you,” she still hesitates to walk in the promise of my word.\n\nIt is funny how God uses these little experiences in our lives to teach us spiritual truths about ourselves. When it comes to acting on God’s promised word, I often act like my four-year-old: “God, I hear what Your word says, but I cannot see beyond my own circumstances. I really want to trust You, but I also want to know what is ahead before I step out in faith.” If we are honest, it is difficult to take God at His word. We are no different than Israel. When Israel moved through the promised land in order to take possession, they often viewed their circumstances through their own perspective rather than the eyes of faith.\n\nIn Joshua 17, we are given a description of the tribal allotments west of the Jordan River. As Israel moves in to take possession, they are confronted by the Canaanites who inhabited the land and had military machinery that was beyond their abilities in battle. Israel didn’t have chariots of iron like the strong Canaanites. How would Israel possibly conquer these advanced enemies? As God’s people look around, they complain that the land they were to possess was too inadequate to meet their needs. It became clear to them, from their perspective, that the land they were to settle in was not easily cultivated. How could they possibly dwell in the highlands and deserts?\n\nBut Joshua reminds them, “We have many people, because the LORD has been blessing us greatly (Joshua 17:14). Had they so easily forgotten that God would give them the land that He’d sworn to their fathers? If God would empower them to take possession of the land, then He would also ensure that they would settle there. And if they were to settle there, God would also make sure that it was sufficient to provide all their needs.\n\nAs we read Scripture, it is abundantly clear that not one promise from God to His people would fail. As Christians, how much more are the promises of God secure for us in Christ? Not only has Jesus promised to triumph over all of our enemies, but also to provide a deep rest in His providential hand. Even more, His promises will eventually lead us to our forever home with Him. An eternal home where we can settle and have all of our needs sufficiently met for all of eternity. If God’s hand is strong enough to save you, it is also strong enough to sustain you. So, the next time you find yourself in doubt or fear, learn to view your circumstances through the eyes of faith.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-19.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 15:1-63, Genesis 49:1-27, John 10:7-10",
    "devo_title": "Judah’s Inheritance",
    "devo_summary": "By Russ Ramsey\n\nHave you ever been given an inheritance? What were you given?\n\nWhen we think of inheritances, we often think of inheriting things like houses, money, cars, heirlooms, books, and jewelry. Beyond the things inherited, what is the significance of an inheritance? It is the recognition of a legal bond between two parties, usually between a parent and child. The government looks at the possessions of people who pass from this earth as being the legal property of their descendants, unless specified otherwise.\n\nIn Joshua 15, God’s people are given an inheritance from the Lord. Specifically, He gives them land. If you’ve ever visited Israel, chances are your guide pointed out some of these certain key boundaries. The Jordan River and the Mediterranean Sea were included in the boundaries the Lord established for the promised land.\n\nWhen we think of inheritance, often we think of the thing being passed from one party to another. But in Scripture, the thing being passed down is far less important than the connection between the parties. Think about it: Who gives the different clans of Israel land? The Lord, the Maker of the land. These clans were not just heirs of their fathers. They were heirs of God, and being an heir of God is an eternal connection.\n\nWhen the Lord gives the tribes of Israel land, they are at the beginning of their existence as a nation in many ways. But the inheritance the Lord gives the clans of Israel is a foreshadowing of an eternal inheritance that will last forever. For those whose faith in Christ, we are called heirs with Christ (Romans 8:17). Heirs to what? To the kingdom of God. Nothing less.\n\nThe people of Judah were given a parcel of land that included the place that would become Jerusalem. To Israel, Jerusalem was more than just a city. It was a symbol of something eternal—the seat of God’s kingdom on earth. For Judah, it was a city yet to be built. But for Christians today, it is a reminder that the kingdom the Lord promised to Abraham is an eternal kingdom, and that one day this world will yield to the eternal kingdom of God, with a New Jerusalem at the center where Christ reigns as King.\n\nWhen the Lord gave Judah the land that would contain Jerusalem, they couldn’t have known all that would transpire there—especially the ministry, death, and resurrection of Jesus who would atone for the sins of the people. But that’s what happened.\n\nThere may be things in your life that are on the early end of coming to fruition, blessings and gifts from the Lord. You may not be able to see the value of what He’s given. You may not be able to see what it might or will become. But the Lord does, and He always does exceedingly more than all we ask or imagine (Ephesians 3:20). That’s what He did with Judah, and that’s what He does to this day.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-18.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 14:1-15, Numbers 14:1-25, Romans 11:33-36",
    "devo_title": "Caleb’s Loyalty to God",
    "devo_summary": "By Caleb Faires\n\nHave you ever stood up for something alone? When conscience and conviction run counter to the crowd, where do you stand? Loyalty is perhaps the most courageous of the virtues. It is not cowed or intimidated by numbers or peer pressure. It is the uncompromising stand for what is right, no matter the odds.\n\nCaleb stood in a singular position among the men that spied out the land of Canaan. There were other men, like Joshua, Eleazar and Phineas, who also stood with Moses. Joshua had assisted Moses since his youth and, understandably, sided with his mentor (Numbers 11:28). Of the remaining spies, Caleb alone stood his ground. He stood against ten other men, reputable and respected, who had been called, just like him.\n\nAnd what did he have to gain? The majority was against him, and they were right about the facts. There were indeed giants in the land. They had great, walled cities and were well-armed. This was a land of mighty warriors and iron chariots. How could a tired and nomadic people overtake such a well-entrenched foe?\n\nBut Caleb was not seeking popularity or an elevation of his own status. He was devoted to God, even if that meant standing against every other voice around him, even if it meant standing against what sounded like very reasonable arguments. Of course, the counsel of fear and despair is always easy to swallow. Loyalty, unlike cowardice, doesn’t care about the odds. Caleb, unlike the other spies, was not calculating the strength of the enemy. He cared only about the character and command of God.\n\nThis is true loyalty: that the law and wisdom of God define the hopes, aspirations, and plans of our lives. The call to loyalty comes in many forms in the Bible. We hear that call in the first and greatest commandment, the shema, found in Deuteronomy 6:5: “Love the LORD your God with all your heart, with all your soul, and with all your strength.” We hear the call to loyalty in the command that God repeated to Joshua, to keep the commandments and follow Him, not turning from the right or left, and successfully following God (Joshua 1:7).\n\nThis language is echoed in Numbers 14:24: “But since my servant Caleb has a different spirit and has remained loyal to me, I will bring him into the land where he has gone, and his descendants will inherit it.”  We hear this same call most simply in the words of Christ to His disciples: “Follow me” (Matthew 9:9).\n\nThis is the epitome of Caleb’s person, that “Joshua blessed Caleb… because he followed the LORD, the God of Israel, completely” (Joshua 14:13–14). This is indeed a different spirit from the spirit of the world. It is not “a spirit of fear, but of one power, love, and sound judgment (2Timothy 1:7). It is not a spirit of disobedience, but of love for the law of God. It is not a spirit of doubt and unbelief, but of absolute trust in God and His word. It is this spirit of loyalty and devotion that defined the life of Caleb.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-17.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 13:1-33, Deuteronomy 3:22, Revelation 5:9-10",
    "devo_title": "Unconquered Lands",
    "devo_summary": "By Cameron Thomas\n\nJoshua is no longer the timid leader who needs a nudge to be courageous. The battles fought have been numerous and the hand of God has been evident in every experience. His experiential uniform is fitted with numerous conquests. Then, a potentially emotionally and physically exhausted Joshua receives an invitation to participate with God in His yet unfinished work. He is still on God’s list of leaders fit for the mission.\n\nJoshua’s tenure began as a continuation of Moses’s call in Exodus, and his work would have a lasting impact even beyond his own lifetime. God calls and invites us all into the work of advancing His kingdom, to continue the journey of experiencing His power by committing ourselves to whatever He ordains. The victories experienced do not thwart the essential aspect of what the children of Israel are heading toward: being the representative people of God for His glory.\n\nGod summons Joshua to say there is still more work to do. Victory at Jericho and walking on dry ground through the terrain of the Jordan were crucial, but there is always more with God. His track record in our lives should display the true origin of any success: God alone. His faithfulness in the past encourages us to trust Him in the present and future.\n\nWhen He declares that the victory will once again not be on anyone’s merit but by His power and capacity, God is claiming responsibility for future success: “I will drive them out before the Israelites” (Joshua 13:6). His work in Joshua has been accomplished, evidenced by Joshua’s obedience, and new ventures will require this same posture. Moving forward and venturing into the unknown invites us away from our preoccupation with merit and into experiencing the power of the Almighty.\n\nThe greatest victory for the children of Israel rests in their status of belonging to God. “The LORD, the God of Israel, was their inheritance, just as he had promised them” (Joshua 13:33), and just as He promises to be ours. The accumulation of possessions can potentially cloud our perspective of our greatest gift as His people. Prosperity and victory alone do not define our relationship with God. We must learn to see that He Himself is sufficient—not what He does for us. Are you up to the challenge of deepening your experience with God? Beyond victories and blessings, is God enough? Our beginning is not God’s start; neither is our end God’s conclusion.\n\nOur greatest inheritance is not calculated by riches and the accumulation of material things; it is that we belong to God and God is ours. Despite what we may feel, unconquered lands and obstacles are really unexplored territory we have yet to encounter alongside our God. We must trust that the same God who has ordered our steps also orders our unknown future.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-16.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 12:1-24, Nehemiah 9:22, Psalm 136:16-21, Daniel 2:19-22",
    "devo_title": "Territories & Kings",
    "devo_summary": "By David Chaniott\n\nMy parking space is about to wash away. Well, part of it anyway. I park on a hill, and water has washed the ground away under the curb, making a big muddy hollow under the concrete. I am pretty sure that if I pulled my car all the way into the space, the front-edge of the pavement would break off. A few more good rains, and maybe it will just fold down on its own. This is not the first time the parking spot has been damaged: There was a flood here that washed it out. Ten years ago, a landslide buried it.\n\nIt is just a few square feet of land, but it is mine, and has been for thirteen years. I have parked four different cars in that spot, fought with neighbors over who was allowed to use it. I used to set a grill up there and cook. Even my dog knows it is my spot.\n\nEveryone has places like that, little spots that they know, that they see change with time, fight for, maintain. Get a couple of people and a lot of their spots together and you have a neighborhood. You know your own and some famous ones, too: Brooklyn, the Bronx, and Queens; Venice, Orange County, and Hollywood; Bourbon Street, and up and down the French Quarter. I have not been to all those places, though I have some idea of what they are like. But I have no idea what Baal-Gad is like. Nor Megiddo, Og, Ai, or Sihon.\n\nI will never know a spot in Bethel the way I know my parking spot, but Joshua might have. There were people who knew those places the same way I know my parking spot of thirteen years. Canaanites, then Israelites, then Babylonians, Greeks, Romans, Jews, Christians, and more. Here in Joshua, those places became part of God’s gift, “And Moses the LORD’s servant gave their land as an inheritance to the Reubenites” (Joshua 12:6). God brought them out of the wilderness where they had wandered without a spot, and gave them the place He had chosen for them.\n\nGod’s providence was not just so those people He loved would have a home, no more than His providence in my life has been only so I can fix my parking spot. The book of Daniel tells us that God reveals deep and hidden things, and all His work reveals the depths of His love in Christ (Daniel 2:22), establishing that love to endure forever (Psalm 136). He reminded Israel constantly of this gift He had given them, and when we read it, God is reminding us of His long, unbroken streak of kept promises. He provided both grace and justice. Israel’s inheritance of the land foreshadows every believer’s inheritance in Christ.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-15.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 11:1-23, Psalm 110:1-7, Ephesians 1:3-14",
    "devo_title": "A Battle Without Mercy",
    "devo_summary": "By Barnabas Piper\n\nIt’s easier to say, “God is sovereign,” than to accept what it means, especially since we are prone to think we know best and to question what we don’t understand. But the Bible doesn’t let us skate through big, complex ideas of God in a simplistic manner. If God is sovereign and in control of everything, then He remains true in every situation, in both the difficult and pleasant things, the dark things and the light things. Joshua 11 walks us into this reality.\n\nThe people of Israel were confronted with a massive army as several enemy kings banded together against them. Once again, the odds were against the Israelites, but God was on their side: “Do not be afraid of them, for at this time tomorrow I will cause all of them to be killed before Israel” (Joshua 11:6). And so it was, over time, that “all of them were taken in battle. For it was the LORD’s intention to harden their hearts, so that they would engage Israel in battle, be completely destroyed without mercy, and be annihilated” (vv.19–20).\n\nJoshua’s actions were obedient to the commands of God and fulfilled what God had promised to Moses years earlier. “So Joshua took the entire land, in keeping with all that the LORD had told Moses. Joshua then gave it as an inheritance to Israel” (Joshua 11:23). This was God’s plan: to establish His people, to give them the land as inheritance, and to wipe out His enemies. He fought on behalf of His people, this fledgling nation of wanderers and aliens, to establish them in the land and prepare the way for salvation to come to the world.\n\nPsalm 110 helps us understand God’s sovereign mercy and justice by pointing to the coming Messiah, who would be “a priest forever in the order of Melchizedek” and from the line of David (v.4, ESV). The psalm also describes how God will rightfully destroy those who rebel against Him (vv.5–6). God’s sovereign mercy saves even the least likely, and His sovereign justice must be satisfied as well. This is why we need that promised Messiah. Ephesians 1 tells us:\n\n“In [Jesus] we have redemption through his blood,\n\nthe forgiveness of our trespasses, according to the riches of his grace…\n\nIn him we have also received an inheritance,\n\nbecause we were predestined according to the plan of the one\n\nwho works out everything in agreement with the purpose of his will” (Ephesians 1:7,11).\n\nIn Joshua 11, we see God’s justice being temporarily satisfied in the destruction of His enemies and Israel receiving the land as their promised inheritance. Such stories are true to God’s character, both just and merciful. And they’re meant to help us understand and be in awe of how God later fulfills His plan. What was temporary in Joshua becomes permanent and eternal in Jesus: satisfaction of God’s justice and a lasting inheritance in the final promised land.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-12.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 10:16-43, Romans 1:18-20, Ephesians 1:20-21",
    "devo_title": "God Gives Israel the Land",
    "devo_summary": "By David Chaniott\n\nThe Lord fought for Israel (Joshua 10:42).\n\nToday’s reading contains one of those stories in the Bible where we attempt to explain away all the violence we find on the page. We wonder how a merciful God could punish so harshly, how a just God could fight for one flawed nation over another. But God’s wrath and judgment are a response to humanity’s sin. Even Israel, God’s chosen people, were not exempt from judgment. God used Israel here as an instrument to judge sin, but generations later, God would use the Chaldeans to tear Israel apart in the same way the Israelites tore through Canaan.\n\nThe prophet Habakkuk complained to God about the judgment—not because God chose to judge Israel, but because of how God carried out His justice.\n\n“[M]y Rock, you destined them to punish us.\n\nYour eyes are too pure to look at evil,\n\nand you cannot tolerate wrongdoing.\n\nSo why do you tolerate those who are treacherous?” (Habakkuk 1:12–13).\n\nThe prophet seems to say, “Fine, punish us, but don’t use them.” In other words, justice sounds great, but only if we can somehow land ourselves on the instrumental side of God’s purposes—and then choose the instrument of judgment we’re most comfortable with. Far too often, we’re tempted to wring our hands with glee to decide how to mete out God’s punishment of our enemies: “Yes, God, pour your wrath on them, and mercy for me, please!” A preposterous request. I am as deserving of God’s wrath as the Canaanite kings, the Israelites, and the Chaldeans.\n\nAnd yet, God’s answer is this: wrath for Jesus and mercy for everyone else. His wrath against godlessness and unrighteousness is poured out, but directly, mercifully, on Christ. The same root problem of sin plagues us today, just as it plagued those in the passages we’ve read today. The rooted darkness of their sin, their idolatry and devotion to false gods, had penetrated deeply into their hearts and every aspect of their lives. In His merciful justice, He prevailed over it for the good of His covenant people.\n\nYes, “the LORD, the God of Israel, fought for Israel” (Joshua 10:42). He continues to fight for His people even now. Our God is unchanging, and Jesus Himself came as the remedy to this problem, once and for all time, for us on the cross. Why would He do this, sacrifice Himself for His enemies (Romans 5:8), those bent on loving anything and anyone but Him? For the joy set before Him, beyond the cross (Hebrews 12:2)—bringing us back into His loving presence, freeing us from our own internal battle with sin, and blanketing us securely in His holiness.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-11.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 9:1-27, Joshua 10:1-15, Psalm 84:10",
    "devo_title": "The Day the Sun Stood Still",
    "devo_summary": "By Matt Capps\n\nThe story goes like this: There was a businessman who wanted to purchase a vacant building and turn it into a scandalous and immoral establishment. A group of Christians from a local church were concerned about the businessman’s plans and organized an all-night prayer vigil, asking God to intervene. It just so happened that shortly after the prayer meeting, lightning struck the building and it burned to the ground. The businessman attempted to sue the church, claiming that the prayers of the congregation were responsible. The church, fearful, immediately hired a lawyer to argue in court that they were not responsible. The presiding judge, after his initial review of the case, stated, “No matter how this case comes out, one thing is clear. The businessman believes in prayer and the Christians do not.”\n\nFar too often, Christians live as functional agnostics, that is, as if the spiritual happenings around us have no real implication on our day-to-day lives. For this reason, I think there are some important lessons in Joshua that remind us of God’s power. One of the most comforting and encouraging truths of Scripture is that God intervenes in this world for His glory and the good of His people.\n\nAs Joshua prepares for battle, the allied Canaan powers rally to fight against God’s people because of their presence in the land. But remember, from the very beginning of Joshua’s commissioning to conquer, God told him that every place his foot stepped on would end in victory (Joshua 1:3). He is reminded again in Joshua 10:8: “Do not be afraid of them, for I have handed them over to you.”\n\nThis is where things get interesting! When we read Joshua 10:1–15, we find that God, not Joshua or the Israelites, is the primary character in this narrative. The language of the text paints a picture of the God of the universe marshalling all of creation to win this battle. Not only does God throw the enemies into confusion, but He also hurls hailstones from the sky. And if that wasn’t enough, He also causes the sun to stand still, extending the day so that Joshua could finish the battle and secure victory over the enemy.\n\nJoshua asked, praying for help aligned with God’s instructions and for the good of His people, and God answered. We are told to approach the throne of God “with boldness, so that we may receive mercy and find grace to help us in time of need” (Hebrews 4:16). We shouldn’t be surprised when the Almighty God hears our prayers! We can have confidence in prayer because Jesus, even greater than Joshua, sits at the helm of the cosmos pleading on our behalf (1 John 2:1).\n\nAs Christians, we should not live our lives as functional naturalists because there are spiritual battles waging all around us. We must depend on God, coming to Him in prayer, faithfully pursuing obedience to His Word. Our God intervenes in this world for His glory and the good of His people.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-10.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 8:1-35, Exodus 20:22-24, Hebrews 8:8-12",
    "devo_title": "Conquest & Commitment",
    "devo_summary": "By Alex Florez\n\nObedience is a critical element in our journey of faith. I would guess, however, that obedience is a word that makes most adult Christians—perhaps men in particular—a bit uncomfortable. Isn’t our society built upon the notion that we’re free individuals, at liberty to pursue whatever ends we desire, by any means necessary, so long as we don’t infringe upon another person’s safety, freedom, or security? Sure, we follow laws, either implicitly or explicitly, to avoid punishment. Of course, we acquiesce to social norms that tacitly guide our public behavior. But when I entertain the idea of being obedient to anyone other than myself, my muscles tense, and I grit my teeth.\n\nAs a follower of Jesus, I recognize great tension between my tendency to buck under even the suggestion of human authority and my calling to submit fully to the authority of God. I, as a man, perceive myself to be completely sovereign in my quotidian affairs and, simultaneously, at the mercy of God, at least philosophically. As such, my propensity to resist authority presents a serious challenge to the way I approach the throne of Jesus.\n\nI wonder what went through Joshua’s mind, and the minds of his soldiers, as they faced one mighty enemy after another. How hard it must have been to obey God’s command to march into battle! Frankly, I’m not sure how I would handle such an order, especially since I struggle with obedience in my own life of relative safety. And yet, what the Lord asks of Joshua and his men, and what He asks of you and me, is complete obedience, in clear terms that leave little room for interpretation: “Follow the LORD’s command—see that you do as I have ordered you” (Joshua 8:8).\n\nFrom Genesis to Revelation, God commands us to trust Him enough to follow Him, even into uncertain and dangerous territory. In so doing, we discover an ever-deepening love for Him. This burgeoning love, in turn, engenders more trust and strengthens our faith. The more confident our faith, the more secure we become in following Him further along the road of sanctification. Relationship with Jesus is progressive, and obedience is an essential catalyst.\n\nYou may not face an army in a hostile city. You may not have anything on your plate today more dangerous than your drive to work. But what God requires of you is obedience, and this is not without reward. When we obey the Lord, He inevitably demonstrates that He is completely worthy of our trust. He builds our capacity to recommit ourselves to His commands each day. For all God’s children—warriors and the rest of us—the Lord’s command is to love Him with all our hearts, to trust Him, and to follow Him. And as we follow Him, we will see how the daily discipline of obedience grows in us greater power and freedom—far more than we ever could’ve manufactured living in our own strength or as the highest authority in our own lives.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-9.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 7:1-26, Deuteronomy 9:26-29, Hosea 2:15, James 1:19-25",
    "devo_title": "Achan’s Disobedience",
    "devo_summary": "By Russ Ramsey\n\nOne time I visited California, and a local friend there drove me past orchards covered in oranges, ripe and ready for harvest. He told me the farmers would not be harvesting that year’s crop from those orchards because the market was so saturated with produce that year, that if they were to sell their entire yield, it actually hurt the farmers financially. So, the government ordered those orchards heavy under the weight of perfect California oranges to remain untouched. My friend said if anyone got caught picking them, they would have to pay a ridiculously steep fine.\n\nI think about that when I read about Achan standing before all that plunder—all those valuable resources that the Lord determined were set apart for destruction. Instead of following the LORD’s command to be consecrated (Joshua 7:13), the temptation got the best of Achan, and he took a little of what he figured no one would miss.\n\nBut the Lord knew. Can you imagine the winnowing, when the Lord set Joshua about the business of finding the person who stole the spoils of war? Can you imagine Achan’s slow realization that he was going to be found out, and how dead to rights he must have felt when he was?\n\nThis is a hard passage because the Lord’s justice is swift and grim. But God’s people were called to obey, and they knew He was to be the object of their desire. Achan disobeyed this, and the place where he and his family died as a result was turned into a monument—the Valley of Achor—to remind the people of the Lord’s anger toward sin. Imagine living near that monument. Imagine being a child, seeing it and hearing the story. Is there any hope for sinful people in the presence of a holy God?\n\nLater, in the book of Hosea, the Lord tells His prophet that He is going to turn that valley commemorating the wrath of His holy judgment into a gateway to hope where wayward, foolish, rebellious, adulterous, and hard-hearted people will find acceptance and grace. The place where the Lord poured out His wrath toward sin would become a place where God’s people would find confidence in their standing before Him.\n\nHow could this happen? The holy anger toward sin the Lord showed to Achan’s family would be poured out on His own Son, once and for all, so that His wrath would be satisfied forever. The Lord did not reconcile us by lowering His perfect standard of holiness. He satisfied it through a substitute—one who would live a perfect life in our place, die a sinner’s death in our place, and defeat the power of the grave, which held no claim on Him, giving us life in His name.\n\nTo understand the glory of the work of Christ on our behalf, we should not look past stories like this which show God’s holy wrath on display. We should look deep into them because here we see what Christ redeems us from. God never lowered His standards. Instead, He raised us up to them in Christ.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-8.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 5:10-15, Joshua 6:1-27, Exodus 3:1-6, Romans 8:31",
    "devo_title": "The Conquest of Jericho",
    "devo_summary": "By Barnabas Piper\n\nWe love a good underdog story, tales of unlikely heroes and brave companions striving, shoulder to shoulder, to defeat an enemy. Like King Leonidas and his three hundred Spartans at Thermopylae, the Permian Panthers making their way to the Texas state high school championship football game, two Hobbits scrabbling up the side of Mount Doom to save Middle Earth—the story of Joshua leading the people of Israel against Jericho seems like just such a story.\n\nThe people have entered the plains of Jericho after years of wandering. Their heavenly food has ceased, and they’re encamped in the shadow of Jericho’s fortified walls. Yes, they’ve won a few battles on the way, but the odds are stacked against them. Then Joshua gets, quite literally, their marching orders: march around the city once per day for six days in total silence. On the seventh day, march around it seven times with the priests blowing trumpets. If you’ve read any military history, or have even a modicum of sense, these commands from God don’t exactly seem like sound battle strategy.\n\nHere’s the thing: it might be fair to call Israel an underdog with an inexperienced leader using bad strategy—if they were on their own. But that had never been the case. The Lord was on their side, and He declared the battle won before it started: “Look, I have handed Jericho, its king, and its best soldiers over to you” (Joshua 6:2). Their strategy was nonsense if this was a contest of human strength, but it wasn’t. The whole idea was to show that it was God who fought their battles, God who won, and God who should be followed by His people and feared by His enemies.\n\nOn that seventh day, as the people followed the priests in marching around the city (an important symbolism of who actually led them into battle) there must have been profound anticipation of how God would fulfill His word. And then the command came, “Shout! For the LORD has given you the city” (Joshua 6:16). And the people did with a “great shout, and the wall collapsed” (v.20).\n\nThis underdog story was no underdog story. It was a display of God’s power and promise keeping. He declared Himself to Moses as “I AM WHO I AM… The LORD, the God of your ancestors, the God of Abraham, the God of Isaac, and the God of Jacob” (Exodus 3:14–15), and He did not change once the people entered the promised land. He left no question as to who was fighting on Israel’s side.\n\nLest we think this is a story of how God used to work or used to win, consider that He also called Himself “I AM” (Exodus 3:14), the unchanging one. So, when the apostle Paul writes in Romans 8, “If God is for us, who is against us?” (Romans 8:31), he is writing not only of the past, but also of the present and future. The same God who flattened Jericho is with you and me and all who follow Him no matter the odds stacked against us.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-5.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 4:1-24, Joshua 5:1-9, Exodus 14:21-25, Exodus 14:30-31, Colossians 2:11-12",
    "devo_title": "Memorial Stones",
    "devo_summary": "By Alex Florez\n\nMy church has a beautiful way of framing the experience of receiving communion: at the table of the Lord’s Supper, we renew a beautiful cycle of “remembering and proclaiming.” We humbly kneel as we remember the gravity and power of what Jesus did for us. We then rise, eager to go forth and proclaim the goodness of God. Whatever your view of the nature of transubstantiation, all believers can agree that something beautiful and mysterious happens at the Lord’s Table. The words remember and proclaim help me make sense of the mystery. They inspire me to delight in the goodness of God. They encourage me to share the good news of the gospel in every area of my life to anyone who will listen.\n\nFor centuries prior to Jesus’s life on earth, God’s people participated in myriad other activities and rituals that helped them remember and convicted them to proclaim. In Joshua 4, God instructed the people to use a series of stones from the Jordan River to serve as a memorial to God’s faithfulness. The stones would spark conversation between generations about how God delivered His people from slavery in Egypt to the promise of rest and freedom in His presence—from wandering in the wilderness to security and provision in the land of milk and honey.\n\nGod’s people observed another notable sign of His faithfulness, one that left an indelible physical mark on the men of Israel. Circumcision was the sign of the covenant with Abraham that someday God would bless all the nations of the world through the family of this one man. Just as the result of circumcision cannot be reversed, neither could God’s promise be nullified. The redemption of His covenant people was always, and still is, the end game for God, and circumcision became a daily reminder of His redemption.\n\nWhile these three examples—communion, the memorial stones, and circumcision—serve to help us remember and proclaim, they are certainly not the only means to those ends. What has God done in your heart since you received the gift of faith in Jesus and began the process of sanctification initiated by His mercy and grace? Do you see evidence of transformation in your own life? Are you categorically different now that you have been crucified with Christ?\n\nIn my own life, there are still residual sins and thought patterns that hearken unto my “pre-Jesus” condition. Still, I know this to be true: if you are in Christ, you are a child of God, and as such, you have a beautiful story of redemption to tell. “This is so that all the peoples of the earth may know that the LORD’s hand is strong” (Joshua 4:24). With that in mind, let us remember and proclaim all that He has done.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-4.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 3:1-17, Exodus 25:10-22, Hebrews 10:19-22",
    "devo_title": "Crossing the Jordan",
    "devo_summary": "By Cameron Thomas\n\nThe children of Israel began their preparation for crossing the Jordan River by taking a spiritual inventory. They are not to simply count their men, but also told to look deeper at the posture of their hearts. Their future journey would take them through a road unfamiliar but not unknown to God (Joshua 3:4).\n\nThey are not commissioned to implement a new military strategy, nor do they come away armed with the latest military weapons. Instead, they are called to consecrate themselves. How strange! In the midst of preparing for warfare, they are commissioned for worship. Why? Because the children of Israel are being prepared for a display of God’s mighty power. The assembled group have only heard stories of the crossing of the Red Sea, but now they must be prepared to have their own encounter with the God of wonders.\n\nConsecration refers to preparation for a holy encounter. Do we wake up with anticipation, ready to experience the power of God in our lives? It’s easy for our hearts to become so calloused and numb toward the mundane activity of following our calendars that we fail to anticipate encounters with God. But we must make the cognizant choice to step away from distraction and ready our hearts and minds to experience our God’s presence not only in anticipation of struggle, but every day.\n\nHow can we look toward a tomorrow when we live in the reality of today? Unrealistic expectations of life, ourselves, and our responsibilities seem to compound activity after activity, day after day. Yet, Joshua heeds the Word of the Lord that tomorrow breeds expectation. Joshua’s knowledge and personal experience of Israel’s God remind him that God’s mission is bigger than any one individual (Joshua 1:2). He is bigger than any one person’s feelings of inadequacy (Exodus 3:10–11).\n\nWhat do you expect from God? What if we were to expect no more but also no less than the very presence of our loving God? We constantly need the reminder that God’s leading is what draws us into experiencing His power and blessing. But this comes into fruition under God’s terms and not our own.\n\nJoshua’s confidence in the Lord is rooted in his personal experience with Him (Joshua 1:5–8). And because of his personal encounter with God, Joshua can stand on God’s promises regardless of outside circumstances. Missionary and writer J. Oswald Sanders says, “When God ordains our service, he is morally obligated to see us through.” Indeed, God’s promises never fail.\n\nThe call of God’s people is not to lean on their own capacities but to trust the God of history, in Scripture, and in their own lives. He invites us to share in His amazing wonders. The future crossing of the Jordan River and the conquest of Canaan begin with the explicit command to make ready to be used by God. Because the Lord is ready and waiting to do wonders among us.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-3.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 2:1-24, Numbers 13:26-33, Hebrews 11:31",
    "devo_title": "Rahab & the Spies",
    "devo_summary": "By Andrew Stoddard\n\nIn his book, The Knowledge of the Holy, 20th-century pastor and author A. W. Tozer insightfully observed, “What comes into our minds when we think about God is the most important thing about us.”\n\nWhat comes to your mind? Is your initial instinct to think about a God who is “out there”? Is your default assumption that He is far away, in the heavens, on high? Because of the lingering impact of Renaissance artwork, or perhaps even Saturday morning cartoons, our unexamined functional view of God might be that He is an old, beardy Zeus-man, sitting on a big, gilded throne in outer space, ruling over, but removed from the cares of creation. Nothing could be further from the truth.\n\nNow, you might protest that your theology is far more sophisticated than that. But I wonder, if we’re really honest with ourselves, how often we operate with that cartoonish view of God as a working assumption. Meaning, you might have strong theology proper, but how is your theology practical? Do your actions and instincts betray your confessions and professions? Do you confess that God is near, but act like He is far off?\n\nWhen I think about our reading for today, I wonder how Rahab had such a strong sense of faith and courage in the face of adversity and opposition. In part, I think it’s because of what came to her mind when she spoke the truth about God.\n\n“I know that the LORD has given you this land…\n\nFor we have heard how the LORD dried up the water of the Red Sea\n\nbefore you when you came out of Egypt…\n\nWhen we heard this, we lost heart…for the LORD your God\n\nis God in heaven above and on earth below” (Joshua 2:9–11).\n\nGiven the circumstances, it’s almost humorous that Rahab reminds the spies of the history of God’s action on behalf of the Jewish people. Related to that history of intervention and salvation, she also reminds the spies of the scope and realms of His impact. Simply put, what came to mind for Rahab was that God was not just God “up there,” but also “down here” in creation and with His people.\n\nLet’s be intentional about what we think about when we think about God. He is transcendent, yes. But He is also imminent! He’s here, with us. He’s at work in and through creation, but most importantly, through the incarnation. Jesus is God with us. This means that the battles we fight and the trials we endure are not faced alone.\n\nSo, pause. Take time to really think about how you perceive God. And then be emboldened and encouraged to know that He is with you.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-2.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 1:1-18, Genesis 15:18-21, Deuteronomy 31:1-6, 1 Thessalonians 5:23-24",
    "devo_title": "God Encourages Joshua",
    "devo_summary": "By Russ Ramsey\n\nImagine that one of those emails telling you that you were the secret heir of a wealthy prince were true. Imagine you had gone your whole life struggling to make your way with less than modest means, and suddenly you were not only super-wealthy, but ruled a kingdom. Would that excite you? Would you step into that news eager to take on your new reality and all the responsibility that went with it?\n\nFor many of us, if we’re honest, we might like the idea of sudden, newfound wealth, fame, and power, but living up to the responsibility and change it would require would be a daunting task. For many, change like this would instill as much fear as anticipation. The book of Joshua is like this.\n\nJoshua begins at one of the most pregnant moments in the history of God’s people. For forty years they’ve been wandering in the wilderness, after 400 years of slavery in Egypt. They’d been shaped by so much longing for freedom, so many obstacles to overcome, and so much difficulty in the wilderness, trusting and obeying God.\n\nBut now, after all that, God’s people stand on the eastern banks of the Jordan. The Lord is ready to send them into the land He promised to their forefathers, and Joshua will lead them. It’s such a complicated situation for everyone. They’ve never been a nation. They’ve never really had a military except for what they assembled in the wilderness years. What they have instead is generations of psychological ingraining telling them they were the property of Egypt. Is it any wonder that one of the things Joshua and the people might be feeling as they prepare to enter the promised land is fear?\n\nBefore Israel was enslaved in Egypt, the Lord made a promise to Abraham that his descendants would become a great nation who would be blessed and live to be a blessing. In the opening chapters of Joshua, all of that is taking shape in unprecedented, tangible ways. Still, for every step forward Israel must take, they have to swallow hard in the face of the struggles that await. To this, the Lord reminds Joshua that He is with them, and will never abandon them (Joshua 1:5).\n\nThe Lord comforts Joshua in the same way He encourages any who are called to difficult things—which is to say all of us. He promises that He is with us. His is a ministry of presence. The Lord doesn’t promise us that He’ll make things turn out well for us when we try really hard. That’s not the assurance He deals in. He says He will be with us and remain with us, and we with Him. When your faith is in God, there is no greater encouragement than, “I am with you always, to the end of the age” (Matthew 28:20).",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/02/HRT-Joshua2021-Instagram-Master-1.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 9:23-32, Esther 10:1-3, Leviticus 16:29-31, Ephesians 1:3-14",
    "devo_title": "Mordecai’s Fame",
    "devo_summary": "By Jared Kennedy\n\nIn our culture, we love to throw parties to celebrate new life. We invite the family over for a gender reveal. We put up banners, buy some balloons, and bake a cake for each birthday. We give gifts and throw parties because life is worth rejoicing in.\n\nThe Jewish people of Esther and Mordecai’s time felt the same way. Esther 9:28 tells us, “These days are remembered and celebrated by every generation, family, province, and city.” The Jewish people still celebrate the Feast of Purim today, usually in February or March. As the book of Esther is read publicly, the people raise their voices and shout, “Blessed be Mordecai!” each time his name is spoken. Young children also spin and shake Purim groggers, noisemakers of various kinds, to drown out any mention of Haman’s name. Purim is a celebration of rescue, of salvation, of life! A celebration of the survival of a nation and people in the face of planned annihilation.\n\nThe feast of Purim is also a celebration of Mordecai and Esther’s lives in particular. After the rescue of the Jewish people, Mordecai “continued to pursue prosperity for his people and to speak for the well-being of all his descendants” (Esther 10:3). He rose to a high position in the Persian empire, second only to the king. What a legacy! Mordecai is esteemed throughout history and even today as the ideal Jewish leader. God chose to preserve His people through the interventions of Mordecai and Esther—at just the right time.\n\nIn this way, Mordecai is just a glimpse and foretaste of the infinitely better rescue Jesus won for us. No matter how small or great the circumstances, we must persevere because we share this hope: there is salvation coming! The book of Esther, and the rescue it celebrates, is a reminder for us: Though the decree of death was spoken over us, we will be found alive on the final day. Until that day, we are sealed by the promised Holy Spirit and to the praise of His glorious grace (Ephesians 1:13–14).\n\nSo, let us give Christ praise today. Let’s see our salvation won in Jesus as something to celebrate. Your eternal destination as a believer is something worth throwing a party over. Celebrate today by sharing your testimony with a friend. Even if you can’t raise your voice during the time you’re spending with this devotional, raise the voice of your heart to drown out the echoes of death. Open your heart in song to celebrate the one through whom God has brought deliverance and eternal life for you both now and forevermore.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-12.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 9:1-22, Nehemiah 8:10, Luke 1:46-55",
    "devo_title": "The Victories of the Jews",
    "devo_summary": "By J.A. Medders\n\nWhen I first saw Tolkien’s The Lord of the Rings trilogy, it bothered me for months. I was perplexed: Why didn’t the hobbits just take those giant eagles all the way to Mount Doom to destroy the ring? Rather than trekking on foot through every danger, toil, and snare, the Great Eagles seemed like a pretty great option. Reading through Esther illuminated my perplexity. Hitching a ride with the Great Eagles wouldn’t have made much of a story, and it certainly wouldn’t have made the victory as sweet. The sweetness of victory is heightened by sorrows experienced along the way.\n\nEsther and Mordecai were positioned by God to bring about a great victory of the Jewish people. God’s people had enemies all around them, ready and eager to stomp them out. But God’s plans do not fail. Haman’s sinister plot is reversed; the gruesome plan Haman wanted to execute on the Jewish people is flipped onto him and his family. Haman is outwitted by the power of the God. This is a conflict that finds its origins rooted all the way back in the garden of Eden.\n\nIn the wake of Adam and Eve’s sin, we hear from Yahweh that the offspring of the serpent—those in Satan’s kingdom—will incite perpetual conflict with the seed of the woman. And the future descendants will win (Genesis 3:15). Haman pursued his conflict with the people of God, and in the end, he is the one who is crushed. God wins. God’s people are saved. And the people of God didn’t tame their response:\n\nThat was the month when their sorrow was turned into rejoicing\n\nand their mourning into a holiday (Esther 9:22).\n\nThe Jewish people erupted in joy—so much joy that a holiday (Purim) was created on the heels of their deliverance. Here we see a model, a foreshadowing, of the kind of celebration we find in the cross and resurrection of Jesus Christ.\n\nGod used Esther and Mordecai in our salvation history. They are a part of our testimony, a part of the greater story of how God fights for His people. He chose to work through Mordecai and Esther to defeat their enemy and save His people from death. Christ defeated the ultimate enemy to deliver us from sin, and He invites us to share in His victory over death. Hallelujah! So, let us celebrate Christ and His gospel every day. Raise the cup, poured out for us. Raise up the bread, broken for us.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-11.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 8:1-17, Romans 8:10-11, Colossians 3:1-4",
    "devo_title": "Esther Intervenes for the Jews",
    "devo_summary": "By Chris Martin\n\nMy daughter was born in April 2020. Obviously, it was a bit of a tumultuous time as COVID-19 was at its first peak. No friends or family could visit the hospital when she was born, and we were discouraged from having visitors for a few weeks. We had been trying to get pregnant for a couple of years, and we weren’t sure if it was going to happen. When we welcomed Magnolia into the world, we wept with tears of joy, we praised God for His answer to our prayers, and we have tried to honor God in our stewardship of our daughter. Maggie’s safe arrival, even amidst dire global circumstances, was a beautiful provision after years of discouragement.\n\nToward the end of Esther, we see the Jewish people feel the release of relief and deliverance. Following the execution of Haman for his plot to kill the Jews, Queen Esther inherits Haman’s property and appoints Mordecai as steward of it. What sweet irony we see when we trust the Lord to work in His mysterious ways!\n\nFollowing this transaction, King Ahasuerus fulfilled Queen Esther’s request to free the Jewish people. It’s unlikely any of them imagined their freedom would come by decree of the king himself. Messengers were sent out from the king’s residence to deliver the good news to the Jewish people and, as Scripture tells us, this development led to a celebration filled “with gladness, joy, and honor” (Esther 8:16). Not only had God delivered His people that day, but the threat of Haman had been completely eliminated. Their oppressor was now dead, and their fear and mourning had been turned into utter joy.\n\nDo you recognize the hand of God at work in this world? And when you see the Lord at work, are you overcome with joy and driven to worship Him? Do you seek to honor Him or those through whom He has worked? All too often, we experience the blessing and deliverance of God and find ourselves worshiping the positive developments of our lives instead of worshiping God Himself. As those who have been rescued once and for all time by our Savior, Jesus Christ, we have every reason to be glad: our deliverance has come, and it has no end.\n\nPray and ask that God would soften your heart to praise Him for the ways in which He works in your life. Whether He’s delivered you from some kind of oppressive rule like that of the Jews in Esther, or He has simply given you a beautiful baby girl like He did for us last spring—make time to praise God for His goodness, His faithfulness, and all His mysterious ways.",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-10.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 7:1-10, Psalm 91:2-3, Revelation 20:11-15",
    "devo_title": "Haman Is Executed",
    "devo_summary": "By Aaron Armstrong\n\nI’m pretty sure that no one likes to dwell on judgment. I know I don’t. It’s much easier, and far more comfortable, to think about God as our loving Father (which He is, of course), rather than consider His justice—though Scripture assures us He is a righteous, faithful, and loving judge (Psalm 89:14). Still, I’m sweating it, reading this passage today. Because I can’t not think about God’s wrath when I read about the unfurling drama playing out in Esther chapter 7.\n\nKing Ahasuerus was furious when he learned of Haman’s plot to annihilate the Jewish people. Haman was a trusted advisor, yet he betrayed the king. He used the king to take revenge on one man for a perceived slight by planning genocide! And his fury only increased when he saw Haman falling on the couch where Esther reclined, begging for his life. It’s hard to imagine what it must have been like for Esther to be in the room as Haman’s head was covered, to hear his cries for mercy as he was taken to be executed. I can’t not think about the scene John sets in Revelation, as all the dead rise and stand before God’s throne. All who stood before Him are judged, and those whose names are not found in the book of life are thrown into the lake of fire (Revelation 20:11–15).\n\nBut even as I can’t not think about this—the wrath of God against all ungodliness, His sure judgment against sin—I also can’t help but notice the conviction of Esther in the moments leading up to the death of Haman. “Spare my life; this is my request,” she said. But she didn’t stop there, though she could have. She could have asked the king to exempt her from death at Haman’s hand. But she went further—“And spare my people; this is my desire” (Esther 7:3). It wasn’t enough for her to be spared. She desired above all that her people would be delivered from death. And just as Ahasuerus gave Esther her heart’s desire, rescuing her people from Haman’s scheme, there is something else stirred up as I read this passage. A desire that echoes Esther’s desire for her people’s deliverance.\n\nI know what it’s like to be rescued from the “bird trap, from the destructive plague” of sin (Psalm 91:3). I know that my life has been spared, but that’s not enough. I long to see the rescue of all of humanity. But no one longs for that received rescue like the One who has provided it. He “is patient with [us], not wanting any to perish but all to come to repentance” (2 Peter 3:8–9). He waits to show mercy and compassion (Isaiah 30:18).",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-9.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 6:1-14, Proverbs 26:27, Isaiah 52:1-2, Isaiah 52:7-10",
    "devo_title": "Mordecai Honored by the King",
    "devo_summary": "By Jeremy Writebol\n\nWho doesn’t love an underdog story? Watching the lowly, those who shouldn’t have a chance in the world, take on and defeat the juggernaut always delights us. Whether it’s a love story where the beastly fellow gets the girl, a legal battle in which the little company gets justice over the mega-corporation, or the beloved “Cinderella story” in basketballs’ March Madness, we all approve of the humiliation of the proud and ascendency of the humble.\n\nEntering into Esther 6 shows us that familiar motif once again. God brings down the proud, but He elevates the humble and lowly. Even today, when Esther’s story is read at Purim in Jewish cultural traditions, the name Haman will elicit jeers and boos among the children listening to the story—the enemy would get his just desserts! If you wonder why this theme runs throughout Scripture, it’s likely because we don’t embrace it ourselves. We may root for the underdog, but in reality, we all want to be the elite, the respected, the elevated. Yet, God has ways of bringing us low at the pinnacle of our pride.\n\nThe king’s sleepless night was the provocation of the role-reversal that was about to befall Haman. Attempting to break his insomnia with some boring ledgers of “daily events” being read to him, the king stumbled (not coincidently, mind you) on the report of Mordecai’s exposure of the assassination attempt against him. It raised the question, “What’s been done to honor this man?” And here is where the proud fall, and the humble are exalted.\n\nPride blinds us. Haman was so sure of himself, so confident of his superiority and excellence, that when the king asked, “What should be done for the man the king wants to honor?” (Esther 6:6), the only person Haman could think about was himself. When we elevate ourselves in pride, we diminish everyone else around us, acting as if there is no one else in the world worth considering.\n\nThis is a cautionary tale for us today. It is the practical theology of Proverbs 26:27: “The one who digs a pit will fall into it, and whoever rolls a stone—it will come back on him.” Humility is in short supply today, but arrogance is overwhelmingly abundant.\n\nWhat would it have been like for Haman to walk Mordecai through the streets? Scripture tells us “Haman took the garment and the horse. He clothed Mordecai and paraded him through the city square, calling out before him, ‘This is what is done for the man the king wants to honor’” (Esther 6:11). Are you proud? You’ll find the result of your life similar to Haman’s: being humiliated while those you despise are elevated. Let the humility of Christ, who died for you, be your redemption. “Humble yourselves, therefore, under the mighty hand of God, so that he may exalt you at the proper time” (1Peter 5:6).",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-8.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 5:1-14, Proverbs 16:18, Mark 6:14-29",
    "devo_title": "Esther Approaches the King",
    "devo_summary": "By Jeremy Writebol\n\n“I wonder what happens next?!”\n\nI often felt that way after watching an episode of the early 2000s television series, 24. Episode after episode, a clock always seemed to be ticking, plans and plot twists unfolding. Because this was before the age of streaming, I had to wait until the next week to find out if the hero was going to foil the terrorist’s plot. Cliff-hangers are one of my favorite devices in storytelling. The introduction and building of unresolved tension, a cliff-hanger suspends my interest in how it will all work out. I think that’s why bingeing serial stories today shortcuts a way of suspending curiosity in our lives.\n\nChapter 5 of Esther not only builds the tension of the story as a whole for us, but it also leaves us with a massive cliff-hanger. What’s next? I’m tempted to move, to skip ahead to tomorrow’s reading to discover the story’s resolution, instead of pausing in the tension of the moment. Yet, we should let the tension bring out the big question of this passage.\n\nOn the surface, we see dueling schemes beginning to unfold. Esther has asked the Jewish people to join her in prayer and fasting for three days while she devises a plan to save them. She prepares a banquet for the king. Haman, on the opposite side, has consulted with his wife and friends devising a plan to kill Mordecai. He builds gallows for the execution. The plans are unfolding simultaneously, the timelines set to collide in spectacular fashion.\n\nPitted against each other, it would be easy to conclude that the person with the most power will win out. Esther is the queen, yet she is at the whim of the king’s good disposition to hear her request. Haman has already put in motion his genocide plot against the Jews and seems to have an inside track on the king’s hand. Then there is the king. He seems ready to do something for Esther, “Whatever you want, even to half the kingdom, will be given to you” (Esther 5:3). And so, we sit at a cliff-hanger loaded with relational tension.\n\nMaybe you feel this tension in your own life. You have a trajectory of where you’re headed, yet there seem to be other plans that are thwarting your desired outcome. Things aren’t playing out how you wanted or expected. Your frustration is palpable. But here’s the question our tension raises: Could it be that, in the midst of what appear to be dueling plans and plots in your life, God is calling you to trust Him?\n\nHis plan isn’t revealed at this point in the story of Esther, but He has one. Where the tension is the thickest, when the cliff-hanger of life brings you to the precipice of your comprehension, can you trust God? Can you trust God even when the plans of the proud, the schemes of the wicked, and the designs of the devil are all aligned against you?\n\nPause at the cliff-hanger and ask.\n\nWritten by Jeremy Writebol",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-5.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 4:1-17, Genesis 37:33-35, Romans 5:6-11",
    "devo_title": "Mordecai Appeals to Esther",
    "devo_summary": "By Aaron Armstrong\n\nToo often, when we come to a passage like this one in Scripture, we are immediately drawn to words of comfort or inspiration that we’ve grown familiar with over time, in our own faith journey. Today, that might mean jumping to these words spoken by Mordecai to his young cousin, Esther: “Who knows, perhaps you have come to your royal position for a time such as this” (Esther 4:14). Maybe you’ve heard these words in a sermon or seen them quoted in a book, accompanied with the suggestion that you are where you are in life “for such a time as this.” In one sense, that is certainly true because God determines the “appointed times and the boundaries of where [we] live” (Acts 17:26). But that’s not the message of what Mordecai is saying to Esther, and I don’t believe it’s what God wants any of us to take away from today’s reading.\n\nMordecai’s words cannot be taken without context, however many millennia later, to be used as an all-encompassing, generic encouragement. These are the very intentional and carefully chosen words spoken by a specific man whose grief could not be comforted; a grief that echoed Jacob’s over the assumed death of his beloved son, Joseph (Genesis 37:33–35). They are words that carried a heavy burden, spoken to a Jewish woman who lived as a queen while her people were facing genocide.\n\nThese words cut to the shattered illusion of safety that Esther’s comfortable life in the king’s palace offered and revealed the truth of her own fragile existence. Mordecai’s admonishment forced Esther to face a choice only she could make: She could risk her life and go to speak with the king on behalf of her people (a danger difficult for us to comprehend), or she could live a quiet life as queen—right up until Haman’s men came to kill her too. “Don’t think that you will escape the fate of all the Jews because you are in the king’s palace,” Mordecai told her (Esther 4:13). In other words, yes, she might die if she approached the king uninvited, but she would certainly die if she did nothing at all.\n\nThat hardly seems like the straightforward encouragement we all anticipate coming out of our daily reading, but maybe it’s not meant to be. Still, there is good news in this passage because even though it is not explicitly about us, it is for us—just as all Scripture is.\n\nEven in that moment, in the choice Esther is left to face, we can see a glimpse of the gospel, peeking out through a veil of oppression. When faced with the choice of either dying or leaving His people to die, Jesus—the second person of the Trinity, God the Son, the eternal Word through whom and by whom and for whom all things were made and all things are held together—went to the cross.\n\nAnd this, He did for us.\n\nWhen we could do nothing to save ourselves. When we wanted to do nothing to save ourselves. When we were enemies and haters of God. “While we were still helpless, at the right time, Christ died for the ungodly” (Romans 5:6). And through His death, we have gained everlasting life.\n\nNo, this passage is not about you or me, but it is for us. And it is good news indeed.\n\nWritten by Aaron Armstrong",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-4.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 3:1-15, Psalm 68:1-10, Psalm 68:20, Proverbs 16:33",
    "devo_title": "Haman Plans to Kill the Jews",
    "devo_summary": "By Chris Martin\n\nDietrich Bonhoeffer was a German pastor and author, who was killed by the Nazi regime in 1945. In the introduction to his book Life Together, a Christian classic on community, an English officer who was with Bonhoeffer during his last days is quoted:\n\nOn Sunday, April 8, 1945, Pastor Bonhoeffer conducted a little service of worship and spoke to us in a way that went to the heart of all of us. He found just the right words to express the spirit of our imprisonment… He had hardly ended his last prayer when the door opened and two civilians entered. They said, “Pastor Bonhoeffer, come with us.” That had only one meaning for all prisoners—the gallows. We said good-by to him. He took me aside: “This is the end, but for me it is the beginning of life.”\n\nBonhoeffer knew what it meant to follow his God in the face of opposition of the highest order. In the book of Esther, we find another man of courage: Mordecai. Following his honoring and promotion of Haman, King Ahasuerus commanded that all the royal staff and others in his presence bow down and pay homage to Haman. Mordecai refused to bow before Haman (Esther 3:2), defying the king’s command and dishonoring Haman. This filled Haman with rage and led him to develop his plot to kill the Jews.\n\nOf course, a plot to commit genocide does not likely spring up from one encounter between two men. Though we don’t fully understand the origin or current of animosity running between Haman and Mordecai, we do know that Haman came from a long line of powerful men who hated the Jews (Esther 9:24). Perhaps this, along with his devotion to God, is what led Mordecai to act in opposition to King Ahasuerus’s command. And perhaps that history is why Haman becomes so affronted by Mordecai’s refusal to bow down to him, why his reaction is so extreme.\n\nWhile we don’t have all the information, I do know this: In our flesh, it is far too easy to become like Haman, allowing anger and vengeance to take root and crowd out reason, let alone compassion. And it is far more difficult to resist an oppressor as Mordecai did, by standing in faith and truth, resolute and strengthened by God. When I read these passages from Esther, I recognize just how tempting it might be, in the face of oppression and impending death, to bow down and give my adoration and my worship to something lesser, rather than trusting God Himself.\n\nGod willing, we may never face such devastating circumstances. But we will certainly face the pressure of friends, family, or colleagues to worship persons, lifestyles, policies, standards of living, or success. The remedy to those pressures is to practice devotion to our God now, today and every day.\n\nWritten by Chris Martin",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-3.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 2:1-23, Proverbs 31:10-31",
    "devo_title": "Esther Becomes Queen",
    "devo_summary": "By J.A. Medders\n\nAt first, it might be difficult to connect with the details of young Esther’s story. My own day-to-day life is far removed from harems, twelve months of beauty treatments, one-night auditions for the king, and eunuchs. But after pausing to consider the events unfolding in this book, I believe there is something that we have in common with the central figure here. Like Esther, we don’t get to map out every detail of our lives.\n\nAs much as we like to think we plan our own stories, make our own way, and achieve our own dreams, it’s just not true. Almost never. It is safe to say that Esther’s life is not what she had in mind as a little girl—orphaned, adopted by her cousin Mordecai, and now part of a harem in a foreign land. We just aren’t in control of our stories. Isn’t this consistent with biblical testimony? Job could never have imagined the pain and loss in his life. Joseph had big dreams, but he didn’t know that the betrayal of his brothers was a key plotline for his life’s work. The apostle Paul was heading in one direction, and then in a flash of light, everything changed. This is how life comes at us—fast. The story arcs of our lives are not in our control, but that doesn’t mean they are out of control. We, like Esther, are in the providential hands of God.\n\nWhen Esther, now numbered among the harem, is called to for her night with the king, she entrusts herself to Hegai, the eunuch in charge, and takes his recommendation on how she should prepare. The result? “Esther gained favor in the eyes of everyone who saw her,” most notably, King Ahasuerus (Esther 2:15). The next result? Esther is crowned as the queen. Again, life tends to unfold unexpectedly, changing and shifting in ways we might not have anticipated.\n\nWhat we see happening with Esther is a shadow of what happens to every Christian exile in this fallen world. The Greek word charis, meaning “favor” or “grace,” comes upon lowly sinners in the hands of God. This grace raises us up, renews us, and transforms us for kingdom work the likes of which we never could have imagined. Esther did not simply take matters into her own hands; she listened to, considered, and followed the words and wisdom of another. And in the end, she was given a position that would save her people in the future.\n\nBrothers, we, too, are exiles. We follow the words of another: God’s holy Word. We don’t take our lives into our own hands, but instead recognize that our position in the royal family of the crucified and risen King is by grace alone. We see our lives lodged in the providence of God, leveraged for God’s glory and the good of others. God is writing this story. It comes at us fast, but we can cling to Christ, our Savior.\n\nWritten by J.A. Medders",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-2.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 1:1-22, Psalm 32:7-11, Proverbs 19:12",
    "devo_title": "The King’s Decree",
    "devo_summary": "By Jared Kennedy\n\nWhat makes a man or woman worthy? What gives a person their value? Is worth found in pleasing others? In conformity to cultural expectations? Or is there personal worth and dignity that transcends what this world values?\n\nQueen Vashti refused to be exploited by her husband. She refused to show off her beauty for his drunken dinner guests. The result was a declaration from King Ahasuerus: “Her royal position is to be given to another woman who is more worthy than she” (Esther 1:19). The whole situation drips with irony. Faced with a queen who resists his indecent request, the all-powerful king of the Medes of Persians—who had just put the might and glory of his kingdom on display for his guests—is now forced to seek marriage advice from his political advisors. “What should be done to Queen Vashti,” he asks, “since she refused to obey King Ahasuerus’s command?” (v.15).\n\nThe king’s advisors saw the queen’s defiance as treason, an insult not only of her husband but one that included all the nobles and peoples of Persia. Memucan, in particular, feared the culture this one act might inspire: “The queen’s action will become public knowledge to all the women and cause them to despise their husbands… Before this day is over, the noble women of Persia and Media who hear about the queen’s act will say the same thing to all the king’s officials, resulting in more contempt and fury” (vv.17–18). You can just imagine their disgust: Well, we can’t have that, can we?\n\nSo the queen was banished and a decree issued that her position was to be given to a woman who was “more worthy” than she. King Ahasuerus was looking for a queen who would be subject to his whims and the politics of the time. But the king spoke better than he knew; his decree set the stage for all the other events in this story to take place.\n\nThe book of Esther tells of how God sent a woman into King Ahasuerus’s house, preemptively providing a means of rescue for His people. Esther’s worth wasn’t in the favorable judgment of a Persian king, nor was she without fear or sin. She was a woman, like Vashti, who was made in the image of her God, and it was through her that God chose to outwit powerful Persian men and their wicked plots, accomplishing His redemptive purposes for His people. As you read the book of Esther, remember the truth woven throughout her story: no matter how dire the schemes of man may be, no matter what judgment or standard they present, it is God alone who establishes the true standard of our value.\n\nWritten by Jared Kennedy",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2021/01/HRT-Esther2021-Instagram-Master-1.jpg"
  }
]