[
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Nahum 1:1-15, 2 Kings 19:8–19",
        "devo_title": "God’s Vengeance",
        "devo_summary": "\n\nBy Jessica Lamb\n\nScripture Reading: Nahum 1:1-15, 2 Kings 19:8–19\n\n“God is great, God is good, let us thank Him for our food.”  \n\nI don’t remember when I was first taught this prayer, but I do remember spending my childhood cheerfully chanting it each week in Sunday School over clear Dixie cups half filled with trail mix and graham crackers. This simple prayer was replaced by others as I grew older, but the essential truth it teaches about God in its opening line remains the same.\n\nGod is great. He is powerful, sovereign, and holy. We see this on full display in the opening verses of Nahum. Back in the book of Jonah, we read about Nineveh—how God responded with forgiveness and grace when the people of the city humbled themselves before God and turned away from their evil deeds.\n\nBut in the years after that deliverance, Nineveh, a city in the brutal, domineering nation of Assyria, had turned turned back to its sin. The redemptive work of God in their city was forgotten. In 2 Kings 2:10, we read how their king, Sennacherib, mocked the living God and His promises with a taunt: “Don’t let your God, on whom you rely, deceive you… will you be rescued?”\n\nIn Nahum chapter 1, the prophet shares God’s response to the actions of this unrepentant people: judgment will come to Nineveh. Our great God is just, slow to anger but righteous in dealing with sin, oppression, and plots against Him (vv.3,9).\n\nI sometimes feel whispers of Sennacherib’s taunt slipping into my thoughts as I read the Minor Prophets. The descriptions of the greatness of God remind me of my own rebellion, my own sinful nature. And so I wonder, Is this God I claim to rely on really to be trusted? Will I really be rescued? But the declaration of Nahum 1:7 drowns out those whispers:\n\n“The LORD is good,\na stronghold in a day of distress;\nhe cares for those who take refuge in him.”\n\nThis verse reminds us that God’s greatness is entwined with another essential truth: God is good. He is close to His people, a stronghold in days of distress. He is compassionate and gracious, abounding in mercy and kindness (Psalm 86:15). He is faithful even when we are not (2 Timothy 2:13). Through the work of Jesus, God invites us to know Him and belong to Him—extending the invitation even while we were sinners, rescuing us from suffering, despair, and the punishments our sins deserve (Romans 5:8). \n\nThis is our God, and He is always fully Himself. While passages like the judgment of Nineveh in Nahum show us the devastating consequences of sin, they also paint a picture of a God who is fully just, fully loving, and fully good in His response to wayward hearts and brokenness. \n\nAs we read through these Minor Prophets, we’ll read about God’s character, how He is present and active. He mourns, hurts, and acts in righteous anger. He comforts, rebukes, and restores. God reveals all this and more to us through His Word, which has the power to change us as we reflect on who He is: a God who is great, good, and fully invested in His people.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram1.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Nahum 2:1-13, Nahum 3:1-19, 2 Chronicles 32:9-23",
        "devo_title": "Attack Against Nineveh",
        "devo_summary": "\n\nBy Melanie Rainer\n\nScripture Reading: Nahum 2:1-13, Nahum 3:1-19, 2 Chronicles 32:9-23\n\nThe book of Nahum is the second act of a well-known story—the story of Jonah, a prophet chosen by God to go to the city of Nineveh to call its unrepentant people to God. But despite God’s calling, Jonah did not go to Nineveh; he went to the sea, was swallowed by a fish, and was eventually regurgitated. THEN he went to Nineveh, told the people to repent, and they did.\n\nHowever, the Ninevites’ repentance didn’t last long. Nineveh was the capital of Assyria, and Assyria was a terrible place. In an effort to describe Assyria, biblical scholars and historians have used words such as “cruel” and “arrogant,” “violent” and “tortuous.” This was a nation founded on bloodshed and established by massacre.\n\nAssyria had conquered Israel, the land of God’s people. The Israelites were exiled, their cities burned, and they were filled with sorrow and lament. All the while, Assyria’s power grew through oppression and violence. It was a superpower standing on a terrible foundation.\n\nNahum prophesies the destruction of Assyria in this short book, full of vivid images of violence. His sarcastic tone emphasizes his mocking of the Assyrians and is punctuated by the joy of the people who would “clap their hands” at the news of Assyria’s destruction (Nahum 3:19). Their oppressors would be destroyed.\n\nWhich is why, as hard as it is to remember, God had sent the Assyrians to overtake Israel initially. We see it in 2 Kings 17:6 and again in Isaiah 8:6–8:\n\n“Because these people rejected\nthe slowly flowing water of Shiloah…\nthe Lord will certainly bring against them\nthe mighty rushing water of the Euphrates River—\nthe king of Assyria and all his glory.\nIt will overflow its channels\nand spill over all its banks.\nIt will pour into Judah,\nflood over it, and sweep through,\nreaching up to the neck;\nand its flooded banks\nwill fill your entire land, Immanuel!”\n\nIsrael felt the consequences of their disobedience. And then their oppressors felt the wrath of God. The through line here is that God demands justice. Ecclesiastes 12:14 says, “For God will bring every act to judgment, including every hidden thing, whether good or evil.” The Old Testament sings of His faithfulness and mercy but also His impervious commitment to justice. God’s justice is bound up with His holiness and is part of the fabric of His universe. And His justice is satisfied in Christ alone.\n\nIn Isaiah 9, right after God’s declaration to send Assyria to overtake Israel, He makes a promise: a child would be born, a son would be given. A promise of a government and peace that would have no end (v.6).\n\nGod knew that the only way to satisfy His desire for justice was to send His Son—Himself—to stand in the place of His people. The God who warned, “Beware, I am against you. This is the declaration of the LORD of Armies” (Nahum 2:13), would turn that anger against Himself. His need for justice would be satisfied once for all time in the death of His Son. That Son would rise again, defeating death, with a promise to return and bring a peace that will have no end.\n\nCome, Lord Jesus!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram2.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Habakkuk 1:1-17, Psalm 13:1-6, Acts 13:40-41",
        "devo_title": "Habakkuk’s Prayers",
        "devo_summary": "\n\nBy Lore Ferguson Wilbert\n\nScripture Reading: Habakkuk 1:1-17, Psalm 13:1-6, Acts 13:40-41\n\nIt wasn’t until I was in college studying grammar and literature that I realized something: the word “wait” is an action verb. Something is happening, something is in motion—even when the word itself implies stasis. To wait on someone means to serve them by being actively present, even without words. In Habakkuk 1, waiting abounds. The people of God are waiting for an answer, and God is waiting until the time is right. Neither wait is wrong, still, or without action. \n\nHabakkuk says the law is “paralyzed, and justice never goes forth” (1:4, ESV). To God’s people, it feels as though they are stuck in the perpetual motion of law-keeping, not seeing any hope of the future God has promised them. They stand, waiting and begging, imploring the God of the universe to hear and answer and save. \n\nGod is also waiting, and His waiting is perfect within His predetermined time. He is not being pushed to any limit, and He is not worried about being too early or too late. He is present, even though He may appear silent. And His waiting is good, even though it may feel punitive to His people. \n\nI’m sure you’re waiting for something today. Just in the time I’ve written these last three paragraphs, three different individuals I know walked up to me here, at the coffee shop where I’m working. Each lamented different things they have begged God to see and act on, yet they feel He has remained silent toward their suffering.\n\nI am waiting for things, too. We are all waiting for something, and it can be very tempting to believe we are the only ones waiting. We can feel paralyzed in the waiting, left feeling that God is either ignorant of our pleas or intentionally avoiding an answer for us. But wait is a verb, and it is not one without action. God is at work in your waiting, and you are at work in it, too. Cry out to Him like Habakkuk, asking:\n\n“How long, LORD, must I call for help\nand you do not listen\nor cry out to you about violence\nand you do not save?” (v.2).\n\nDo not be afraid to bring Him your questions and emotion. God can handle your fear. He is rock solid and unchanging, but He is also acting, right now, on behalf of His children.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram3.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Habakkuk 2:1-20, Proverbs 29:18, Hebrews 10:32-39",
        "devo_title": "The Five Woe Oracles",
        "devo_summary": "\n\nBy Erin Davis\n\nScripture Reading: Habakkuk 2:1-20, Proverbs 29:18, Hebrews 10:32-39\n\nLet’s be honest. Sin can be entertaining as a spectator sport. There’s a certain draw to the grit and gore of sin in the lives of other people, isn’t there? At first glance, Habakkuk 2 reads like a cage match to me. God calls out a series of sins, and we’re tempted to sit on the sidelines, cheering, while munching on popcorn. \n\n\n“Woe to the thief and extortionist!” (v.6, my paraphrasing).\nGet em, God! we cry\n.\n“Woe to the crook in his big, fancy house!” (v.9).\nTake him down a few notches! we say with a smirk.\n\n“Woe to the murderers and crime bosses!” (v.12).\nMake them pay! we heckle.\n\n“Woe to the drug dealer, the keg provider, the predator!” (v.15).\nLet ‘em have it! we roar.\n\n“Woe to the mystic!” (v.19).\nWe’re right, and they’re wrong! we boast.\n\nBut wait—look again. This passage isn’t punctuated with the celebration of the “righteous.” There are no “Atta, girls!” for us here. God follows the woes with a dose of truth, one that makes my eyes drop to the floor and my knees weak:\n\n“But the LORD is in his holy temple;\nlet the whole earth\nbe silent in his presence” (v.20).\n\nThe holiness of God is a spotlight none of us can bear. It isn’t just pointed toward the crooks and the cowards. It illuminates our sin, and then suddenly we don’t feel much like cheering anymore. Coming face to face with God’s holiness, His righteousness, we are silenced by the weight of our sin and our desperate need for mercy. Instead of screaming, “Woe to you!” our sin compels us to respond more like the prophet Isaiah: \n\n“Woe to me!” I cried. “I am ruined! For I am a man of unclean lips, and I live among a people of unclean lips, and my eyes have seen the King, the LORD Almighty”\n(Isaiah 6:5, NIV).\n\nWe are a people prone to rebellion against the loving laws of God. We are more likely to obsess over our own reflection than the image of God we bear. We are selfish, self-reliant, and scared. We are shattered by sin, and there is not enough glue in the universe to repair us. And no matter how hard we try, we cannot clean ourselves up or drum up enough righteousness to stand before a holy God. Woe to us. \n\nThat’s the truth we must acknowledge before we can truly live out of the forgiveness and grace of our Savior, the grace we all need so desperately. Thank God, He gives it so generously to all nations and people groups (Titus 2:11). One day the whole earth will know the Lord’s glory (Habakkuk 2:14), but the ground will always be level at the foot of the cross. The gospel bids us to gather there—the thieves and the theologians, the swindlers and the savers, the predators and the preachers. We are all guilty, and our sin levels the playing field. But so does God’s grace. \n\nWe are sinners turned saints, orphans turned heirs. We were unrighteous, but now we are clothed in Christ’s righteousness. Blessed are we! The new covenant silences us once again, but this time our mouths aren’t silenced in fear. Instead, we are made speechless by the goodness of our grace-giving God.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram4.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Habakkuk 3:1-19, Psalm 17:1-15, John 1:14-18, Galatians 3:11",
        "devo_title": "Confidence in God",
        "devo_summary": "\n\nBy Claire Gibson\n\nScripture Reading: Habakkuk 3:1-19, Psalm 17:1-15, John 1:14-18, Galatians 3:11\n\nThe Broadway show, Mean Girls, is a spectacle. Hot pink and glitter, blonde hair and high-pitched voices—I saw them everywhere under the stage’s bright spotlight. As the play began, my eyes landed on Regina’s mother (played by Amy Poehler in the movie version). When her “Queen Bee” daughter arrives home with friends, the mother says: “There are no rules in this house! I’m not like a regular mom. I’m a cool mom.” Then she winks.\n\nRegina’s mother is a laughing stock. Out all of the kids in the movie, Regina needs a strong parent the most. And in trying to be the “cool” mom, she’s actually no mother at all. Her well-timed wink is proof of her weakness. \n\nI say this because we live in a time that would very much like for God to be a “cool” God. If He is all-forgiving, we suppose He is all-accommodating too. But we don’t have a God who winks at evil. In this passage in Habakkuk, we’re given explosive imagery, like a fresh pair of glasses with which to see God. Take the time to read the passage out loud and really envision the scene. \n\nAs I read this chapter, I imagine God standing in the midst of a city, turning His head back and forth, searching for something. He stomps through the earth, on the hunt. His brilliance is like light. Rays are flashing from His hand. Pestilence surrounds His feet. As I read Habakkuk 3 with this image in mind, a picture of God, I wonder, Should I fall in love with Him, or should I be afraid of Him?\n\nI think the author of Habakkuk wants us to feel that tension. Because God is attractive, He draws us to Him. But He is also terrifying. Whether we’re about to be saved or destroyed, the same thing is true: God is worthy of our awe (Habakkuk 3:2). In His presence, our mouths should drop open; He is worthy of our rapt attention.\n\nBut what is He doing in this passage? What is He after? Our answer can be found right in the middle of the chapter where the prophet tells us why God is on a rampage: “You come out to save Your people, to save Your anointed” (v.13).\n\nIn this book of poetry, I see God as a fierce fighter trampling wickedness, turning His head to the left and right, all in order to find and save me. This is such great news! God is not angry with me; He is angry with evil. God is not on a mission to destroy me; He is on a mission to destroy His enemies. That is why the last few verses of this chapter are so very powerful. Can I write my own version? Can you?\n\nEven if cancer takes the ones I love away\nEven if my marriage falters and fails\nEven if the house is empty of children forever\nEven if my career is cut short\nEven if my bank account is nearing zero\nEven if all I see is sorrow and pain and destruction—\nEven then I will rejoice in the Lord.\n\nI will trust Him.\n\nI will wait quietly for God to do His work, confident in His goodness and His timing.\n\nNo, God does not wink at our sin. But He loves His children, and He holds us in His arms, even as His feet stomp out the worst of the evil in this world.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram5.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Zephaniah 1:1-18, Romans 9:19-24, 2 Peter 3:8-10",
        "devo_title": "The Great Day of the Lord",
        "devo_summary": "\n\nBy Rebecca Faires\n\nScripture Reading: Zephaniah 1:1-18, Romans 9:19-24, 2 Peter 3:8-10\n\n“The day of the Lord…” \n\nThere are lots of passages throughout Scripture pointing to “the day of the Lord” as judgment, like Isaiah 13:6, which instructs the reader to “Wail! For the day of the LORD is near.” The instruction to “wail” suggests some sort of reckoning. But there are other passages that speak of a joyous day: “Hallelujah! Salvation, glory, and power belong to our God, because his judgments are true and righteous” (Revelation 19:1–2).\n\nThe day of the Lord seems to be a culmination of things, when God will set all things aright. It is a day of judgment against wickedness—those who will not humble themselves will be humbled—and a day of salvation for those who love God. So our understanding of this event really depends on which camp we’re in; it all comes back to the saving grace of Jesus.\n\nThe prophecy we read in Zephaniah 1 is deeply troubling, thick with wrath, destruction, and a distressing commentary on our inability to save ourselves. The prophet’s words remind us of the great and awesome nature of God; He is not to be trifled with, and He will not be mocked. He will not leave sin unpunished, nor will He be placated with cheap offerings or empty lip service. He is a holy God, and He will purify all creation from the stain of wickedness. When the day of the Lord comes, those who have given their hearts over to the things of this world will be brought low.\n\nThat’s an uncomfortable idea. It requires us to examine our own hearts and ask ourselves, Am I like those who pledge loyalty to the Lord, while at the same time pledging loyalty to the world? Do I really long to see the goodness of the Lord above all else? We simply cannot serve two masters (Matthew 6:24). When we consider the day of the Lord, we ought to be driven to repentance.\n\nI am struck by these words in Zephaniah 1:7: “The LORD has prepared a sacrifice; he has consecrated his guests.” This would have been a familiar image to the Jews, because they understood what regular sacrifices in the temple entailed. Each sacrifice was a twofold sign: an image of God’s holy burning wrath against sin, and a reminder that God would provide a substitute payment for His people. Here, even in the midst of Zephaniah’s terrible warning, is a reminder of God’s just wrath poured out on Christ. \n\nThat was a day of judgment, of wrath and distress, of darkness and gloom, when Christ’s blood was poured out on our behalf. Even now, “the great day of the LORD is near, near and rapidly approaching” (Zephaniah 1:14). May knowing this truth lead us to repentance. May it lead us to Christ.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram8.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Zephaniah 2:1-15, Psalm 27:7-10, Romans 11:1-6",
        "devo_title": "A Call to Repentance",
        "devo_summary": "\n\nBy Melanie Rainer\n\nScripture Reading: Zephaniah 2:1-15, Psalm 27:7-10, Romans 11:1-6\n\nOftentimes, I find myself deeply influenced by other people rather than by Jesus. I scroll Instagram and find new recipes, new decorating tips, new fashion ideas, and myriad examples of my self-assigned inadequacy. It’s dangerous, because it draws me deeper into the trappings of this world and further away from pinning all my hope on the person and work of Christ. \n\nThere is nothing inherently wrong with Insta-inspiration or the longing for beauty that it stirs up within me. But that longing for beauty will never be satisfied outside of eternity, outside of the God who created beauty.  \n\nZephaniah chapter 2 opens with a call to repentance for the people of God, who had succumbed to the lure of the idols of their pagan neighbors. The passage addresses Israel but focuses on the impending judgment of Israel’s enemies. The first two verses strike straight into my heart: \n\n“Gather yourselves together;\ngather together, undesirable nation,\nbefore the decree takes effect\nand the day passes like chaff,\nbefore the burning of the LORD’s anger overtakes you,\nbefore the day of the LORD’s anger overtakes you.”\n\nIn the original Hebrew text, the word “goy” is used for the word “nation”—a word typically used to identify nations other than Israel. We know, however, that in these verses, the prophet is addressing Israel, specifically. So why use “goy”? Because Israel had become so influenced by the surrounding pagan nations that she had become like one of them: more pagan than godly. \n\nThe lure of idols brought Israel to the brink of destruction. My idols are not made of gold, nor do I worship them in pagan temples, but I am so desperately drawn to the fleeting beauty of the material world. I chase after it. I demand it. I see what my neighbors have, and I want more and better. From the outside, I’m sure I appear more worldly than godly—an assertion I really cannot deny. \n\nGod set aside the people of Israel for Himself, for His glory. But they turned away from Him and toward the gleaming idols of their pagan neighbors. He has called me to Himself. I am so thankful He did, and I’m grateful for the reminder today to keep my heart focused on Jesus and His glory, not the glories of this world.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram9.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Zephaniah 3:1-20, Isaiah 30:18, Hebrews 7:22-28",
        "devo_title": "Woe to Oppressive Jerusalem",
        "devo_summary": "\n\nBy Rebecca Faires\n\nScripture Reading: Zephaniah 3:1-20, Isaiah 30:18, Hebrews 7:22-28\n\n“Woe to the city that is rebellious and defiled, the oppressive city!” declares Zephaniah (3:1). Woe is a scary word, isn’t it? It is a word used to indicate deep grief and calamity. It is a declaration of impending ruin, tidings of bad times to come. Who wants to talk about woeful tidings? I’d rather talk about joyful ones (Isaiah 9:6). But here in Zephaniah 3, the word woe is offered as a relief because it signals the end of injustice and the dawn of righteousness and hope.\n\nGod’s rebuke of Jerusalem centers on its inversion of justice and injustice. Leaders, prophets, and priests are supposed to uphold justice, not instigate injustice, right? But that’s just what they are guilty of, and so God’s rebuke is followed by a series of specific indictments. The rulers of the city are characterized as lions who devour, rather than shepherds who protect. The prophets are reckless, not wise. The priests are profane, not holy. And when God confronts them, their response is not repentance, but increased corruption. All of this sounds a little convicting and familiar.\n\nBut God “applies his justice morning by morning; he does not fail at dawn” (v.5). He cannot abide continuing injustice, but restores righteousness. Woe to those who persist in doing injustice! The final fulfillment of God’s promise is found in Christ, who is the true King, Prophet, and Priest—just, wise, and holy.\n\nHis restoration, however, is not only a resetting of the social order; it’s also the transformation of a people, who will be marked by pure speech and wholehearted devotion to the Lord. Their sins will be washed away, and they will walk in humility, meekness, righteousness, and truthfulness before God. On His holy mountain, they will dwell in peace and security.\n\nThe contrasting images of woeful ruin and righteous security are often hard for us to grasp simultaneously, but we find them perfectly pictured in the image of God as a warrior who saves. His warfare is the warfare both of justice and of salvation. But He is not just a warrior who saves—He is a warrior who sings. In one of the most beautiful verses in the Bible, we read: \n\n“The LORD your God is among you,\na warrior who saves.\nHe will rejoice over you with gladness.\nHe will be quiet in his love.\nHe will delight in you with singing” (v.17).\n\nYou! With all your injustices and vices, and in spite of your failings—when God looks at you, He sees Christ’s perfect righteousness. He rejoices over you with gladness, delight, and singing. Thanks be to God for both His justice and His love. Hear His faithful promises today, and let your heart be quieted and calmed by His love.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram10.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Haggai 1:1-15, Ezra 4:24-5:5, Ephesians 2:19-22",
        "devo_title": "Command to Rebuild the Temple",
        "devo_summary": "\n\nBy Claire Gibson\n\nScripture Reading: Haggai 1:1-15, Ezra 4:24-5:5, Ephesians 2:19-22\n\nPractically speaking, the Israelites had good reason to put off building the temple. It wasn’t too far in the past that Babylon had burned the first one to the ground. They feared that if they put all of their time, money, and political capital into rebuilding it, it might end up being a waste in the end. What if someone else came and destroyed it again? In response, they lived safe, small lives that created little of lasting value. But then Haggai arrived with a word from the Lord, and twice he says to God’s people, “Consider your ways” (Haggai 1:5, ESV).\n\nConsider your ways. Think carefully about what you do and why you do it.\n\nWhen I consider my ways, I realize that like the people of Israel, I spend time farming in fields that bear no real fruit in my life. I pour money and resources into things that are temporary—things that, though opulent, never feel like enough. I dress my spiritual wounds with consumer comforts. I go to quick-fixes, partly because they seem to temporarily work, and partly because I’ve been conditioned to reach for them without even thinking. I spend a lot less time considering, and more time acting out of compulsion. Much like the Israelites, I often feel like my money goes into a “bag with holes” (v.6). \n\nYikes. Sorry, God. \n\nIt would be easy to stop there and conclude that this passage is meant to encourage me to be more holy with the way I spend money. But is that what Haggai is saying? Is the point to give more to charity and stop wasting time? Maybe. Lord knows I have work to do in those arenas. But I think there’s more to what God is saying here. Over and over again throughout Scripture, the Lord invites His people to give Him everything—not because He is angry with them or needs something from them, but because He wants to prove Himself trustworthy. \n\nIn this story, God doesn’t leave His people to build the temple alone. He gives them His presence. He tells them, “I am with you” (v.13), and He doesn’t stop there. Along with His presence, He provides for them abundantly. Though the Israelites are willing to sacrifice their hard-earned money to build the temple, God works a bureaucratic miracle, and King Darius ends up paying for the whole thing!\n\nThough it is terrifying to risk everything, our God delights in filling our empty hands. God didn’t need Israel’s finances—He wanted their faith. He was less concerned about their wallets and more concerned with their willingness to take Him at His Word. He pointed out the powerlessness of their pennies in order to wake them up to their purpose.\n\nAt the beginning of this story, the Israelites looked at rebuilding the temple like powering through a spreadsheet, a to-do list. By the end, they’ve experienced what it’s like to live with the resources of a holy, all-powerful God. It’s exciting to serve a God this big, this extravagant and trustworthy. He asks me to consider my small ways, and then He invites me into His bigger, more miraculous plans for my life. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram11.jpg"
    },
    {
        "book_title": "Nahum, Habakkuk, Zephaniah, & Haggai",
        "devo_passages": "Haggai 2:1-23, Romans 8:9-10, Hebrews 12:26",
        "devo_title": "Encouragement and Promise",
        "devo_summary": "\n\nBy Erin Davis\n\nScripture Reading: Haggai 2:1-23, Romans 8:9-10, Hebrews 12:26\n\nI suppose we’re all a little skeptical in the promises department. We feel like we need some collateral when someone makes one. But as a woman, as a Christ-follower, and as a broken person in desperate need of healing—nothing has changed me more than the Word of God, and more specifically, His promises to His people.\n\nAs the scattered Israelites stared at their ruined temple, God’s promises, voiced through Haggai, must have seemed impossible. And yet He fulfilled His promises in ways they never could have fathomed. Jesus would one day restore the temple. In fact, He would become the temple (John 2:19). \n\nHe will keep His promises to us too. Everywhere we see destruction in our lives, we will one day see restoration. Where we feel only brokenness, we will one day experience healing. The grief we know so intimately now will one day be replaced with deep, lasting joy. Right now, this very moment, Jesus is working to make all things new. It won’t be long now. \n\nDeath will die. Tears will dry. All brokenness will mend. And where we currently see rubble, we will see a world re-built on the bedrock promises of God. \n\nWhen? In the words of the Lord Himself, “in a little while” (Haggai 2:6). The time between this moment and the fulfillment of the beautiful promises of God is short. On the radar screen of eternity, the time between now and the realization of His promises is just a blip. And as we wait, He tells us, “My Spirit is present among you; don’t be afraid” (Haggai 2:5; see also Romans 8:10). His words are not just an encouragement, but a promise too.\n\nBased on the evidence of their current circumstances, the Israelites had reason to believe that God had abandoned them and reneged on His promises. Yet through the prophet Haggai, God reminded them to get their eyes off the brokeness because He is a God who comes through. If they’d only turn toward Him, they would see it! The call is the same for us, to lift our eyes from the brokenness inside us and all around us. We can look forward with great hope because God’s promises are true! \n\n“For people swear by something greater than themselves, and for them a confirming oath ends every dispute. Because God wanted to show his unchangeable purpose even more clearly to the heirs of the promise, he guaranteed it with an oath, so that through two unchangeable things, in which it is impossible for God to lie, we who have fled for refuge might have strong encouragement to seize the hope set before us” (Hebrews 6:16–18). \n\nHung on a cross, Jesus chose to die for us. His finished work there is our collateral. We are a broken yet redeemed people, stitched together with a promise. There is something better coming. It won’t be long now. Just a little while. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/SRT-MP-instagram12.jpg"
    }
]