[
  {
    "book_title": "John",
    "devo_passages": "John 1:1-51, Genesis 1:1-5, Isaiah 55:10-11, Hebrews 1:1-4",
    "devo_title": "The Word Was God",
    "devo_summary": "\n\nBy Kaitlin Wernet\n\nText: John 1:1-51, Genesis 1:1-5, Isaiah 55:10-11, Hebrews 1:1-4\n\nGathered around the living room, we remained seated as the doorbell continued to ring. We didn’t need another casserole or vase of sympathy flowers; we needed words. \n\nVoid of compassion, the blank document—an unforeseen obituary—stared back at us, wringing all adjectives of their meaning, one after another. Each suggested description seemed to shrink our beloved boy, the one who held the titles of both my best friend and my younger brother, into someone foreign and unrecognizable. The task of fitting all of his life and all of our love into one small newspaper column was exhausting, so we traded our pencils for pillows and gave up for the night. \n\nA few hours later, unable to sleep, I rolled over to see a small beam of light coming from downstairs, and decided to follow it. I found my sleepy-eyed father furiously scribbling notes on a stack of white index cards. Between the light blue lines were favorite stories, memorable quotes, and beloved quirks. My dad handed me a stack, and as the dark sky faded into morning, our collection of cards finally created the outline of something familiar—someone familiar. \n\nI imagine the Apostle John sitting down to translate the encounters he’d had with Jesus into suitable words. To him, Jesus was not a faraway character, but a trusted friend and beloved Savior. Writing these words, this Gospel account, John probably recalled intimate details about Jesus—the way He smelled, what His favorite foods were, the sound of His laugh. He could clearly call to mind the expressions his friend made when feeling tired or excited or somber. Yet, John undertook the task of assembling words to describe the heaven-sent Son of God to those of us who didn’t know Jesus in the flesh.\n\nJohn must have had a wealth of stories to choose from when deciding how to open his eyewitness account. But, through the Holy Spirit’s inspiration, this dear friend of Jesus begins his narrative with the thing that identified Jesus most: \n\n“In the beginning was the Word,\nand the Word was with God,\nand the Word was God.”\n-John 1:1\n\nAfter years of witnessing Jesus’ parables, miracles, and interactions firsthand, John presents Jesus as the Word—a tangible love letter from God. Jesus did not come to merely deliver a message from God—He Himself is the message. \n\n“The Word became flesh and dwelt among us. We observed his glory, the glory as the one and only Son from the Father, full of grace and truth.” -John 1:14\n\nThe Apostle John’s words are not only the beginning to another chapter in the Bible; they are the beginning to understanding who Jesus is. He is our promised Savior. He is the one who has been with God from the beginning. He is the Word.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/SRT-John16-Instagram1s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 2:1-25, Psalm 104:14-15, 1 Peter 4:11",
    "devo_title": "Glory on Display",
    "devo_summary": "\n\nBy Lore Ferguson Wilbert\n\nText: John 2:1-25, Psalm 104:14-15, 1 Peter 4:11\n\nI have always wondered why Jesus gave permission to not believe on account of Himself alone. After all, wasn’t it He, who claimed to be the way, the truth, and the life? That no man comes to the Father except through the Son? (John 14:6). Why then, did Jesus Himself say, “If I am not doing the works of my Father, then do not believe me; but if I do them, even though you do not believe me, believe the works” (John 10:37,38). Even if, Jesus said. Even if you cannot believe His words, believe the works of His hand.\n\nPastor and author Tim Keller calls Jesus the Lord of the wine, the feast, the party, and basically, the greatest time ever. We know this because His very first miracle—the first work of His man hands—was the turning of water into wine. Nay, the best wine. And the disciples marveled, John tells us; they believed in Him (John 2:11). It was because of a miracle that His disciples believed in Him, and it was on account of His miracles that many came to Him. \n\nI find it hard to trust sometimes. Don’t you? It seems sometimes that God is intricately interested in the plans and futures of so many others, while He feels far off from me. His presence feels not as near and His words sound not as bright. I find it hard to believe Him in those moments. It’s much easier to believe the God who answers my prayers, clears my ways, and makes straight my paths. It’s easier to believe the God who is there. \n\nI think Jesus knew this. In our common vernacular, I imagine His words sounded something like this: “If you cannot believe me (even though I’m doing these works right in front of you), can’t you believe on the evidence of me?” \n\nI don’t know whether Jesus was disappointed with the people for being incredulous at what played out in front of their eyes, in their skepticism and doubt. But sometimes, when God feels far from me, I remember the glory of Jesus and imagine these words to be more tender than perhaps He meant them. I imagine He knows to believe is hard enough, and even harder when our hearts have grown hard and our hearing dull, and this is why He worked miracles during His short time on earth. He wanted so deeply for the people to believe and see and understand and come and follow Him. \n\nRecently, at Christmas, we celebrated the coming of God to earth not only as man, but as baby. That baby grew into a man, changed water to wine, healed blind eyes, raised the dead, commanded the storm to be silent, and then He died an unjust and brutal death. But this can never be the end of our gospel story, because the most miraculous event comes after: His own resurrection and the proffered gift to us of eternity with Him. Jesus is one long succession of miracles, from birth until death and then life again. His glory is on display from the beginning of time until now, this very second, even in my doubt and my struggle with belief.\n\nI know so many of us struggle to believe with all our hearts that all Jesus’ words and love are true. But do you see His miracles? He didn’t do them for the healed, calmed, and raised alone. He did them for you and for me, and for all humanity. His best glory is the belief of His children.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram2s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 3:1-36, Ezekiel 36:25-27, 1 Timothy 2:5-6",
    "devo_title": "For God so Loved",
    "devo_summary": "\n\nBy Erin Davis\n\nText: John 3:1-36, Ezekiel 36:25-27, 1 Timothy 2:5-6\n\nJohn 3:16 wins the prize for the most well-worn verse in the Bible. Scribbled on bathroom stalls, held high on signs at basketball games, or added to the gear of NFL quarterbacks, John 3:16 is seemingly everywhere. When things become familiar, they sometimes lose their ability to “wow” us. But we still need John 3:16.\n\nIn John 3, we find Jesus in a clandestine conversation with Nicodemus, a Pharisee and influential Jew (v. 1). Nicodemus was trying to wrap his well-educated, powerful brain around the fact that the Savior of His people didn’t look like, act like, or teach like Nicodemus thought he should. What Nicodemus was really wrestling with was the gospel. \n\nI’ve always had a soft spot for Nicodemus, probably because I’ve stepped into the ring and gone a few rounds with the gospel myself. There is a tiny corner of my mind and heart that gets it: I am a sinner, deserving of eternal separation from a holy God. Through His death on the cross, Jesus paid the penalty for my sin and made a way for me to be reconciled to the Father (Romans 6:23). But I struggle to convince my whole self that the gospel can be this simple. \n\nSurely, I need a lot of good works to save me. I mess up so often, God must have changed His mind about me. Maybe if I run myself ragged, involving myself in every possible ministry, I will please God.\n\nThese are the things I tell myself nearly as often as John 3:16 shows up on the side of a semi-truck. It’s what we see when we read between the lines when Nicodemus said to Jesus, “But how can anyone be born when he is old?. . . Can he enter his mother’s womb a second time and be born?” (John 3:4). \n\nA few short verses later, we see Nicodemus finally collide with gospel truth: \n\n“For God so loved the world in this way: He gave his one and only Son, so that everyone who believes in him will not perish but have eternal life.” -John 3:16\n\nThis is so good! Let’s keep reading: \n\n“For God did not send his Son into the world to condemn the world, but to save the world through him.” -John 3:17\n\nWhen I try to create a list of requirements for my salvation, I do so out of fear and forgetfulness—like Nicodemus. I’m fearful of being punished and forgetful of God’s character. But God loves us so much! That’s why He sent Jesus here—not to condemn us but to save us. His perfect plan for salvation is laid out for us in John 3:16-17. \n\nMay these words from our Savior never grow stale in hearts and minds, and may we never grow tired of hearing them.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram3s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 4:1-54, Isaiah 55:1-3",
    "devo_title": "The Living Water",
    "devo_summary": "\n\nBy Andrea Lucado\n\nText: John 4:1-54, Isaiah 55:1-3\n\nI wonder if she spotted Him from a distance, a man sitting at the well alone—her well, the one she visited daily. I wonder if, as she drew closer, she could make out Jesus’ face and recognize His nationality. A man—a Jewish man—sitting at her well?\n\nShe approached, probably confused. Maybe even a bit afraid. Then, Jesus spoke to her.\n\nIn this story from John 4, Jesus broke through at least three cultural and social barriers of His time:\n\n1. He spoke to a woman, and traditionally, Jewish men were not to be seen conversing with women.\n\n2. He spoke to a Samaritan, and as the Scripture says, Jews had no dealings with Samaritans at the time (v. 9).\n\n3. He spoke to a woman He knew was an “adulteress”—a woman who had more than one husband and was with a man she wasn’t married to.\n\nYet, Jesus spoke to her. A woman. A Samaritan. A sinner.\n\nAnd He didn’t just say hello. Over the course of their brief and profound conversation, He offered her the gift of a lifetime: living water, eternal life. “But whoever drinks from the water that I will give him will never get thirsty again,” Jesus said to her (v. 14).\n\n“Sir,” she said, “give me this water, so that I won’t get thirsty and come here to draw water” (v. 15). \n\nThere she was, standing beside the Messiah in the flesh, and she didn’t fully understand what He was telling her. She took His offer of living water literally. She didn’t get it—not yet.\n\nI love this part so much because it paints such a real and beautiful picture of grace. You don’t have to fully “get it” to receive it.\n\nThat part is hard for me, a lifelong Christ follower, to accept. Unlike the Samaritan woman, I have the knowledge. I like to think that I know Jesus and His story, that I know the right answers and theology. But this story says the gift of Christ is for anyone who wants to receive it—no matter how little you know, how little you have been taught, or how wayward you have lived. Grace reminds us how level the playing field is. \n\nThe Samaritan woman wanted what Jesus offered. She knew this if she knew nothing else. “Give me this water,” she said. And that’s all she had to say.\n\nThat’s all we have to say, too. From the woman frantically checking all her Bible-study boxes to the woman buried under the weight of past sin and shame, this promise is for all of us. Because we’re all thirsty. We’re all weary. We are all desperate for the Jesus who stands at the well offering the exact and only thing we need.\n\nGive me this water, we say, breathless and tired. And He does.\n\n \n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram4s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 5:1-47, Exodus 20:8-11, Luke 6:5, 1 Thessalonians 4:13-18",
    "devo_title": "Lord of the Sabbath",
    "devo_summary": "\n\nBy Kim Cash Tate\n\nText: John 5:1-47, Exodus 20:8-11, Luke 6:5, 1 Thessalonians 4:13-18\n\nI’ll never forget the day I sat down to study my Bible and discovered my toddler had beaten me to the pages. Scribble marks adorned two chapters in Luke—big loopy scribbles in permanent blue ink. “Oh, no!” reverberated within. This was my favorite Bible, the one I spent time with daily over a hot cup of coffee. I was learning to do inductive study with this Bible and marking key words with care. I’d cringe if I had to erase a bit of colored pencil, knowing it wouldn’t be clean. But this was more than a smudged word. Two entire pages had been ruined.\n\nI sat my little girl on my lap to explain gently that she couldn’t color in mommy’s Bible. She’d meant no harm, of course, but this was a teachable moment. She simply couldn’t go around taking pen to paper in books around the house.\n\nBut in that moment the Lord graciously spoke to my heart. My daughter hadn’t taken a pen to any other books, only this book. She was modeling what she’d seen.\n\n“Sweetie, were you ‘studying’ like Mommy?”\n\nShe smiled, nodding her head big.\n\nIt became my teachable moment. Instead of focusing on “the rules” or my own angst over the pages, I could see the bigger picture. God had been moving in my little girl’s heart, drawing her to His Word. She wanted to interact with it in the only way she knew how. Lifting my focus helped me to see God at work, which changed everything.\n\nIt’s often easy to miss God’s hand at work, just as many did when Jesus walked the earth. I’m astounded when I read of the man Jesus healed by the pool of Bethesda, because of the scene afterward. People had seen this man laying around for thirty-eight years, and suddenly he was walking. Yet, no one said, “Wow! What happened? How were you cured?” No one praised God that he’d been delivered from decades of infirmity. Instead, the healed man is chastised for carrying his pallet on the Sabbath. And the Jewish leaders want to know, not who cured him, but who had the audacity to tell him to pick up his pallet and walk with it (John 5:12).  \n\nJesus, the Son of God, was there among them. A miracle had been done in their midst. Yet, focusing on the rules of the Sabbath, they missed the Lord of the Sabbath.  \n\nHow often do we do the same? How often are we so focused on one side of a circumstance that we miss God’s purposes altogether?\n\nJesus is the Author of life. And He brings not only life, but light, grace, and glory into that which seems dead, dark, and overwhelming (Acts 3:15; 2 Corinthians 4:6). We’re told to walk by faith and not by sight (2 Corinthians 5:7) because when our eyes are faith-filled, we see the divine. We see God. \n\nJesus is always working, in every facet of our lives and the lives of those around us. Let’s pray to keep our eyes fixed on Him, so we can behold every moment.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram5s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 6:1-71, Acts 3:22-23, Psalm 29:10-11",
    "devo_title": "The Bread of Life",
    "devo_summary": "\n\nBy Andrea Lucado\n\nText: John 6:1-71, Acts 3:22-23, Psalm 29:10-11\n\nThe day after Jesus miraculously multiplied loaves and fish, the crowd He fed went looking for Him. They loaded into boats and stalked Jesus across the Sea of Galilee. When they found Him, Jesus knew the real reason they had come: “You are looking for Me, not because you saw the signs, but because you ate the loaves and were filled. Don’t work for the food that perishes but for the food that lasts for eternal life, which the Son of Man will give you” (John 6:26-27).\n\nThe crowds didn’t yet understand the meaning of the Bread Jesus spoke of, so they took Him literally and hoped He would perform the miracle again. They begged, “Sir, give us this bread always!” (v. 34).\n\nIt sounds demanding, right? A little superficial? How could these people stand before the Son of God who offered them eternal life and demand more barley loaves instead?\n\nIt sounds ridiculous, but it also sounds familiar. I’ve done this before with my prayers and requests. I have often begged for bread (and when I am asking Him for bread, it’s the lower-case bread). I am asking for what I want instead of Jesus Himself. Because, admittedly, what I want is often not Jesus.\n\nOur conversations might go something like this:\n\nMe: I want a new job! I hate this one!\nJesus: Here is contentment. It will put your soul at rest. This is what you need. Not a new job.\n\nMe: I want a husband now because everyone else I know is getting married!\nJesus: Here is trust. Trust in me and our relationship will deepen.\n\nMe: I don’t know what to do. Give me a sign!\nJesus: Here I am. My Spirit lives inside of you, guiding you all the time.\n\nI need the same explanation the crowd did that day when Jesus said, “I am the bread of life.”\n\nThe Bread of Life is so much more than the bread I ask for. It endures (v. 27). It gives life to the whole world (v. 33). It is given freely to those who believe (v. 29). Those who eat it will abide in Christ, and Christ will abide in them (v. 56).\n\nThe true miracle of the Bread of Life is that Jesus is all we need. All that other stuff we are hoping will fill our bellies up? It is nothing compared to Christ Himself.\n\nAfter a bit of refining and a lot of grace, my hope is that we will look up one day and realize that our prayers for perishable things can be simplified into one prayer. May we grow to want only one thing and passionately learn to pray, “Give us Jesus, always!”\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram8s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 7:1-53, Leviticus 23:39-41, Joel 2:28-29",
    "devo_title": "A Prophet from Galilee",
    "devo_summary": "\n\nBy Kim Cash Tate\n\nText: John 7:1-53, Leviticus 23:39-41, Joel 2:28-29\n\nWhen I was a young girl, I loved to visit my father’s elementary school. He was the principal, and being the principal’s daughter made me feel special. I especially loved the times he sent me on errands. I would walk into the cafeteria or library, looking like any other student. But when the staff learned who I was—and that I’d been sent by my father, the principal—it made all the difference. All that he represented was attached to me.\n\nI love that the book of John sets itself apart from the other Gospels in the way it showcases Jesus as the Son of God. While Matthew, Mark, and Luke together have a handful of instances in which Jesus refers to Himself as “sent” by God, John records more than thirty. As Jesus talked to the crowds—and in particular, to the Jewish leaders—He used some version of these words: “Him who sent me… the One who sent me.” \n\nJesus’ choice of words was purposeful. The Jewish people knew that God had promised to send a Savior. It’s amazing to me that Jesus would tell them so plainly, so many times, that He was the “sent” One. In chapter 7 alone, those words appear five times:\n\n“My teaching is not Mine, but His who sent Me” (John 7:16).\n“but He who is seeking the glory of the One who sent Him, He is true… ” (John 7:18).\n“I know Him, because I am from Him, and He sent Me” (John 7:29).\n“For a little while longer I am with you, then I go to Him who sent Me” (John 7:33).\nAnd this one:  “I have not come of Myself, but He who sent me is true…” (John 7:28).\n\nGod the Father had been true to His promise. He had sent His Son for the salvation of mankind.  Yet, many who walked and talked with Jesus—who heard Him testify repeatedly that He was the sent One—did not believe.\n\nSo many precious truths are repeated this way throughout the Bible, and I can’t help but wonder at just how often I’m slow to believe them. For instance, while some version of “Do not fear” appears hundreds of times throughout Scripture, there are still countless circumstances arising in day-to-day life that tend to stoke fear deep within my heart. The Bible is replete with assurances of peace and joy despite what’s happening around us. But how long does it take to believe those assurances in a given situation? God trumpets His love for us, unconditional and eternal, a love unsurpassed by any human love we could ever experience. Yet, when we feel the sting of rejection from a friend or loved one, we suddenly feel alone.\n\nGod keeps His word. If a promise is given just once in the Bible, He is faithful to fulfill it. By His grace, He often repeats those promises, giving added assurance to our hearts. With faith, we can stand on those promises and believe, because there is another promise that’s often repeated: our God is true (John 7:28-29). \n\nNo matter how many promises God has made to us, they are all made complete in Jesus. He was sent from God for our salvation, making us daughters of the King. We can believe Him. And when we do, receiving His promises as His children, we bring Him glory (2 Corinthians 1:20). \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram9s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 8:1-59, 1 John 1:5-7, Romans 2:25-29",
    "devo_title": "The Light of the World",
    "devo_summary": "\n\nBy Lore Ferguson Wilbert\n\nText: John 8:1-59, 1 John 1:5-7, Romans 2:25-29\n\nI used to be a morning person, when mornings used to be quiet, solitary, slow. This year they’ve been abrupt, noisy, shoving—everything mornings should not be. I am disgruntled while I tie my shoes. It’s barely past 5am. I know mothers and wives and fathers and farmers and workers all over the world wake up this early, but I am self-employed and childless and have convinced myself I’m owed uninterrupted sleep until at least 6am. Our dog does not agree, and in fact, seems to think the fastest way to my heart right now is through her leash. She noses me until I relent and meet her at the front door.\n\nOutside, the moon is a pregnant belly, super and bright, shining the whole still-dark neighborhood over. How strange, I think, that the Son of God would call Himself the “light of the world,” when the most constant earthly source of light disappears every night, then reemerges as varying sizes and shapes, a mere reflection of the original source. \n\nBut this morning I remember the pillar of fire by night and the cloud by day (Exodus 13:21-22); I remember the star shining in the east (Matthew 2:1-2), the day the sun stood still (Joshua 10:12-13), and the day the earth went dark (Matthew 27:45-54). I think about how the God of the universe created the orbs and commands them even now. He is the One who sets clouds the size of a man’s fist in the sky and makes it rain for forty days and forty nights (Genesis 7:11-12). Storms cease at the sound of His voice (Mark 4:35-41). \n\nJesus tells us, “I am the light of the world. Whoever follows me will not walk in darkness, but will have the light of life” (John 8:12). But the kind of of light He offers, is not of the natural, earthly sort. His light is supernatural and He freely offers it to whomever would follow Him.\n\nYes, Jesus is the light of the world, but when our hope is in anything or anyone other than Him, the world can go grow terribly dark in a hurry. I tend to believe Jesus is near and present when I can clearly see His hand at work in my life. But when I cannot see Jesus at work in my life, He seems absent, distant and busy, too tied up with more important things—more important people—than me.\n\nBut this morning, the supermoon shines a deceptive light on my path, blue, dim, shadowed. Not sunlight, but still of the sun—whether I can see it or not. Walking with the light of the world is like that, too, I think to myself. I am still walking in darkness but I know the light exists. \n\nI come back home to a still, dark, quiet house, with a somewhat less rambunctious pup. She snores beside me on the floor and I drink my coffee slowly, quietly. I have the light of life, I think to myself, even today, in this season that feels dark in many ways. I have the light of life because I follow Jesus, and He never fails to shine, even when His light feels hidden by this world and the brokenness within it. \n\nHe is the One, true light of this world—the sun pales in comparison to the light of His presence. Even darkness is not dark to Him (Psalm 139:11-12).\n\nI light a candle and the room, once dark, is light again.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram10s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 9:1-41, Genesis 2:7, Romans 1:18-20",
    "devo_title": "He Heals the Blind",
    "devo_summary": "\n\nBy Erin Davis\n\nText: John 9:1-41, Genesis 2:7, Romans 1:18-20\n\nI believe in Jesus with every cell He created in me. I know He’s the only hope for those who are adrift from His love and truth. And yet, when it’s time to share the gospel, sometimes my palms start to sweat.\n\nWhat if I take a detour off the Romans Road?\nWhat if I create more confusion than clarity?\nWhat if I get snagged on questions about the finer points of propitiation?\nWhat then?\n\nTucked here in John 9, we find a remarkable story about hope, healing, and the beautiful simplicity of the gospel. At the center of the story is a man born blind. Surely, every time he glanced toward something his eyes could not see, he was reminded of his brokenness and need for a Healer. \n\nWhen we come face to face with our inability to be holy as God is holy, or to “fix” ourselves, we realize our need for a Savior. We try to go a day without sinning and fail before our feet hit the floor, once again realizing just how broken we are.\n\nThen the God who healed this man’s eyes lifts ours.\n\nAfter his miraculous healing, the man is pressed by the religious establishment about his encounter with Jesus. He doesn’t debate the points of the Law, or drop a truth bomb, leaving the room in stunned silence. He simply tells his story. Pay attention. It sounds like the chorus of one of the Church’s sweetest anthems.\n\nHe answered, “Whether he is a sinner I do not know. One thing I do know, that though I was blind, now I see.” -John 9:25\n\nThis man didn’t have Jesus all figured out. He couldn’t explain a God willing to break tradition on the Sabbath He created. He couldn’t reconcile the Pharisees’ perception of God with the reality of his encounter with Jesus, but he did know one thing: “I was blind. Now I see.” He was preaching the gospel. \n\nWhatever else the gospel is, it most certainly is this: “I am a great sinner and Christ is a great Savior.” \n\nThose words were penned by John Newton, writer of the hymn “Amazing Grace.” What the blind man said before the Pharisees, Newton transformed into an anthem for the ages. He cuts to the quick of both our deep need and our source of hope. Like dead eyes revealed this man’s need for a healer, our sin reveals our need for a Savior. Both needs are met Jesus in alone.\n\nThe Pharisees simply could not stand against the undeniable testimony of the the man who had been healed. So radical was his transformation that his friends and neighbors declared him a changed man, “No, he only looks like him” (John 9:9).\n\nFriends, the gospel is not a treasure to be hoarded. The call on each of our lives is to shout it from every rooftop, whisper it in every coffee shop, declare it to every fellow sinner (Matthew 28:16-20). But how? Maybe it’s as simple as Jesus rubbing mud on a blind man’s eyes. \n\nWhen we simply put the story of God’s grace in our own lives on display, we declare, “I was blind. But because of Jesus, now I see.” This is our anthem of hope, and it’s hard to deny hope. We don’t have to have all the answers; our explanations won’t woo others to Jesus. But the aroma of Christ Jesus in us will. It’s His healing presence in our own lives that draws the lost and the blind to the One who brings healing.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram11s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 10:1-42, Micah 2:12-13, Numbers 27:16-17",
    "devo_title": "The Good Shepherd",
    "devo_summary": "\n\nBy Claire Gibson\n\nText: John 10:1-42, Micah 2:12-13, Numbers 27:16-17\n\nAs an Army brat, I did a lot of following when I was a child. Along with my two sisters and my mother, we followed my dad from station to station, Army base to Army base. We moved every few years from the time I was born until the time my father retired when I was sixteen years old. It was an adventure, a privilege, and at times, it was the worst. We didn’t get to follow orders when we wanted to; we followed them when they were given.\n\nWhen I think about my life as a Christian, I often assume it’s going to be like my life as an Army brat: God gives the orders; I follow. His leadership is cold, indifferent, and ultimately, His orders exist to serve His purposes alone, not my good. My feelings, fears, and preferences aren’t considered. I am not consulted; I am told, sent, and left to deal with the emotional fallout on my own. \n\n With that picture as my guide, my feelings toward God become a deadly cocktail of fear, hurt, and distrust. I’m left wondering if He even loves me.\n\nThankfully, through Scripture, God gives us an entirely different picture of how He leads us in this life. And that picture, time and time again, is not of a cold General leading unsuspecting troops into battle, but of a Good Shepherd tending to His flock, caring for their needs, guiding their grazing.\n\nI have to admit, I couldn’t tell you the last time I saw a sheep in a field. But a little internet detective work revealed this: sheep rely heavily on their incredible range of peripheral vision—they can even see behind them without turning their heads. But their depth perception is so poor, they literally cannot see what lies right in front of their noses.\n\nI can say with conviction that these things are true of me, too. It’s easy for me to look to the past behind me, and to the side at what other people are doing. But when I look out in front of me, everything is incredibly hazy. If I’m honest, most of the time, I have no idea where I’m going.\n\nGod knows this about me. He knows I have a weak sense of vision, and so He guides me with His voice. He speaks in many ways, and even when I fear He is silent, Scripture reminds me of just how near He really is: providing for me, leading, renewing, and comforting me (Psalm 23).\n\nThis is the love of the Good Shepherd in action. With Scripture as my guide, I can see God as He truly is. I can learn from the posture of the sheep: I can follow and rest. I can take in beauty and comfort, even in seemingly dark times. I can love the Shepherd, and trust that no one will ever snatch me from His hands (John 10:28).\n\nThere are times when I’d still prefer to follow a god who sends orders via envelope or email, telling me explicitly where to go and what to do next. But that’s not real relationship. The direction and assurance I seek—that each of us need—are found solely in Jesus, the Shepherd-God. \n\nWe move toward Him, not only because we want to, but because He is the only Way. His voice is the only one we were meant to follow.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram12s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 11:1-57, Daniel 12:2-3, 1 Thessalonians 4:13-14",
    "devo_title": "When Jesus Wept",
    "devo_summary": "\n\nBy Rebecca Faires\n\nText: John 11:1-57, Daniel 12:2-3, 1 Thessalonians 4:13-14\n\nJohn’s Gospel invites readers to “come and see”—not just to hear Christ’s words, but to engage with Him, to “come and see” who Christ is. This was the way of Christ Himself. When His followers had questions, when they were troubled about the world, Christ invited them to come and see the answer: Him.\n\nWhat is the answer to sin, death and darkness? Christ. Won’t you come and see? \n\nThe phrase “come and see” appears four times in the Gospel of John, and the pattern that appears is this: when we see Christ and what He has to offer, we see life, but when we see what man offers, we see death.\n\n“Come and you’ll see,” He replied. So they went and saw where He was staying, and they stayed with Him that day. It was about 10 in the morning (John 1:39).\n\n“Can anything good come out of Nazareth?” Nathanael asked him. “Come and see,” Philip answered (John 1:46).\n\n“Come, see a man who told me everything I ever did! Could this be the Messiah?” (John 4:29).\n\nIn all three instances above, we are invited to “come and see” Christ as the Messiah, to see what He is doing. In contrast, when we focus on what we see in the world, all we’ll find is death and darkness.\n\nIn John 11:34, Jesus asks after his friend Lazarus, saying, “Where have you put him?” “Lord,” they tell Him, “come and see.” But this “come and see” doesn’t point to Christ; instead it points to death.\n\nDeath is all this world has to offer. The only solution to sin and darkness is Christ Jesus. When Christ bids us “come and see,” He shows us life. When the world bids us “come and see,” we find a man laid in a tomb. We find death. \n\nThe next verse, verse 35, tells us that “Jesus wept” for his friend Lazarus. Death has struck a blow, and Jesus weeps to see sin and its consequences in a fallen world. But His tears are not an indication of defeat. Instead, there at Lazarus’s tomb, Christ wages war on death, arresting the powers of death and decay, and reversing them. \n\n“I am the resurrection and the life. The one who believes in Me, even if he dies, will live. Everyone who lives and believes in Me will never die—ever. Do you believe this?” -John 11:25-26\n\nThe raising of Lazarus from the dead is a foreshadowing of Christ’s work on the cross, which will come just a short time later (John 19-21). Defeating death once and for all, Jesus Himself is raised from the dead. This time, it is Mary Magdalene who weeps, while looking for the body of her Lord. Jesus asks what she is seeking, then simply calls her by name: “Mary” (John 20:16). He’s calling us too (Isaiah 43:1).\n\nWe have seen who Christ is. The light has come. “Life was in Him, and that life was the light of men” (John 1:4). The invitation is no longer just to “come and see,” but to follow Him, to walk with Him (John 8:12). Now that we have seen the light, we are called to abide in it and bear witness to its power and goodness. \n\nBehold Christ, the light of life. Love Him. Walk with Him.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram15s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 12:1-50, Psalm 118:25-26, Isaiah 6:10, Isaiah 53:1",
    "devo_title": "The Father’s Son",
    "devo_summary": "\n\nBy Carolyn Denny\n\nText: John 12:1-50, Psalm 118:25-26, Isaiah 6:10, Isaiah 53:1\n\nThere’s an old church joke that the answer to every question in Sunday school is “Jesus.” As I am trying to teach my boys the gospel, I’ve realized how true this is. The answer to almost every major question really is Jesus.\n\nUnfortunately, one of my sons has a terrible time remembering names. Our conversations might go a little something like this:\n\nMe: Who came to save us?\nMy boy: God!\nMe: Who died on the cross for our sins?\nMy boy: God!\nMe: And what’s God’s other name?\nMy boy: [Silence]\n\nI’m constantly wondering how he can possibly forget the Great Sunday School Answer. But when I read through John chapter 12, I’m see he’s not the only one.\n\nModern culture often wants to distance Jesus from God, to turn Jesus into a great teacher or a prophet. If He were just a good teacher, a great man—anything but the Son of God, and God incarnate—then we could pick and choose from what He said. We wouldn’t have to submit to Him.\n\nWhen we read the New Testament we see this is not just a figment of modern culture; it was a part of first-century culture, too. The religious elite attacked Jesus for blasphemy because they understood that He was claiming to be God. They knew what Jesus meant when He said He was God’s “only Son” (John 3:16), doing His Father’s will (John 6:38). Up until that point, no one else would have dared to call God their “Father” (John 5:18).\n\nIn this chapter, we again see Jesus fulfilling His calling as the Son of God: speaking life to all who will listen, shining light in the darkness, and bringing glory to God the Father. We even catch a glimpse of the relationship between God the Father and God the Son, as Jesus wrestles with what’s to come:\n\n“Now My soul is troubled. What should I say—Father, save Me from this hour? But that is why I came to this hour. Father, glorify Your name!” \n\nThen a voice came from heaven: “I have glorified it, and I will glorify it again!” (John 12:27-28).\n\nIt is a precious insight into the Trinity, our relational God. He has come at great cost to Himself in order to seek relationship with us, offering us the resurrection and the life. \n\nNo wonder Mary was led to worship Him. No wonder the Greeks wanted to see Jesus (John 12:20). No wonder the crowd sang, “Blessed is he who comes in the name of the Lord” (Matthew 23:39). God—Jesus—truly is the answer to our most important questions, the remedy for our greatest fears.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram16s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 13:1-38, Mark 9:35, Romans 3:21-26, Psalm 31:9-10",
    "devo_title": "Servant of All",
    "devo_summary": "\n\nBy Erin Davis\n\nText: John 13:1-38, Mark 9:35, Romans 3:21-26, Psalm 31:9-10\n\nI’ve heard it said that suffering reveals the real you. What comes out of our mouths when life squeezes us in its vise grip is the stuff we’re really made of. \n\nAt the Last Supper, we find Jesus in the tightest situation imaginable. He knows unthinkable suffering is right around the corner. Since His disciples are still presuming He is going to lead a government takeover, it’s a burden He must carry alone. Jesus knows there will be no military coup. He will secure the Kingdom victory, but through suffering—not conquest. \n\nIn that crucible of suffering, the real Jesus shines through. We don’t catch one hint of self-pity or bitterness in His words or actions. He would soon be poured out on our behalf, yet Jesus remained faithful to who He is and what He came to do.\n\nHe never stopped teaching. Using bread and wine for an object lesson of cosmic consequences, Jesus taught truths in advance that His disciples would not grasp until He was gone (John 12:16). As modern Christ followers, we have access to this Upper Room as a classroom. We’re able to wrestle with the lessons of His atoning sacrifice every time we come to take communion. \n\nHe never stopped serving. Knowing that within hours His own would be nailed to a tree, Jesus took the time to wash His disciples’ feet. “So if I, your Lord and Teacher, have washed your feet, you also ought to wash one another’s feet. For I have given you an example, that you also should do just as I have done for you” (John 13:14-15). This moment wasn’t mere ritual. Jesus was showing them how to care for one another after He departed.\n\nHe never stopped loving. When I study the Last Supper, I am most grateful for this truth: “Having loved his own who were in the world, he loved them to the end” (John 13:1). To the end. Our Savior never stopped loving the undeserving, helpless sinners He came to die for. He never chose hatred or contempt. He didn’t shame or ostracize Judas, the one who would sell Him out for a few silver coins. Instead of pointing His finger at him, Jesus offered him bread.\n\nWhen hard-pressed on every side, Jesus never resented the sacrifice He chose to make on our behalf. It was in His suffering that our Savior displayed His true strength.\n\n“But he was pierced because of our rebellion,\ncrushed because of our iniquities;\npunishment for our peace was on him,\nand we are healed by his wounds.”\n-Isaiah 53:5\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram17s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 14:1-31, Isaiah 28:16, Ezekiel 1:26-28",
    "devo_title": "The Only Way",
    "devo_summary": "\n\nBy Kaitie Stoddard\n\nText: John 14:1-31, Isaiah 28:16, Ezekiel 1:26-28\n\nI don’t know about you, but I tend to over-analyze things. Sometimes even a small decision can lead to an overwhelming list of pros and cons. In my heart of hearts, I know I want pizza for dinner, but maybe I should want the soup, or the salad… or the chicken. You’d think dinner would be a simpler decision. (The answer is pizza. Always choose the pizza!) When it’s so easy to complicate the tiniest of decisions, how do we come to any sense of peace and assurance about the bigger matters in life?\n\nThe Christian faith is simple and complicated at the same time. We are called to have faith like a child (Matthew 18:3), and also to grow toward maturity (Hebrews 6:1). In some places the Word of God seems so straightforward, and yet the psalmist declared some knowledge too wonderful and lofty to grasp (Psalm 139:6). The seeming contradiction between this simplicity and complexity speaks to the mystery of the gospel. But when it comes to our salvation, Jesus doesn’t want there to be any confusion.\n\nIt’s funny—and oddly reassuring—just how human the disciples were. By the time we come to John 14, they were well into their ministry alongside the Son of God. You would think after all the miracles and face-to-face teachings from Jesus, they would have learned the basics. But when Jesus talked about the way to heaven, the disciples seemed totally and utterly confused!\n\nSo, once again, He spoke clearly, telling them:\n\n“I am the way, the truth, and the life. No one comes to the Father except through Me. If you know Me, you will also know My Father. From now on you do know Him and have seen Him.” -John 14:6-7\n\nJesus spells it out for His disciples—and for us, too—so that there can be no misunderstanding. He is the way to freedom. He is truth and life.\n\nThere are parts of our faith that are truly complex because we love and serve an infinite God. There are some questions that don’t have simple answers. The gospel is like an intricately woven tapestry, with threads intertwining in hidden places, forming the most epic story of all time. God gives us minds to think and question and analyze these mysteries with humility, so that we might grow in our understanding and love.\n\nBut, some parts of the Word are crystal clear. \n\nJesus came to our world in the form of a man so that His followers could see, know, and touch the love of their Father. In a world full of confusion, God wants His people to know exactly who He is.\n\nIf you know Jesus, you know the Creator of all and the way to salvation. As you “work out your salvation with fear and trembling” (Philippians 2:12), may you find peace in the straightforward declarations and promises of our Lord.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram18s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 15:1-27, Zephaniah 3:14-17",
    "devo_title": "The True Vine",
    "devo_summary": "\n\nBy Amanda Bible Williams\n\nText: John 15:1-27, Zephaniah 3:14-17\n\nI’m the queen of focusing on the wrong things.\n\nMy daughter makes an amazing piece of 9-year-old art and declares it dedicated to her mom (that’s me!)—and I silently lament the sea of paper covering the floor and the glue stick smashed into all the creases of the dining room table.\n\nA long-lost friend says she and her family are coming to visit for a weekend—and I spend more time worrying about the condition of the guest room than rejoicing in the long conversations and late-night laughter to come.\n\nMy husband spends hours creating new storage solutions for our mudroom (slash laundry room, slash pantry, slash coat closet, slash place the dog stays during dinner so he won’t eat food off our plates)—and I involuntarily scowl that my tired, dirty, three-compartment clothes hamper will no longer fit. (Three compartments! You can understand my sadness.)\n\nAnd here, in John chapter 15, Jesus says this:\n\n“Remain in me, and I in you. Just as a branch is unable to produce fruit by itself unless it remains on the vine, neither can you unless you remain in me. I am the vine; you are the branches. The one who remains in me and I in him produces much fruit, because you can do nothing without me” (vv. 4-5, emphasis mine). \n\nThis is what He says. But do you know what I hear? I hear, “Bear fruit.” Or, to be more specific, “Hey, you, why aren’t you bearing fruit?” I, the Queen of Focusing On The Wrong Things, read Jesus’ words and hear all of the goal and none of the grace. I want the end but forget the means.\n\nYes, bear fruit. Yes, love others. Yes, give grace to a world that will misunderstand and even hate us. But look back through John 15. Jesus is not commanding His disciples to bear fruit. The command is to remain. When we remain—when we abide in the never-ending, unconditional, forever love of Christ—then the fruit will come. \n\nWe bear fruit when, and only when, we are grafted into the True Vine. His Holy Spirit in us is the fruit producer; we are simply the branches who have the privilege of displaying His fruit.\n\nJesus Christ comes to make us new. He comes to redeem the dead branches that we are and give us abundant life! Remaining in Him—resting, dwelling, abiding in Him—is the only source of our strength, our goodness, our fruit. \n\nLet’s focus our eyes on the True Vine today. Let’s be about the business of remaining in Jesus, and trust His Spirit to be about the business of bearing fruit in our lives. \n\nLord, teach us what it means to remain when all we want to do is produce. Help us to rest in your never-stopping love. Amen.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram19s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": " John 16:1-33, Isaiah 32:14-18, Romans 8:12-17",
    "devo_title": "Jesus the Conqueror",
    "devo_summary": "\n\nBy Claire Gibson\n\nText: John 16:1-33, Isaiah 32:14-18, Romans 8:12-17\n\nMost mornings, I go to a local coffee shop in East Nashville where I order my two-dollar coffee, sit in a corner, and try to bang out a few words on my machine. They know my name here. They welcome me in the door, ask how my writing is going, and never give me the slant-eye when my coffee goes cold, while I continue to suck electricity from their walls and Wi-Fi out of their air. Here, it’s easy to pretend that life is all lattes and progress.\n\nBut the reality is, everyone around me is experiencing their own pain. The girl who stops by my table just had a miscarriage. The grey-haired man eating his oatmeal while reading the paper just lost his wife last year. The exhausted, lonely mother at the register keeps trying to order her coffee, but stops to run out the door after her two-year-old escape artist. The newspaper sitting next to me screams its headlines of tragedy: War Rages On! Politicians Still Lie! Poverty Eats Away at the Hungry!\n\nWe’re all acquainted with our own brand of heartache. It’s enough to bring you to the same conclusion as Solomon in Ecclesiastes: “I observed everything going on under the sun, and really, it is all meaningless—like chasing the wind” (Ecclesiastes 1:14).\n\nThis view of suffering is the fare the world offers up to us for breakfast, lunch, and dinner. The world tells us that if we’re hurting, it’s up to us to change our circumstances so we won’t hurt anymore. We’re to follow our heart, chase our dreams, and forsake everything—even our responsibilities, family, and God— in order to secure our own happiness in the world. But in the midst of all that noise, Jesus provides a much different view of suffering. \n\nWith some of His last words to His disciples, Jesus predicted that trouble was coming. He said they would be kicked out of the temple—losing the social center of their lives (Luke 21:5-6). They would be ostracized, killed, and separated from one another. But most importantly, He told them to expect these things, to not be surprised when they happened. Grief would be a part of their experience here on earth, just as it’s a part of ours. \n\nBut Jesus doesn’t leave us in our sorrow. He promises to turn our grief into joy (John 16:20). He tells us we’re to have courage because He’s already conquered the evil in this world (John 16:33)—and, in fact, He’s making us a new one (Isaiah 65:17).\n\nThe world tells us to break free from grief because our time here is limited. Jesus invites us to welcome our grief as the precursor to eternity. In that way, our pain is not a state of being that needs to be avoided; it is an access point to the throne of God.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram22s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 17:1-26, Isaiah 42:8, 1 John 5:20",
    "devo_title": "Glorify Your Son",
    "devo_summary": "\n\nBy Andrea Lucado\n\nText: John 17:1-26, Isaiah 42:8, 1 John 5:20\n\nThis has been a difficult week for me. I am heartbroken. I am utterly aching with loss. I feel upside-down in my sadness. Have you ever felt this way? Honestly, I wonder who hasn’t. What is your heart aching for today as you read these verses in John 17?\n\nSometimes when I find myself in the depths, cracking my Bible open is the last thing I want to do. But for some reason, today, I craved falling into Scripture. I felt that God had something for me here, in this passage. And oh, how rich this passage is, especially for the aching heart.\n\nThe hour had come for our Savior. As I read His prayer, I can almost feel His aching, His longing to protect those who’ve come to believe in Him. As He anticipated the events to come, He pleaded with the Father for the disciples He loved:\n\n“Now I am no longer in the world, but these are in the world, and I come to You, Holy Father, keep through Your name those whom You have given Me, that they may be one as We are.” -John 17:11\n\nCan you imagine being in the presence of Christ as He is praying for you? Sitting in the same room with Him, hearing Him say just before, “in this world you will have tribulation but be of good cheer, I have overcome the world,” and then watching Jesus turn His eyes heavenward and, in prayer, put your life and soul into the Father’s care?\n\nWhen I read Jesus’ prayer today, something cracked open. I felt the fervent love He has for me, the fervent love He has for us all. Right after He prayed for the disciples, He prayed for those who will believe (John 17:20). Jesus prayed for you, and He prayed for me, too—for all who would come to trust in Him.\n\nHe knew this world. He lived it, walked it, saw the desperation and the brokenness. He knew what it would mean for us to be here—that we would face a seemingly endless stream of trial and tribulation. Knowing what was to come for His disciples and for who would believe, He said:\n\n“I am not praying\nthat You take them out of the world\nbut that You protect them from the evil one.”\n-John 17:15\n\nHe did not pray for our suffering to end, or for the pain and sorrow to cease. Instead, He prayed for our protection as we face these trials and circumstances. He prayed that we would not face them alone, but with the support of our community and our God.\n\n“May they all be one,\nas You, Father, are in Me and I am in You.\nMay they also be one in Us,\nso the world may believe You sent Me.”\n-John 17:21\n\nThe idea that Jesus is not only near us, but in us—not only for us, but a part of us—brings comfort to my heart as nothing else can. “I in them, and You in Me” (v. 23)—this is His will for the Church.\n\nWhatever you face today, we as believers are one in Him, and this oneness tells the world of the glory of God. Perhaps that is why writing this has felt so healing for me: it has reminded me that I am not alone in heartache. We are all still in this world, though not of it, and whether it is joy or suffering that binds us, God is glorified in our unity.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram23s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 18:1-40, Daniel 7:14",
    "devo_title": "Not of This World",
    "devo_summary": "\n\nBy Carolyn Denny\n\nText: John 18:1-40, Daniel 7:14\n\nThe hour Jesus was born for had finally come. He’d been predicting it, waiting for it, knowing what it would require of Him: arrest, pain, and death. For anyone else, this would be a crisis moment, to be sure. For the Son of God, it was an opportunity for the most profound display of obedience, love, and humility ever known.\n\nJohn’s account of this night shows us the holiness of Jesus, God incarnate—deliberate, powerful, wise, and gentle. Put simply, He is not of this world. But the people surrounding Him? They proved themselves to be oh-so very human.\n\nAt this point, Judas’ secret sin had finally consumed him. All those months on the road—stealing from the disciples’ treasury, betraying his friends—had prepared him for this moment, and he intended to capitalize on it. Jesus responded as only He can: by declaring His deity, revealing His glory, and protecting His disciples. And even as He submitted to His arrest, Jesus gave Judas one last chance to see His true identity.\n\nPeter was a man of action, refusing to sit around and wait for Jesus to die. He followed his heart, despite Jesus’ teaching and example—despite knowing better. First, he sliced off the soldier’s ear to protect his Lord, then he denied Jesus altogether. His Savior’s response was not one of condemnation, but of grace. He protected Peter, gently rebuked him, and restored him (John 21). He continued to build Peter’s faith, even in His darkest hours.\n\nAnnas was one of the richest, most powerful Jews of his time. There was no way he’d be willing to let some upstart from the outskirts destroy everything he’d spent a lifetime building. Believing Jesus was leading the people away from his agenda, Annas had no problem breaking a few laws to get rid of Him. But Jesus had nothing to hide, no secret life to reveal. So He turned the tables on Annas, subtly challenging the leader’s interrogation of Him (which had been done in secret, and therefore, was against their civil laws). \n\nAs for Pilate, he’d learned not to interfere in Jewish matters and had become skilled at shifting responsibility. To him, this was a Jewish problem for the Jews to work out amongst themselves. But to Jesus, this wasn’t just a Jewish issue but a human one, an eternal one. It was about a Kingdom impacting the whole world and beyond, a Kingdom rooted in Truth.\n\nIn this series of events, John’s Gospel makes one thing clear: our Savior is fundamentally different from this world. His response is never fed by deception or greed or fear, but rather by an otherworldly compassion for His people and command over all circumstances. He will always accomplish His gracious plan, often in unforeseeable ways.\n\nLike the events in John 18, life can seem like one long, dark night, leaving us feeling betrayed, wounded, and scared. It’s easy to relate to Peter’s impulse to fix the situation, or Pilate’s attempts to distance himself from it. But then I see Jesus walking into the darkness, knowing all there is to fear, yet bolstered by confidence in the Father’s plan to rescue all who love Him. \n\nIt’s tempting, perhaps even good, to feel inspired by Christ’s example. But I’m finding I don’t always have the wherewithal to follow Jesus’ lead. I need to lean on Him, push against Him, knowing He will never falter or fail. Seeing His response to such an array of broken people is healing and soul-nourishing for me, a sinner. Our Savior was gentle, trustworthy, and sovereign on the darkest night in history, and He will be so with us today, even now.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram24s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 19:1-42, John 20:1-31, 1 Peter 2:22-25, Psalm 22:1-8",
    "devo_title": "The Son of God",
    "devo_summary": "\n\nBy Amanda Bible Williams\n\nText: John 19:1-42, John 20:1-31, 1 Peter 2:22-25, Psalm 22:1-8\n\nMy kids learned to fly kites this weekend. \n\nAfter much trial and error (and a fair amount of weeping and gnashing of teeth), all three of them experienced that exhilarating payoff of the kite string pulling tight in their hand and the wind lifting the cheap, plastic diamond high in the happy, flappy breeze. They stood outside for hours—5 hours, come to think of it—watching their kites soar in the air. They flew kites while singing songs. They flew kites while dancing. They flew kites while running in circles and they even flew kites while lying down. My personal favorite? When they flew kites while singing AND lying down.\n\nAs I sat on a blanket and watched the event unfold, it reminded me of a Billy Graham quote about the wind. You fellow youth group kids of the early 90’s know the one; I’m pretty sure it was spliced into the beginning of a DC Talk song: “Can you see God? You haven’t seen him? I’ve never seen the wind. I see the effects of the wind, but I’ve never seen the wind. There’s a mystery to it.”\n\nBelieving in what we cannot see can be downright hard. Even those who walked the earth with Jesus wanted to see more of Him in order to believe or hold onto belief. The crowds followed Him, pushing in closer and longing to catch a real, live glimpse of the Messiah in action.\n\nMary Magdalene was one who followed Jesus faithfully. Even after His death she went to the tomb, anxious to see the body of her Savior; and when He wasn’t there, she wept. \n\nMary needed to see Jesus. Then He appeared to her there where she knelt crying, and she saw Him and believed! \n\nThe disciple Thomas heard the news that Jesus had risen from the dead. “We have seen the Lord,” the others told him (John 20:24). But Thomas was a doubter, like I’m prone to be. \n\nThomas needed to touch Jesus. “Unless I see in his hands the mark of the nails, and place my finger into the mark of the nails, and place my hand into his side, I will never believe” (v. 25). And Thomas touched his hands to Jesus’ hands and believed!\n\nWe can understand our sister Mary and our brother Thomas, can’t we? In the hurry and sorrow and uncertainty of this life, we need a hope we can see and feel. But unlike Mary, we don’t get to see Jesus face to face. And unlike Thomas, we don’t get to put our fingers on His nail-scarred hands. Yes, we can see God’s mercy at work in the world, making broken things new. We can feel the Holy Spirit changing our hearts, softening what once was stone. But the darkest valleys leave our eyes and hands searching for something we can’t seem to find. \n\nJesus knew this would be hard for us. It’s why He gives us faith—to believe. Paul tells us faith is a gift, not something we muster up on our own (Ephesians 2:8). And Jesus calls those who have it blessed (John 20:29). He has also given us His very Spirit to live within us (John 14:26), and His Word to guide us (Psalm 119:105). Though we can’t yet lay eyes on Christ, He lays His hand of mercy on us by the indwelling of His Spirit and the gift of His Word. \n\nThere will be times when we struggle to believe what we cannot see. But the risen Savior is ever near, as alive as He was the day He spoke to a distraught Mary, and the day He beckoned Thomas to touch His side. When we have trouble seeing Him in our lives, we can see Him here, in the pages of His Word. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram25s.jpg"
  },
  {
    "book_title": "John",
    "devo_passages": "John 21:1-25, Hebrews 2:17-18, 1 Peter 5:1-4",
    "devo_title": "The Ascended Lord",
    "devo_summary": "\n\nBy Erin Davis\n\nText: John 21:1-25, Hebrews 2:17-18, 1 Peter 5:1-4\n\nI was the very pregnant, sick, and tired mama of a demanding toddler. My brain was so clouded by pregnancy hormones and sleep deprivation that I didn’t know what I needed or how to ask for help. \n\nSo Mandy made me pancakes. \n\nMandy and I weren’t friends, exactly. We mostly smiled at each other in the halls of our church, but she called me one evening with this invitation: “Come over tomorrow morning, first thing. Bring your little guy and stay in your jammies. I’m going to make you pancakes.”\n\nNot typically the kind of gal to show up at a stranger’s house in my jammies, I’m surprised I accepted her offer. I’m usually more of a “spiff everything up and look like you have it together” kind of girl. Even so, the next morning we headed over to Mandy’s in our comfies. \n\nThose were the best pancakes of my life. Food eaten on dishes I didn’t have to wash was a lifeline of sorts. That moment of simple compassion stuck with me long after I cleaned (okay fine, licked) my plate and headed home. \n\nYears later I was surprised to find a similar story in John 21. \n\nAfter a night of fruitless fishing to punctuate the best and worst months of their lives, Peter, James, John, and a handful of other disciples found themselves staring out at the same waves Jesus had walked upon. Everything had changed since then. Jesus had been arrested, crucified, and buried. Their hopes were dashed and they scattered, fearing for their lives. Peter’s grief was compounded by the agonizing memory that he denied the Savior not once, not twice, but three times. \n\nAlmost immediately after everything went so terribly wrong, Jesus started setting it right again. His death was trumped by His resurrection. His scared disciples were refocused by His return. Even Peter’s denials got reversed. \n\nJesus called His fishing friends to the shore. Peter was so anxious to be with his Savior that he jumped right out of the boat fully clothed (John 21:7). When they got to shore, they found that Jesus had made them breakfast. It was a simple gesture that demonstrated profound care and compassion. In His glorified state, Jesus tenderly met His friends’ physical needs before offering an even better portion. \n\nDuring a post-breakfast stroll, Jesus gave Peter not one, not two, but three chances to declare his love. For every denial, Peter got to make a proclamation (John 21:15-17). Though sinned against, Jesus initiated reconciliation and offered tender mercies. \n\nIn this last chapter of John’s Gospel, we see the risen Christ doing more of what He’d done all along: love and serve, invite and forgive. In fact, John ends his account of Jesus’ life by stating there were so many more things that Jesus did, “if they were written one by one, I suppose not even the world itself could contain the books that would be written” (John 21:25). Volume after volume of love and service. Book after book of invitation and forgiveness. \n\nPerhaps emulating Jesus is simpler than we think. Offer grace. Pursue reconciliation. Forgive freely. Whenever possible, love others well by serving them. Pancakes optional.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/01/SRT-John16-Instagram26s.jpg"
  }
]