[
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 1:1-25, Matthew 2:1-23, Isaiah 9:2-7, Isaiah 11:1-9, Jeremiah 31:15",
    "devo_title": "Jesus Is Born",
    "devo_summary": "\n\nBy Amanda Bible Williams\n\nScripture Reading: Matthew 1:1-25, Matthew 2:1-23, Isaiah 9:2-7, Isaiah 11:1-9, Jeremiah 31:15\n\n“Who is Jesus?” \n\nThey all asked the question. Those who walked the streets with Jesus, who encountered His teaching in the synagogues, who witnessed Him healing the sick and eating with sinners—they were compelled to understand who this man was. That was 2,000 years ago. And here we are, asking the same question today.\n\nEven now, sitting in my Nashville office, surrounded by modern technology and Western comforts, I can think of no more foundational question to ask. The answer frames what I believe about God. It frames what I know about myself and how I view the world around me. And, on one hand, my response as a Christian is simple: Jesus is the Son of God. But because that is true, is there not infinitely more to know?\n\nTheologian Charles Hodge said, “The gospel is so simple that small children can understand it, and it is so profound that studies by the wisest theologians will never exhaust its riches.” I believe he’s right, and I believe the same is true with the central figure of that gospel, the person of Jesus Christ. We cannot exhaust the depth of Him, but we can know Him. \n\nThe Gospel of Matthew is a great place to start. \n\nBeginning with a genealogy, Matthew lays out his account of who Jesus is: the Messiah that the Jewish people—and the world—had been waiting for. He presents Jesus as the Son of God, born of the Holy Spirit, baptized by a prophet, and tempted by the devil. He shows Jesus as teacher, healer, servant, and friend—a man who walked the earth but was not bound by it. \n\nIn telling us who Jesus is, Matthew tells the story of our salvation. \n\nIt is a story written from the foundation of the world (Matthew 25:34). In these two chapters alone, our historian Matthew references five Old Testament prophecies fulfilled in Christ’s birth (1:22; 2:5, 15, 17, 23). He is Immanuel, “God with us,” the one who “will save his people from their sins” (1:23, 21). Jesus is not just part of this story—He is the story. \n\nI hope you’ll read along with us these next four weeks as we explore Matthew’s Gospel together and discover the true answers to that all-important question. Jesus is the Son of God. He is the Savior, the Christ, the Messiah. \n\nThis is the story Matthew tells. This is Jesus.\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/SRT-Matthew-instagram-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 3:1-17, Matthew 4:1-25, Isaiah 40:3, Malachi 4:1-6",
    "devo_title": "Jesus’ Ministry Begins",
    "devo_summary": "\n\nBy Andrea Lucado\n\nScripture Reading: Matthew 3:1-17, Matthew 4:1-25, Isaiah 40:3, Malachi 4:1-6\n\nI recently visited the eye doctor. While waiting for the exam, I looked at the framed diploma on the wall assuring me that this doctor had gone to medical school and successfully received her degree in ophthalmology. Can you imagine if instead of an ophthalmology degree hanging on the wall, it was a degree in something like culinary arts? I don’t want an eye doctor certified in making soufflés. I want an eye doctor certified in treating eyes. \n\nWhere someone’s authority comes from matters. It matters to us today, and it mattered to those present during the events recorded in Matthew’s Gospel.\n\nEveryone in the Galilee region was asking the same question: Who is Jesus? Some asked it aloud but probably all who came in contact with Him asked it to themselves. If Jesus was a rabbi or a prophet, that would have given Him some authority, but not authority over everything. However, if Jesus was the Son of God, that would give Him full authority. That would mean that everything He did was worth watching. Everything He said worth listening to and abiding by. \n\nThis is why the identification of Jesus in Matthew 3 is so pivotal to the gospel story. Present at Jesus’ baptism were those who were skeptical of Him, such as the Pharisees, as well as some who believed, such as John the Baptist. In front of them all, the Father answered everyone’s question: “This is my beloved Son, with whom I am well-pleased” (Matthew 3:17). \n\nThe declaration of Jesus’ authority mattered greatly that day. Jesus was beginning His ministry. He would go on to perform miracles and heal countless numbers of people. If He was doing so by any name other than the Father’s, if His miracles were performed through anyone other than the Holy Spirit, His authority during His ministry would be undermined, as well as the work that was done on the cross.\n\nAuthority matters. \n\nLater in chapter four, Satan tempts Jesus. What was Satan’s strategy? To question Jesus’ authority. You can’t turn this rock to bread…The angels don’t really answer to you…You are not actually in control of anything here. It’s the same strategy Satan uses to tempt us. He wants us to question Jesus’ authority, to look outside of Christ for guidance. To bow down to other idols. To look to fulfillment in other things. \n\nIf Jesus is not the authority in our lives, something else will be, someone else will be. \n\nScripture says the devil left Jesus when Jesus quoted these words from the law: “Worship the Lord your God, and serve only him” (Matthew 4:10). Satan knew he stood no chance against someone who was clear about the authority in His life. He stands no chance against us, if we are clear about the authority that is ours in Christ Jesus. \n\nWho is Jesus in your life? \n\nDoes He have authority? Is He the Son of God, or, when it comes down to it, is His role more that of a rabbi’s? A good teacher, but not the be-all-end-all? How we answer this question determines what or who has authority over our life. May it be the Son of God, and may we say with boldness today, “Him only do I serve.”  \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/SRT-Matthew-instagram-2.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 5:1-48, Romans 12:9-21, 2 Timothy 3:16-17",
    "devo_title": "Jesus Preaches the Sermon on the Mount, Part 1",
    "devo_summary": "\n\nBy Rebecca Faires\n\nScripture Reading: Matthew 5:1-48, Romans 12:9-21, 2 Timothy 3:16-17\n\nOn Sunday mornings I show up greedy for the sublime. I hope our circus tricks of dressing up, shaking hands, and passing the plate will conjure the ineffable glory of God—maybe we can lure Him to approve of us if the children’s faces are clean! We clip our fighting short as we walk into the sanctuary; we can’t bring our pettiness into a holy place.\n\nIf only my day-to-day shenanigans really could be glossed over by washing my hair and putting clean trousers on the children every Sunday. If only our knack for welcoming visitors and taking communion would do the trick and show God how truly worthy we are.\n\nA few weeks ago, I stood in the sanctuary, hemmed in by my moderately clean children and propped up by my fashion-booties. We were singing hymns to the glory of God, and in the whirl of wrangling and worshiping I realized I was holding a child instead of the papers with the sheet music. Looking down, I saw that my papers lay under the delicately beautiful foot of an elderly woman on my left. You have to understand that I was in a hurry, wanting to keep on with the worshiping and the children and the swell of holiness.\n\nI had seen in the past magicians who could grab hold of one corner of a white tablecloth and quickly sweep it off a beautifully set table without disturbing the china or the candles that lay upon it. I had the idea that I could apply this same principle to my situation.\n\nKneeling down and holding the paper tightly in my fingers, I wish I had paused to consider that the success of the service doesn’t depend on me—we are the imperfect participants in a holy circus. Our antics are always going to be a little ridiculous. We try to do what is right, but still end up failing ridiculously, even at the moments when we should be at our very best.\n\nThe problem is that no amount of hand-waving hallelujahs, or giving of holy kisses, will make us what we ought to be. My own doings do not number me with the merciful, the peacemakers, or the pure in heart. It is tempting to think that by substituting my own Sunday morning showmanship, I can actually abolish the real law. But, as He stated in His Sermon on the Mount, Christ came to establish the law, and also to fulfill it (Matthew 5:17).\n\nAnd there is the answer: He fulfills it. Not me. He is the true peacemaker, the one who suffered for righteousness, the saltiness of the salt, the true light of the world. My antics, even at their highest and most “expert” level, are still filthy rags. Jesus laid it out for us, saying, “For I tell you, unless your righteousness surpasses that of the scribes and Pharisees, you will never get into the kingdom of heaven” (v. 20).\n\nAnd hallelujah to that. Those Pharisees worked harder than anybody at getting the holy hoedown exactly right, and even those perfectionists couldn’t do it. Thanks be to God that my salvation doesn’t depend on me.\n\nEven if I am careful, I can’t retrieve my worship folder without disturbing the ankle of a very elegant and elderly woman. But at the time, I didn’t think of all this, so I just gave it a sharp yank. We were both surprised and, I think, we were probably both a little disappointed in me. But then we sighed, raised our tambourine hands, and continued to worship. Our imperfection is written on our lips and our feet. But they are the tools we have, so we keep on worshiping.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/SRT-Matthew-instagram-3.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 6:1-34, Matthew 7:1-29, 1 Chronicles 29:11-13, 1 John 2:28-29",
    "devo_title": "Jesus Preaches the Sermon on the Mount, Part 2",
    "devo_summary": "\n\nBy Raechel Myers\n\nScripture Reading: Matthew 6:1-34, Matthew 7:1-29, 1 Chronicles 29:11-13, 1 John 2:28-29\n\nPull up a chair, girls. We’re going to have a conversation about intimacy. Yep—“husband and wife” intimacy. It may very well make you blush, but I promise to keep it PG, and I promise it’s all part of a very important point.\n\nThe Bible often refers to the Church as the Bride of Christ (2 Corinthians 11:2, Ephesians 5:22-33). Our relationship with Jesus is like a marriage—but in a perfect way. He makes us beautiful, then admires us as we walk down the aisle toward Him on our wedding day (Revelation 19:6-9). Perfectly pure. Impeccably white. Kind of awesome.\n\nSo now comes that part about intimacy.\n\nLet’s say, physically speaking, there are varying levels of intimacy. Those levels might begin with any sort of public display of affection and graduate all the way to the most intimate, behind-closed-doors, one-flesh moments meant to be shared only between a husband and wife. It’s really nobody’s business, and it’s deeply personal. A husband and wife are, indeed, one flesh. The intimate covenant they share, like Christ’s covenant with us, is sacred. \n\nWhen it comes to our relationship with God, it can be the same way. There’s PDA and then there’s sacred intimacy. There are grand public gestures of skywriting and singing telegrams (praying on the street corner “to be seen by people,” as Matthew put it in 6:5). And then there is knowing the love language of God: taking time in secret to show Him the only affections you’re chasing after are His. Pursuing Him privately, closing the doors, enjoying sacred intimacy.\n\nAny relationship that only goes as deep as public displays, or mere physical intimacy without an emotional bond and commitment, is not true intimacy. This is what Jesus warns the crowds about in Matthew 6:1, “Be careful not to practice your righteousness in front of others to be seen by them. Otherwise, you will have no reward with your Father in heaven.”\n\nJesus doesn’t want your love to be a spectacle. He wants it to be sacred. He wants you to seek Him and His kingdom first, before everything and everyone else (Matthew 6:33). \n\nIn a marriage—in any relationship that lasts past the honeymoon phase—intimacy takes intentionality. Sometimes it takes scheduling regular dates on the calendar, even committing to block out distractions and making space for, ahem, intimacy on a regular basis. Intimacy can be enjoyed organically, only when it is supported intentionally. Jesus told us this: “But when you pray, go into your private room, shut your door, and pray to your Father who is in secret” (Matthew 6:6).\n\nHow are you pursuing intimacy as the Bride of Christ? Are you intentionally closing the doors, scheduling dates, and setting aside time in order for your relationship to deepen? Or are you publically kissing Him, then living as strangers at home? Is your prayer life simply a spectacle, or is it spectacularly sacred?\n\nTo know Jesus personally is to be in loving relationship with Him, one where He longs to be gracious to us because He loves us (Isaiah 30:18). The God who calls us His treasured possession is also the greatest treasure our hearts will ever know (Deuteronomy 7:6; Matthew 6:21). The intimacy and acceptance we crave is waiting for us. \n\n“Ask, and it will be given to you. Seek, and you will find. Knock, and the door will be opened to you.”  -Matthew 7:7\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/SRT-Matthew-Instagram-4.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 8:1-34, 2 Samuel 22:16, Isaiah 53:4-5",
    "devo_title": "Jesus Heals",
    "devo_summary": "\n\nBy Melanie Rainer\n\nScripture Reading: Matthew 8:1-34, 2 Samuel 22:16, Isaiah 53:4-5\n\nReading Matthew 8 reminds me of Sunday School. Every story—six of them in just 34 verses—is familiar, conjuring up memories of flannel boards and coloring pages from my elementary school days. Jesus heals a leper, He calms a storm, He casts out the demons into pigs … it’s like a WOW! That’s What We Call Miracles Greatest Hits compilation. If you grew up in the Church, you know these stories. \n\nWhen we know Bible stories like the back of our hand, we risk missing the miraculous. Perhaps more importantly though, we read them as just that—stories. But these stories are true. And more than true, they are promises. Each story is not just a historical event, something that Jesus did. Rather, they are glimpses of everything that Jesus will do. \n\nIn his book The Reason for God, Tim Keller writes:\n\nWe modern people think of miracles as the suspension of the natural order, but Jesus meant them to be the restoration of the natural order. The Bible tells us that God did not originally make the world to have disease, hunger, and death in it. Jesus has come to redeem where it is wrong and heal the world where it is broken. His miracles are not just proofs that he has power but also wonderful foretastes of what he is going to do with that power. Jesus’ miracles are not just a challenge to our minds, but a promise to our hearts, that the world we all want is coming.\n\nThe miracles of Matthew 8 are about people in a specific place and time. They are about a leper, a centurion and his servant, Peter’s mother-in-law, the disciples on an angry sea, and two men with demons. But each miracle is also about the Israelites who wandered and trusted the God who promised them that one day their King would come. Each miracle is about the Jews, torn away from Jerusalem, listening to Isaiah prophesy that a Messiah would come to take on their illnesses and bear their diseases. And each miracle is about us, with our mix of ancient faith and modern doubt. Each miracle proved to the Jewish people then and teaches us now that Jesus is who He says He is, that He fulfilled God’s promises, and that He will fulfill them again. \n\nI risk reading this passage purely at face value: people needed help, they asked Jesus, and He helped them, healing the dying and rescuing the scared disciples. In my own life, I am tempted to pray with the same expectation for earthly healing and immediate help. Every prayer is my own version of “calm the storm, Jesus!” But my own experience has taught me that Jesus doesn’t always work that way. Matthew is telling us that while Jesus can do all we could ever ask or imagine, He may not always answer our earthly needs in the way we think He should. Is it enough for me to know that the One who makes even the winds and sea obey Him will also makes everything new one day? (Matthew 8:27; Revelation 21:5).\n\nSo I continue to pray for miracles, yes. I pray with faithful expectation, and sometimes, with honest doubt. I live in the tension of the already and the not yet. \n\nGod has already fulfilled His promises, and we know that we can trust Him. But He has not yet fully restored His kingdom—what Keller called “the world we all want.” So we wait and pray, hope and trust. And we read these stories about Jesus, and take heart because we know they were true then, and they are just as true for us today.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/SRT-Matthew-Instagram-5.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 9:1-38, Numbers 19:11-21, Hosea 2:19-20",
    "devo_title": "Jesus Forgives",
    "devo_summary": "\n\nBy Kaitlin Wernet\n\nScripture Reading: Matthew 9:1-38, Numbers 19:11-21, Hosea 2:19-20\n\nI committed an embarrassing crime in my favorite pair of boots. With double-knotted laces and heels worn from hopscotch, those shoes supported me during some of my best moments, from resting on foot pedals during piano recitals to walking across the stage to accept awards for reading and attendance. They were impressive shoes for an equally impressive first grader, or so I thought.\n\nAnd then one day, I stepped off the school bus and sat at the kitchen table to begin my homework. From here, the details get a little foggy. All I know is that a light-hearted family conversation escalated to a hearty quarrel when I stood up, angrily seeking my next victim. Without my brain’s permission, my foot swung backward to gain momentum and forward to meet a target. I kicked a hole in my parents’ couch—not a small one, either.\n\nWhile my parents were certainly less than pleased, they soon realized this deed came with a built-in punishment. After the couch had to be moved down the stairs, out the door, and across town to be repaired, I would have to explain to any guests why we temporarily had no place for them to sit.\n\n“Oh, the couch? I broke it.”\n\nWhen I remember this story, I sometimes wonder if we’re all walking around with our own versions of kicked-in couches, whatever they may be, always aware of our brokenness.\n\nMy family? We’re struggling.\nMy job? It’s difficult.\nMy body? It’s hurting.\nMy heart? It’s suffering.\nMy circumstances? They’re unfair. \n\nIn Matthew 9, we find person after person in physical suffering, and yet, Jesus’ response to each one is very similar.\n\n“Have courage, your sins are forgiven” (v. 2).\n“Get up and walk” (v. 6).\n“Have courage, your faith has saved you” (v. 22).\n“Let it be done according to your faith” (v. 29). \n\nHere, Jesus isn’t telling us to brush ourselves off from the hurt; He is showing us what it means to be whole again. It’s more than the healing of our bodies, our families, or any other shattered piece we may be holding. True healing can only be found through forgiveness, and ultimately, through Jesus’ broken body and shed blood. He knew that “it is not those who are well who need a doctor, but those who are sick… For [He] didn’t come to call the righteous, but sinners (Matthew 9:12-13).\n\nJesus calls out a truth that maybe we’re too afraid or wrapped up in our circumstances to admit: Broken lives require faith. We may not know what to do with broken pieces and messy circumstances, but He certainly knows what to do with the bold faith of His children. Jesus uses the broken pieces to draw us to His wholeness.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-8-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 10:1-42, Acts 1:13, James 2:1-7",
    "devo_title": "Jesus Sends the Twelve",
    "devo_summary": "\n\nBy Kaitie Stoddard\n\nScripture Reading: Matthew 10:1-42, Acts 1:13, James 2:1-7 \n\nHave you ever received a gift with no strings attached? Many of us may recall the joy of receiving Christmas presents as a child. When you’re young there are no expectations of repayment; the gift is freely given, and certainly, freely taken. \n\nDo you also know what it’s like to receive a gift with strings attached? Maybe you “won” a free night at the hotel in exchange for a timeshare meeting, or your friend loaned you their car with an unspoken debt to pay. It’s not so fun to receive a gift and find out later it wasn’t really free.  \n\nThe gift of salvation can only be received freely like a child. “Life to the fullest” is free to us because our generous God paid the price with His own Son (John 10:10). Not to mention, we couldn’t pay the fair value for such a precious present, even if we tried. “For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord” (Romans 6:23).\n\nWhen Jesus sent out His twelve disciples for the first time, He warned them about the quid-pro-quo economy of the world (Matthew 10). Jesus was well aware that when you start healing people, driving out demons, or raising people from the dead, there will be loved ones willing and eager to compensate you. \n\nBut Jesus does not want people to believe they can buy God’s love or favor. The Lord doesn’t want you to confuse the gospel with a bait-and-switch timeshare meeting. Christ warned the disciples against the temptation to take those payments. He reminded them that they had received spiritual gifts without paying for them, so they should not charge others. “Freely you received, freely give,” He instructed them (Matthew 10:8).\n\nWe might not expect our neighbor or coworker to pay us money for our encouragement or service, but do we secretly expect them to pay us back with social favors or reciprocated acts? Are there spiritual gifts the Lord has given you that He wants you to spill out onto others lavishly? If you’ve been given the spiritual gift of encouragement, encourage others in the faith freely. If God has given you the spiritual gift of service, serve with a heart of generosity. \n\nEverything we have has been given to us. When we remember that our salvation, financial resources, and spiritual gifts are purely by the grace of God, we become stewards instead of hoarders. As followers of Christ sent into the world, we are given the same instructions as the twelve disciples. Give away the most valuable gift of God’s love at no charge, because that is how we all received it—freely.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-9-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 11:1-30, Isaiah 29:18-19, 1 John 5:3-4",
    "devo_title": "Jesus Gives Rest",
    "devo_summary": "\n\nBy Erin Davis\n\nScripture Reading: Matthew 11:1-30, Isaiah 29:18-19, 1 John 5:3-4\n\nIt’s one of those moments so deeply seared onto my heart that I still glance at the memories and wince. I was in a Jamaican infirmary, tasked with offering some measure of comfort to the sick and dying housed there. Their beds were jammed together, packing every room. Conditions weren’t sanitary. Many patients wailed incessantly. My comfort-craving brain wanted to find the escape hatch, to look somewhere other than at the faces of these people I could do so little for. Maybe that’s why my eyes kept drifting out the windows at the sugary white sand and emerald blue Caribbean waters that sparkled just beyond the compound’s walls.\n\nThe juxtaposition of human sorrow and breathtaking beauty sticks with me still. Jesus was on the shore and in the suffering at the same time. We find a juxtaposition just as jarring in Matthew 11. \n\nJohn the Baptist was imprisoned for his faith, sitting on death row. Yet, Jesus was using John’s predicament as an object lesson for true discipleship when He delivered these comforting words:\n\n“Come to me, all who labor and are heavy laden, and I will give you rest. Take my yoke upon you, and learn from me, for I am gentle and lowly in heart, and you will find rest for your souls, For my yoke is easy, and my burden is light” (vv. 28-30). \n\nRest. Our bleary eyes and exhausted souls crave it, don’t they? And yet, John would remain in prison until his gruesome death. Humanly speaking, John’s yoke was not easy. His burden was not light. So, what did Jesus mean? \n\nI imagine John must have looked around his prison cell and felt tired from the weight of it all. He sent messengers to make sure Jesus had something better to offer (vv. 1-3). Our weary hearts often wonder the same thing, don’t they?\n\nJesus responds like this:\n\n“Go and tell John what you hear and see: the blind receive their sight and the lame walk, lepers are cleansed and the deaf hear, and the dead are raised up, and the poor have good news preached to them” (vv. 4-5). \n\nRest from pain, suffering, and worry is certainly something we can all readily give our “Amen!” to. But then here comes that juxtaposition again—that same tension—when Jesus adds, “And blessed be the one who is not offended by me” (v. 6). \n\nWhen this world leaves me weary, I want to take a nap. But Jesus wants to give me a break from the tyranny of self. If the kind of rest Christ offers doesn’t look like I think it will, He must be promising so much more. \n\nIf a good night’s sleep and an easy life was all Jesus had to give John, it would not have been enough to keep him chained to Christ. John would die for his faith—not for a handful of miracles that had already happened, but for a tsunami of healing that was to come. Somewhere along the way, John must’ve resolved that the rest he needed most was not circumstantial. \n\nWe are all broken by sin, longing for a cure. Jesus walks among us, removing the yoke of sin that bends our backs and breaks our hearts. Suffering and sleeplessness may remain temporarily, but the burden of sin is no longer ours to carry. Jesus took that burden so we could know the kind of rest that seeps past our bones and into our weary souls.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-10-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 12:1-50, Leviticus 19:9-10, Isaiah 42:1-4",
    "devo_title": "Jesus Is Lord of the Sabbath",
    "devo_summary": "\n\nBy Claire Gibson\n\nScripture Reading: Matthew 12:1-50, Leviticus 19:9-10, Isaiah 42:1-4\n\nRecently, at a dinner with friends, I noticed the person sitting next to me skip the pork tenderloin and serve himself an extra spoonful of brussels sprouts. This made no sense to me.\n\n“Are you a vegetarian?” I asked, hoping to avoid a pitch to join the fold. (I love meat.) \n\n“Oh no,” he said. “I’m just taking a break. We went paleo for a long time and I kind of went overboard.”\n\nI laughed. Sure enough, a few years ago my husband and I decided to go Paleo too. This was before the “Whole 30” eating plan was a thing. We were simply trying to do something different with our diet, and quickly learned how easy it was to make a meal out of veggies and protein. But it was also easy to use the “Paleo” rules to fill our plates with nothing but pork, bacon, and ground beef.\n\nIt’s easy to follow the rules but ignore the spirit and intent behind them.\n\nThat’s the heart of Matthew 12. At this time in history, Pharisees were a group of devout Jewish men who had tried to keep every letter of the law. Scribes, mentioned later in the passage, were essentially lawyers—men who copied and interpreted the law of Moses for the people. Both groups knew the rules inside and out. And sure enough, they were right about the rules.\n\nIn the book of Leviticus, the Lord instructs His people not to strip the farmland bare, but to leave the final portion to the poor and to immigrants. In fact, in the book of Ruth, we see Ruth, a poor, barren immigrant woman, benefitting from that compassionate law, as she gathers grain from Boaz’s field. But intent on proving Jesus to be a hypocrite, the Pharisees point out that He was breaking two laws: the harvesting laws and the laws prohibiting work on the Sabbath.\n\nI can almost see their self-satisfied smiles as they imagine Jesus stuttering to respond. But He doesn’t miss a beat. He says He is Lord of the Sabbath because He created it (vv. 6-8). He defined rest.\n\nAnd yet, the Pharisees continue to press. Entering the temple, they point to a crippled man and ask Jesus a theoretical question, as if they can stump Him with a bit of moral philosophy. In order to accuse Him, they asked, “Is it lawful to heal on the Sabbath?” (v. 9).\n\nAre you kidding me? How prideful! How arrogant! As if they wanted to go around healing crippled people, but the Sabbath was all that was stopping them? If I were Jesus, I would have yelled, “You Pharisees couldn’t heal whether it was on the Sabbath or not! Shut your traps!”\n\nBut thankfully, Jesus is not me.\n\nHe doesn’t answer them while screaming and shouting like I would have. Instead, He exposes their hearts with a simple story that even a child could understand, making the truth abundantly clear: There is no prohibition against mercy. Only He can heal, and only He determines when to do it.\n\nScribes and Pharisees dole out burdens and rules and loopholes and philosophical arguments. Jesus delivers hope. May we put our trust in His name alone.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-11-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 13:1-52, 1 Corinthians 5:6-7",
    "devo_title": "Jesus Speaks in Parables",
    "devo_summary": "\n\nBy Melanie Rainer\n\nScripture Reading: Matthew 13:1-52, 1 Corinthians 5:6-7\n\nUntil last year, I had never seen the movie Star Wars. This was the cinematic equivalent of blasphemy for my in-laws, my friends—pretty much everyone else in the world, really. Star Wars is part of our cultural lexicon, but when you’ve never seen it, most references to it go unnoticed. It’s as if fans of the film franchise speak another language when they talk about it. Sure, I was familiar with the line, “Luke, I am your father,” but anything more than that, and I was totally lost. I’d heard about Star Wars a lot, but I’d never understood the context of what I was hearing. And I certainly couldn’t contribute to the conversation. \n\nWhen Jesus taught in parables, He was speaking to two audiences. Some, like His disciples, understood what He was teaching. And if they didn’t understand, they would ask Jesus to explain. Others belonged to the “you will hear but never understand” camp (Matthew 13:14). Much like being a part of a conversation about a movie you’ve never seen or a book you’ve never read, the latter audience could tune out Jesus’ message. \n\nJesus knew that by speaking in parables, His message would get through to the right people—the people who would open their hearts to Him and who would work to see the kingdom of God flourish. He also knew that the people who were out to get Him (the Pharisees, the Romans) would not understand the parables, and so to some degree, parables were a protective measure. \n\nReading the parable of the sower, I wonder where I land on the spectrum of listeners. As Jesus sows the seeds of His message, how receptive are my heart and mind? Do I have a hard heart and closed eyes when I read Scripture? Do I read the difficult parts with the same rigor and delight as I do the easier passages? Do I cling to the Jesus who heals and pardons, and shy away from the Jesus who turns over tables and calls out sinners? Do I let the double-edged sword of Scripture do its good, sanctifying work in me? \n\nEugene Peterson wrote it this way in The Message: “They stick their fingers in their ears so they won’t have to listen; They screw their eyes shut so they won’t have to look, so they won’t have to deal with me face-to-face and let me heal them” (Matthew 13:15).\n\nI know my heart is rocky and full of weeds that choke out the Word. The parable of the sower exposes my idols, holding them up to the light of Jesus’ message about the kingdom of God, about the freedom and peace He, and He alone, brings. But I am tempted to fall away when trials come, turning to my own strength instead of the Word of God. I chase the material, the next-best, and the greener grass, instead of running relentlessly after Jesus alone. My faith is weak, even when I long for it to somehow be enough. \n\nThe remedy for my fallow heart is the Word. \n\nThe Apostle Paul tells us that “faith comes from hearing, and hearing through the word of Christ” (Romans 10:17). May it be so with us. May we be eager listeners with hearts rich with fertile ground, anxious know His teaching, and ready to whatever He asks of us.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-12-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 13:53-58, Matthew 14:1-36, Deuteronomy 8:3, Isaiah 43:10-13",
    "devo_title": "Jesus Is the Son of God",
    "devo_summary": "\n\nBy Sharon Hodde Miller\n\nScripture Reading: Matthew 13:53-58, Matthew 14:1-36, Deuteronomy 8:3, Isaiah 43:10-13\n\n“Have courage! It is I.”\n\nWhen we read these words in Matthew 14:27, from the viewpoint of our modern context, it’s easy to miss their significance. It’s easy to dismiss them as a much needed encouragement, and little more. The disciples, after all, are frightened. They are stranded in a boat, far from shore, their vessel “buffeted by the waves.” Jesus “goes out to them,” walking across the water, which only stokes their fears more (vv.24-25).\n\nTo calm their anxieties, Jesus says, “It is I,” clarifying who He is. And immediately, Peter recognizes his teacher. \n\nThe climax of the story would seem to come later, when Peter joins Jesus in the waves. But the truth is, this verse is a bombshell. Jesus is making a statement of cosmic proportions, so it’s important not to miss what is happening. \n\nIn these five short words, Jesus is not merely identifying Himself, not in the usual way. This statement is not like announcing yourself at your parents’ back door: “It’s me! Just popping by!” Instead Jesus is making a monumental claim, one that Matthew’s Jewish listeners certainly would have noticed. Jesus is not just identifying Himself as the man they know and love. He is identifying Himself as God.\n\n“It is I”—translated from the Greek words ego eimi, which literally means “I am”—is a clear reference to an Old Testament story. Thousands of years earlier, God identified Himself to Moses in exactly the same way (Exodus 3:14). Theologian Stanley Hauerwas explains, “Just as God names himself to Moses in the burning bush, Jesus identifies himself as ‘I am.’ This is the ‘I am’ of Psalm 77:19, the ‘I am” who provides a way through the sea, a path though the mighty waters.”  \n\nIn other words, Jesus isn’t simply identifying Himself in the midst of the storm; He is identifying His place in human history. Jesus is not just another prophet. He is not just another priest. He is not just another rescuer. He is not just another king. Jesus is no ordinary “good person” who loves God and happens to know a lot about Scripture. Jesus is God Himself, the God who delivered the Israelites and parted the Red Sea. He is the God who is more than able to command the threatening waves below Him.\n\nIt’s an audacious claim, blasphemous even, had it not been true. And it’s a claim that continues to assert its power over our storms today, promising that Jesus is not simply with us, but as God of the universe He is reigning over all creation. We are guaranteed both the intimate presence of the Son, and the almighty authority of the Father. \n\nBoth then and now, we have this comfort and this truth. Jesus is not just our teacher, not just a good example, and not just a friend. Instead He declares, “It is I”:\n\nI am the God of Abraham, Isaac, and Jacob. I am the God of Moses—the God who heard my people cry, and delivered them. I am the God who sees, who knows, and who cares. I am capable and faithful, steady and good. I am not the God who was, or the God who will be; I am the God who is—unchanging, unshakeable, unfailingly compassionate and near.\n\nAnd I, Jesus, have another name: I AM.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-15-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 15:1-39, Matthew 16:1-28, Zechariah 12:10, 2 Peter 1:16-18",
    "devo_title": "Jesus Is the Messiah",
    "devo_summary": "\n\nBy Andrea Lucado\n\nScripture Reading: Matthew 15:1-39, Matthew 16:1-28, Zechariah 12:10, 2 Peter 1:16-18\n\nI am very good at proclaiming things:\n\nI’m going to run a marathon!\nI’m going to take music lessons!\nI’m going to write one poem a day!\n\nBut these are things that are easier said than done; therefore, I say them, but do not really do them. I ran a half marathon, not a full. I took voice lessons for a few weeks, then quit. I wrote about six poems—over the course of an entire year.\n\nDeclarations are good, but in order to follow through with them we must understand their implications. \n\nIn Matthew 16, Jesus asks His followers, “Who do you say that I am?” And Peter has the right answer: “You are the Messiah, the Son of the living God!” he declares (vv. 15-16). \n\nBut just a few verses later, we see that Peter doesn’t fully understand the implications of his declaration. When Jesus explains to His disciples what will eventually happen to Him in Jerusalem, that He will suffer on the cross, Peter is upset. “Oh no, Lord!” he says, “This will never happen to you!” (v. 22). \n\nAs my IVP Bible Background Commentary notes, “Peter had divulged Jesus’ secret identity yet had retained a faulty concept of what that identity entailed.” In other words, it’s one thing to say Jesus is the Messiah; it’s another to understand the implications this has on our lives. \n\nJesus proceeds to very clearly explain what it means to believe He is the Messiah, saying, “If anyone wants to follow after me, let him deny himself, take up his cross, and follow me” (v. 24). Three things: deny yourself, take up your cross, follow Jesus. For those of you who’ve been on this Christian journey for a while, you might be thinking what I’m thinking: Easier said than done. \n\nAll three of these commands are incredibly counterintuitive to our sin nature. “Deny yourself” implies denying your selfish desires, ambitions, and needs. “Take up your cross” implies being prepared for the ridicule and scorn of others, even being prepared for death itself. “Follow me” implies allowing Jesus to be Lord of your life, laying down your control, and giving it to Him. \n\nI can declare that Jesus is the Messiah all day long, but do my actions reflect that I truly believe this? Have I denied myself today? Am I more concerned with what others think than I am with openly being a Christ follower? Am I allowing Jesus to control my life, or am I still gripping the wheel?\n\nBacking up a little in this passage we see that Jesus first asked His disciples, “Who do people say that the Son of Man is?” (v. 13). He wanted to know what the disciples had observed others were saying about Him. Then He asks, “But you… who do you say that I am?” (v. 15). To me, it feels like the emphasis is on that second question. Jesus is more concerned with who His followers believe Him to be than what other men are saying about Him. \n\nWho we, as Christ followers, proclaim Jesus to be is critical for the world that is looking on. And how we act—much more than what we say—reflects whether or not we believe Jesus is the Messiah. \n\nWe can say and not do, proclaiming Jesus is the Messiah but never denying ourselves, never actually following Him. Or, through the power of Christ in us, we can proclaim and do, showing those around us who Jesus is. Pointing them to Him with our lives. Pointing them to the true Messiah.\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-16-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 17:1-27, Matthew 18:1-35, 1 Kings 8:10-13, Jeremiah 23:1-4",
    "devo_title": "Jesus’ Glory and Power",
    "devo_summary": "\n\nBy Rebecca Faires\n\nScripture Reading: Matthew 17:1-27, Matthew 18:1-35, 1 Kings 8:10-13, Jeremiah 23:1-4\n\n“Lord,” he said, “have mercy.”\n\nThis was the plea of a father made on behalf of his demon-possessed son. It is a request we have all cried out at one time or another, in different languages and circumstances. In big and small ways, we are constantly asking for mercy from the Lord and from each other. \n\nGive us more time!\nHelp us find her!\nDon’t lay me down for a nap!\n(And as the years pass…) Please, just let me rest!\n\nWhen Jesus healed the demon-possessed boy, His disciples gathered around to understand why they’d been unable to work the miracle themselves. \n\n“Because of your little faith,” he told them. “For truly I tell you, if you have faith the size of a mustard seed… nothing will be impossible for you” (Matthew 17:20).\n\nThe disciples were unable to give this man and his son the mercy they needed because their own faith was so small. While the disciples couldn’t heal the boy or cast out the demon, Jesus could. In fact, earlier in this chapter, the mere radiance of His glory sent them falling to the ground in terror (v. 5). Indeed, Jesus is set apart by His glory.\n\nAlthough there are certainly other times in Scripture when the disciples were able to perform miracles, this case is especially interesting because the man specifically asked for mercy, and the disciples were unable to give it. Later, in chapter 18, Jesus shared the parable of a servant who owes his master a huge sum—a sum so huge that he would need several lifetimes to pay it back. But then that servant turns around and finds somebody who owes him a couple of nickels, and starts choking him to give back his money (vv. 23-28).\n\nAlthough we don’t literally put our hands around the throats of those who owe us something, we do choke others with our lack of mercy and forgiveness. There is a great chasm of difference between God’s mercy and ours, between God’s faithfulness and our faithlessness, between God’s glory and our need. Jesus’ parable forces me to look at the truth: Even when I actually want to be merciful and forgiving, in my own strength, my best efforts prove my ability to forgive is forever lacking.\n\nThe vastness of God’s never-ending mercy shows us our need for forgiveness is enormous. Grasping that need is the first step to understanding the gospel. \n\nIt’s difficult to remember mercy when someone hurts us. Some of us have been hurt so badly it feels like everything is ruined, that nothing can restore what’s been taken from us. The very thought of the offense can fill us with fear and loathing. But we do well to remember this: In order to forgive us, Christ had to die for us. He took the curse that we brought to Him and gave up everything, so He could give us mercy (Galatians 3:13). This is staggering.\n\nTrue forgiveness costs everything. But God loves us so much, He freely gave everything. While this passage does remind us that we are like the unforgiving slave, the bigger truth here is that God is our compassionate Master, and He piles love and forgiveness on us all.\n\nThe gospel is true! God’s great love and mercy for us are greater than all our sins.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-17-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 19:1-30, Matthew 20:1-34, Deuteronomy 6:4, 2 Peter 3:10-13",
    "devo_title": "Jesus Came to Serve",
    "devo_summary": "\n\nBy Kaitlin Wernet\n\nScripture Reading: Matthew 19:1-30, Matthew 20:1-34, Deuteronomy 6:4, 2 Peter 3:10-13\n\nI am very hopeful that my one-day husband’s last name will begin with a letter in the first half of the alphabet. You see, while I love my last name with my whole heart, it begins with a “W,” which means the line for almost anything ends with me.\n\nDuring college graduation, I imagine that my friends whose last names fall at the beginning of the alphabet —Austin, Brock, and Chapman—were all halfway through their family celebration dinners before it was my turn to walk across the stage. I have very big ideas about what it would mean to be first in line.\n\nGetting ahead is the name of the human game. We want nothing more than to be picked first for the kickball team, secure the best seats at the movie theater, win the affection of our coworkers, achieve financial success, and ensure our security and worth at every turn.\n\nSo in Matthew 19, when Jesus says, “Many who are first will be last, and the last first” (v. 30), it may be our first instinct to picture a world where the underdog wins the game of getting ahead—the least athletic kid gets picked first for kickball, and those without savings accounts win the lottery. This is the illustration Jesus gives us, but its main purpose is to point to something even greater: His own measure of success.\n\nGod’s goal isn’t helping us to get ahead—it’s helping us get to Him. His redemption does not work within the constraints of the world’s standards, but within the bounds of eternity.\n\nIn the parable of the vineyard workers in Matthew 20, the workers hired at the beginning of the day are angry by the end of it. They are complaining because the other workers—hired hands just as they were—had done nothing, yet had been made equal to them. None of the workers were underpaid or overworked. Some of them had just experienced “undeserved” kindness, leaving others to feel less superior.\n\nAt least, that’s how it looks from our perspective. But these aren’t just rules and concepts Jesus wants us to unlearn from the ways of the world. Christ is showing us that His kingdom is wholly better. In it, we will be fully loved by Him, forever united. This is the message that all of Jesus’ teachings in these passages point to: unity over divorce, children inheriting the kingdom, poor over rich, last before first. Jesus came to serve the undeserving with kindness; this is the heart of God’s economy.\n\nAs Tim Keller says, “The gospel is this: We are more sinful and flawed in ourselves than we ever dared to believe, yet at the very same time we are more loved and accepted in Jesus Christ than we ever dared hope.”\n\nKnowing all our earthly measures are off, let us look to Him, for we are worse and He is better than we could ever guess. May our deepest goal and desire be to find ourselves not first or last, but close to Him. Amen.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-18-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 21:1-46, Ezekiel 16:10-13, Zechariah 9:9",
    "devo_title": "Jesus Is King",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture Reading: Matthew 21:1-46, Ezekiel 16:10-13, Zechariah 9:9\n\nOnly Jesus knew the gravity of what the crowd was asking when they shouted “Hosanna!” that day. \n\nIt was a shout of adoration but it was also a plea, because the word “Hosanna” literally means, “Come save us now!” And this is exactly what He would do. \n\nThe next day, Jesus walked into the temple, flipping over tables and tossing money to the floor. The hosanna-shouters must have been shocked to see the man on the donkey driving the sellers out of the temple with such authority. “My house will be called a house of prayer,” Jesus said to them. “But you are making it a den of thieves!” (Matthew 21:13).\n\nBut it’s what He did next that was truly radical: He invited the least inside. \n\nThe blind, the lame, the children all came in and Jesus welcomed them, healed them, confirmed their place among Him (vv. 14-15). He cleared out those who had profaned the temple and ushered in those who humbly sought after God. \n\nWhen I picture the scene I can see myself in the wings, on the outside looking in. I am nervous, I am afraid, but I am drawn to this house of God, and so I watch and wait. Those inside seem to have it together, bringing riches rather than sacrifice, doing religion like a business. All I have is this humble offering in my hands, carried the long journey from my home, over rocky roads and mistake-laden miles. \n\nThen I see Him. And right before my eyes I watch Him turn it on its side, all the pretension and injustice and darkness that kept me at bay. He sends out those who’ve come not for God but for gods. \n\nAnd then? He looks me in the eye. Me. Lame, frightened, filthy from days of travel. He looks at me and sees me. He motions for me to come in and then He tells me I belong. \n\nI had cried out “Hosanna! Save me!” not knowing what I was really asking. And He rode on through the streets and into the city, knowing exactly what was coming. He would soon die, but not before He cleansed His house of prayer and invited me in. \n\nThis is our Christ! “The stone that the builders rejected has become the cornerstone” (v. 42). He welcomes in the defenseless, becoming their defense. He brings the weak to Himself and makes them strong. He desires not the shiny sacrifices our pride wishes to bring, but only a heart that is stayed on Him. He saves us when we call out to Him.\n\nOnly He knows what our hearts truly need as we cry out, “Hosanna!” He knew it even then.\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-19-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 22:1-46, Psalm 110:1-7, Hebrews 10:11-14",
    "devo_title": "Jesus Is Our Access to God",
    "devo_summary": "\n\nBy Kaitie Stoddard\n\nScripture Reading: Matthew 22:1-46, Psalm 110, Hebrews 10:11-14\n\nDon’t get me wrong. I really do love my job, but I am not a morning person. Just the other day, I woke to the sound of my phone’s beeping alarm. Ugh. That was my first response. But as my feet hit the ground, something seemed off. Oh, that’s right. It’s Saturday, isn’t it?\n\nIt’s sad but true: I’ve been known to get so caught up in the daily grind that I’ve forgotten about the glory and goodness of the coming weekend. \n\nThe Sadducees didn’t just forget about the good news; they completely denied the possibility of life after death. Anyone remember singing at Vacation Bible School, “I don’t want to be a Sadducee, because they’re so sad you see”? Well, the reason they were “sad” is because their sect of Judaism had no hope for bodily resurrection. The Sadducees wanted to make the idea of the resurrection look ridiculous, and Matthew 22 recounts their attempt to trap the Messiah with a trick question.  \n\nHow did Jesus respond to their attempts at trickery? He lovingly responded to them in their own language, and then offered them a challenge. Because the Sadducees esteemed Moses over all others, Jesus quoted what Moses had to say about the resurrection. When God appeared to Moses in the burning bush, He said, “I am the God of Abraham, and the God of Isaac, and the God of Jacob” (Exodus 3:6). The Lord used the present tense—“I am,” not “I was.” \n\n“He is not the God of the dead, but of the living” (Matthew 22:32). Jesus confirms that Abraham is living, Isaac is living, Jacob is living. There is life after death. Hallelujah!\n\nIt’s easy for us to judge the Sadducees’ unbelief because we have the full and complete gospel in mind. We know that Jesus went down to the grave and rose again. Still, while we might not outright deny the resurrection, do we sometimes forget about it? It’s easy to get so focused on our everyday lives that we lose sight of our heavenly future. We live in fear, cling to earthly security, and fight for status. We may not deny the resurrection with our tongues, but we do with our thoughts and actions. \n\nChrist’s response to the Sadducees is a response for all of us. The Lord understands where you’re coming from and wants to lovingly speak to you about what’s to come. He knows exactly what makes you forget the eternal hope—whether you’re struggling with anxiety, exhausted by caring for children, distracted by work, or any number of other things. He gets it, but He doesn’t leave us there. He gives us true hope. \n\nJesus also challenged the Sadducees to know Scripture better. Could the same be said for us? When we lose sight of the good news, let’s fill our minds with the truth of God’s Word and open our ears to the Lord who speaks to us. May we delve into our Bibles for wisdom from above and hold fast to the living hope of the resurrection.\n\n“Because of his great mercy he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead and into an inheritance that is imperishable, undefiled, and unfading, kept in heaven for you.” -1 Peter 1:3-4\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-22-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 23:1-39, Exodus 10:21-23, Romans 8:22-23",
    "devo_title": "Jesus Judges the World",
    "devo_summary": "\n\nBy Claire Gibson\n\nScripture Reading: Matthew 23:1-39, Exodus 10:21-23, Romans 8:22-23\n\nToday’s passage is a doozy. In Matthew 23, Jesus holds nothing back, saving His harshest, sternest rebuke for two groups. \n\nFirst were the prideful Pharisees, who piled unnecessary burden onto the people. Rather than seeing God’s law as His love, the Pharisees used it as a weapon of position and power. Second were the sidelined scribes. They knew the law, but refused to speak up against the Pharisees’ hypocrisy, and therefore, became a part of the problem themselves. Fearful of the Pharisees’ power, the scribes kept silent, allowing the Pharisees’ perverted message to flourish. They could’ve been a voice for truth, but instead stood by and allowed the Pharisees to abuse the people.  \n\nJesus strongly condemned the Pharisees and scribes—but why?\n\nJesus saw their passion for position. The Pharisees were obsessed with increasing their own authority. They cared a lot about titles, requiring people to call them “Teacher,” “Master,” or “Father,” and racked up converts—not for the benefit of others’ souls, but for the sake of showing the power of their sect. They exalted themselves with false humility, and Jesus saw right through it. \n\nThe Pharisees perverted the Lord’s priorities. They were strict and precise when it came to small matters within the law, while being careless and loose about the things that mattered most. They pointed out small flaws in others while ignoring pervasive sin in their own hearts.\n\nJesus condemned the powerlessness of the Pharisees’ prescriptions. In their position of influence, Pharisees and scribes could have pointed people to deeper relationship with the Lord. Instead, they paved a road that led to destruction.\n\nThe Pharisees were preoccupied with perception. They cared deeply about what other people thought of them, wanting to be followed, trusted, honored, and revered. More concerned with their outward appearance than substance, they dressed to impress. In Deuteronomy, the Lord told His people to impress His commandments on their hearts, to “tie them on your hands and bind them on your foreheads” (6:8). Jews took that literally. During times of prayer, they tied small leather boxes called phylacteries onto their foreheads with Scripture verses hidden inside. The Pharisees made their phylacteries as large as possible, as if to say, “Look at how much Scripture I can carry on my forehead! More than you!”  \n\nBut does it really matter how beautiful you look on the outside, if you’re dying on the inside? Does it matter how beautiful the stone is, when all it marks is a grave?\n\nThe Pharisees were persistent in pride. They allowed themselves to carry on in the sin of their day, while still convinced they would’ve opposed the sins of their fathers. Jesus exposes their hypocrisy and self-deception under the microscope of truth. But the rebukes we hear in Matthew 23 aren’t angry rants—they are woes. Jesus feels deep anguish for the Pharisees and scribes, and for the people they are leading astray, to death. He isn’t smug. He’s not pointing fingers. He’s begging them to see the light. \n\nI imagine Jesus’ heart tearing in two as He speaks to them, longing for them to hear and receive the truth. He knows these are the very men whose hardened hearts will soon cry out, “Crucify!” These men and their pride, their empty passions—they will soon lead Jesus to the cross. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-23-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 24:1-51, Matthew 25:1-46, Daniel 7:13-14",
    "devo_title": "Jesus Will Come Again                                                                                                 ",
    "devo_summary": "\n\nBy Erin Davis\n\nScripture Reading: Matthew 24:1-51, Matthew 25:1-46, Daniel 7:13-14\n\nRather than organizing our lives into a zillion little categories like family and finances, work and leisure, God’s Word invites us to adopt a new filing system. Everything ultimately fits into one of only two categories: former things, which are destined to pass away, and forever things, which never will. There is no third option. \n\nIn language that feels equal parts inspiring and terrifying, Jesus reminds us to consider forever things here in Matthew 24 and 25. While the gravitational pull of our hearts is to spend our time thinking about the days on our calendar, Christ reminds us that a Day is coming soon that will forever sever our ties to the temporary.\n\n“Then will appear in heaven the sign of the Son of Man, and then all the tribes of the earth will mourn, and they will see the Son of Man coming on the clouds of heaven with power and great glory. And he will send out his angels with aloud trumpet call, and they will gather his elect from the four winds, from one of heaven to the other” (Matthew 24:30-31). \n\nWhen Christ returns a second time, the former things will be no more, and only forever things will remain. It’s a promise so spectacular our hearts can’t seem to absorb it. Jesus knows our tendency is to drop our eyes toward our navels rather than straining them heavenward, waiting for His return. In a parable designed to teach us how to wait well, He compares the Church to ten virgins waiting for their bridegroom. Five came prepared to wait as long as necessary. Five were foolish and did not (Matthew 25:1-12).\n\nJust like Jesus’ disciples who slept instead of standing guard with Him in the garden the night before He died, we are the sleepy virgins, prone to to become weary and distracted as we wait. But our Groom is coming. He’s already on His way. There’s still time to shift our focus away from bills and brokenness and toward our coming King. And while we do not know either the day or the hour, we do know that He’s called us to be alert and ready, waiting for Him with expectant hope of His return (v. 13). \n\nIn Revelation 21 we’re given a glimpse of what life will be like after Jesus rides in on the clouds. Jesus says, “Behold, the dwelling place of God is with man. He will dwell with them, and they will be his people, and God himself will be with them as their God” (v. 3). Christ is coming back to save the Bride whose ransom He’s already paid. Our long separation from Him will finally come to an end. What then?\n\n“He will wipe away every tear from their eyes, and death shall be no more, neither shall there be mourning, nor crying, nor pain anymore, for the former things have passed away” (v. 4, emphasis mine). Death, mourning, crying, pain—these will all become former things. As Christ teaches about His return, we find that it’s not that temporal things don’t matter, but a time is coming when they won’t. Jesus is coming back for us. On the timeline of eternity, it won’t be long now. May He find us waiting well.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-24-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 26:1-75, Leviticus 23:5-6, Isaiah 53:7, Jeremiah 31:31",
    "devo_title": "Jesus Gives His Life",
    "devo_summary": "\n\nBy Rebecca Faires\n\nScripture Reading: Matthew 26:1-75, Leviticus 23:5-6, Isaiah 53:7, Jeremiah 31:31\n\n“What are you willing to give me if I hand him over to you?” (Matthew 26:15).\n\nThis historical record of Jesus Christ contains some of the most chilling sentences in all of literature and history. In this chapter of Matthew 26, we follow Christ through His final days and hours and watch, blow by agonizing blow, how He gives His life away in little pieces, even before He gasps His last breath on Golgotha. Judas plays his role, but Christ handed Himself over.\n\nWhat did it look like for Christ to give His life, while He still breathed, as He willingly walked to His death? He gives it away in so many big and small ways in this chapter alone, that I don’t have space here to touch on each. (If you can, take time to circle all the ways you see Christ giving away His life in these verses.) But we can look at a few here together.\n\nWithin the first two verses of the chapter, Jesus tells His disciples the exact day He will die. He specifies that it will happen in two days’ time. We don’t have a record here of their response, but judging from their other responses in Scripture, disbelief is a fair guess. Jesus gives His life by declaring His intention to do so.\n\nHe then allows the woman to prepare His body for burial. He defends her extravagance and celebrates her for seeing a small part of the truth of what would happen to Him, declaring her actions as noble (vv. 6-13). He knows what is coming, yet He doesn’t run from it. Jesus gives His life by preparing for His own burial.\n\nWhile He shares His final meal with the disciples, Jesus distresses His disciples by saying, “Truly I tell you, one of you will betray me” (v. 21). He suffers one of the deepest human sorrows: betrayal by a friend. In spite of their protestations, His disciples continue to betray Him as they fall asleep (vv. 36-46), desert Him (v. 56), and deny Him (vv. 69-75). Jesus gives His life by suffering betrayal.\n\nIn all these little ways and more, Jesus gave up His life for us. He suffered the whole gamut of human pain from heartbreak to torture. Reading all of this horror would feel gratuitous, except this is the narrative of our own happy ending. Because of Jesus’ thousand tiny deaths, and one literal death, we can live. We not only live, but we get to live happily ever after, with Him. This harrowing history is the key. He slayed the dragon of death and sin, and we can live in grateful joy for His precious sacrifice.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-25-1.jpg"
  },
  {
    "book_title": "Matthew",
    "devo_passages": "Matthew 27:1-66, Matthew 28:1-20, Psalm 22:7-8, 1 Corinthians 15:6, 2 Corinthians 3:18",
    "devo_title": "Jesus Is Risen",
    "devo_summary": "\n\nBy Andrea Lucado\n\nScripture Reading: Matthew 27:1-66, Matthew 28:1-20, Psalm 22:7-8, 1 Corinthians 15:6, 2 Corinthians 3:18\n\nMy parents like to tell this story about me as a three-year-old.\n\nMy sister and I had a babysitter for the night, and my mom had made us brownies to have as a snack, with the instruction that we were each allowed one brownie. After the first brownie, I reached for a second. \n\n“No, Andrea,” said the babysitter. “You can only have one.” I looked at her, and with a scrunched up face and my hands on my hips, I declared, “You’re not the boss!” At the time, I had a speech impediment that softened my “R”s. So you can imagine how intimidating this sounded to my babysitter.\n\nI still have authority issues. Authority threatens my freedom. It says I am not in charge, not the boss of my own life. Yet, as Christians, we aren’t meant to live under the authority of our own rule. We have a King!\n\nThe Kingship of Jesus is highlighted in Matthew’s account of the crucifixion and resurrection. It was a Roman custom to name the crime of the offender on a plaque and place it above the criminal’s head as He hung on the cross. Because Pilate said Jesus had committed no real crime, he ordered this inscription instead:\n\n“This is Jesus, the King of the Jews” (Matthew 27:37).\n\nIt was a label given in contempt that could not have been more correct. \n\nScripture tells us Jesus is not only King of the Jews, but He is the King. As Revelation 19:16 says, “he has a name written on his robe on his thigh: King of Kings and LORD of Lords.” Still, I more often refer to Jesus as my Savior rather than my King. Charles Spurgeon says this is our tendency: “Men might be willing for Christ to save them, but not for Him to reign over them.”\n\nAcknowledging that Jesus reigns over me means acknowledging that I am not in control. But His kingship also means He is involved in the everyday—that His sovereignty covers even the nitty gritty of life. There is accountability that says we are called to a new, gospel way of living, and there is grace that says we aren’t doing this on our own. Both threaten our autonomy. \n\nSo we have to ask ourselves: Who’s the boss here? Me or Jesus?\n\nWhen we bow to Jesus as our King, we receive what we are most afraid of losing in the face of authority: freedom. Real freedom. \n\n“So if the Son sets you free, you really will be free” (John 8:36). \n\nThat’s the type of freedom I want. Not the kind that creates the illusion of my own control, but the kind that comes with the cross. The kind that comes with surrendering to the power that conquered death forever and rose victorious from the grave. \n\nThis is Jesus. He is the Son of God, the King of the Jews, the Savior of the world—and He is also the King of me. \n\nThe angel told the women, “Don’t be afraid, because I know you are looking for Jesus who was crucified. He is not here. For he has risen, just as he said.” -Matthew 28:5-6\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/01/SRT-Matthew-Instagram-26-1.jpg"
  }
]