[
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 24:1-33, Deuteronomy 7:9, Romans 8:28",
    "devo_title": "Israel Renews Their Covenant Commitment",
    "devo_summary": "\n\nBY Patti Sauls\n\nThey had walked the aisle before, but this time the bride and groom had twenty years of marriage under their belts. As they held intimately familiar hands, the couple promised to stick together for better or worse, for richer or poorer, in sickness and in health, to love and to cherish till death would part them. They declared, “I do…again” as an affirmation of vows made years ago and as a recommitment to keep these vows for years to come. \n\nPublicly declaring and doubling down on unconditional love and faithfulness is no small thing. To say that marriage is hard is a colossal understatement. Renewing vows can be a bold celebration of victory in the face of opposition, as well as a humble agreement to continue the arduous journey, one day at a time. \n\nIt was no small thing for Joshua to conduct a covenant renewal ceremony between God and His people either. All seemed well as Israel settled down in the promised land, finally free from battle. But Joshua knew the people needed to double down on their commitment to the Lord because they were surrounded by nations worshiping false gods. It would be so tempting to cheat on God by adopting the idolatry around them, to put their hope in their new land and homes, forgetting and forsaking the one, true God.\n\nIn his final act of leadership, Joshua gathered Israel’s leaders in the city of Shechem for a vow renewal ceremony. This spot was no accident. Hundreds of years earlier, Abraham faithfully left his homeland and followed the Lord to Shechem (Genesis 12:6). Under the well-known oak of Shechem, Jacob buried his family’s idols in obedience and commitment to God (Genesis 35:4). Here once again, Joshua calls God’s people to remember and recommit, to demolish idols and turn toward the Lord. \n\n“Fear the LORD and worship him in sincerity and truth. Get rid of the gods your fathers worshiped beyond the Euphrates River and in Egypt, and worship the LORD” (Joshua 24:14). \n\nOnce again, God’s people promised, “We will” (v.16).\n\nBut then a surprising correction from Joshua threatened to derail the ceremony: “You will not be able to worship the LORD, because he is a holy God” (Joshua 24:19). God is perfect, and Israel was not. Neither are we. “For all have sinned and fall short of the glory of God” (Romans 3:23). Despite our promises and best intentions, we cannot keep our vows to God. We will stray. We will forget. We will forsake. But God has not forsaken us. “The righteousness of God is through faith in Jesus Christ to all who believe” (v.22). Through Jesus, our unfaithfulness—our sin—is forgiven, so that we can be in right relationship with God. He completes the ceremony, saves a colossally hard union, and fulfills all the vows—both His and ours. \n\nWhat God has joined together, no one can separate.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-26-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 23:1-16, Matthew 22:37-40, Philippians 1:6",
    "devo_title": "Joshua’s Farewell Address",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nWe’ve all seen it before in books or plays. Long lost relatives turn up out of nowhere. A bright blue sky conveniently starts pouring rain onto a parched, dry land. Eagles swoop in unexpectedly and save the day. These are examples of deus ex machina, a phrase referring to a story’s unexpected, sometimes unbelievable, turn of events. It’s a plot device that abruptly offers a way out of catastrophe as events unfold outside the existing logic of a story.\n\nAt first glance, the book of Joshua is one long string of seemingly unbelievable twists and turns. The sun stands still, the walls of Jericho fall, and the Israelites cross the Jordan River after it miraculously dries up. Too good to be true, right? Except these divine victories unfold perfectly within the book’s framework because this is the story of our faithful God fighting on behalf of His people—just like He promised (Joshua 23:3, 10). It’s too good not to be true. \n\nCan you imagine the relief Joshua must have felt near the end of his life? Scripture tells us that by the time Israel found rest from their enemies, Joshua was “advanced in age” (Joshua 23:1). He had the satisfaction of seeing each of God’s promises to him fulfilled with his own eyes. While giving a final address to the Israelites, Joshua stood as a witness to God’s character and said: “You know with all your heart and all your soul that none of the good promises the LORD your God made to you has failed” (v.14). \n\nDo we also know this with all our heart and soul? As we watch the Lord fight on behalf of His appointed leader, we see God’s primary promise was that He would never abandon Joshua. He was promising His presence. For those of us who are in Christ, we are promised the gift of God’s presence in the Holy Spirit, who is always with us (John 14:16). This is a promise we can count on for the rest of our lives.\n\nI think one of the most encouraging things we can do in our journey with the Lord is read stories of God’s faithfulness in the lives of others. His divine victory is no fallible plot twist. We can expect it, believe it, and even petition for it with fervor because God is for us (Romans 8:31). He does what He says He will do. Historical narratives like the book of Joshua renew our trust in God and the promise of His presence as we trace His hand at work through the lives of His people. \n\nWe can remember and rejoice that our God always keeps His promises. “I am sure of this,” we can say along with our brothers and sisters, “that he who started a good work in you will carry it on to completion until the day of Christ Jesus” (Philippians 1:6). \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-25-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 22:1-34, Psalm 7:8-10, 2 Corinthians 1:21-22",
    "devo_title": "An Altar of Witness",
    "devo_summary": "\n\nBY Tameshia Williams\n\nAfter the tribes of Reuben, Gad, and Manasseh helped the rest of Israel conquer Canaan, Joshua released them to return to their homes across the Jordan. As he sent them off, he blessed them and charged them to maintain their allegiance to God, saying, “Love the LORD your God, walk in all his ways, keep his commands, be loyal to him, and serve him with all your heart and all your soul” (Joshua 22:5).\n\nThe conversation was between Joshua and those three tribes, but his words are also for us today. As the people of God, He calls us to love Him wholeheartedly and walk in His ways. We pattern our thoughts and actions after His very thoughts and actions expressed in His Word. It’s a lifetime of continuous transformation, as we rely on the power of the Spirit to shape and reorient our values and behaviors to look more and more like Jesus. He gets our full allegiance.\n\nBeing loyal to God includes being committed to taking a stand for righteousness, even when it challenges our relationships. Sometimes we do this in quieter ways, and other times we take a more vocal stand—like Israel did when they learned the three tribes had built an altar at the border (Joshua 22:9–12).\n\nIsrael’s history included many instances of infidelity and rebellion against God. However, Joshua 22 shows us an Israel whose priority was walking in God’s ways, even to the point of being willing to fight their own countrymen. Here was the generation seeing God’s promises fulfilled, and they were determined to be faithful to Him as He had been to them. This is a lesson for us today: Do we desire God’s holiness and presence to the point of boldly standing against anyone or anything that would threaten our allegiance to Him?\n\nIt was also a lesson to seek understanding before taking action. Thankfully, the altar was not a sign of rebellion but a show of solidarity. The Eastern tribes built it to ensure unity and permanently mark their inclusion as the people of God (Joshua 22:24). It was a memorial of remembrance and a visual declaration that the Lord was their God and would always be their God. The action of the three tribes is a model for us. Although we no longer use altars, we can still incorporate rhythms of remembrance into our spiritual practices. What could these periods of reflection look like for us? \n\nWhen we set aside time to remember God’s faithfulness and the many ways He has worked in our lives, we come away with a renewed sense of wonder for who He is, as well as a deeper awareness of His presence. This awareness fosters joy and a confidence that He will be with us throughout every season of life. This can intensify our commitment to love God without reservation, serving Him with all of our heart and soul (Joshua 22:5). \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-24-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 20:1-9, Joshua 21:1-45, Exodus 21:12-14, Hebrews 4:14-16",
    "devo_title": "The Lord Fulfills His Promises",
    "devo_summary": "\n\nBY Rebecca Faires\n\nIt’s hard to see your happy ending when it’s happening. Right now, for the first time in four years, we are on a beach vacation. My baby is napping upstairs, and my husband and our other kids are out splashing and sunning in the ocean. I mean, this is it! Settled family unity with beautiful scenery and a grill. But I’m not sure I’ve rested yet. (Yes, I have little kids and no one ever really rests until everyone is over five, but let’s set that aside for now.) It’s hard to stop and see promises fulfilled, to enjoy rest when it comes, because we are so accustomed to chasing and straining. But God does bring us rest, and we can enjoy it; we just have to keep our eyes open to His goodness.\n\nThe book of Joshua is a record of God’s fulfillment of His part of the renewed covenant in Deuteronomy. God gave Israel victories, but each victory required a step of faith. God’s provision for the people as their leader and guide was recorded in this book and recounted to later generations. \n\n“The LORD gave them rest on every side according to all he had sworn to their ancestors” (Joshua 21:44). And the rest He gave extended to every part of their lives. In the civil sphere, He gave them the rule of His righteous law rather than the rule of revenge. They got to enjoy rest from the consequences of earthly vengeance (Joshua 20:1–6), and this blessing extended even to those who merely associated with God’s people. His civil rest was wide and generous (v.9).\n\nHe also gave rest in the religious sphere, giving rest to His priests. The Levites received cities of inheritance in all the land. The work of the priesthood was acknowledged and the ministers of God were provided for. \n\nFinally, He gave rest for every heart and mind, enjoying rest from their enemies. In setting apart His people, God provided blessings that extended to every hearth and home, to every field and meadow. He blessed His people with victory and peace.\n\nThe foundation for any true rest is built on the fulfilled promises of God. God promised and delivered rest to His people. Although man threw away perfect rest and peace in the garden, God faithfully and continually rescued His people from the slavery and unrest of their own folly, and brought them to a land of rest that He had prepared for them. Every Sabbath, every feast and festival, tells the same story. The promise is for us also. One day, the chasing and straining of this world will cease, and we will find perfect rest and peace in Him forever.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-23-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 18:1-28, Joshua 19:1-51, Acts 13:16-23, Romans 4:16-22",
    "devo_title": "Joshua Divides the Land",
    "devo_summary": "\n\nBY Jen Yokel\n\nFrom the crafting of Eden, to the building of cities, from Abraham setting out toward a promised land he’d never see, to a scattered kinship across every tribe and nation, and the future promise of a new creation—the Bible is, in a sense, the story of God’s people seeking and finding a home. Once you see this, it becomes harder to miss, even in the long and detailed records of land allotment tucked into the middle of Joshua.\n\nWhen I say detailed, I mean all the way down to the borderlands, geographic features, and names of every town within them. You may need one of those handy maps in the back of your Bible or in your Study Book to make sense of it. But God, it turns out, is in the details. So perhaps, we could read this not as a tedious historical list, but as an intricate record of God’s faithfulness to the people He loves.\n\nIt’s interesting to note where and how the land division took place. At that time, seven of the tribes had yet to divide up their inheritance, so they gathered at Shiloh, the tabernacle meeting tent. Joshua asked for a detailed document of all the land, then told them he would decide by “cast[ing] lots…in the presence of the LORD our God” (Joshua 18:6). It’s a method that seems to us as arbitrary as a coin flip, but the involvement of a priest and the location of God’s dwelling place suggest that this is a sacred moment of discernment.\n\nAs we’ve already explored in this study, land, a place to live, was a matter of economic stability. This was especially true for these descendants of slaves, who carried God’s promise to Abraham in their memories and stories. And yet, they didn’t live happily ever after in the promised land. There would be struggles to come: invasions, corruption, communal sin, and all the consequences to go with it. They would live under the rule of judges and kings and, eventually, Roman occupation. They would  be scattered sojourners once again.\n\nYet hope endures, though no one can quite see what God has been building all along. In guiding them through the wilderness, God ensured their survival. In giving these tribes a home, God laid the foundation for a new nation. In relenting to their demands for a king, God gave them the line of David, and in time, Christ the true King (Acts 13:16–23).\n\nThe kingdom is still being built, one with room and space not just for the direct descendants of Abraham, but for all who share in his faith. Even now in redemption’s history, God’s promised land is still being tended, still being built with ever-expanding borders. These lists and maps are just a preview, a testament in writing to God’s faithfulness. And thankfully, they’re only the beginning.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-22-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 16:1-10, Joshua 17:1-18, Psalm 2:8, 1 Peter 1:3-5",
    "devo_title": "Joseph’s Inheritance",
    "devo_summary": "\n\nBY Rebecca Faires\n\nMy Grandma Pennington was really the best of all of us Penningtons. She walked for miles every day, read through the Bible more times than she could count, prayed for each of us by name every morning, only ever ate three peanut M&Ms at a time, always smelled like Chanel N°5, and she always made her husband chuckle. Her chief desire was that we know Jesus. And she made each of us feel like we were her very favorite person in the world. I miss her very much. \n\nShe had some jewelry, and everyone received a piece as part of an inheritance. I got a necklace that is black, gold, and perfect. It may seem like a small thing, but the detail of a fitting piece of jewelry is a reminder of what deeply personal love looks like. My grandmother reflected one way in which God’s goodness is personal: the details matter to Him. He is close to and cares for His children. He created us with love, and He cares about our relationships and our beautiful, marvelous grandmothers.\n\nI just love this passage about Israel’s happy ending—their long-awaited, personal inheritance. I understand that reading about the division of land might seem dry. But lists and rosters are often where we can really find the good stuff. It is precisely in these particulars that we see the practical outworking of the favor of God. His promises are not far off and cold, because even in the mundane, jewelry-wearing aspects of our lives, all of His promises are “Yes” and “Amen” (2 Corinthians 1:20). \n\nWhat a relief and joy to realize God is not indifferent to or dismissive of our circumstances. He considers our estate, and provides an inheritance for all His people. And boy, does He love people! The abundance of children and grandchildren as His generous blessing is a constant theme in Scripture. The blessing of fruitfulness, the continuation of families, and the generational promises of God’s covenant are signs of His favor. “We have many people, because the LORD has been blessing us greatly” (Joshua 17:14). And this family isn’t limited to biology. In Christ, God’s family extends beyond literal descendants to bless us with a far-reaching family through faith. Every person gains a heap of brothers, sisters, aunts, uncles, parents, and children they are called to care for like flesh and blood in the body of Christ.\n\nAnd when He blesses us with more people, He provides according to our needs. Yes, even the very land beneath our feet is His generous gift. We ought not fear or worry about the sufficiency of His provision. He knows us by name and knits us together before we are even born. The life of the Christian is an adventure story where we know the ending. He makes dear provisions for us along the way. He knows our names. He provides for us an inheritance perfectly tailored to us and out of His abundant generosity.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-19-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 15:1-63, Genesis 49:1-27, John 10:7-10",
    "devo_title": "Judah’s Inheritance",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nMy parents live on three acres in the Northern California foothills, where the land’s boundary lines are hard to see. After a forest of pine trees and a jungle of blackberry bushes, our property comes to a point. You’d never know it since our neighborhood acreage spills out into one messy field of overgrown weeds. There are no fences or stakes. Just a field that dead ends at an old street. Being good friends with our neighbors, we’ve always had permission to trot down there anytime we like, silver pails in hand, to harvest blackberries for homemade ice cream.\n\nIn the book of Joshua, boundary lines and land borders are given more importance. Joshua 15 thrusts us right into the heart of land divisions. Caleb had just received his inheritance, and it was time for the tribe of the descendents of Judah to receive theirs (Joshua 15:1). Unless you’re the type of person who loves reading detailed lists of ancient real estate, it can be tempting to just skim the rest of the chapter. But stick with me.\n\nFirst, we’re told about the many twists and turns of the southern border until it hit the Mediterranean Sea (Joshua 15:2–4). After moving past the eastern border in a sentence, we get a detailed description of the northern border that was three times as long as the southern (vv.5–11). After that, we hear about the inhabitants Caleb drove out of their homeland so Judah’s descendents could take up residence (vv.14–15), as well as comprehensive lists of cities Judah inherited by clan: twenty-nine outermost cities, thirty-nine in the Judean foothills, thirty-eight in the hill country, and six in the wilderness (vv.21–62). \n\nWhew! That’s a lot of people, cities, and borders. Personally, I think it’s easy to want to skip ahead to “the good parts” or take a detour to a familiar psalm. But the text begs another question: Why does this matter for us? You see, to Judah, this was the good part. When we read the statement “this was the boundary of the descendants of Judah around their clans” (Joshua 15:12), we glimpse Judah’s role in redemption history. Because land was an invaluable commodity at the time, this inheritance was tangible evidence of God’s faithfulness and the fulfillment of His promise to them. It was God’s provision. It was their manna.  \n\nThe same God who was faithful to Judah is faithful to us today. Even though property boundary lines are a little more loosy-goosy in my parents’ neighborhood than they were in the book of Joshua, they still matter. To us, these invisible lines point to the many trees and butterfly bushes that embody God’s provision for our family over the years. How have you seen God provide for you this year? If you’re still waiting to taste His provision, take a moment to praise Him for the ways He’s already taken care of you, and then ask for the patience to see His faithfulness again.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-18-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": " Joshua 14:1-15, Numbers 14:1-25, Romans 11:33-36",
    "devo_title": "Caleb’s Loyalty to God",
    "devo_summary": "\n\nBY Tameshia Williams\n\nThe broader narrative of Joshua is about God fulfilling His promises to the nation of Israel, as they progressively inherit Canaan. Within this narrative are accounts that show us how God specifically fulfilled His promises in the individual lives of His people, such as Caleb.\n\nOf the twelves spies, Caleb and Joshua were the only ones who believed God could give them the land of Canaan. God guaranteed Caleb an inheritance in the land of promise because “he followed the LORD, the God of Israel, completely” (Joshua 14:14). Forty years later, an eighty-five-year-old Caleb still displayed an unshakeable faith.\n\nWhen we read Caleb’s story, we might be tempted to feel insecure about our own faith in God. Our faith journeys include times when we have trusted God fully. Other times, we may have questioned the reality of His presence in our situations. To follow God completely doesn’t mean that we don’t have days of doubt. Instead, we rely on the Holy Spirit to help us push through those days, carrying all of our anxieties and doubts to the Lord. At the heart of Caleb’s faith was trust in the faithfulness of the one who had been with him all those years before, when he went into the promised land as a spy.\n\nFollowing God completely also means we can ask God to carry out His promises to us. When the time came to distribute the land, Caleb reminded Joshua of the Lord’s promise to him, saying, “‘The land where you have set foot will be an inheritance for you and your descendants forever’” (Joshua 14:9). Caleb didn’t come to Joshua in arrogance or with a sense of entitlement. He came with confidence, trusting that the Lord would give him the land and help him, even believing that he could drive out the current inhabitants, who were giants! This belief wasn’t based on his strength but on total confidence in the Lord’s strength. When we rely on God’s power, we are able to do things we could hardly imagine and gain physical, emotional, and physical victories. Through Caleb, we see that nothing is impossible for God. \n\nCaleb’s story is a beautiful picture of a faithful God honoring the faithfulness of His people. It shows us that God keeps His word, no matter how many years have passed. Forty years after God promised Caleb the land, Caleb received his inheritance, and the land remained in his possession: “Hebron still belongs to Caleb son of Jephunneh the Kenizzite as an inheritance today” (Joshua 14:14).\n\nWhat does our story look like? What promises are we waiting for God to fulfill? As we serve Him and wait for His promises, our charge is to follow Him and trust that He will fulfill His promises in His time, according to His will (Romans 11:34). His presence is with us always, and He has good things in store for us. \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-17-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 13:1-33, Deuteronomy 3:22, Revelation 5:9-10",
    "devo_title": "Unconquered Lands",
    "devo_summary": "\n\nBY Jen Yokel\n\nThe book of Joshua is known for its epic tales of war and wonders, of walls collapsing at the blast of trumpets, and the sun standing still in the sky. But as you’ve been reading, you’ve probably also noticed a book of lists, of conquered kings and detailed land allotments. From Abraham under the stars to an army crossing the Jordan, the promised land has been both a distant dream and a sought-after goal.\n\nIn chapter 13, Joshua’s war days are done, but God reminds him of some unfinished business. There’s a great deal of land waiting to be possessed, still occupied by the Philistines, Canaanites, and other tribes. God promises to take care of clearing the land. All Joshua needs to do is distribute it (Joshua 13:6–7).\n\nA string of lists about who gets what follows. This might feel like tedious reading for us today, but to the tribes of ancient Israel, land ownership was an important asset for a good life. A family’s land could be bought and sold, but it could also be inherited, passed down for the security of future generations. For a community who had been freed from slavery only to wander in the desert for forty years, the prospect of settling down and having an inheritance was worth celebrating and recording.\n\nAnd yet, there’s one repeated exception. The tribe of Levi, Israel’s priestly class, receives some cities, but no land to call their own. Instead, “The LORD, the God of Israel, was their inheritance, just as he had promised them” (Joshua 13:33). At this point, we are left to wonder why the keepers of sacrifices and worship (arguably the most important work) are not granted some land of their own?\n\nI wonder if it has something to do with detachment from security. For so much of their story, God has been leading these people, fighting for them, and showing them the way to go. They have shown themselves to be fickle and forgetful, longing for the old life when a new, better one is coming. How easily they could have settled into the security of the new land, passing along the inheritance, forgetting the miraculous journey to get there.\n\nMaybe these priests were there to remind them what it’s like to utterly depend on God, to serve as spiritual leaders within their communities, rather than separate themselves. In a way, our living in the midst of this world is a bit like the Levites living among neighboring tribes: both require dependence on God.\n\nI’d like to think we share a common ground with the Levites, as outsiders brought to God and made into “a kingdom and priests to our God” (Revelation 5:9–10). Our inheritance is not found in land or other wealth, but in God, just as He promised, with a hope and security that will never fade.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-16-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 12:1-24, Nehemiah 9:22, Psalm 136:16-21, Daniel 2:19-22",
    "devo_title": "Territories & Kings",
    "devo_summary": "\n\nBY Patti Sauls\n\nA spunky child may disagree with me, but I appreciate a good time-out. Offer me a chance to pause, catch my breath, and regroup, and I’ll take it every time. Today, we’re offered a pause as we reach the midpoint of the book of Joshua. There’s been a lot of action already. So far, we’ve tracked Israel’s turbulent entrance into Canaan. And now we slow down for a retelling of Moses’s earlier victories on the east side of the Jordan River, as well as Joshua’s victories in the west. This clear summary gives us a chance to understand what was happening in the land. \n\nHere’s another recap: The nation of Israel consisted of twelve tribes that descended from the families of Jacob’s twelve children. This confederation of tribes was called “Israel” because that was the new name God gave to Jacob, a Hebrew patriarch (Genesis 32:28). After hundreds of years enslaved in Egypt and forty more years wandering in the desert, Israel finally got to enter the abundant land that God had promised to Jacob’s grandfather, Abraham. \n\nIn Canaan under Joshua’s leadership, Israel was a nation on the move. We read of each king who was overthrown and each city that was conquered (Joshua 12). The conquered eastern land was divided and distributed to some of the tribes, “and Moses the LORD’s servant gave their land as an inheritance to the Reubenites, Gadites and half the tribe of Manasseh” (v.6). The conquered western land was divided among the remaining tribes, including the other half of the Manasseh tribe (Joshua 13–17).\n\nHere we have a bird’s-eye view of Israel in the land, but now we need a close-up perspective. What about each man, woman, and child? What were their hopes and dreams? This nomadic nation had been enslaved and homeless for hundreds of years. They dreamed of settling down in freedom, safety, and peace; they longed for a place to call home. \n\nSadly, it wouldn’t come easily. The unfolding of the Old Testament describes the challenges that God’s people encountered in their search for home. Abundant land wasn’t enough. Conquered cities weren’t enough. The people’s struggle with unbelief, disobedience, forgetfulness, and fear wrecked them again and again. The Israelites needed more than a place to call home; they needed a Person to be their home. And, so do we.  \n\nWhat are you running to for security and peace? Or are you weary and wrecked and barely managing to crawl? What are you trying to conquer in hopes that it will define you or protect you? As God remained faithful to the Israelites, He remains faithful to us. God not only promises an eternal place to call home; He also gives us Himself. This is what we have been looking for all along. \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-15-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 11:1-23, Psalm 110:1-7, Ephesians 1:3-14",
    "devo_title": "A Battle Without Mercy",
    "devo_summary": "\n\nBY Sharon Hodde Miller\n\nWhat do we do with the violence in the Old Testament?\n\nThis is a question I hear often from members of our church, and for good reason. Whenever we read stories like the one in Joshua 11, it can be difficult for us to reconcile these accounts with what we understand about the person of Jesus. For this reason, for thousands of years, many people have wondered if the God of the Old Testament and the New Testament are, in fact, somehow different. \n\nTheologian N.T. Wright warns against this disjointed approach to reading the Bible, but he also cautions against drawing neat and tidy conclusions about passages like Joshua 11. In the crucifixion, Jesus received the punishment we deserve, and this is the primary paradigm by which we understand God’s judgment; God’s final word on human depravity is not condemnation, but the possibility of redemption in Christ. \n\nThat said, what can we take from passages like this one? \n\nWhile we must be cautious about applying Joshua 11 to literal battles, it certainly teaches us something about spiritual ones. In the early chapters of the book, Joshua picks up the mantle of Moses’s leadership and fights many battles. In the end, “Joshua took the entire land, in keeping with all that the LORD had told Moses. Joshua then gave it as an inheritance to Israel… After this, the land had rest from war” (Joshua 11:23). He does all of this later in life, so he has earned a reputation as an effective military leader. Even so, he understands that Israel is not his to lead. Not truly. Instead, Joshua defers entirely to the legacy of Moses and the will of God.\n\nThis example is not especially notable until we compare it with a later leader, King Saul. In 1 Samuel 15, God gives Saul nearly identical instructions: go, conquer, and destroy entirely. Saul successfully completes the mission, mostly, but he spares some of the best sheep and cattle to keep for himself. Even though he conquers the Amalekites, God is displeased and rejects Saul.\n\nIt’s important for us to understand that God is less concerned with the battle than He is with the orientation of our hearts. Joshua understands this. He realizes that, although he is the leader of Israel’s army, he is not ultimately in charge of God’s people. And he refuses to win the battle “his way” because he trusts God more than his own judgment.\n\nFor those of us facing battles of our own today, we ought to ask ourselves some searching questions. When faced with one of life’s battles, will I respond like Joshua, or take matters into my own hands? Will I choose “what works,” or what is faithful? Will I be absolutely, positively obedient to the commands and character of God, even when it does not at first make sense to me?\n\nBoth options can achieve a similar outcome. But only one is a faithful response.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-12-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 10:16-43, Romans 1:18-20, Ephesians 1:20-21",
    "devo_title": "God Gives Israel the Land",
    "devo_summary": "\n\nBY Patti Sauls\n\nShould we cheer or should we grieve? I certainly cheer as I read about the nation of Israel finally entering the promised land of Canaan. What a celebration and relief for God’s people! Their forty-year-long desert detour was over! Now, these men, women, and children were free to settle down in the abundant land God had promised Abraham so long ago. \n\nI also cheer for Joshua, Moses’s protégé and successor. As God’s chosen man, he led the people into Canaan. However, all was not smooth sailing. After crossing the Jordan River, Israel was met with resistance. Canaan was not an empty, unsettled territory. City after city fortified itself against Joshua and his advancing Israelite army. King after king dispatched troops to fight for land and dominance. From the city of Makkedah, to Libnah, to Lachish, to Eglon, to Hebron, to Debir, our reading follows Joshua and his soldiers as they march to victory across the southern region of Canaan. \n\nI can almost hear Israel’s victorious battle cry, but if I’m being honest, my cheers give way to heaviness. As United States Army General Sherman soberly stated, “War is hell.” We may grieve as we recognize that Israel’s long-awaited entrance into the promised land was an invasion. We may be troubled as we remember that Joshua was not only Israel’s strong and courageous national leader; he was also its top military general. He obeyed direct orders from God to mobilize troops and strategically conquer Canaanite strongholds.\n\nAre you wrestling with this account of God declaring war? Let’s press into ancient texts to get a better glimpse of God as a righteous warrior. For hundreds of years, the Canaanites had been increasingly sinful (Genesis 15:16). The root of their sin was idolatry: worshiping false gods instead of the one, true God. The fruit of their idolatry included brutal child sacrifice and witchcraft (Deuteronomy 18:9–12). Any person settling in Canaan would suffer from this way of life. Worse yet, all future generations would be twisted and dehumanized by such deeply entrenched sin patterns and spiritual darkness long at work in the land. \n\nWe see that God declared war against this deadly system, but do we know what He was fighting for? Joshua experienced victory “because the LORD, the God of Israel, fought for Israel” (Joshua 10:42). By demolishing Canaanite strongholds, God uprooted destructive wickedness and prepared the land for faithful, flourishing life. He fought to protect and preserve His people.\n\nWe reflect on Israel’s conquest of Canaan with both grief and gratefulness. We grieve over the deadly seriousness of rejecting God and over the destructive powers of sin and darkness. Yet, we also gratefully rejoice as we see God declaring love for His people by declaring war on sin, both in the promised land and in our own hearts today. To Him, the fight against sin and death is worthy of the shed blood of His own Son, Jesus. Thanks be to God.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-11-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 9:1-27, Joshua 10:1-15, Psalm 84:10",
    "devo_title": "The Day the Sun Stood Still",
    "devo_summary": "\n\nBY Kaitie Stoddard\n\nI think Ms. Frizzle from The Magic School Bus was modeled after my third grade teacher. One of the coolest things about my Ms. Frizzle was that she took adult ballet classes. Once a week, I’d see her at the dance studio as my class let out and she was warming up for hers. Our mutual love of dance forged a special bond between us. In and out of the classroom, I felt like she was rooting for me. I was confident she was on my side and wanted to see me succeed.\n\nThat confidence in our relationship gave me the gumption to ask her if I could set up a “sewing station” in her classroom. I was shocked when she obliged my request. Barely able to stitch two pieces of fabric together, I’d taken to making blankets for my classmates. Any downtime I had throughout the school day, I would race back to my needle and thread to whip up a new creation. This was not a creative arts school, mind you, but a public school where my teacher was bending all the rules for me. \n\nI learned that when someone is in your corner, you should make bold requests. They might say “no,” perhaps for your own good. Then again, they might just say “yes.” And they certainly wouldn’t ridicule you for asking. If anything, the confidence I felt to express my creativity in the classroom probably made my teacher feel even closer to me. When we feel secure in a relationship, we have more confidence to ask for what we really want. The same is true with God.\n\nIn Joshua 10, we see a man who was truly confident in his relationship with the Lord. As five neighboring kings launched an attack on Joshua’s people, he didn’t waver one bit from God’s plan for Israel. The Lord told Joshua, “Do not be afraid of them, for I have handed them over to you” (Joshua 10:8). God promised to back Joshua’s army, and Joshua trusted the Lord to follow through on His promise. Joshua’s strong faith in God gave him the boldness to ask for the impossible: to stop the sun in the sky long enough to finish the battle. And “the LORD listened to a man, because the LORD fought for Israel” (v.14). \n\nAre we afraid to ask God for the impossible? If God has commissioned us to do a work, we need to trust that He will see His plan through. We can ask our Father for miracles, believing that however He answers our prayers, He does so with love. We may not always get the result we’d hoped for, but that doesn’t mean we should stop asking. God tells us to “approach the throne of grace with boldness,” confident in our relationship with Jesus (Hebrews 4:16). We serve a God with the power to move mountains, stop the sun from setting, and give us eternal life. Why shouldn’t we ask? \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-10-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 8:1-35, Exodus 20:22-24, Hebrews 8:8-12",
    "devo_title": "Conquest & Commitment",
    "devo_summary": "\n\nBY Rebecca Faires\n\nWhen I landed my first job, I was just three credits short of my bachelor’s degree—just a little chemistry course. So I walked in my graduation ceremony, threw my hat in the air, and planned to sort out the nagging little detail of those three little credits at a community college… later. After all, my degree was ninety-eight percent finished, and such a little thing hardly seemed important. I was pretty much a college graduate, and no one would care about all the nuts and bolts involved with my degree. Oh, but they did care. To my boss, it was less a matter of what percentage of the degree was finished and more a literal desire to see my actual diploma. \n\nObedience matters. Actual black-and-white, toe-the-line obedience matters. In an age of self-worship, the notion of true obedience is an offense, making it a neglected virtue. We like to assert independent thought and maintain our autonomous individualism. But God is absolutely clear: He commands our obedience. It bears mentioning that God can require our faithfulness because He is actually God. Indiscriminate or blind obedience to earthly authorities can be at odds with what God asks of us. Petty, earthly rulers have the limited power God grants them, but our first allegiance is always with the King who sits on the eternal throne (Psalm 9:7).\n\nThe first defeat at Ai was the result of the disobedience of one man, Achan. As with Adam and Eve, however, his self-serving theft undid an entire people. Shiny things are tempting, but God had called His people to do more than just lay hold of territorial possession; they were to establish a culture rooted in His covenant with them. The conquest wasn’t about stuff—it was about culture. He was their God, and they were His people. And so Joshua instructed them as such: \n\n“Follow the LORD’s command—see that you do as I have ordered you” (Joshua 8:8).\n\nThe conquest of the land was built upon covenantal relationship. God wasn’t just giving earthly land-grants or stocks and shares in the gold market. He was doing something altogether different. He was calling His people to take dominion, as He had called Adam to take dominion. They were to remove idolatry from the land and be a people who honored God’s statutes and commandments. \n\nMercifully—though the lesson of obedience was costly—God restored the set-apartness of His people. They were called back to Ai, to this time be obedient to everything God commanded. Before, they had tried to go out in their own strength and had failed. But when they obeyed, they gained victory. \n\nDisobedience undermines our fitness for the work of God’s kingdom. We cannot expect to see victory in our lives if we dally in disobedience. Still, God is merciful, and because of His great mercy, we can once again return to Him, making His word our joy and His command our delight (Psalm 119:16).\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-9-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 7:1-26, Deuteronomy 9:26-29, Hosea 2:15, James 1:19-25",
    "devo_title": "Achan’s Disobedience",
    "devo_summary": "\n\nBY Tameshia Williams\n\nMy sisters and I dreaded certain family meetings when we were teenagers. For these talks, Dad would call us into the living room because one of us had broken a major rule, though my parents couldn’t clearly identify the culprit. Our comfy, blue couch became a witness stand with throw pillows, with Dad and Mom acting as both judge and prosecutor. “How did that dent get there on the side of your mother’s car?” “To whom do these cigarettes belong?” No matter who the offender was, none of us looked forward to our parents’ disappointment—or their punishment. \n\nThe children of Israel found themselves in a similar, yet far more serious situation. Achan’s greed led to his disobedience, and his disobedience brought tragedy to Israel, starting with their defeat in the battle at Ai (Joshua 7:5). Joshua was sorrowful, and the Lord was displeased, requiring the people to present themselves before Him: “Go and consecrate the people,” the Lord told Joshua (v.13). Israel was to prepare for God’s presence, and then He would address the offense and the offending party. Achan’s desire for things God had forbidden caused him to hide stolen items. The irony is that Achan had stolen in a land already promised to him and his fellow citizens. God had a great inheritance in store for them that included cattle and other riches. But Achan wanted things his way and in his time: “I coveted them and took them” (v.21).\n\nHow often have we been like Achan? Sometimes, we desire things so badly that we resort to getting them by any means necessary, cutting corners or engaging in activities that teeter on the ethical borderline. We reason that if it’s just for me, no one has to know.\n\nBut God sees all and knows all. He didn’t bring the children of Israel before Him so that He could discover who had sinned. Achan’s rebellion had affected the entire community, and God refused to move forward until it had been acknowledged publicly. We hardly ever realize the far-reaching consequences that come about because of our disobedience. The consequences of Achan’s sin were a message to Israel, reminding them of the graveness of disobeying God’s instruction. Achan was buried in the Valley of Achor, which means “valley of trouble.” From then on, that place has been permanently linked to his tragic story.\n\nThe story of Achan’s disobedience remains a sobering narrative, but it’s more than a cautionary tale of the tragedy that can occur when the Lord’s commands are disobeyed. It’s an opportunity to confess our sins to the Lord and lament over the ways we still aren’t trusting Him. But we aren’t meant to wallow in guilt. The beauty of His grace is that we can admit our brokenness and shortcomings, and He refuses to turn away from us. Instead, He invites us to lean in closer, trusting Him to make us whole. \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-8-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 5:10-15, Joshua 6:1-27, Exodus 3:1-6, Romans 8:31",
    "devo_title": "The Conquest of Jericho",
    "devo_summary": "\n\nBY Jen Yokel\n\nI’m fairly confident most of us who grew up in the church have a whole collection of children’s Bible songs in our brains, ready to surface when we read Scripture—at least, I know I do. And every time I read Joshua 6, I hear little kids’ voices from my past, singing:\n\nJoshua fought the battle of JerichoJericho, JerichoJoshua fought the battle of JerichoAnd the walls came a-tumblin’ down\n\nBut stories like this one in Joshua can be more troubling to read than the song might suggest. Destruction is disorienting when what we long for is peace. I find it helpful to ask what passages like this teach us about God’s character. What does He want us to know about Him?\n\nIn this story, we see Joshua lead the Israelites to enter the promised land. It appears this will unequivocally be Israel’s victory tale—until Joshua comes face to face with a mysterious man with a sword, drawn and ready. Whose side is he on: Israel’s or their enemy’s? “‘Neither,’ he replied. ‘I have now come as commander of the LORD’s army’” (Joshua 5:14). This battle, then, is the Lord’s. So, the real question is, whose side is Joshua on? \n\nSome say this figure is an angel, and others believe he is God Himself. Regardless, we know this soldier represents God’s presence. The commander’s first instruction? “Remove the sandals from your feet, for the place where you are standing is holy” (Joshua 5:15; Exodus 3:2–6). And Joshua does that, declaring where his allegiance truly is.\n\nThe Lord gives Joshua a set of specific instructions: march around the city walls every morning with priests and trumpets and the Ark of the Covenant, then return to camp without saying a word. No battle cries or attacks. Just presence, day after day. \n\nOn the seventh day, Israel let out the final trumpet blasts and Joshua gave them permission to “Shout! For the Lord has given you the city.” (Joshua 6:16) We see Joshua’s utter trust that God will keep the promises to Abraham, Moses, and to him. The stronghold of Jericho’s walls collapses. There’s destruction, yes, but also enduring mercy for Rahab (v.25). Perhaps, then, this is the story of victory within some grander mission—the tale of God’s people who come to possess what God had long-promised them, a gift truly worthy of their shouts.\n\nWhose victory do we long to see? We are called to fight the battles the Lord calls us to, which are “not against flesh and blood, but against…evil, spiritual forces in the heavens” (Ephesians 6:12). God is faithful. If He’s called us to something, He’s already very much in it with us, fighting for what He has promised. And if God is for us, who can stand against us?\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-5-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 4:1-24, Joshua 5:1-9, Exodus 14:21-25, Exodus 14:30-31, Colossians 2:11-12 ",
    "devo_title": "Memorial Stones",
    "devo_summary": "\n\nBY Bailey Gillespie\n\nIt only takes a quick glance around to see how much we like to set up memorials. We build rock towers to display human creativity, erect statues on behalf of war conquests, attach plaques to park benches, and place headstones at gravesites. Each time I visit a new city with a friend (or even when I take a solo road trip), I make a playlist that honors the journey. Listening to it is a memorial to the wonders we witnessed and the many melodies that moved us along the way. \n\nWe don’t want to forget the events of our lives. We want to remember what we have gained or achieved, as well as what we have lost. While not everything we’re tempted to memorialize is honorable, these tangible markers connect us to our past and our present, and possibly even cast a vision for the future. Our identity is closely tied to our memory, and that makes it worth talking about.  \n\nIn Joshua 4, we find an intriguing story about how God instructs Joshua to have twelve men select twelve stones from the Jordan riverbed (Joshua 4:1–3). This happens right after He makes a dry path for the Israelites as they carry the ark of the covenant (v.7), hearkening back to Moses and the miraculous crossing of the Red Sea. \n\nWhen I first read this account, I was a little confused by all the directional cues—the coming and going, picking up stones and balancing stones on shoulders, and then carrying these same stones back to camp. Like the little children referenced in this passage, I echoed their hypothetical questions and thought, What’s the deal with all these stones? (Joshua 4:21).\n\nExamining the story, we discover it’s less about the stones and where they’re being taken, and more about remembering the Lord’s strength and provision. In following Joshua’s instructions, the twelve men representing the twelve tribes of Israel are participating in an act of remembrance. “This is so that all the peoples of the earth may know that the LORD’s hand is strong,” says Joshua to the crowd, “so that you may always fear the LORD your God” (Joshua 4:24). Through miracles like this one, God’s faithfulness is revealed to generation after generation, and it’s important not to forget it.  \n\nI want to be known for remembering who God is. If our identity is intertwined with our memory, then we need reminders of who we belong to—every single day. We are God’s people. We are not orphans left to care for ourselves, but beloved children grafted into His family. The local church reminds me of this. Road trip playlists remind me of this. Whether it’s crossing the Red Sea, the Jordan River, or the gravel street across from my condo, I can worship the Lord knowing His hand is strong and He is a trustworthy Deliverer. \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-4-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 3:1-17, Exodus 25:10-22, Hebrews 10:19-22",
    "devo_title": "Crossing the Jordan",
    "devo_summary": "\n\nBY Rebecca Faires\n\nIf I’d been the foreman of the Jordan River Crossing Committee, I would have had a bridge-building exploratory team, a fording contingency, a subcommittee on rafts, and a weather detail. I might have been tempted to squat on the banks and take soil samples in an attempt to analyze our chances because I love to get organized, make a plan, and then get to work. But the Israelites were specifically instructed to follow at enough of a distance to be able to discern which way the ark was going. The ark went ahead, and the people just had to hang back and watch.\n\nThere are few things more difficult for me than to hang back and watch. Unfortunately, taking control of every job is not as practical as it seems. Turns out, I don’t always have all the information, and I’m not always right. This is a hard lesson to learn because humans are adorably hard-headed and obstinate.\n\nGod was teaching Israel to consecrate themselves to Him, to learn to walk in His ways, not their own. We are prone to put our own plans on a pedestal, then consult and seek the direction of God as an afterthought. Do you ever find yourself attempting to get Him to approve your plans, instead of seeking first His plan? Even when our plans seem so clever and fitting, we are called to wait on the Lord.\n\nWait on Him and He will do wonders. His ways and thoughts are higher than our own (Isaiah 55:8–9). We often try to nip at His heels, hoping we can nudge God along to do things our way. Instead, we ought to look for His timing and His wisdom, even when it may not be what we expect. Walking the ark out into the middle of a river hardly seems like a viable crossing plan. But this miracle that God performed among His people was indicative of how He works: in His own ways, unexpectedly, wondrously.\n\nGod called His people to dedicate themselves to His ways and leave the specific means to Him. J. Hudson Taylor, a missionary to China in the 1800s, once said, “God’s work, done in God’s way, will never lack God’s supplies.” We are to trust God for the means to accomplish what He purposes and consecrate ourselves to follow His plan, “because the LORD will do wonders” among us and in His own time (Joshua 3:5).\n\nHow can we consecrate ourselves like this? Joshua is very clear: “Come closer and listen to the words of the LORD your God” (Joshua 3:9). We do not have a trail of priests and an ark of the covenant to follow. We have an even greater priest (Hebrews 4:14), who has opened access to the mercy seat and leads us safely through the deep waters to the greater promised land. He is the one who does wonders among us. Consecrate yourselves to Him.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-3-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 2:1-24, Numbers 13:26-33, Hebrews 11:31",
    "devo_title": "Rahab & the Spies",
    "devo_summary": "\n\nBY Amanda Bible Williams\n\nJust yesterday, I forgot again. It had been a long day, and I was tired—physically tired, but emotionally exhausted too. It seems we live in that place of general fatigue more often than not these days, huh? And when an already-full cup gets bumped, we all know what happens: it spills over, and there is usually a mess to clean up. \n\nI spilled over, and circumstances are not to blame. Circumstances, I’ve lived long enough to know, are always going to shift and change. If I set my hope on them, I’m guaranteed disappointment and discouragement. So, I must set my hope on something else instead—Someone else. I must remember what is true when the stresses of life fill me to the brim. I must remember who is true.\n\nRahab’s story in Joshua 2 is one of my favorite narratives in Scripture. I love that this loudly-labeled woman defies her definition and turns toward Yahweh in a remarkable plot twist. I love the symbolism of that scarlet cord in the window and the passion I can imagine in Rahab’s voice as I read her words. But the thing that gets me every single time I read Rahab’s story is how she seems to understand from the start something I struggle with daily. She recalls and remembers the acts of Yahweh, and this leads her to worship—right there in the most unlikely and uncertain of circumstances:\n\n“I know that the LORD has given you this land and that the terror of you has fallen on us… we have heard how the LORD dried up the water of the Red Sea before you… When we heard this, we lost heart, and everyone’s courage failed because of you, for the LORD your God is God in heaven above and on earth below” (Joshua 2:9–11, emphasis mine).\n\nRahab calls to mind what she knows, and this leads her to profess what she believes. What if we did the same? Whether we’ve walked with the Lord for days or decades, we are here opening His Word together because we have seen Him at work in our hearts, our lives, our world, or all of the above. We have seen evidence of His hand, His goodness, His glory, and it’s enough to melt our very hearts before Him in awe and worship. What if we made a practice of remembering this? Not just when it’s easy, but when it’s hard. Not only when blessings are evident, but when they’re hidden. Not in times of ease, but in times of stress. \n\nJoin me today in recalling what you’ve seen God do. Join me in remembering who He is. Let the record of His faithfulness draw you to worship, and let’s echo Rahab’s profession together: “The LORD your God is God in heaven above and on earth below” (Joshua 2:11). We give our moments, days, and hearts to Him.\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-2-1024x1024.jpg"
  },
  {
    "book_title": "Joshua",
    "devo_passages": "Joshua 1:1-18, Genesis 15:18-21, Deuteronomy 31:1-6, 1 Thessalonians 5:23-24",
    "devo_title": "God Encourages Joshua",
    "devo_summary": "\n\nBY Amanda Bible Williams\n\nI put no stock in fortune cookies. Still, I usually crack one open once I’m overfull from a generous plate of sesame chicken and rice. Despite my satisfied appetite, I nibble on a bite of the sweet shell while reading the words printed on the tiny slip of paper inside.\n\nI’m not sure why I have trouble resisting that treat at the bottom of my takeout bag. Maybe it’s my love of sugar, but I think it’s something more. In a world that seems to grow more uncertain by the day, we want a sure thing. We want to know what’s coming, what’s not, and what’s next. A fortune cookie isn’t going to change our circumstances, but it’s fun to pretend for a moment that it might.    \n\nWhen the book of Joshua opens, the Israelites have come to the end of one long, unpredictable journey. That is, unpredictable as far as the humans involved are concerned. The Lord has been with His people each step of the way. And here, as Israel stands on the edge of the last leg of their journey to the promised land, God promises that His faithfulness will continue:\n\n“No one will be able to stand against you as long as you live. I will be with you, just as I was with Moses. I will not leave you or abandon you” (Joshua 1:5).\n\nAs profoundly complex as the situation seemed, it was also profoundly simple: God was keeping His promise, just like He always had and always will. Israel got the message, and they responded in kind: “‘Everything you have commanded us we will do, and everywhere you send us we will go. We will obey you, just as we obeyed Moses in everything’” (vv.16–17).\n\nIf you’ve read ahead, you know how this story ends. The God of Israel was completely faithful to His people. They crossed the Jordan River and took possession of the land He’d promised their ancestor Abraham 450 years earlier. You may also know that Israel did not hold to the “everything” and “everywhere” they’d promised. Yes, they followed Joshua, heeding his instructions to prepare, go, and remember (vv.11–13), but their faithfulness was only partial. As through a sieve, obedience slipped through the holes in their good intentions. Their faith wasn’t perfect, yet God’s Word and faithfulness did not falter. \n\nThis Bible makes some bold promises. They aren’t fortune-cookie promises to be read one moment and tossed aside the next. They are holy promises, true promises (Psalm 19:7). When God promises, “I will” and “I have,” He truly will and He truly has. \n\nPraise the Lord, His faithfulness is sure! We can walk with courage and confidence into the certainty of a tomorrow where God will never leave us or forsake us. As coheirs with Christ (Romans 8:17), every foot forward is another step on the journey of seeing God’s promises fulfilled. \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Joshua2021-Instagram-Master-1-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 1:1-22, Psalm 32:7-11, Proverbs 19:12",
    "devo_title": "The King’s Decree",
    "devo_summary": "\n\nBY Jasmine Holmes\n\nWhen I was younger, I would often daydream about what I would say when I accepted the biggest award of my life. I may have gone back and forth over the biggest dream I could imagine, but that thank-you speech never changed. I had to practice, after all, because once I stepped into the light and stared into the camera, I was liable to forget exactly who I wanted to thank. We’ve all seen those acceptance speeches where the winner sputters inanely until a canned music cue hurries them offstage, and they forget to thank the most important people and influences in their life. \n\nTo the uninitiated, the book of Esther can read like a winner who has forgotten to give credit where credit is due. It’s a sweeping story of rescue jam-packed with harrowing plot points that are filled with suspense, cunning, and betrayal. And yet, it could appear that the author, blinded by the light of sharing that amazing story, forgot to give honor where honor was due. Nowhere in the pages of Esther is God mentioned, yet from the very first chapter, God’s hand is stunningly apparent. The God who sways the heart of kings (Proverbs 21:1), steps into the story of King Ahasuerus and his wife Vashti and begins to set things in motion for the rescue of His people. A seemingly innocuous event—the worldly banquet of a successful king—sets the stage for the rescue of Israel. \n\nWhen King Ahasuerus’s anger burns against his wife, his counselors soothe his troubled mind by declaring that “her royal position is to be given to another woman who is more worthy than she” (Esther 1:19). That single phrase points the king toward the search that will eventually lead him to Esther, a young Jewish girl in his kingdom. The God who turns the hearts of kings was about to turn Ahasuerus’s favor toward one of His daughters, and that favor would change the course of history (Proverbs 19:12).\n\nThe real storyteller here isn’t the author of Esther. The name of the Lord isn’t a detail he simply forgot to include. It is, rather, the Lord who is writing the story. He is the one laying the plans, guiding the narrative, and guarding His people (Psalm 37:8–9). He is at the heart of this narrative, carefully choreographing the ultimate protection of His people. \n\nThat story isn’t just about the temporal saving of Israel from the plot that will soon brew at the heart of this book’s narrative; it’s about the saving of God’s people, a deliverance that is central to the narrative of the whole of creation. King Ahasuerus is looking for a worthy bride; this bride will end up being a savior of Israel. We are looking for a worthy King; His name is Jesus, and He is the Savior of His Bride. \n\nGod is not forgotten in the book of Esther. He is central to both the story itself as it unfolds, and in the telling of that story to generations. And He provides the worthy King we need in the person of His Son.\n\nIt’s not too late to get your Study Books for Lent! Plan ahead to read Joshua and Mark with us starting February 15. Shop the collection now!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-1-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 2:1-23, Proverbs 31:10-31",
    "devo_title": "Esther Becomes Queen",
    "devo_summary": "\n\nBY Kaitie Stoddard\n\n“It’s all a popularity contest,” my friend explained as the votes rolled in for student council. That was not music to my ears. Let’s just say I hadn’t secured a spot at the cool kids’ lunch table yet. In the end, I didn’t make the cut for student council, but over the years I learned that popularity is far less important than influence.\n\nInfluence is about so much more than sitting at the “right” table. It doesn’t matter if you have the most friends, a fancy job, or an official position at your church. If you have the courage to speak the truth in love, you can be influential. If your life is marked by following God in faith, you will naturally inspire those around you. Whether your circle of reach is a few people or an auditorium, God has placed others in your path for a reason.\n\nOur text today shows the saving work God can do through the influence He’s given us. It’s unclear if Esther was selected as queen purely based on her outward beauty, a result of her wise actions, or due solely to God’s divine intervention. But one thing is clear: “Esther gained favor in the eyes of everyone who saw her” (Esther 2:15). However she got there, you can’t deny that Esther found herself in a position of great power. She had the ear of the king, and she didn’t waste her opportunity.\n\nWhat I want all of us to realize is just how much influence God has already given us! It’s easy to discount the impact your words and actions can make on others. The world feels so big, and its problems feel so complex—we feel helpless to fix it all. It’s easy to come up with a million reasons why our roles don’t matter. Is it possible those are excuses to avoid using our influence for the glory of God?\n\nIf you’re a mom, your work of shepherding tiny humans every day will have an everlasting impact on their souls. If you work outside the home, your daily choices can touch the lives of your coworkers and clients, both relationally and through the quality of your work. If you’re a student, your interactions with classmates and teachers could be used to change their eternal fate. No matter who you are, your life and actions can lead people closer to God.\n\nWe can certainly admire the courage and obedience of Esther. She didn’t become arrogant when the king turned his favor on her because she recognized that it’s God’s attention and affection that truly matter. When push came to shove, Esther chose to risk not just her popularity but her very life to accomplish what God was calling her to do—and not just for her sake, but for the sake of God’s people. Isn’t that the kind of legacy we want to be remembered for?\n\nFirst, we need to understand and acknowledge the influence God has given us. Who are the people God has placed in our path? Then we can ask Him how He wants us to use our influence as ambassadors of His good news. By seeking after the Lord’s favor above all others, we will find the courage to risk it all for the glory of His kingdom.\n\nThe question is not so much whether or not you have influence. The real question is, what are you doing with it?\n\nIt’s not too late to get your Study Books for Lent! Plan ahead to read Joshua and Mark with us starting February 15. Shop the collection now!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-2-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 3:1-15, Psalm 68:1-10, Psalm 68:20, Proverbs 16:33",
    "devo_title": "Haman Plans to Kill the Jews",
    "devo_summary": "\n\nBY Melanie Rainer\n\nI remember learning to write my first stories in grade school. Character, setting, problem, climax, solution: the formula was right there, on my worksheet, just ready for my imagination to fill it in. My first stories were about pioneers, of course, as I loved Laura Ingalls Wilder. While I never progressed much further as a fiction author, the basic elements of a good story are still embedded in my mind when I read. \n\nEsther is one of the grandest stories in Scripture. It is the dramatic tale of an orphaned girl, swept up to be queen of all of Persia, then putting her own life at risk to save her people from mass execution at the hand of the king’s evil vizier. And today, in Esther 3, we read about the problem, the complication that leads to rising action. Haman, King Ahasuerus’s evil vizier, commanded all people to bow to him. And they all did—except for Esther’s cousin Mordecai, a Jewish man. “Mordecai would not bow down or pay homage” (Esther 3:2). \n\nHere’s where the story gets really interesting. All the other Jewish people bowed to Haman, as it was customary to bow to leaders and kings (Scripture is full of such examples, like David bowing to Saul in 1Samuel 24). But Mordecai didn’t, and we don’t really know why. One popular theory from scholars suggests that perhaps it was because Haman was a descendant of Agag (Esther 3:1), and Mordecai of King Saul (v.4), and since Agag and Saul were enemies, their descendants were too (Esther 9:24). \n\nWe don’t fully understand the root of their hatred for one another, but regardless, it was the spark that lit the fire. Haman wanted to punish not just Mordecai, but all the Jewish people in Persia. And so, the punishment far, far outweighed the crime. Haman dismissed an entire people and pursued them to death.\n\nIn reading this passage again and again, I recognize that the qualities present in this feud are also present in me. I’m quick to anger, slow to change my mind. I root down into long-held prejudices, and I refuse to stretch the muscles of an empathetic imagination. It’s easier to be prideful and mean, hasty and hurtful—especially when almost every interaction I have these days seems to  take place on a screen. \n\nThe power imbalance between the two led to Haman’s anger materializing into intended mass destruction, and we get to see God work through the brave young Esther to stop the genocide. But this isn’t Esther’s story of heroism, Mordecai’s story of selfless sacrifice, or even Haman’s story of falling from favor and power. It’s all a foretaste of God’s story of sacrifice and redemption.\n\nHundreds of years later, when Jesus broke into our world as a baby, God was writing the same story. He was writing the story of redemption, of promises kept, of a people who were once not a people becoming one, and of people who did not know mercy receiving mercy (1Peter 2:10). It’s what God offers the prideful Mordecais and the evil Hamans of this world: mercy, belonging, restoration. It’s what Jesus secured in His selfless sacrifice on the cross. And it is ours to receive with repentance and with hope. \n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent! \n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-3-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 4:1-17, Genesis 37:33-35, Romans 5:6-11",
    "devo_title": "Mordecai Appeals to Esther",
    "devo_summary": "\n\nBY Lore Ferguson Wilbert\n\nA few months after the lockdowns began in March, my husband and I moved from Texas back to my hometown in New York. Moving in the midst of a country-wide shutdown has felt disorienting.  Ordinarily a vibrant college community, my village has felt more like a ghost town these days, with furrowed brows above masked faces (a necessary reality of living through a pandemic) replacing the friendly and welcoming smiles we expected to see. I have wondered, “Why did you move us here now, Lord? Why, in the midst of a season like this are we in yet another transition?”\n\nI left this place a decade ago, which was a decade after a tragedy that tore my family apart. On a rainy April morning, two of my younger brothers left for an errand and only one returned alive. My brother was 14 years old when he died. I was 19. For the next ten years my life felt empty, lifeless, confusing. My entire family fractured, never to join together whole for another holiday, wedding, or reunion. I felt divided even from myself. After ten years of trying to piece myself together again, I left here, and found hope and healing in Christ and therapy and the blessed relief of time. But coming back home has reminded me of all of it again. Even though the Lord has healed and redeemed, I still remember the grief of those days. Coming back in the midst of the pandemic has highlighted those griefs in some ways too. My questions to the Lord increase.\n\nSeveral months ago, though, through a series of events I could have never foreseen or orchestrated, two young people began to frequent our home. Their grief is similar in some ways to mine, the loss of a young brother suddenly this year. I sat this morning and thought of Esther in the king’s house, likely wondering why. “Why am I here? Why have I been brought to a place where there is the potential for so much pain? Do I think I will be protected from the pangs of grief that are common to all people and particular to me?” \n\nMordecai, Esther’s cousin, admonished, “Don’t think that you will escape the fate of all the Jews because you are in the king’s palace” (Esther 4:13), and I hear his echo in my heart too. But perhaps, like Esther, I am here for this time in this place for this reason. For such a time as this? To lend my washer and dryer, my kayaks, my tea, my table, and my tears to two suffering people whose grief cannot be held by them alone.\n\nPastor and theologian John Piper once wrote, “God is always doing 10,000 things in your life, and you may be aware of three of them.” It helps me to remember this because even in the most grievous moments, I know there is another moment twenty, thirty, fifty years away for which that previous moment prepared me. It doesn’t lessen the grief of twenty years ago, but it gives it meaning today which I could not have foreseen then. It shapes the meaning of today. And this is what Esther must have learned and come to know in these verses. This time, this aching, awful time, is held secure by a God who knows the future, who ordains the steps of His children, and who has prepared a better Esther, a better Savior for all His people to come. \n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-4-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 5:1-14, Proverbs 16:18, Mark 6:14-29",
    "devo_title": "Esther Approaches the King",
    "devo_summary": "\n\nBY Erin Davis\n\nHaman’s gallows were built with the whispers of his wife and friends. I’m mortified by the power of these diabolical words. Though their intent was to plot for the downfall of Haman’s enemy, Mordecai, they instead set the stage for the execution of Haman and his sons (Esther 9:25). In the most jarring way, Zeresh and Haman’s friends serve as archetypes of the kind of person I never want to be. \n\nThere are other examples embedded in this chapter of Esther. Let’s start with Haman. His appetite for power was insatiable. His pride, it seems, knew no bounds. When Mordecai refused to stand and honor him, Haman became enraged. In his anger at Mordecai, he became a threat to the well-being of all the Israelites living in Persia.\n\nIn Haman, I’m reminded of a more powerful enemy, the one who seeks to harm all of God’s children everywhere. The devil is the enemy of God and His people, seeking to devour and destroy (1Peter 5:8). Haman’s plot to eradicate the Jewish people in Persia is simply one strand of a larger, deadlier sickness. The devil’s efforts to destroy God’s people began long before Haman ordered the genocide of God’s people, and they have continued long after.\n\nThis danger compels me to open my Bible, to remember the hero who can rescue me from unrelenting evil. In today’s reading, we find that because Esther had found favor with King Ahasuerus, he offered her whatever she wanted, “even to half of the kingdom” (Esther 5:3). How much better is the offer from our good and perfect King? King Jesus is our true hope. Our Jesus extended grace to us, inviting us into the work of His kingdom, one that could not be shaken (Hebrews 12:28).  \n\nThis reality takes the story of Esther out of the history books and into our lives. The threat continues. The enemy is still plotting the destruction of the people of God. He is set on our death through sin. The proverbial gallows have been built for us. But look! Our good King has extended grace toward us. He invites us to boldly approach His throne, “so that we may receive mercy and find grace to help us in time of need” (Hebrews 4:16). \n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-5-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 6:1-14, Proverbs 26:27, Isaiah 52:1-2, Isaiah 52:7-10",
    "devo_title": "Mordecai Honored by the King",
    "devo_summary": "\n\nBY Rebecca Faires\n\nIf a king gave you carte blanche and said, “Dream up your own reward!”—what would you create? Haman was sure the king was poised to honor him, so he created his dream reward that could be summed up like this: “Doll me up, and let me ride around town on a fancy horse. Make sure to holler about it, so folks don’t miss my pretty parade!” Seems like such a fleeting thing to ask for. Not that anyone has asked me, but I’d request 100 acres of land and a nice clock radio.\n\nWhy did Haman ask for a parade? Setting aside the irony that he was choosing a reward for his nemesis, why did he want to be praised and displayed like a prancing pony? More than a desire for land or clock radios, Haman wanted to be worshipped. Human nature was the same in Persia then as it is in America, or any number of places, today. We are self-worshippers by nature, and the highest honor we can conceive of is simply that the world would bow in awe and worship of our own greatness. \n\nThe greatest temptation of man is the urge to make a god of self. “The fool says in his heart, ‘There’s no god’” (Psalm 14:1). Left to our own devices, we’re all fools, and what we’re really thinking to ourselves is, “There is no god but me.” The foolish pride of self-worship, of course, always ends in its own undoing. This isn’t a judgment that God unnaturally foists upon the prideful. It is the natural and necessary outcome of the way God’s creation works. Self-worship is unnatural. It runs against the very grain of creation, because only God is God. We are not. The inevitable end and consequence of every act of self-glorification is self-debasement. \n\nWe cannot remain atop the pedestals we build for ourselves because we are poor builders. Like Babel, our greatest works of self-exaltation come to an end because our God will not be mocked (Galatians 6:7). He exalts the humble and topples the proud. As Solomon says, “The one who digs a pit will fall into it” (Proverbs 26:27). Haman expected to be worshipped, but instead the king “clothed Mordecai and paraded him through the city square” (Esther 6:11).\n\nAll this is so because the proper relation of creature to Creator is trust. Again and again, God declares “Trust in the LORD and do what is good,” and “commit your way to the LORD; trust in him” (Psalm 37:3,5). Haman refused to trust any higher authority than himself. He refused to live humbly in his role. He abandoned both humility and truth, and so blundered into the ironic, yet fitting, humiliation of parading the humble Mordecai through the streets. \n\nLet us not put our trust either in public parades or private possessions. Trust in the Lord, for all of creation is His. Let us humbly honor Him, for He alone is our God.\n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/02/SRT-Esther2021-Instagram-Master-8-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 7:1-10, Psalm 91:2-3, Revelation 20:11-15",
    "devo_title": "Haman Is Executed",
    "devo_summary": "\n\nBY Kaitie Stoddard\n\nIf you could have anything in the world, what would you ask for? I’m sure a lot of us instantly think of material possessions. A new house, an enviable wardrobe, a relationship we’ve longed for, or a totally different body type. Esther could have asked for up to half the kingdom, and yet she asks for something far more valuable than stuff. She asks the king for life, for him to spare the lives of both her and the Jewish people (Esther 7:3).\n\nAs we’ve followed Esther’s story, we’ve witnessed the courageous orphan girl gain influence for this exact moment. The moment when she bravely asks for the right thing. If the sparkly things around Esther had distracted her, if she’d lost her focus on God’s bigger plan, if she’d asked selfishly, she might have blown it. While God is certainly powerful enough to save His people another way, Esther was called to be a part of His rescue mission. And it was the most important work of her life!\n\nIt begs the question, are we asking God for too little? You see, it’s a lie the world is feeding us, that wealth and admiration is the end all, be all. As C. S. Lewis so brilliantly put it, we are “like an ignorant child who wants to go on making mud pies in a slum because he cannot imagine what is meant by the offer of a holiday at the sea. We are far too easily pleased.”\n\nWhen we’re only praying for a checklist of things to make our lives feel nice and tidy, we are praying too small. We are settling for things that will one day turn to dust and leaving eternal life on the table! God is honored by our big prayers. We glorify Him in our hearts when we turn to Him with our heart’s desire.\n\nLike Esther, when our King asks us what we desire, our first request should be for life. If King Ahasuerus, of questionable character, knew how to give good gifts to his friends, then as the apostle Matthew said, “How much more will your Father in heaven give good gifts to those who ask him!” (Matthew 7:11).\n\nI admit that I have not always turned my desires over to God in prayer. I’ve falsely believed He’s too busy, or I’ve feared He won’t come through for me. While God is not a mere genie granting wishes, we must take seriously this instruction from Scripture: “Take delight in the LORD, and he will give you your heart’s desires” (Psalm 37:4).\n\nThe truth is, we don’t always ask for the right things. Sometimes we aren’t even sure if our motives are pure. At times, our thinking, our vision, and our requests are too temporal or small, but the good news is that God wants to hear it all. Let Him decide what to do with your requests, but don’t hold back in asking. If anything, we need to ask more boldly! We need to pray more vibrantly.\n\nLike Esther, let’s approach the throne of our King with courage and make the most important request of all. Let us ask for life both everlasting and abundant. \n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-9-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 8:1-17, Romans 8:10-11, Colossians 3:1-4",
    "devo_title": "Esther Intervenes for the Jews",
    "devo_summary": "\n\nBY Melanie Rainer\n\nAs I read today’s chapter in Esther, all I can picture in my mind is the end of war. A ticker tape parade, kissing in Times Square, hot-off-the-actual-presses newspapers that stain your hands with ink. It’s the kind of overly romanticized celebration that stamps itself into history and, for a moment, forgets the horror and atrocities that preceded it. \n\nEsther chapter 8 is a glorious celebration of the Lord’s provision and protection for His people. Haman is dead, the Jews are safe, and the king allows Mordecai to use his signet ring to declare the Jews victorious. Mordecai experienced not only pardon, but he was raised to be in charge of Haman’s estate. It was a restoration beyond imagination. \n\nAnd so, the Jews celebrate with gladness, joy, and honor (Esther 8:16). They create a new holiday, the festival of Purim. Couriers race on the fastest horses to spread the good news throughout the whole land. It’s over! The fear, the danger, the hopelessness. \n\nDon’t you long for that kind of freedom and joy? To know that you would no longer have to fear? \n\nThis momentary victory in Persia would not be a harbinger of peace for the Jews for very long, but for the time being, it was enough. From oppressed to honored, from fearful to safe, from tear-stained to joy-filled—God had delivered His people yet again. And the best news? God continued to deliver His people, situationally, culminating in the day He permanently offered His Son Jesus to secure forever deliverance, gladness, joy, and honor for all who believe in Him. \n\nThe story of Esther ends in triumphant celebration, and our story will too. For those who belong to Jesus, our future is secure and safe. But it is more than safe; it is glorious. Every celebration on earth will pale in comparison to the overflowing, overwhelming joy of Jesus’s return. When He comes again, all oppression, fear, injustice, anger, pride, and grief will be gone forever. We will lose all bonds of sin, but we will also gain the righteousness of Christ and an eternal companionship with God. \n\nColossians 3:4 says, “When Christ, who is your life, appears, then you also will appear with him in glory.” Indeed, Christ holds our victory and restoration, and He offers them freely to us. So, gather the people, write a proclamation of joy and freedom, sealed with the blood of Jesus. Celebrate with gladness, joy, and honor. The victory is ours through Christ! \n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-10-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 9:1-22, Nehemiah 8:10, Luke 1:46-55",
    "devo_title": "The Victories of the Jews",
    "devo_summary": "\n\nBY Rebecca Faires\n\nOn the twelfth day of Adar, the Jews were afraid. Sure doom awaited them the next morning. Everything looked bleak and impossible, and there was nothing they could do to stop it. Their enemies had removed every legal protection for them, and their destruction was a forgone conclusion. Haman and those who sought to overtake them were licking their lips like cartoon wolves. But “that was the month when their sorrow was turned into rejoicing and their mourning into a holiday” (Esther 9:22). The Lord took a hopeless situation, used ordinary, obedient believers, and rescued His people.\n\nGoodness, there are some things that scare me. I sometimes feel like the wolves are circling around my very house and howling at the door. But perhaps the greatest lesson of Esther is this: even when God seems to be absent in every way, He is still at work. His providence is at work, even if no one speaks His name. On the twelfth day, everything looked black, but on the morning of the thirteenth, the sun rose, and God had changed everything.\n\nA sudden reversal of this sort is not calculable or predictable. This wasn’t the scheme of Esther and Mordecai. The unexpected turn of events was unexpected precisely because it came from outside the realm of human control. Some greater power had acted, and had unraveled the finely crafted plot against the Jews. \n\nHow did He act? He moved hearts. First, Mordecai and Esther. Then Ahasuerus. Then the satraps, the governors, and the administrators. Then the people. God changed hearts, affections, and allegiances. He moved some to fear and some to courage. But make no mistake: all the actors in this extraordinary story were His actors. Each played a part in God’s plan of redemption.\n\nEsther, once part of a condemned people, was now offered whatever she wanted. Ahasuerus, her king, gave her unprecedented autonomy. The king who had banished Vashti in a show of might, was now handing over the decisions to his new queen in complete trust. His heart was changed.\n\nGod is a God who acts, not according to the whims and wishes of men, but according to His own good purposes, in His own good time. But, like Haman, the enemies of God’s people face their own undoing instead. And in this story detailing oppression turned into redemption, His people saw their mourning turned into holiday rejoicing. He turns sorrow into dancing, and mourning to laughter. Even when we are surrounded by the darkness of the twelfth day of Adar and there is no hope in sight, the redemption of the morning is coming. Take hope!\n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-11-1024x1024.jpg"
  },
  {
    "book_title": "Esther",
    "devo_passages": "Esther 9:23-32, Esther 10:1-3, Leviticus 16:29-31, Ephesians 1:3-14",
    "devo_title": "Mordecai’s Fame",
    "devo_summary": "\n\nBY Erin Davis\n\nI once met a woman who told me the story of two Bibles. She had inherited them as heirlooms, one from each of her grandmothers. Her maternal grandmother was a woman of deep faith in Jesus. She loved and lived the Word of God. Her Bible was torn and tattered. Some of the pages had broken free from their binding. She left notes behind, and questions were scribbled throughout. \n\nThe woman’s paternal grandmother did not know or follow Jesus. Upon her death, her family found a Bible pristine and dusty, sitting on the shelf. She had barely touched it. The difference, the woman told me, was remarkable. The grandmother who loved her Bible left a legacy of faith. Her life was a testament to the goodness of God and the transforming power of His Word. The grandmother whose Bible stayed closed, left a different, more painful kind of mark. Her granddaughter remembered her as angry, bitter, and difficult. \n\nLegacy is the punctuation mark at the end of the book of Esther. The book’s namesake played a starring role in the redemption of God’s people from the evil plot of Haman, yet it is Mordecai’s impact that brings this inspired story to a close. \n\nThough King Ahasuerus’s influence was felt “even to the farthest shores” of his kingdom (Esther 10:1), Mordecai’s fame spread past the borders of time and into the hearts of future generations—including ours. Though Mordecai lived and died more than two millennia ago, we are still strengthened by his story of courage. The pages of Esther record Mordecai’s commitment to securing his people’s future—to ensuring they survived in the face of tyranny, no matter what it cost him.\n\nThe curtains of Esther open with Mordecai as a resident in a foreign land, separated from his adopted daughter (Esther 2:7–9). They close with Mordecai as a famous hero, triumphant and highly esteemed. In plenty and in want, in power and powerless, whether he was calling the shots or he was oppressed alongside his people—Mordecai resolved to seek the best for his people. The book’s final words almost read as his epitaph: “He continued to pursue prosperity for his people and to speak for the well-being of all his descendants” (Esther 10:3). \n\nLegacy is the punctuation mark at the end of each of our stories. The book of Esther reminds me that I want mine to end with ellipses, continuing on in the life of the next follower of Christ. May those who come after us be strengthened because we sought the well-being of “all [our] descendants.”\n\nPlan ahead to read Joshua and Mark with us starting February 15. Shop the collection now for Digital Study Books for Lent!\n\n",
    "img_url": "https://shereadstruth.com/wp-content/uploads/2021/01/SRT-Esther2021-Instagram-Master-12-1024x1024.jpg"
  }
]