[
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:1-16, Psalm 19:7-8, Exodus 20:1-17",
        "devo_title": "Happy Are Those Who Keep His Decrees",
        "devo_summary": "\n\nBY Raechel Myers\n\nI used to really love the law (Exodus 20:1–17). I remember enthusiastically singing the Ten-Commandments song “The Perfect Ten” at school and church with the confidence of a child whose Christian walk was just beginning.\n\nNumber one, we’ve just begun: God should be first in your life!Number two’s the idol rule: those graven images aren’t nice.\n\nI’d assure myself as I sang…\n\nNumber three: God’s name should be never spoken in jest.Number four: the Sabbath’s for our worship and for rest.\n\nSo far, so good. Our family was known for nothing if not for our Sunday naps.\n\nNumber five: we all should strive to honor father and mother.Number six: don’t get your kicks from killing one another.\n\nSuccess!\n\nNumber seven: life is heaven when you’re true to your mate.Number eight: don’t steal and break this rule for goodness’ sake!\n\nNumber seven was easy—I didn’t even have a mate!\n\nNumber nine: don’t be the kind who goes around telling lies.Number ten: don’t covet when you see your neighbor’s house or wife!\n\nI was doing so well. It had never occurred to me to covet my neighbor’s wife. In my mind I would sing that song with a full band playing behind me—like a victory song. I was delighting in God’s law because it was just so keepable! But as I grew to understand the law, I began to understand how difficult it was to follow.\n\nI thank God that He brought me out of the age of check, check, check into the maturity of, If this is the measuring stick, I will never measure up. And even more, I’m thankful He didn’t leave me there with my checklist. When God mercifully, gradually granted me eyes to see how readily I broke His law by commission, omission, and flat-out rejection of Him, the big band musicians in my head began to slowly lower their instruments and solemnly take their seats. I wasn’t delighting in God’s law at all. I had been delighting in my “keeping” of His law.\n\nBut my delight hasn’t gone away; it has instead shifted and matured. Now, my soul finds rest in knowing that the law has been fulfilled by Christ on my behalf. Because of Jesus, the law no longer justifies or condemns us—it frees us and becomes our guide for thankful obedience to the One by whom we are justified.\n\nDo you get that? If the law is our measuring stick, every one of us will be found unrighteous. But Jesus kept God’s law perfectly, imparting His righteousness to us so that when we are measured, we, too, will be counted as righteous—as perfect law-keepers!\n\nNow, when I catch myself humming that childhood ten commandments tune (or teaching it to my children), I hear it differently. Not as a reminder of what I have to do, or even as a condemnation of what I can’t do. I hear it now as an assurance of what He has done, and as the kindest, clearest roadmap to the heart of the Father. He makes me righteous, and I delight in pleasing Him. “Oh that my ways may be steadfast in keeping [His] statutes!” (Psalm 119:5, ESV).\n\nLord, I love your law. “With my lips I declare all the rules of your mouth” (v.13, ESV).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-1-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:17-32, Joshua 1:6-8, Galatians 4:1-7",
        "devo_title": "Give Me Life Through Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nIn her essay called “The Wreck of Time,” Annie Dillard references the idea that when a single person dies, we treat it as a tragedy. But when a million people die, we treat it as a statistic.\n\nThis unsettling observation shows how inconsistent we humans can be concerning the value of a life. On the one hand, if a friend or relative or some other cherished person is taken from us, we are moved to deep and abiding sorrow. On the other hand, if a million lives with whom we share no personal connection are suddenly wiped out by a viral pandemic or natural disaster, any initial sadness and shock we feel can fade within weeks, and possibly within hours. The one who is close to us seems more precious even than the million who are further away.\n\nOur selective valuation of our fellow humans invites a haunting question: If the million don’t matter to us as much as the one, then can we honestly say that the one really matters at all? How precious are many lives, how precious is a single life, and how precious is my life… really?\n\nEach of us living today is one in seven billion. Of all the people who have ever lived, we are one in 107 billion. David hinted at this relative smallness of ours when he cried out to God, “What is a human being that you remember him, a son of man that you look after him?” (Psalm 8:4).\n\nThankfully, Scripture provides us with a strong and sure answer. David continued, “You made him a little less than God and crowned him with glory and honor” (v.5). The poet-king after God’s own heart is genuinely awestruck by the truth about all humans and about each individual human: We are made in the image of God (Genesis 1:27). Of all creatures everywhere, only humans are esteemed in this way.\n\nThis truth about our inestimable value becomes even more compelling when we realize that in Christ, we are the image of God but also much more: Scripture tells us we are the children of God. And as His children, He gives us life through His Word and teaches us His ways (Psalm 119:25–26). In his letter to the Galatians, Paul amplifies this astonishing truth by reminding us that through faith in Christ, God has adopted us, sent His Spirit into our hearts, invited us to call Him “Father,” and made us heirs of all that is His (Galatians 4:4–7).\n\nAs Brennan Manning has written, “Define yourself radically as one beloved by God. This is the true self. Every other identity is an illusion.”\n\nThe next time you look in the mirror, don’t for a moment think that you’re looking at a mere face in the crowd. Don’t for a moment think that you’re looking at a tragedy or a statistic. You have no true basis for looking at yourself in this way. Rather, you are looking at an esteemed crown of God’s creation, a beloved child of God, and a privileged heir of everything.\n\nThis is your true self. Every other identity is an illusion.\n\nScott Sauls is husband to Patti, dad to Abby and Ellie, and senior pastor of Christ Presbyterian Church in Nashville, Tennessee. Scott was also lead and preaching pastor at NYC’s Redeemer Presbyterian Church after planting two churches in the midwest. Scott has authored several books, including Jesus Outside the Lines and his most recent work, A Gentle Answer. He regularly blogs at scottsauls.com. His work has been featured in Christianity Today, Relevant Magazine, Qideas, Catalyst, Leadership Magazine, Outreach Magazine, annvoskamp.com, The Gospel Coalition, and several other publications. You can connect with Scott on Facebook or Twitter/Instagram at @scottsauls.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-2-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:33-56, 2 Timothy 3:16-17, James 1:16-25",
        "devo_title": "Teach Me the Meaning of Your Statutes",
        "devo_summary": "\n\nBY Jessica Lamb\n\nOne of my strongest memories from my sophomore year of high school is of a black, 5-inch thick three-ring binder I carried everywhere. I was part of the not-so-exclusive academic quiz bowl team at my school, and every few weeks, I would compete against other schools to see which team could “buzz in” first to earn points answering trivia questions. My binder was filled with the printed records of previous tournament questions and answers. Though questions were rarely repeated, I poured over that binder every opportunity I could find, hoping that my incessant studying might reveal recurring subject matter or a pattern in how questions are worded for tournaments to give me an edge over the competition. To this day, I’d still choose a trivia night at a local restaurant over almost any other activity.\n\nI used to think taking this same approach to Scripture was proof that I loved God’s Word. Studying the Bible—its words, history, cultural contexts, and languages—has been life-giving to my faith in my undergraduate and postgraduate studies, as well as in my career. But I have to be reminded that life as a follower of Jesus is so much more than just memorizing facts about God or storing up interesting trivia about the Bible. Our reading and study of Scripture should shape us and reorient our hearts as it shows us who He is and who we are in Him.\n\nI come back to the book of James over and over when I find my heart wanting to make a god of knowing about God, rather than truly knowing Him. The book is full of direct one-liners that cut right to the truth: truly delighting in God’s Word means living out what the Word teaches us. In the opening passage of his letter, James sums this up by telling believers that we must be “doers of the word and not hearers only” (James 1:22).\n\nHearing without acting is more than useless—it’s self-deception, because as believers, we are new people born of the gospel (v.22,18). James writes that God has implanted His Word in us (v.21). We miss the point if we are not willing to let its truth take root, growing and bearing fruit in us as we are changed and made more like Christ.\n\nEssentially, we are living out what the psalmist pleads with God to do: transform him so that he can keep God’s commands. By His Spirit and His Word, we’ve been made into new people. Unlike the person who looks in the mirror and responds, “I forget,” when asked what they look like (vv.23–24), we are called to remember who we are as we walk away from reading the Bible. If we go about our lives without acting on what it teaches, we live as fractured people, at odds with who we now are in Christ. Praise God, because He’s done the hardest work in giving us new hearts already!\n\nBeing in the Word of God every day equips us to live out the Word of God every day. It guards against forgetting what is true of our God and of ourselves. Let our prayer echo that of the psalmist as we come to the Bible each day: ”Teach me, LORD, the meaning of your statutes, and I will always keep them” (Psalm 119:33).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-3wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:57-72, Deuteronomy 6:6-9, Joshua 2:1-21",
        "devo_title": "I Have Promised to Keep Your Words",
        "devo_summary": "\n\nBY Guest Writer\n\nI remember listening to journalist Malcolm Gladwell interview Nashville legend and famed songwriter Bobby Braddock. Their conversation centered on what goes into writing a truly sad song, the kind of tune that finds you driving with one hand on the steering wheel so the other can be free to wipe the tears from your eyes.\n\nAs they talked, they decided that country music has a leg up on rock and pop when it comes to mournful tracks, but the question that lingered was Why? In the end, Braddock said it came down to details: “We cry when melancholy collides with specificity.” It’s one thing to sing about heartache, and another thing entirely to sing about standing by a lost friend’s grave and the angels’ faces delighting to welcome that friend home. Take a listen to “Go Rest High on That Mountain” by Vince Gill to hear what I’m talking about.\n\nThe reason that details help sad songs resonate with us is because they echo our own experience. We live in a world of details, not generalities. Somehow, the details make a thing more real. When it comes to God’s Word, I delight in the details. You see, in the ancient world, there was no paper. Instead, texts were written on papyrus, a material similar to paper but made out of certain flattened reeds—and papyrus wasn’t cheap. That means that everything included in God’s Word is important. There are no throwaway lines, no unimportant details.\n\nIn the story of Rahab, there’s a detail that jumps off the page for me. When she lets the two Israelite spies down through her window, she does so with a “scarlet cord” (Joshua 2:18). And it was this scarlet cord that would identify her home and keep her safe when the Israelites later attacked Jericho. It wasn’t brown or blue or white. It was a scarlet rope—and that makes all the difference in telling this story.\n\nFor those early Israelite readers of Rahab’s account, they would have connected the red color of the rope “dripping” down the window frame with the lamb’s blood a previous generation had brushed on the doorframes of their homes. While still slaves in Egypt, God had passed over the houses of the Hebrews on the night the firstborn in every household in the land had died (Exodus 12:23). The blood marked those inside as belonging to God. Rahab was a Gentile and a prostitute, but she, too, would be marked as one of God’s people. Though she was late to the party, so to speak, the “blood” of the scarlet cord would bring Rahab her own Passover moment.\n\nThe symbol, of course, is not as important as the thing it symbolizes. What set Rahab apart as a member of God’s family was not the red rope but her loyalty to Yahweh, based on the reports she had heard (Joshua 2:10–11). By helping the Israelites, she was committing treason, and she knew it. By earthly measures, the people of Jericho should have been able to withstand an attack by the Israelites. Rahab could have turned the spies over to the authorities and garnered herself the favor of Jericho’s king. But she believed what she had heard about the Lord, and she gave Him her allegiance, echoing with her life what the psalmist would later write: “The LORD is my portion” (Psalm 119:57).\n\nBut the scarlet cord doesn’t just point backwards to Passover; it also points forward to Christ. It is Christ’s red blood that now marks those who are members of God’s family. The Passover account had always foreshadowed the sacrifice of Jesus, and God had always planned on making one new people from Jews and Gentiles. Rahab’s story reveals this had long been in God’s heart to do. The prostitute-turned-daughter of the King is even honored with a place in Jesus’s family tree (Matthew 1:5).\n\nGod is the Author of Scripture. No detail is included by accident. Every last one is an invitation to thank Him for His faithfulness, our God who knows the end from the beginning (Isaiah 46:10).\n\nJohn Greco is a writer, editor, and Bible nerd. He and his wife, Laurin, live south of Nashville, where they daily wrangle their three small boys and dream of someday being the ones who get to take all the naps. You can find John at JohnGrecoWrites.com.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagra-4-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:73-88, Hebrews 4:12-13, Genesis 18:9-15, Genesis 21:1-7",
        "devo_title": "I Put My Hope in Your Word",
        "devo_summary": "\n\nBY Ellen L. Taylor\n\nI grew up going to church three times a week and met some of my closest friends (even to this day!) in youth group. Most of my Facebook statuses in high school were inspirational Bible verses that I hoped would encourage my friends at my public high school who weren’t believers. I went to a Christian university for my undergraduate degree, where mandatory chapel was held twice a week, and every student was required to take six semesters worth of Bible classes. I interned at a local church and even earned a minor degree in the Bible. And then, I went to graduate divinity school.\n\nBut somewhere along the way, I stopped delighting in Scripture. I saw it as something to be studied, but not something to be taken to heart. I began to think of God as something to learn about rather than someone to know. To date, this was one of the most confusing times in my life so far.\n\nAfter a time spent in this confusing season, I was given a special project at work; I was instructed to go through the entire book of Genesis, chapter by chapter, writing discussion questions along the way for kids aged eleven to fifteen.\n\nI don’t know the last time you read through the book of Genesis (maybe in January when we read it together, as an SRT community), but there are some stories in that book that are, well, a little less than age-appropriate for young teens. As I was going through some of the trickier passages, the discussion point I kept coming back to was that God keeps His promises to His people. His people keep turning away from Him, not believing Him, disobeying Him and turning to other gods, but God is consistently faithful to His promises.\n\nOne of the passages that fell into this category was the story of Sarah and her pregnancy with Isaac. When God told her she would become pregnant in her old age, Sarah laughed at the very thought (Genesis 18:9–15). But God kept His promise to her, and she bore a son (Genesis 21:1–7). After reading and working through the rest of the book of Genesis, I went into my friend’s office exasperated and frustrated with myself because I couldn’t find anything else for the discussion questions. She encouraged me to keep at it and do my best, and reassured me that maybe it was okay if God keeping His promises was the main theme of the project.\n\nSoon after completing the project, I realized that what had been frustrating me about the book of Genesis was exactly what I needed to hear and understand about God in a season of my own confusion and doubt: God keeps His promises to His people. He keeps His promises when your world seems to come crashing down. He keeps His promises when your best friend betrays you, when a dear family member falls ill, when the plans you had for your life have suddenly fallen to pieces around you. I know He does because I’ve seen it in my own life. His promises to His people are true. We can put our hope in Him to do so (Psalm 119:81). What a beautiful gift.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:89-104, Isaiah 40:6-8, Isaiah 41:17-20",
        "devo_title": "Your Word Is Forever",
        "devo_summary": "\n\nBY Amanda Bible Williams\n\nHis photo was taped to my computer monitor at work and to the refrigerator door at home—a three-year-old boy with olive skin, black hair, deep brown eyes, and a dimple above each cheek. He was a child of God with no earthly mama or baba to call his own, and I wanted so badly for him to be ours.\n\nI’ve said that adoption feels as miraculous as childbirth, a million little pieces that must fall perfectly into place for that blessed homecoming to occur. It seemed all but impossible in the beginning—too much paperwork, too much money, too many unknowns. And then there was his heart. This image-bearer was created by God with a very special heart, one that somehow managed to channel blood throughout his small frame despite missing some very important vessels. He’s been a miracle from the start.\n\nSomewhere in those early days of wondering if this beautiful, brokenhearted boy could be our son, I read a passage from Isaiah 41 that made my own heart beat loud and fast.\n\n“I am the LORD, the God of Israel. I will not abandon them…I will open rivers on the barren heights, and springs in the middle of the plains.I will turn the desert into a pool and dry land into springs…So that all may see and know, consider and understand,that the hand of the LORD has done this,the Holy One of Israel has created it” (Isaiah 41:17–18,20).\n\nI taped those words to my computer monitor, right next to that dimpled smile. It was a promise from God to His people, and it became my prayer in the joy and hope and helplessness of the days and months ahead.\n\nLord, do what we cannot. Be who we cannot. Create vessels where there are none, and a road home for this boy of ours, if indeed he’s ours. Create what only you can create, as only You can. May all who see it know that You and You alone bring life and hope.\n\nPsalm 119:89 says that God’s Word is forever, “firmly fixed in heaven.” But the concept of an unbreakable thing is difficult to understand when you yourself are broken. The idea that something lasts forever feels like fiction when the world we live in is filled with people, places, and promises that fade. But God’s Word is both unbreakable and everlasting. Tethering my heart to it changes the way I walk through this wounded, temporary world. So, I grabbed hold of that Isaiah passage, and I still haven’t let it go.\n\nOur son did come home, despite all the obstacles. And after his first heart catheterization here, the surgeon showed us images we’d prayed for, but never dreamed we’d see: vessels where there once were none, tangible hope created from nothing. But would God have been good if that catheterization had found nothing new, no surgical path forward? A resounding, Yes. Because our hope is not in healed hearts or an oasis planted in the desert; our hope is in the One who speaks arteries and myrtle trees into existence, whose Word never fades or fails, even when our bodies most certainly will.\n\nThose verses I stared at day after day in that season—the same ones I clung to by his hospital bed in the year that followed—do not guarantee an outcome. They guarantee God’s goodness. He is bigger than outcomes, even when our circumstances shift and our hearts ache. We can trust the God who makes all things new.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:105-120, Proverbs 19:21, 1 Chronicles 28:9-20",
        "devo_title": "Your Word Is a Lamp for My Feet",
        "devo_summary": "\n\nBY Ryan Myers\n\n“Okay. What have you learned from this?”\n\nThis phrase, spoken by my father, was a mainstay of my growing up. I heard it one summer afternoon when I was eight years old, following my sheepish confession that I’d accidentally shot my neighbor, Mr. Horner, with my BB gun. I heard it late one snowy Michigan night, when my car came to rest against a chain-link fence—after I’d impatiently tried (unsuccessfully) to maneuver it between a ditch and another parked car in my girlfriend’s driveway—resulting in a phone call to my dad, asking him to come help me dig my car out of a snowdrift. And I’ve uttered that same question to myself countless times since, even as I’ve grown older and the learning opportunities have evolved with time and age.\n\nAlways spoken in love, and almost always received with humility, it’s a phrase so simple, yet it resounds with the essence of the relationship between a dad and a son. I’m deeply grateful to fall into the increasingly receding percentage of men whose fathers are truly fatherly.\n\nWe might not expect to find such a rare, human moment between father and son within Scripture. While God’s Word is relatable and relevant across time, I still struggle sometimes to grasp the idea that these words were written to real people who existed in a real time and place. But that wasn’t the case for me when I read David’s words to his son, Solomon, in 1 Chronicles 28. His words could’ve just as easily been written to me in a text message from my dad on any given Monday morning:\n\n“As for you, Solomon my son, know the God of your father,and serve him wholeheartedly and with a willing mind,for the LORD searches every heart and understands the intention of every thought.If you seek him, he will be found by you” (v.9).\n\nI can almost picture the memories and hard-won lessons flashing before David’s eyes as he distills his life into just two simple sentences, passing down parting wisdom to his son. After charging Solomon with the great responsibility of building the temple and outlining the requirements of the job, David’s parting words to his son, and some of his last we read in the Bible, include loving encouragement that ultimately points Solomon to a present, secure, steadfast God. He tells Solomon to “be strong and courageous, and do the work… for the LORD God, my God, is with you. He won’t leave you or abandon you until all the work for the service of the LORD’s house is finished” (v.20).\n\nWhat a delight it is to be offered wisdom by those who’ve come before us, and in turn, to offer guidance to those who will come after us. But isn’t that what this entire book, the Bible, is about? It’s a lamp to lead our feet along the path of life (Psalm 119:105). It gives guidance from a loving Father through stories of His own and others’ that are full of grace and love, that shape us and call us to grow. May we honor the same Father of David and Solomon, feel loved by Him, and love like Him every day.\n\nRyan Myers is Chief Operating Officer of She Reads Truth, He Reads Truth, and Kids Read Truth. Ryan and his wife, Raechel, live with their two children in Nashville, Tennessee.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:121-144, Romans 15:4, 1 Corinthians 13:1-13",
        "devo_title": "Your Decrees Are Wondrous",
        "devo_summary": "\n\nBY Bailey Gillespie\n\nReading the Bible has always been hard for me. That may sound strange coming from someone who works for a company with the motto, “Women in the Word of God every day.” Over the years, being in the Word has proved tricky for several reasons, one of which is its familiarity. I’ve read Scripture my whole life, yet the transformative stories and commands lose their potency when I grow used to their rhythms and cadence, to the way the words sound when they roll off my tongue.\n\nLet me be clear: Scripture can’t lose its power or potency. But I can diminish its work in my life through my own apathy. I can choose not to slow down and really open myself to the text or the Holy Spirit who speaks through it.\n\nA decade ago, I walked through a situation that required me to love a friend and leader in our church community with what the Bible calls agape love—a love that seeks someone else’s wellbeing. Since I could no longer speak with this person directly, the development of this love had to take place solely between God and me. So, my best friend and I made a pact to read 1 Corinthians 13 every day for a whole year. The love passage. This well-known chapter was the best model we could find for the altruistic, Christlike, agape kind of love.\n\nJust because it was a well-known chapter didn’t mean it was easy to put into action. By focusing our attention on one passage for an extended period of time, the purpose was long-term, personal transformation. I began reading it to myself out loud, as if to absorb into my very being. I can still hear the lines echoing through my car, as I read it aloud each morning:\n\n“Love is patient, love is kind. Love does not envy,is not boastful, is not arrogant, is not rude,is not self-seeking, is not irritable,and does not keep a record of wrongs” (1 Corinthians 13:4–5).\n\nThese aren’t just eloquent lines of verse or truisms to tuck away in our back pocket. They’re the living, active words of God. My friend and I didn’t set out to memorize the chapter, but within a couple weeks it was buried inside us. I found that my heart had been softened toward God’s Word and toward this person from our community. And even though it may not have redeemed the situation, it changed my heart.\n\nAs Psalm 119 says, “Your decrees are wondrous; therefore I obey them” (v.129). Let’s obey God’s decrees by burying them inside us, even if that means reciting them aloud for 365 days. When our hearts have a chance to catch up with our minds, we begin to embody truth and become not a clanging cymbal but a transformed child of God (1Corinthians 13:1).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-10-wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:145-160, Romans 2:12-13, Ecclesiastes 2:24-25",
        "devo_title": "I Have Not Forgotten Your Instruction",
        "devo_summary": "\n\nBY Kara Gause\n\nIt was the first time I’d ever stood up in front of our church congregation, some fifteen years ago. Alongside our fellow “new members,” my husband and I looked out over the church body we were joining, as our pastor read our favorite Bible verses aloud and introduced us by name. Never one to go first, I listened from the end of the line as one inspirational verse after another was read into the microphone, each one offering another shade of affirmation, encouragement, and faith. But as I listened for the first time to the verses of other new congregants, I felt panic set in: Had I misunderstood the instruction? The sound of my blood pumping in my ears grew louder, nearly drowning out my pastor’s voice completely, until my husband gently squeezed my hand to hear my own “favorite verse” from Scripture:\n\n“There is nothing better for a person than to eat, drink, and enjoy his work.I have seen that even this is from God’s hand,because who can eat and who can enjoy life apart from him?” (Ecclesiastes 2:24–25).\n\nYup.\n\nIn all of Scripture, with its sweeping poetry and prose, that was “my verse”—is my verse, I should say. In that moment of pride, I began to doubt my seemingly simple choice. I was afraid that, out of context, it misrepresented my faith and understanding of the gospel and downplayed my affection for God. I’ve since come to realize just how accurately it still reflects my relationship with Him and the sin that so often distracts me from Him: my heart’s unfortunate tendency to wander.\n\nI’m easily distracted, you see. By work. By striving. By perfectionism of the textbook-definition variety. And when I get caught up in working and worrying, spinning myself into a cycle that pushes God away from the center of my heart’s affections—that’s when He reminds me of what’s true. He gently squeezes my heart in such a way that I’m forced to acknowledge the emptiness I’m feeling, the deep ache I work so hard to numb with the distraction of productivity, when I try to live my life with my gaze affixed on anyone or anything “apart from him” (John 15:5).\n\nThe Westminster Shorter Catechism posits that “the chief end of man is to glorify God and enjoy him forever.” In my own walk with God, I’ve tended to focus on the first part, on what it might mean to glorify Him. I’ve twisted the idea of bearing His image into a works-based, legalistic, shallow religion that has very little to do with my God.\n\nBut to enjoy Him. To be satisfied in Him. To delight in His Word. To stop and savor His provision and the work He’s called me to, not just for what they might become in the future, but for what they are today—well, that sings of enjoying relationship with my very relational God, the one who is ready to answer when we call out to Him, when we seek Him with all our heart (Psalm 119:145). His Word is a very precious gift that instructs us on how to best live this life He’s given us (v.153). And it is clear: in knowing Him, being in His presence, there is abundant joy and eternal pleasure. But apart from Him, we will never be satisfied (Psalm 16:11). This is the instruction my wandering heart so desperately needs.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-11-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:161-176, Ecclesiastes 12:12-14, John 21:1-19",
        "devo_title": "My Heart Fears Only Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nChristians don’t just read the Bible. We enter into a life-long relationship with it. We read it over the course of a lifetime, knowing we will never exhaust all there is to know or glean from God’s Word. Often, when we return to passages we’ve read before, we come to them having changed since the last time we spent time with those verses. We go through things that shift how we see the world—vocational upheaval, marriage, divorce, parenthood, miscarriage, life-altering diagnoses, unexpected windfalls of good-fortune, and the like.\n\nAs we experience more of the joys and heartaches associated with living in this world, we look at Scripture through different eyes. Sometimes a theological idea we thought we had wrapped up in a tidy bow suddenly becomes shot through with questions we never thought to ask when we were younger and had not suffered much.\n\nThis is one of the reasons I am so drawn to the story of Peter’s reinstatement in John 21:1–19. Here we find Simon Peter, who was one of Jesus’s closest friends, sitting with the fact that he had denied Jesus in His greatest hour of need. He had done so exactly as Jesus predicted he would, even though he swore this sort of failure wasn’t something he was capable of (Mark 14:31).\n\nI love the story because it’s about someone who appeared to have as good of a relationship with Jesus as anyone could have, and yet he himself was weak. When Jesus appeared on the shore cooking breakfast for His friends, and caused their empty nets to be filled with more fish than they could handle, Peter recognized Jesus, because this is the same way Jesus first called Peter—with a miraculous catch of fish (Luke 5:1–11).\n\nWhen Peter jumped out of the boat and cast his drenched and dripping self at the feet of Jesus, he had no relational ground to stand on. He’d betrayed his best friend, his Lord. And yet, Jesus asked Peter the most simple and searching question imaginable: “Do you love me?” And Peter, paradox that he is, answered truthfully. He did love Jesus. He did. When Jesus said, “Feed my sheep,” He was hearkening back to when He first called Peter and told him He would make him a fisher of men. Peter’s failure did not disqualify him from Jesus’s love, or from Jesus’s call on his life.\n\nI love this passage because it offers so much hope to people who go through seasons of struggle and failure and wonder if they have lost the love of God. Peter could do nothing but receive from Jesus. On that shore, he had nothing to offer. And yet, he longed to be near his Lord and friend. We know this because earlier, before Jesus was crucified, He taught that people would ultimately need to be nourished by His flesh and blood. It was a teaching many found too difficult to embrace, and they left. But when Jesus asked His disciples if they, too, would leave, it was Peter who said, “Lord, to whom will we go? You have the words of eternal life” (John 6:68).\n\nPeter’s story reminds us that the thing we must cling to most, and fear above all else, is the Word of Christ (Psalm 119:161). Though our circumstances change, and even we change, He does not (Hebrews 13:8). Where else can we go?\n\nRuss Ramsey and his wife and four children make their home in Nashville, Tennessee, where he is the pastor of Christ Presbyterian Church Cool Springs. Russ is the author of the Retelling the Story series and Struck: One Christian’s Reflections on Encountering Death. You can follow him on Facebook, Twitter, and Instagram.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-12-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:1-16, Psalm 19:7-8, Exodus 20:1-17",
        "devo_title": "Happy Are Those Who Keep His Decrees",
        "devo_summary": "\n\nBY Raechel Myers\n\nI used to really love the law (Exodus 20:1–17). I remember enthusiastically singing the Ten-Commandments song “The Perfect Ten” at school and church with the confidence of a child whose Christian walk was just beginning.\n\nNumber one, we’ve just begun: God should be first in your life!Number two’s the idol rule: those graven images aren’t nice.\n\nI’d assure myself as I sang…\n\nNumber three: God’s name should be never spoken in jest.Number four: the Sabbath’s for our worship and for rest.\n\nSo far, so good. Our family was known for nothing if not for our Sunday naps.\n\nNumber five: we all should strive to honor father and mother.Number six: don’t get your kicks from killing one another.\n\nSuccess!\n\nNumber seven: life is heaven when you’re true to your mate.Number eight: don’t steal and break this rule for goodness’ sake!\n\nNumber seven was easy—I didn’t even have a mate!\n\nNumber nine: don’t be the kind who goes around telling lies.Number ten: don’t covet when you see your neighbor’s house or wife!\n\nI was doing so well. It had never occurred to me to covet my neighbor’s wife. In my mind I would sing that song with a full band playing behind me—like a victory song. I was delighting in God’s law because it was just so keepable! But as I grew to understand the law, I began to understand how difficult it was to follow.\n\nI thank God that He brought me out of the age of check, check, check into the maturity of, If this is the measuring stick, I will never measure up. And even more, I’m thankful He didn’t leave me there with my checklist. When God mercifully, gradually granted me eyes to see how readily I broke His law by commission, omission, and flat-out rejection of Him, the big band musicians in my head began to slowly lower their instruments and solemnly take their seats. I wasn’t delighting in God’s law at all. I had been delighting in my “keeping” of His law.\n\nBut my delight hasn’t gone away; it has instead shifted and matured. Now, my soul finds rest in knowing that the law has been fulfilled by Christ on my behalf. Because of Jesus, the law no longer justifies or condemns us—it frees us and becomes our guide for thankful obedience to the One by whom we are justified.\n\nDo you get that? If the law is our measuring stick, every one of us will be found unrighteous. But Jesus kept God’s law perfectly, imparting His righteousness to us so that when we are measured, we, too, will be counted as righteous—as perfect law-keepers!\n\nNow, when I catch myself humming that childhood ten commandments tune (or teaching it to my children), I hear it differently. Not as a reminder of what I have to do, or even as a condemnation of what I can’t do. I hear it now as an assurance of what He has done, and as the kindest, clearest roadmap to the heart of the Father. He makes me righteous, and I delight in pleasing Him. “Oh that my ways may be steadfast in keeping [His] statutes!” (Psalm 119:5, ESV).\n\nLord, I love your law. “With my lips I declare all the rules of your mouth” (v.13, ESV).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-1-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:17-32, Joshua 1:6-8, Galatians 4:1-7",
        "devo_title": "Give Me Life Through Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nIn her essay called “The Wreck of Time,” Annie Dillard references the idea that when a single person dies, we treat it as a tragedy. But when a million people die, we treat it as a statistic.\n\nThis unsettling observation shows how inconsistent we humans can be concerning the value of a life. On the one hand, if a friend or relative or some other cherished person is taken from us, we are moved to deep and abiding sorrow. On the other hand, if a million lives with whom we share no personal connection are suddenly wiped out by a viral pandemic or natural disaster, any initial sadness and shock we feel can fade within weeks, and possibly within hours. The one who is close to us seems more precious even than the million who are further away.\n\nOur selective valuation of our fellow humans invites a haunting question: If the million don’t matter to us as much as the one, then can we honestly say that the one really matters at all? How precious are many lives, how precious is a single life, and how precious is my life… really?\n\nEach of us living today is one in seven billion. Of all the people who have ever lived, we are one in 107 billion. David hinted at this relative smallness of ours when he cried out to God, “What is a human being that you remember him, a son of man that you look after him?” (Psalm 8:4).\n\nThankfully, Scripture provides us with a strong and sure answer. David continued, “You made him a little less than God and crowned him with glory and honor” (v.5). The poet-king after God’s own heart is genuinely awestruck by the truth about all humans and about each individual human: We are made in the image of God (Genesis 1:27). Of all creatures everywhere, only humans are esteemed in this way.\n\nThis truth about our inestimable value becomes even more compelling when we realize that in Christ, we are the image of God but also much more: Scripture tells us we are the children of God. And as His children, He gives us life through His Word and teaches us His ways (Psalm 119:25–26). In his letter to the Galatians, Paul amplifies this astonishing truth by reminding us that through faith in Christ, God has adopted us, sent His Spirit into our hearts, invited us to call Him “Father,” and made us heirs of all that is His (Galatians 4:4–7).\n\nAs Brennan Manning has written, “Define yourself radically as one beloved by God. This is the true self. Every other identity is an illusion.”\n\nThe next time you look in the mirror, don’t for a moment think that you’re looking at a mere face in the crowd. Don’t for a moment think that you’re looking at a tragedy or a statistic. You have no true basis for looking at yourself in this way. Rather, you are looking at an esteemed crown of God’s creation, a beloved child of God, and a privileged heir of everything.\n\nThis is your true self. Every other identity is an illusion.\n\nScott Sauls is husband to Patti, dad to Abby and Ellie, and senior pastor of Christ Presbyterian Church in Nashville, Tennessee. Scott was also lead and preaching pastor at NYC’s Redeemer Presbyterian Church after planting two churches in the midwest. Scott has authored several books, including Jesus Outside the Lines and his most recent work, A Gentle Answer. He regularly blogs at scottsauls.com. His work has been featured in Christianity Today, Relevant Magazine, Qideas, Catalyst, Leadership Magazine, Outreach Magazine, annvoskamp.com, The Gospel Coalition, and several other publications. You can connect with Scott on Facebook or Twitter/Instagram at @scottsauls.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-2-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:33-56, 2 Timothy 3:16-17, James 1:16-25",
        "devo_title": "Teach Me the Meaning of Your Statutes",
        "devo_summary": "\n\nBY Jessica Lamb\n\nOne of my strongest memories from my sophomore year of high school is of a black, 5-inch thick three-ring binder I carried everywhere. I was part of the not-so-exclusive academic quiz bowl team at my school, and every few weeks, I would compete against other schools to see which team could “buzz in” first to earn points answering trivia questions. My binder was filled with the printed records of previous tournament questions and answers. Though questions were rarely repeated, I poured over that binder every opportunity I could find, hoping that my incessant studying might reveal recurring subject matter or a pattern in how questions are worded for tournaments to give me an edge over the competition. To this day, I’d still choose a trivia night at a local restaurant over almost any other activity.\n\nI used to think taking this same approach to Scripture was proof that I loved God’s Word. Studying the Bible—its words, history, cultural contexts, and languages—has been life-giving to my faith in my undergraduate and postgraduate studies, as well as in my career. But I have to be reminded that life as a follower of Jesus is so much more than just memorizing facts about God or storing up interesting trivia about the Bible. Our reading and study of Scripture should shape us and reorient our hearts as it shows us who He is and who we are in Him.\n\nI come back to the book of James over and over when I find my heart wanting to make a god of knowing about God, rather than truly knowing Him. The book is full of direct one-liners that cut right to the truth: truly delighting in God’s Word means living out what the Word teaches us. In the opening passage of his letter, James sums this up by telling believers that we must be “doers of the word and not hearers only” (James 1:22).\n\nHearing without acting is more than useless—it’s self-deception, because as believers, we are new people born of the gospel (v.22,18). James writes that God has implanted His Word in us (v.21). We miss the point if we are not willing to let its truth take root, growing and bearing fruit in us as we are changed and made more like Christ.\n\nEssentially, we are living out what the psalmist pleads with God to do: transform him so that he can keep God’s commands. By His Spirit and His Word, we’ve been made into new people. Unlike the person who looks in the mirror and responds, “I forget,” when asked what they look like (vv.23–24), we are called to remember who we are as we walk away from reading the Bible. If we go about our lives without acting on what it teaches, we live as fractured people, at odds with who we now are in Christ. Praise God, because He’s done the hardest work in giving us new hearts already!\n\nBeing in the Word of God every day equips us to live out the Word of God every day. It guards against forgetting what is true of our God and of ourselves. Let our prayer echo that of the psalmist as we come to the Bible each day: ”Teach me, LORD, the meaning of your statutes, and I will always keep them” (Psalm 119:33).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-3wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:57-72, Deuteronomy 6:6-9, Joshua 2:1-21",
        "devo_title": "I Have Promised to Keep Your Words",
        "devo_summary": "\n\nBY Guest Writer\n\nI remember listening to journalist Malcolm Gladwell interview Nashville legend and famed songwriter Bobby Braddock. Their conversation centered on what goes into writing a truly sad song, the kind of tune that finds you driving with one hand on the steering wheel so the other can be free to wipe the tears from your eyes.\n\nAs they talked, they decided that country music has a leg up on rock and pop when it comes to mournful tracks, but the question that lingered was Why? In the end, Braddock said it came down to details: “We cry when melancholy collides with specificity.” It’s one thing to sing about heartache, and another thing entirely to sing about standing by a lost friend’s grave and the angels’ faces delighting to welcome that friend home. Take a listen to “Go Rest High on That Mountain” by Vince Gill to hear what I’m talking about.\n\nThe reason that details help sad songs resonate with us is because they echo our own experience. We live in a world of details, not generalities. Somehow, the details make a thing more real. When it comes to God’s Word, I delight in the details. You see, in the ancient world, there was no paper. Instead, texts were written on papyrus, a material similar to paper but made out of certain flattened reeds—and papyrus wasn’t cheap. That means that everything included in God’s Word is important. There are no throwaway lines, no unimportant details.\n\nIn the story of Rahab, there’s a detail that jumps off the page for me. When she lets the two Israelite spies down through her window, she does so with a “scarlet cord” (Joshua 2:18). And it was this scarlet cord that would identify her home and keep her safe when the Israelites later attacked Jericho. It wasn’t brown or blue or white. It was a scarlet rope—and that makes all the difference in telling this story.\n\nFor those early Israelite readers of Rahab’s account, they would have connected the red color of the rope “dripping” down the window frame with the lamb’s blood a previous generation had brushed on the doorframes of their homes. While still slaves in Egypt, God had passed over the houses of the Hebrews on the night the firstborn in every household in the land had died (Exodus 12:23). The blood marked those inside as belonging to God. Rahab was a Gentile and a prostitute, but she, too, would be marked as one of God’s people. Though she was late to the party, so to speak, the “blood” of the scarlet cord would bring Rahab her own Passover moment.\n\nThe symbol, of course, is not as important as the thing it symbolizes. What set Rahab apart as a member of God’s family was not the red rope but her loyalty to Yahweh, based on the reports she had heard (Joshua 2:10–11). By helping the Israelites, she was committing treason, and she knew it. By earthly measures, the people of Jericho should have been able to withstand an attack by the Israelites. Rahab could have turned the spies over to the authorities and garnered herself the favor of Jericho’s king. But she believed what she had heard about the Lord, and she gave Him her allegiance, echoing with her life what the psalmist would later write: “The LORD is my portion” (Psalm 119:57).\n\nBut the scarlet cord doesn’t just point backwards to Passover; it also points forward to Christ. It is Christ’s red blood that now marks those who are members of God’s family. The Passover account had always foreshadowed the sacrifice of Jesus, and God had always planned on making one new people from Jews and Gentiles. Rahab’s story reveals this had long been in God’s heart to do. The prostitute-turned-daughter of the King is even honored with a place in Jesus’s family tree (Matthew 1:5).\n\nGod is the Author of Scripture. No detail is included by accident. Every last one is an invitation to thank Him for His faithfulness, our God who knows the end from the beginning (Isaiah 46:10).\n\nJohn Greco is a writer, editor, and Bible nerd. He and his wife, Laurin, live south of Nashville, where they daily wrangle their three small boys and dream of someday being the ones who get to take all the naps. You can find John at JohnGrecoWrites.com.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagra-4-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:73-88, Hebrews 4:12-13, Genesis 18:9-15, Genesis 21:1-7",
        "devo_title": "I Put My Hope in Your Word",
        "devo_summary": "\n\nBY Ellen L. Taylor\n\nI grew up going to church three times a week and met some of my closest friends (even to this day!) in youth group. Most of my Facebook statuses in high school were inspirational Bible verses that I hoped would encourage my friends at my public high school who weren’t believers. I went to a Christian university for my undergraduate degree, where mandatory chapel was held twice a week, and every student was required to take six semesters worth of Bible classes. I interned at a local church and even earned a minor degree in the Bible. And then, I went to graduate divinity school.\n\nBut somewhere along the way, I stopped delighting in Scripture. I saw it as something to be studied, but not something to be taken to heart. I began to think of God as something to learn about rather than someone to know. To date, this was one of the most confusing times in my life so far.\n\nAfter a time spent in this confusing season, I was given a special project at work; I was instructed to go through the entire book of Genesis, chapter by chapter, writing discussion questions along the way for kids aged eleven to fifteen.\n\nI don’t know the last time you read through the book of Genesis (maybe in January when we read it together, as an SRT community), but there are some stories in that book that are, well, a little less than age-appropriate for young teens. As I was going through some of the trickier passages, the discussion point I kept coming back to was that God keeps His promises to His people. His people keep turning away from Him, not believing Him, disobeying Him and turning to other gods, but God is consistently faithful to His promises.\n\nOne of the passages that fell into this category was the story of Sarah and her pregnancy with Isaac. When God told her she would become pregnant in her old age, Sarah laughed at the very thought (Genesis 18:9–15). But God kept His promise to her, and she bore a son (Genesis 21:1–7). After reading and working through the rest of the book of Genesis, I went into my friend’s office exasperated and frustrated with myself because I couldn’t find anything else for the discussion questions. She encouraged me to keep at it and do my best, and reassured me that maybe it was okay if God keeping His promises was the main theme of the project.\n\nSoon after completing the project, I realized that what had been frustrating me about the book of Genesis was exactly what I needed to hear and understand about God in a season of my own confusion and doubt: God keeps His promises to His people. He keeps His promises when your world seems to come crashing down. He keeps His promises when your best friend betrays you, when a dear family member falls ill, when the plans you had for your life have suddenly fallen to pieces around you. I know He does because I’ve seen it in my own life. His promises to His people are true. We can put our hope in Him to do so (Psalm 119:81). What a beautiful gift.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:89-104, Isaiah 40:6-8, Isaiah 41:17-20",
        "devo_title": "Your Word Is Forever",
        "devo_summary": "\n\nBY Amanda Bible Williams\n\nHis photo was taped to my computer monitor at work and to the refrigerator door at home—a three-year-old boy with olive skin, black hair, deep brown eyes, and a dimple above each cheek. He was a child of God with no earthly mama or baba to call his own, and I wanted so badly for him to be ours.\n\nI’ve said that adoption feels as miraculous as childbirth, a million little pieces that must fall perfectly into place for that blessed homecoming to occur. It seemed all but impossible in the beginning—too much paperwork, too much money, too many unknowns. And then there was his heart. This image-bearer was created by God with a very special heart, one that somehow managed to channel blood throughout his small frame despite missing some very important vessels. He’s been a miracle from the start.\n\nSomewhere in those early days of wondering if this beautiful, brokenhearted boy could be our son, I read a passage from Isaiah 41 that made my own heart beat loud and fast.\n\n“I am the LORD, the God of Israel. I will not abandon them…I will open rivers on the barren heights, and springs in the middle of the plains.I will turn the desert into a pool and dry land into springs…So that all may see and know, consider and understand,that the hand of the LORD has done this,the Holy One of Israel has created it” (Isaiah 41:17–18,20).\n\nI taped those words to my computer monitor, right next to that dimpled smile. It was a promise from God to His people, and it became my prayer in the joy and hope and helplessness of the days and months ahead.\n\nLord, do what we cannot. Be who we cannot. Create vessels where there are none, and a road home for this boy of ours, if indeed he’s ours. Create what only you can create, as only You can. May all who see it know that You and You alone bring life and hope.\n\nPsalm 119:89 says that God’s Word is forever, “firmly fixed in heaven.” But the concept of an unbreakable thing is difficult to understand when you yourself are broken. The idea that something lasts forever feels like fiction when the world we live in is filled with people, places, and promises that fade. But God’s Word is both unbreakable and everlasting. Tethering my heart to it changes the way I walk through this wounded, temporary world. So, I grabbed hold of that Isaiah passage, and I still haven’t let it go.\n\nOur son did come home, despite all the obstacles. And after his first heart catheterization here, the surgeon showed us images we’d prayed for, but never dreamed we’d see: vessels where there once were none, tangible hope created from nothing. But would God have been good if that catheterization had found nothing new, no surgical path forward? A resounding, Yes. Because our hope is not in healed hearts or an oasis planted in the desert; our hope is in the One who speaks arteries and myrtle trees into existence, whose Word never fades or fails, even when our bodies most certainly will.\n\nThose verses I stared at day after day in that season—the same ones I clung to by his hospital bed in the year that followed—do not guarantee an outcome. They guarantee God’s goodness. He is bigger than outcomes, even when our circumstances shift and our hearts ache. We can trust the God who makes all things new.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:105-120, Proverbs 19:21, 1 Chronicles 28:9-20",
        "devo_title": "Your Word Is a Lamp for My Feet",
        "devo_summary": "\n\nBY Ryan Myers\n\n“Okay. What have you learned from this?”\n\nThis phrase, spoken by my father, was a mainstay of my growing up. I heard it one summer afternoon when I was eight years old, following my sheepish confession that I’d accidentally shot my neighbor, Mr. Horner, with my BB gun. I heard it late one snowy Michigan night, when my car came to rest against a chain-link fence—after I’d impatiently tried (unsuccessfully) to maneuver it between a ditch and another parked car in my girlfriend’s driveway—resulting in a phone call to my dad, asking him to come help me dig my car out of a snowdrift. And I’ve uttered that same question to myself countless times since, even as I’ve grown older and the learning opportunities have evolved with time and age.\n\nAlways spoken in love, and almost always received with humility, it’s a phrase so simple, yet it resounds with the essence of the relationship between a dad and a son. I’m deeply grateful to fall into the increasingly receding percentage of men whose fathers are truly fatherly.\n\nWe might not expect to find such a rare, human moment between father and son within Scripture. While God’s Word is relatable and relevant across time, I still struggle sometimes to grasp the idea that these words were written to real people who existed in a real time and place. But that wasn’t the case for me when I read David’s words to his son, Solomon, in 1 Chronicles 28. His words could’ve just as easily been written to me in a text message from my dad on any given Monday morning:\n\n“As for you, Solomon my son, know the God of your father,and serve him wholeheartedly and with a willing mind,for the LORD searches every heart and understands the intention of every thought.If you seek him, he will be found by you” (v.9).\n\nI can almost picture the memories and hard-won lessons flashing before David’s eyes as he distills his life into just two simple sentences, passing down parting wisdom to his son. After charging Solomon with the great responsibility of building the temple and outlining the requirements of the job, David’s parting words to his son, and some of his last we read in the Bible, include loving encouragement that ultimately points Solomon to a present, secure, steadfast God. He tells Solomon to “be strong and courageous, and do the work… for the LORD God, my God, is with you. He won’t leave you or abandon you until all the work for the service of the LORD’s house is finished” (v.20).\n\nWhat a delight it is to be offered wisdom by those who’ve come before us, and in turn, to offer guidance to those who will come after us. But isn’t that what this entire book, the Bible, is about? It’s a lamp to lead our feet along the path of life (Psalm 119:105). It gives guidance from a loving Father through stories of His own and others’ that are full of grace and love, that shape us and call us to grow. May we honor the same Father of David and Solomon, feel loved by Him, and love like Him every day.\n\nRyan Myers is Chief Operating Officer of She Reads Truth, He Reads Truth, and Kids Read Truth. Ryan and his wife, Raechel, live with their two children in Nashville, Tennessee.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:121-144, Romans 15:4, 1 Corinthians 13:1-13",
        "devo_title": "Your Decrees Are Wondrous",
        "devo_summary": "\n\nBY Bailey Gillespie\n\nReading the Bible has always been hard for me. That may sound strange coming from someone who works for a company with the motto, “Women in the Word of God every day.” Over the years, being in the Word has proved tricky for several reasons, one of which is its familiarity. I’ve read Scripture my whole life, yet the transformative stories and commands lose their potency when I grow used to their rhythms and cadence, to the way the words sound when they roll off my tongue.\n\nLet me be clear: Scripture can’t lose its power or potency. But I can diminish its work in my life through my own apathy. I can choose not to slow down and really open myself to the text or the Holy Spirit who speaks through it.\n\nA decade ago, I walked through a situation that required me to love a friend and leader in our church community with what the Bible calls agape love—a love that seeks someone else’s wellbeing. Since I could no longer speak with this person directly, the development of this love had to take place solely between God and me. So, my best friend and I made a pact to read 1 Corinthians 13 every day for a whole year. The love passage. This well-known chapter was the best model we could find for the altruistic, Christlike, agape kind of love.\n\nJust because it was a well-known chapter didn’t mean it was easy to put into action. By focusing our attention on one passage for an extended period of time, the purpose was long-term, personal transformation. I began reading it to myself out loud, as if to absorb into my very being. I can still hear the lines echoing through my car, as I read it aloud each morning:\n\n“Love is patient, love is kind. Love does not envy,is not boastful, is not arrogant, is not rude,is not self-seeking, is not irritable,and does not keep a record of wrongs” (1 Corinthians 13:4–5).\n\nThese aren’t just eloquent lines of verse or truisms to tuck away in our back pocket. They’re the living, active words of God. My friend and I didn’t set out to memorize the chapter, but within a couple weeks it was buried inside us. I found that my heart had been softened toward God’s Word and toward this person from our community. And even though it may not have redeemed the situation, it changed my heart.\n\nAs Psalm 119 says, “Your decrees are wondrous; therefore I obey them” (v.129). Let’s obey God’s decrees by burying them inside us, even if that means reciting them aloud for 365 days. When our hearts have a chance to catch up with our minds, we begin to embody truth and become not a clanging cymbal but a transformed child of God (1Corinthians 13:1).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-10-wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:145-160, Romans 2:12-13, Ecclesiastes 2:24-25",
        "devo_title": "I Have Not Forgotten Your Instruction",
        "devo_summary": "\n\nBY Kara Gause\n\nIt was the first time I’d ever stood up in front of our church congregation, some fifteen years ago. Alongside our fellow “new members,” my husband and I looked out over the church body we were joining, as our pastor read our favorite Bible verses aloud and introduced us by name. Never one to go first, I listened from the end of the line as one inspirational verse after another was read into the microphone, each one offering another shade of affirmation, encouragement, and faith. But as I listened for the first time to the verses of other new congregants, I felt panic set in: Had I misunderstood the instruction? The sound of my blood pumping in my ears grew louder, nearly drowning out my pastor’s voice completely, until my husband gently squeezed my hand to hear my own “favorite verse” from Scripture:\n\n“There is nothing better for a person than to eat, drink, and enjoy his work.I have seen that even this is from God’s hand,because who can eat and who can enjoy life apart from him?” (Ecclesiastes 2:24–25).\n\nYup.\n\nIn all of Scripture, with its sweeping poetry and prose, that was “my verse”—is my verse, I should say. In that moment of pride, I began to doubt my seemingly simple choice. I was afraid that, out of context, it misrepresented my faith and understanding of the gospel and downplayed my affection for God. I’ve since come to realize just how accurately it still reflects my relationship with Him and the sin that so often distracts me from Him: my heart’s unfortunate tendency to wander.\n\nI’m easily distracted, you see. By work. By striving. By perfectionism of the textbook-definition variety. And when I get caught up in working and worrying, spinning myself into a cycle that pushes God away from the center of my heart’s affections—that’s when He reminds me of what’s true. He gently squeezes my heart in such a way that I’m forced to acknowledge the emptiness I’m feeling, the deep ache I work so hard to numb with the distraction of productivity, when I try to live my life with my gaze affixed on anyone or anything “apart from him” (John 15:5).\n\nThe Westminster Shorter Catechism posits that “the chief end of man is to glorify God and enjoy him forever.” In my own walk with God, I’ve tended to focus on the first part, on what it might mean to glorify Him. I’ve twisted the idea of bearing His image into a works-based, legalistic, shallow religion that has very little to do with my God.\n\nBut to enjoy Him. To be satisfied in Him. To delight in His Word. To stop and savor His provision and the work He’s called me to, not just for what they might become in the future, but for what they are today—well, that sings of enjoying relationship with my very relational God, the one who is ready to answer when we call out to Him, when we seek Him with all our heart (Psalm 119:145). His Word is a very precious gift that instructs us on how to best live this life He’s given us (v.153). And it is clear: in knowing Him, being in His presence, there is abundant joy and eternal pleasure. But apart from Him, we will never be satisfied (Psalm 16:11). This is the instruction my wandering heart so desperately needs.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-11-1024x1024.jpg"
    },
    {
        "book_title": "Psalm 119",
        "devo_passages": "Psalm 119:161-176, Ecclesiastes 12:12-14, John 21:1-19",
        "devo_title": "My Heart Fears Only Your Word",
        "devo_summary": "\n\nBY Guest Writer\n\nChristians don’t just read the Bible. We enter into a life-long relationship with it. We read it over the course of a lifetime, knowing we will never exhaust all there is to know or glean from God’s Word. Often, when we return to passages we’ve read before, we come to them having changed since the last time we spent time with those verses. We go through things that shift how we see the world—vocational upheaval, marriage, divorce, parenthood, miscarriage, life-altering diagnoses, unexpected windfalls of good-fortune, and the like.\n\nAs we experience more of the joys and heartaches associated with living in this world, we look at Scripture through different eyes. Sometimes a theological idea we thought we had wrapped up in a tidy bow suddenly becomes shot through with questions we never thought to ask when we were younger and had not suffered much.\n\nThis is one of the reasons I am so drawn to the story of Peter’s reinstatement in John 21:1–19. Here we find Simon Peter, who was one of Jesus’s closest friends, sitting with the fact that he had denied Jesus in His greatest hour of need. He had done so exactly as Jesus predicted he would, even though he swore this sort of failure wasn’t something he was capable of (Mark 14:31).\n\nI love the story because it’s about someone who appeared to have as good of a relationship with Jesus as anyone could have, and yet he himself was weak. When Jesus appeared on the shore cooking breakfast for His friends, and caused their empty nets to be filled with more fish than they could handle, Peter recognized Jesus, because this is the same way Jesus first called Peter—with a miraculous catch of fish (Luke 5:1–11).\n\nWhen Peter jumped out of the boat and cast his drenched and dripping self at the feet of Jesus, he had no relational ground to stand on. He’d betrayed his best friend, his Lord. And yet, Jesus asked Peter the most simple and searching question imaginable: “Do you love me?” And Peter, paradox that he is, answered truthfully. He did love Jesus. He did. When Jesus said, “Feed my sheep,” He was hearkening back to when He first called Peter and told him He would make him a fisher of men. Peter’s failure did not disqualify him from Jesus’s love, or from Jesus’s call on his life.\n\nI love this passage because it offers so much hope to people who go through seasons of struggle and failure and wonder if they have lost the love of God. Peter could do nothing but receive from Jesus. On that shore, he had nothing to offer. And yet, he longed to be near his Lord and friend. We know this because earlier, before Jesus was crucified, He taught that people would ultimately need to be nourished by His flesh and blood. It was a teaching many found too difficult to embrace, and they left. But when Jesus asked His disciples if they, too, would leave, it was Peter who said, “Lord, to whom will we go? You have the words of eternal life” (John 6:68).\n\nPeter’s story reminds us that the thing we must cling to most, and fear above all else, is the Word of Christ (Psalm 119:161). Though our circumstances change, and even we change, He does not (Hebrews 13:8). Where else can we go?\n\nRuss Ramsey and his wife and four children make their home in Nashville, Tennessee, where he is the pastor of Christ Presbyterian Church Cool Springs. Russ is the author of the Retelling the Story series and Struck: One Christian’s Reflections on Encountering Death. You can follow him on Facebook, Twitter, and Instagram.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/SRT-Psalm119-Instagram-12-1024x1024.jpg"
    }
]