[
    {
        "book_title": "Job",
        "devo_passages": "Job 42:1-17, Psalm 40:10-13, Lamentations 3:19-26",
        "devo_title": "The Restoration of Job",
        "devo_summary": "\n\nBy Melanie Rainer\n\nI’ve always been afraid of the book of Job.\n\nI’m afraid of Job’s story, the way I’m afraid of Abraham’s, and Mary’s, and the disciples’. I’m afraid the cost of following Jesus will be too much for me—unlike Abraham, who obeyed God and prepared his son for sacrifice; and Mary, who was willing to face scandal as an unwed mother; and Jesus’s first disciples, most of whom died as martyrs. I’m afraid that, when faced with the sharp rock of suffering, my faith will shatter like glass. I don’t trust my flesh, which I know will fail. I’m afraid to live fully, to love completely, and trust wholly. I am afraid to suffer.\n\nOf course, I have suffered a variety of wounds, as we all have. If there is a more common thread to humanity than suffering, I’m not sure I know it. And so Job’s story is, naturally, my story. And your story, and your neighbor’s story, and every member of your family’s story, and that person who served you coffee this morning’s story too. In chapter 42, Job’s story ends with the same stunningly beautiful conclusion we are all offered: repentance and restoration.\n\nJob cries out, “I know that you can do anything.… I reject my words and am sorry for them” (Job 42:2,6). He knows that God is just, merciful, and mighty to save. Job doesn’t expect to be made whole, to have everything and everyone he’s lost restored. It is enough for Job to know that God is God and he is not, and to repent of his own pride.\n\nIn chapters 38–41, God speaks. He proclaims His power, His justice, His righteousness, and His sovereignty over all things. It’s a “mic drop” moment, one that needs no punctuation, no follow up. But after Job’s cry of repentance, God responds once more to Job in a manner so kind and lavish that we are compelled to react with just as much awe and wonder as we did when we read that He breathed all creation out of nothing. Yes, God is mighty, unrivaled in power. Yes, God is sovereign, unrivaled in His commitment to justice. But also, Yes, God is good, and He promises us bountiful restoration.\n\nJob received restoration in his lifetime—his fortunes returned, his flocks and herds multiplied, his home filled with new children. Our suffering may not, and often does not, end with restoration in this life. Death wounds us, sickness steals from us, broken relationships limit our ability to trust, and tragedy on a global scale haunts even our happiest days. Our hope is not in the here and now. Ours is a future hope, formed and grounded in God’s Word, molded by His mercy, and secured by His Son.\n\nWe will experience the restoration and renewal of all things, as promised in Revelation 21:3–5. It is the only ending that makes sense to our stories of suffering, the kind and lavish response of a loving Father who promises, one day, to wipe every tear from our eyes.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day26.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 40:1-24, Job 41:1-34, Mark 4:35-41, James 1:5-8",
        "devo_title": "God’s Second Speech",
        "devo_summary": "\n\nBy Melanie Rainer\n\nIn Night, the seminal autobiographical novel about his experience in Nazi concentration camps, writer Elie Wiesel says this: “Some of the men spoke of God: His mysterious ways, the sins of the Jewish people, and the redemption to come. As for me, I had ceased to pray. I concurred with Job! I was not denying His existence, but I doubted His absolute justice.”\n\nBecause it deeply resonated with his own experiences with tragedy and suffering, Wiesel publicly lectured on the book of Job throughout his career as a professor and Nobel Prize-winning author.\n\nAs I was researching Wiesel’s work on Job, I remembered reading Night in middle school. Then, I had a second thought, one that made my stomach drop and my eyes flood with tears. I realized that one day, my daughter is going to read Night. One day, she is going to find out about the Holocaust. She’ll read about about slavery and Jim Crow and 9/11. She’ll find out about war, famine, genocide, opioid overdoses, and school shootings. One day, she will learn about suffering. And even harder still to imagine, one day, she herself will suffer.\n\nWhere will God be when she learns about these things? And can I trust Him not only with my own suffering, but with my precious baby girl’s?\n\nWhen my heart wavers and falters on the edge of faith, brought on by suffering and fear, I know I cannot stand on my own feelings. I must stand in faith, which is a gift of the Spirit, and I must pray unceasingly for Him to strengthen it. I must stand on the unwavering, infallible Word of God. Here is what it teaches me:\n\n1) God is just and good. He controls the wind and waves, the leviathan and behemoth, and every living creature.\n\n2) His Son Jesus, who is God incarnate, knew suffering here on earth, just as we do. But the suffering He endured was infinitely greater than anything we might bear, as He took on the weight of the world’s sins.\n\nSuffering belongs to all of us, through all time. One of the gifts that comes with reading Job through the lens of the New Testament is knowing that his story of suffering is our story and that Jesus came to secure true righteousness for all who believe in Him.\n\nGod’s justice is absolute. In the depths of suffering, it is no wonder we question it. God speaks to Job, “Would you really challenge my justice? Would you declare me guilty to justify yourself?” (Job 40:8). Would we?\n\nWe can trust God with our suffering because He is the Creator and King of everything. But we can also trust God with our suffering because Jesus suffered, bearing all of our sorrows to the cross.\n\nHe himself bore our sicknesses,\nand he carried our pains;\nbut we in turn regarded him stricken,\nstruck down by God, and afflicted.\nBut he was pierced because of our rebellion,\ncrushed because of our iniquities;\npunishment for our peace was on him,\nand we are healed by his wounds (Isaiah 53:4–5).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day25.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 38:1-41, Job 39:1-30, Jeremiah 31:35-36, Revelation 3:14-20",
        "devo_title": "God’s First Speech",
        "devo_summary": "\n\nBy Melanie Rainer\n\nA few days a week, our notoriously chaotic and tardy household experiences a mini miracle. Somehow, we make it downstairs in time to eat breakfast, and inevitably, my four-year-old daughter asks to listen to her favorite catechism songs. And before I’ve had one sip of coffee, it starts: kid voices, electronic synth background music, and “GOD IS THE CRE-A-TOR OF EVERYONE AND EVERYTHING!” Then it repeats, and repeats again, and even in my pre-caffeinated state, I’m aware and grateful that this will be the song my girl has stuck in her head all day.\n\n“What is God?” The answer to this question, in some form or fashion, is foundational to every Church creed. It’s also touched upon in the very first sentence of Scripture. Everything started from God, who has no beginning and no end. And implicit in the story of creation is the sheer goodness, creativity, and affection of our Maker.\n\nThis is the truth God thunders from the whirlwind when He appears to the long-suffering Job. His speech in chapters 38 and 39 hearkens back to the story of creation in Genesis chapter 1: God created the earth and sea, the light and dark, the weather, the stars, and the animals (Job 38:4–39:30).\n\nGod presents two challenges to Job during His speech, and these two chapters contain the first. God is essentially asking, Do you understand how all this was made? How it all works? He is challenging Job’s finite understanding with all these questions. He’s challenging Job’s focus on himself.\n\nGod is not finished with His speech, but the start of it is more than enough for Job to fall back into his place. He has been reminded of Who he is speaking to, and just what the Maker of heaven and earth is capable of doing. And we, like Job, can marvel at His majesty and find our provision in His mercy.\n\nThe Heidelberg Catechism, written in 1563, poses this question and answer about the first line of the Apostles” Creed:\n\nQuestion: What do you believe when you say,“I believe in God, the Father almighty, creator of heaven and earth”?\n\nAnswer: That the eternal Father of our Lord Jesus Christ, who out of nothing created heaven and earth and everything in them, who still upholds and rules them by his eternal counsel and providence, is my God and Father because of Christ the Son. I trust God so much that I do not doubt he will provide whatever I need for body and soul, and will turn to my good whatever adversity he sends upon me in this sad world. God is able to do this because he is almighty God and desires to do this because he is a faithful Father.\n\nGod is almighty and faithful, full of mercy and majesty, creativity and care. As He declares His infinite holiness in these chapters, He does so to one man, Job. But God’s message is an eternal, cosmic truth, an invitation for each of us to rest in the security of knowing that we, too, are intimately loved by our Creator.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day24.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 36:1-33, Job 37:1-24, Jeremiah 9:24, Romans 5:20-21",
        "devo_title": "The Mercy and Majesty of God",
        "devo_summary": "\n\nBy Melanie Rainer\n\nToday’s readings are about mercy and majesty, two perfect descriptors of our perfect God. He is indeed merciful, and He is the King. But toward the end of this book about suffering, these two truths stand on trial. God has yet to show mercy to Job. If He is King, and sovereign, and has dominion over everything, why has His faithful servant suffered so much?\n\nLike God Himself, weather is unpredictable, wild, and powerful. So when Elihu describes the power of God, he talks about the weather. “He says to the snow, ‘fall to the earth,’” and “Ice is formed by the breath of God,” and “He saturates clouds with moisture; he scatters his lightning through them.” The wild, untamable weather that, despite our most advanced radar and predictions, never does what we think it will—this weather is controlled by God, a testament to His sovereignty and majesty.\n\nI write this while most of the United States is gripped by deadly freezing temperatures, the lowest in a generation. I write this after seeing our local weather-people get utterly destroyed on Twitter because they missed a forecast for snow. And always, their defense is simply this: weather is WEATHER. It is, by its very nature, impossible to control. We can read the radar, the charts, the signs, but at the end of the day, weather does what weather wants. Or rather, weather does what God wants.\n\nBut God’s majesty does have boundaries, lines drawn by His character and His goodness. In 37:13 we read, “He causes this to happen for punishment, for his land, or for his faithful love” (emphasis added). In verse 23, we are told, “The Almighty—we cannot reach him—he is exalted in power! He will not violate justice and abundant righteousness.” God may be utterly other, higher than anything we can fathom, but He has bound Himself by His character. And His character, proclaimed by Elihu and written throughout the Scriptures, is steadfast and faithful love, justice, and abundant righteousness.\n\nThe answer to the question, Can we trust God in our suffering? is yes, because of His abundant righteousness. Yes, because of His perfect will and His unbreakable commitment to His people, to us.\n\nThe psalmist wrote:\n\nI wait for the LORD; I wait\nand put my hope in his word.\nI wait for the Lord\nmore than watchmen for the morning—\nmore than watchmen for the morning.\nIsrael, put your hope in the Lord.\nFor there is faithful love with the LORD,\nand with him is redemption in abundance (Psalm 130:5–7).\n\nWe can wait, and we can hope, even in the deepest suffering, because there is faithful love and redemption in abundance in the arms of our good Father.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day23.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 34:1-37, Job 35:1-16, Psalm 28:1-9, Psalm 55:16-17",
        "devo_title": "Elihu’s Appeal to Wisdom",
        "devo_summary": "\n\nBy Melanie Rainer\n\nWhen I was a child in Sunday School, someone once told me that God answers our prayers in three ways: with a “yes,” a “no,” or a “not yet.” To be clear, I don’t think God’s answers are nearly as neat and tidy as that. His ways are mysterious, far bigger and more cosmic than we could ever perceive. As I look back on that teaching now, I wonder, What about when He just doesn’t answer? or What if His “answer” comes as painful, intense, soul-crushing silence? As for Job, he begins to wonder if God even hears him: “If only I had someone to hear my case! Here is my signature; let the Almighty answer me” (Job 31:35). But Job is not the only figure in Scripture who felt the absence of God.\n\nIn John 11, Jesus delays going to heal His friend Lazarus, who then dies. In response, his sister Martha tells Jesus, “Lord, if you had been here, my brother wouldn’t have died” (v.21). Martha had sent for Jesus, and His delay was silence in her ears.\n\nIn Psalm 13, David cries out, “How long, Lord? Will you forget me forever? How long will you hide your face from me?” (v.1). But in Psalm 55, David speaks with confidence that God really does hear him, even when he feels alone: “I complain and groan morning, noon, and night, and he hears my voice” (v.17).\n\nIn these chapters from Job, the young counselor Elihu is responding to Job’s cry for God to answer. He challenges Job’s pride, suggesting that God’s silence is in response to Job’s pride-filled assertions that he is righteous and does not deserve his situation. Elihu isn’t exactly compassionate toward Job, but he does speak some important truths about God.\n\nSometimes God is silent. Sometimes He speaks. But He is always just, the standard of all that is good and holy and right. He is the Almighty, the all-knowing, the only Author and Creator and Sustainer of our faith. As Elihu says, “It is impossible for God to do wrong, and for the Almighty to act unjustly” (Job 34:10).\n\nReading through the book of Job, this question has come to me again and again: Do you trust Him—even when He seems silent? My honest answer is that I try, but most of the time I fail.\n\nI see myself in Job, as he protests, “But I did everything right!”\n\nI see myself in Martha, blaming Jesus for not doing exactly what she wanted Him to do.\n\nI see myself in David, crushed by sin and desperate to see the Lord.\n\nIn all things—even His silence—do I trust that He still holds all things together? After all, He is God, and I am not. Therefore, “when God is silent, who can declare him guilty?” (Psalm 55:17). He does not answer to us.\n\nSo do I trust the One who spun out the stars, who exhaled Creation and all its glory? Do I trust the One who was born into the dark and cold, who wept blood in Gethsemane, who died a brutal death for me? My only response to His love is to offer mine in return, despite what I see or understand. I believe that one day, I’ll stand before my God in perfect peace, and all the fear and unbelief will be gone. Until then, His Word tells me that He is worthy of my hope and trust. He hears my cries and is not indifferent to my suffering, even when He seems silent.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day22.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 32:1-22, Job 33:1-33, Psalm 118:8, Mark 12:28–31",
        "devo_title": "Elihu Speaks to Job’s Condition",
        "devo_summary": "\n\nBy Andrea Lucado\n\nI recently had a conversation with a friend who is facing a trial at work. A co-worker spread a false rumor about her, and now my friend must defend herself and her character to her boss. We talked about how lonely and powerless the business of defending oneself can be.\n\nAt this point in Job’s trial, prosecutors Bildad and Eliphaz are winning. Although they have no evidence, they have made a strong case that Job has sinned and earned the punishment he is now suffering. Job has done his best to be his own defense attorney, defending his character to his prosecutors as well as to God. But his case is weak in the face of his dire circumstances, and the verdict seems to be leaning one way: Job has done something to deserve this punishment.\n\nEnter Elihu. Young in years but wise in spirit, Elihu pauses the impending verdict and suggests another way: “If there is an angel on his side…to be gracious and say, ‘Spare him from going down to the Pit; I have found a ransom’” (Job 33:24–25).\n\nAfter reading those words, I breathed a sigh of relief. Finally someone is suggesting that Job doesn’t have to do anything to get himself out of this situation. He doesn’t have to plead with God or somehow correct the unrighteous behavior we still have no proof of. There is a third way in the form of ransom.\n\nElihu speaks of a gracious and loving God in these chapters, one who is willing to forgive, keep us from death, and ultimately restore us to righteousness (v.26). This is the God I have come to know through Jesus Christ, who is more than an angel—He is my Savior.\n\nWhereas both Job and my friend were innocent, the case brought against me is true. I have done wrong. I have sinned. There is no defense I could muster against that prosecution. Yet, by the blood of Christ, I have received the same ransom Elihu suggests here. Jesus is my defender so that I don’t have to defend myself.\n\nBecause of the life, death, and resurrection of Christ, Elihu’s hypothetical scenario is our everyday reality. We have a defender. We have a good Judge who has restored us to righteousness. Because of this, we walk in grace, not judgment. And we step forward without fear, knowing that when we one day see His face, it will be “with a shout of joy” (v.26).\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day19.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 30:1-31, Job 31:1-40, Psalm 42:4, Matthew 27:45–46",
        "devo_title": "Job Speaks About His Condition",
        "devo_summary": "\n\nBy Andrea Lucado\n\nAs if Job’s suffering isn’t enough, he must now endure the scorn of onlookers, men who spit on him and openly despise him, simply for the suffering that’s befallen him. Worse, these onlookers were once far beneath Job on the social, economic, and moral ladder (Job 30:1). Now, they’re mocking him. Job falls into a unique type of despair caused when you are suffering but those around you are not.\n\nNo one was literally spitting on me, but I have certainly experienced scorn for my suffering from those around me. I experience it most on social media. Whenever I see a friend post about something she has that I don’t, but wish I did, I feel the scorn. A husband, a child, another book coming out—posts about these things can strike a sensitive nerve in me, a place that quietly suffers from loneliness, longing, and lack. Because of this, a simple engagement announcement, wedding photo, or book-cover reveal can feel like torture to my heart.\n\nUnlike the wicked men in our reading today, this mocking is completely unintentional on the part of my friends, but it still has the power to deepen my despair, not only because comparison is the thief of joy, but because the voice of the mockers convinces me that I am alone in my suffering. Everyone else’s life seems to be moving along according to plan. Mine is not.\n\nI wonder if Satan sent the mockers to Job, and I wonder if he did so knowing how frail we humans are in the face of loneliness. Suffering is difficult. Suffering alone is unbearable.\n\nPerhaps this would be Job’s tipping point. I would have understood if it was, but Job still cries out to God. It is a despairing cry, but a cry nonetheless: “I cry out to you for help, but You do not answer me” (Job 30:20). His words foreshadow the ultimate cry of despair when Christ hangs on a cross and asks, “My God, my God, why have you abandoned me?” (Matthew 27:46).\n\nChrist suffered. Christ was mocked in that suffering. Christ felt forsaken by God. All of Christ’s work and ministry led to those hours of scorn on the cross. And yet, I continue to sit in my suffering, I look at the thriving lives of those around me, and I convince myself I am alone when the exact opposite is true.\n\nThis is why the companionship of Christ and the knowledge of His suffering are so important to hold onto in our darkest times. If we do not listen first to these truths, we will only hear the voices of the mockers telling us we are alone.\n\nBut you are not. We are not. Not in this. Not ever. Jesus has cried out on our behalf, and because of Him, we are not forsaken, not abandoned, and never forgotten in our suffering.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day18.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 28:1-28, Job 29:1-25, Proverbs 1:7, 1 Corinthians 1:28–31 ",
        "devo_title": "Where Is Wisdom Found?",
        "devo_summary": "\n\nBy Andrea Lucado\n\nI have a new addiction, and it’s called YouTube. A couple of weeks ago, my doctor prescribed a new diet for me. I got on YouTube to see if anyone had tried it and had any meal ideas. Approximately two-hundred million people have and they do. I watched approximately two-hundred million of their videos. Each day I visit again, hoping to learn more.\n\nThere’s nothing wrong with looking up a recipe on YouTube, but when forty-five minutes have passed, and I’m still watching people talk about “What I Eat in a Day” or “How I Grocery Shop,” it could be that I am looking for more than a simple recipe. Like the gold and silver miners Job describes, I am probing the “dark recesses” for something valuable.\n\nIn today’s reading, Job describes the difficulty of finding and attaining wisdom. According to him, wisdom is invaluable, almost impossible to find, and only known to God (Job 28:20,13,23).\n\nThe way to wisdom. That is the ultimate aim of my search. To know what is good, right, and wise. And yet, I am looking for it in the wrong place. I am mining for gold, not wisdom.\n\nDo you know what happens after I spend forty-five minutes watching videos of chefs and health gurus? I don’t actually get more knowledgeable. I get more confused. With so many different opinions about what to eat and when, I don’t know whose voice to heed.\n\nJob’s quest for wisdom does not lead him to a certain location or web address. It leads him to Almighty God: “The fear of the Lord—that is wisdom. And to turn from evil is understanding” (Job 28:28).\n\nThough the internet will convince us otherwise, as Christ-followers, we have access to this wisdom and understanding. As Paul told the church in Corinth, “But it is from Him that you are in Christ Jesus, who became God-given wisdom for us” (1 Corinthians 1:30).\n\nChrist is the physical manifestation of God-given wisdom, and with our knowledge of the Word and by the power of the Holy Spirit, we have access to this wisdom. The Gospels tell us how Jesus ministered, prayed, made decisions, and treated others. The Holy Spirit indwells us so that we can discern how to use Christ-like wisdom in our everyday lives.\n\nGod-given wisdom does not leave us confused. It does not make us question whose voice to heed or what to do. God-given wisdom is clear. It is written in the Word, and it has been written on our hearts. This is why forty-five minutes spent reading the Gospels does not create the same angst and confusion as forty-five minutes spent online.\n\nAs we venture out on our quests for wisdom, let us seek true, God-given wisdom. Let us turn first to the life of Christ. For if He is in you, so is wisdom.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day17.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 25:1-6, Job 26:1-14, Job 27:1-23, Psalm 119:9–16, 1 John 1:8–10",
        "devo_title": "Bildad’s Third Speech and Job’s Reply",
        "devo_summary": "\n\nBy Andrea Lucado\n\nMy experience in the Christian life often feels like being on a train that’s traveling through the mountains. One minute the view out my window is crisp and clear. I am certain of how to do right in the eyes of God. But the next minute, I am in a tunnel, and the once-clear view goes dark. Life gets complicated, and I am not sure how to navigate it in a righteous way. In these times, I have often asked the questions that Bildad did: “How can a person be justified before God? How can one born of woman be pure?” (Job 25:4–5).\n\nInstead of directly answering Bildad’s question, Job replies with a list of acts that exemplify God’s power: “By His power He stirred the sea… By His breath the heavens gained their beauty” (Job 26:12–13). Similar to our reading from yesterday, it seems that Job is asking a better question now. Instead of how—How can man be righteous?—he asks who—Who is God? These questions might seem unrelated, but one must be asked before the other can be answered.\n\nA few years ago, during a tunnel season of intense anxiety, I felt like I could not see up from down. I wasn’t sure what I was doing right and what I was doing wrong. Thinking and analyzing my way through things wasn’t working; it simply increased my anxiety. Finally, I turned to what I knew. Each morning, I wrote down five things I knew to be true about God, even if I only believed it that day. I scrawled truths like, He is fighting for me. He is my Creator. And eventually I began to write, He is good.\n\nThis was not a quick fix for my anxiety, but it helped me weather the season until I came out the other side, and it taught me that when it comes to our own righteousness, the question is not how but who. When I am asking what to do, what is right, I need a friend to tell me, as Job told Bildad, “I will teach you about God’s power” (Job 27:11).\n\nThis is where our rightness begins, with a God who loves us, and in that love sent His Son to make us righteous. If we stand any chance of doing good on this earth, our actions must be motivated and sustained by that love—the love of Christ and of the Father who sent Him. It is the who that makes us good, not the how. And while the how may change as we grow and learn in faith, the who never does. The truth of Christ remains the same.\n\nMay we rest in God’s goodness today and let go of the quest for our own. For in the end it is all by His power; it is all by His breath.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day16.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 22:1-30, Job 23:1-17, Job 24:1-25, Romans 8:1-2, Galatians 6:7-10",
        "devo_title": "Eliphaz’s Third Speech and Job’s Reply",
        "devo_summary": "\n\nBy Andrea Lucado\n\nIn Eliphaz’s third and final speech, he accuses Job of wickedness. Grasping for a reason behind his friend’s suffering, Eliphaz must believe his friend has done something to deserve this. If he hadn’t, surely God would not have allowed this amount of suffering to befall him.\n\nHow quickly our faith reduces to a formula when in crisis. If I do good works for God, God will bless me, right? Job knew that no matter what he did or did not do, God “is unchangeable, who can oppose Him? He does what he desires” (Job 23:13). Which leaves us wondering, if the outcome will always be the same, why even bother with trying to do good?\n\nI recently moved into a house with a newly remodeled kitchen. It is neat and pristine on the surface, but I have learned that the pipes beneath it are not. Previous owners committed the cardinal sin against sinks. They put grease down the drain, and now I’m dealing with a clog.\n\nAs several different plumbers have come in and out of my home, I have learned that a beautiful kitchen is worthless if the pipes are bad. When it comes to kitchens, it is only what’s beneath the surface that allows everything to function, flow, and thrive. When it comes to us, it is the same.\n\nTo the church in Galatia, Paul wrote, “For whatever a person sows he will also reap, because the one who sows to his flesh will reap destruction from the flesh” (Galatians 6:7–8). For whatever a man puts down the drain, he will also see it come up again.\n\nGod cares about our good works, not because they affect His will—He is unchangeable, who can oppose Him?—but because they affect who we are. As Paul continues, saying, “the one who sows to his flesh will reap destruction from the flesh, but the one who sows to the Spirit will reap eternal life from the Spirit” (v.8).\n\nWe must not get tired of doing good, not because our good deeds will lead to good circumstances, but because sowing goodness leads to a life of trusting in the Spirit—the type of life that can withstand trials with faith.\n\nJob seems to have the opposite problem of my kitchen. His life is in shambles, his kitchen a disaster zone, but the plumbing is clear. He is asking why, as we all would, but he is also asking a better question: where? Where is God in the struggle? “If only I knew how to find him,” he pleads, “so that I could go to His throne” (Job 23:3).\n\nThrough our great High Priest Jesus Christ, we have direct access to the throne room Job seeks. Because of this, although we can’t always be confident of the why, we can be confident of the where. Where is God in our suffering? Right there with us in the midst of it.\n\nWhatever suffering befalls you today, know that God is near. And His Spirit is allowing you to do good, so that even if your physical life is in shambles, you can be confident the life inside of you is eternal. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day15.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 20:1-29, Job 21:1-34, Psalm 37:34-36, 2 Peter 3:9-13",
        "devo_title": "Zophar’s Second Speech and Job’s Reply",
        "devo_summary": "\n\nBy Elaine A. Phillips\n\n“Why do bad things happen to good people?”\n\nThis is a question we’ve all asked at some point in our lives. And up until this point in our reading of Job, it’s been the essential question. In other words, how else could Job’s excruciating circumstances be explained here, “on the ground”? (Job 1:20). No one sitting around Job had access to the heavenly scene you and I read in chapters 1 and 2, so how else were they to understand the human wreckage sitting right in front of them? As far as Job’s friends were concerned, the only possibly explanation was that Job must have committed some egregious sin.\n\nJob and his friends did have the same fundamental theological framework. With this in mind, they reasoned that if people are good, they can expect God to be good to them in return. (This also sounds an awful lot like a message from today’s culture.) Sinful behavior, on the other hand, results in disastrous consequences. (We see this laced throughout God’s instructions at Sinai, emphasized by the prophets, and threaded throughout later books as well.) But this a human expectation. We believe life is supposed to be fair. Turns out, it’s not—which is why we hear the steady drumbeat of this question throughout Job: “Why do bad things happen to good people?”\n\nIn this chapter, that question gets turned somewhat on its head, inverted: “Why do good things keep happening to bad people?” Why are some wealthy and seemingly untroubled while others struggle day in and day out? In our cultural terms, we wonder how someone can afford to travel abroad to exotic places while others have to work three jobs, struggling to keep food on the table. Why do some people seem to lead such peaceful lives? How do some get away with blatantly rejecting God? None of it seems fair.\n\nZophar’s emphatic response was this: the sinful may lead lives that look just peachy on the outside, but it’s all fleeting (ch. 20). Those who mistreat the poor and greedily hoard everything in sight—in the end, they will be crushed under God’s judgment and end up in the terror of utter darkness. Job’s response to this? Basically, “Yeah, right.” From what he had seen, the lives of immoral people were often golden. Their families were fine, they lived in security, and they were prosperous.\n\nLetting the wicked get off scot free is not justice, Job reasoned. Most of us would agree with him, I suspect, as we watch all kinds of contemporary injustices parade across our television screens daily. But Job’s observations—while spot-on, to be sure—are not the only perspective. Scripture gives us another view, another way to regard the wicked who seem to flourish in this world. As the psalmist declared, it is only for a season. Those who wait on the Lord, those who hope in Him, will see justice (Psalm 37:34–36). And it is in the waiting that we, like Job, must trust in God and His righteous character, rather than trusting in what we perceive with our own eyes.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day12.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 18:1-21, Job 19:1-29, Isaiah 50:7-10, John 3:17-18",
        "devo_title": "Bildad’s Second Speech and Job’s Reply",
        "devo_summary": "\n\nBy Elaine A. Phillips\n\nIn the wake of Bildad’s second speech (Job 18)—a terrifying description of the darkness, entrapment, and utter destruction awaiting the wicked—Job lamented. He returned his focus once again to how God had destroyed him in every way. He mourned his lost hope and the feeling of being trapped in his circumstances (Job 19:10,12). He lamented that he was a physical wreck and that all of his household—relatives, guests, servants, and even his own wife—now despised him (vv.13–19,20).\n\nIn other words, Job’s extreme suffering continued. But now it was interlaced with crushing social abandonment. Nevertheless, what Job said next stands as a radical alternative to despair:\n\n“But I know that my Redeemer lives” (v.25).\n\nA “redeemer” was a family member who bought back persons or property that had been lost to the family due to poverty. We know the practice well from the selfless action of Boaz, when he redeemed the property of Naomi’s family and married the widowed Ruth. We know of the redemption and deliverance of God’s people Israel from their enslavement in Egypt. And we remember how Isaiah repeatedly called the Lord “God of Israel,” “the Redeemer,” and “the Holy One of Israel.”\n\nJob’s own declaration about God is woven within this same rich tapestry of faith. Having just said that his own relatives, or “kin,” had completely deserted him, Job fully affirmed that his “kinsman-redeemer,” his God, would not fail to rise up to vindicate and buy him back. “But I know” tells us something about Job’s confidence in God—so much so, that he asked that his words be inscribed as a witness for the future (vv.23–24)—and so they were!\n\nJob’s profound vow of hope continues on as he proclaims that he will see his Redeemer:\n\n“Even after my skin has been destroyed,\nyet I will see God in my flesh.\nI will see him myself;\nmy eyes will look at him, and not as a stranger.\nMy heart longs within me (vv.26–27).”\n\nPerhaps he was echoing the symbolism of dust from Genesis 3, or maybe he anticipated restoration from his present illness (2:8;7:5). Regardless, his words are telling: he knew God would remain faithful. The bottom line is this: Job affirmed that he would see God. He was clinging to the truth that he knew. Seeing his Redeemer was what Job wanted more than anything else, and indeed he did, as we will read later in the book (ch. 38–41).\n\nThe beauty of this beloved passage lies in a paradox. On one hand, we see the ambiguity of never really knowing how or when our pain, suffering, and weariness will end. But on the other, we see Job’s fierce, unwavering hope. Hope compelled him forward, re-anchoring and recentering him to his faith. May we learn to do the same. Let us trust in the name of the Lord, relying on Him alone (Isaiah 50:10).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day11.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 15:1-35, Job 16:1-22, Job 17:1-16, Romans 12:9-15, James 5:8-11",
        "devo_title": "Eliphaz’s Second Speech and Job’s Reply",
        "devo_summary": "\n\nBy Elaine A. Phillips\n\nHow many times has some very well-meaning person tried to assuage your heartache with words, saying something along the lines of this: “God will comfort you and see you through this. He always does.” Or this: “Just hang in there. Evil people always get what they deserve.”\n\nLook closely, and you’ll see those two sentiments are basically parts of Eliphaz’s second conversation with Job. So why are they a problem? Well, for one thing, the latter suggests that Job must be evil too—why else would he be suffering badly? Their conversation leads to the question: How do we truly weep with, mourn with, and comfort those who are broken? How do we become true comforters? (Romans 12:15).\n\nFirst, we need to read and truly absorb Job’s scorching honesty in chapters 16 and 17, where the stakes are even higher. Just a reminder: God refused to allow Satan to take Job’s life, which means Job’s torment was as bad as it could possibly get with no relief anywhere, falling just short of death—and Job couldn’t exactly turn to morphine to numb the pain. So now the question becomes one of self-reflection: If we are the ones in the fiery furnace, how do we cling to our relationship with God when it feels as if it is all going up in smoke?\n\nThese two questions are tied together, because those who weep and mourn most effectively will have climbed into that fiery furnace of suffering in some way. In doing so, they join the “Jobs” of the world. So for both situations, we wonder:\n\n• What does true faithfulness look like, both for the one who comforts and the one who suffers? n• What part does prayer play in our suffering? n• What does it mean to bring all our emotions—even our anger, doubt, and feelings of betrayal—before God?\n\nAfter all, Job’s protests were laced with accusations. If his suffering teaches us anything, it is to strip away all pretenses—physical and spiritual. God had worn out and torn up Job, seized him by the neck and dashed him to pieces to the point that Job’s face was red from weeping (Job 16:7–9,12,16). His dark anger boiled over in agonizing questions, as he protested the stony silence of God.\n\nStill, more than anything else, Job longed for his shattered relationship with God to be mended. He’d already sought out a mediator to bring them together (9:33–35; 16:21). He also repeatedly begged to talk with God—which he ultimately did in the most extraordinary of circumstances. Most importantly, Job returned to this understanding: his “advocate” and “witness” were set apart on high (16:19). Job remembered who he was and who he was not—he was not God. All of this points to Job’s faithfulness and his very real relationship with God.\n\nSo how do we sit with someone in their despair? How do we pray in the midst of others’ suffering, as well as our own? In my own experience, words like “Lord have mercy! Christ have Mercy!” bring me back to the truth of God’s character, of both His unfailing lovingkindness and ultimate sovereignty through Jesus Christ. Our Savior reaches through our blinding pain to comfort and deliver us. Our prayer for mercy, offered with humility and hope, binds us together before the God who comforts, even from on high.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day10.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 13:1-28, Job 14:1-22, Psalm 71:19-21, John 5:24-25",
        "devo_title": "Job Challenges the Advice of His Friends",
        "devo_summary": "\n\nBy Elaine A. Phillips\n\nWhere does Job’s hope lie, and where does our own?\n\nPause for a moment to reflect back on one of your darkest times. Perhaps you tossed and turned for sleepless nights, futilely attempting to unravel the tangled web created by bad decisions. Perhaps you agonized over a bitter and angry child. Perhaps physical pain incessantly pierced and jabbed at you. Perhaps… Perhaps. No matter what our individual calamities, each one of us has been (or will someday be) there with Job, drained of strength and courage to face even the next hour. Where can we turn? Where can we place our hope? And how?\n\nWe may have to venture outside Job chapters 13 and 14 to knit together those slender strands that constitute hope, especially in the midst of the unrelenting pain that chews away at every part of our lives. At this point in his terrible journey, Job contrasted human hope (quite unfavorably) to a chopped down tree. Even though the tree had been destroyed, it sprouted again when watered—not so, with those who sleep in death (14:7–12). With great courage, Job had previously declared that he was prepared to defend himself before God, knowing full well that no godless person could stand in His presence (13:15–16). But like most of our courageous statements, Job’s expectations faded almost as quickly as he spoke them. He was back in the gloom of his torment and suffering. For Job, the steady and irreversible disintegration of mountains and rock in the natural world were a fitting metaphor for the erosion of his hope (14:18–19).\n\nOf course, that is not the end of Job’s story—or ours. We affirm with saints through the ages that our faithful God does restore our lives and comfort us in our pain (Psalm 71:20–21). We believe we will be carried through the deep waters and the ravaging fire (Isaiah 43:1–2). We hold fast to the hope that Jesus is the resurrection and the life (John 11:25–26). And we believe God has the power to do all He’s promised to do (Romans 4:20–24). This means that if we are in Christ Jesus, we have crossed over from death to life—even now! (John 5:24–25). Did you catch that? It’s a truth worth repeating, this time with the apostle Paul’s words, who tells us that right now, this very moment, we are seated in the heavenly realms with Jesus (Ephesians 2:6).\n\nHow do we respond? I confess I’m tempted to be a bit skeptical from time to time. You too? Thankfully, there is another path on which to set out at this point. Even from the crucible of our suffering and discouragement, we can take up the mantle of the psalmist. We have the privilege of declaring God’s goodness, of proclaiming the richness of God’s immeasurable and precious grace, and of being increasingly thankful (Psalm 71:14–18). Gratitude trumps grumpiness—every time, in all circumstances. The Apostle Paul affirmed that as well, saying, “Give thanks in all circumstances, for this is the will of God for you in Christ Jesus” (1 Thessalonians 5:18).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day9.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 11:1-20, Job 12:1-25, Proverbs 4:18, 1 Peter 2:21-25",
        "devo_title": "Zophar’s First Speech and Job’s Reply",
        "devo_summary": "\n\nBy Elaine A. Phillips\n\nHere’s a question: Can anything good come out of the mouths of Job’s friends? I don’t know about you, but I occasionally find myself thinking (dismissively), “Yes, but one of Job’s friends said that.” The subtext is that we can safely skim over what they said and then move on. The three friends, however, had some extraordinarily good theology; it just happens to have been misapplied.\n\nThe three “friends,” “comforters,” or whatever we label those well-meaning fellows, arrived from afar in order to weep, mourn, and sit silently with Job. Their intentions were noble—until they started to speak! After they sat silently with Job for a whole week, Job set them back on their heels with a deeply troubling lament. In response, the first two friends tried to cajole Job into confession and repentance, but he would have none of it. His response was to ask why God was so cruelly oppressing him, which had left him longing for the darkness of the grave.\n\nWhat do we say in response to that kind of raw pain? When we find ourselves in such circumstances, we stumble about, trying to be “meaningful” in our comforting. Toward that same end, Zophar ventured in, declaring that God is utterly transcendent and all-powerful beyond the highest heaven and the depths of the grave. This is true, but a gnawing question remains: how can we really wrap our minds (and hearts) around this majestic, sovereign transcendence of God? And then how do we talk about it, especially when we are face to face with seemingly interminable agony? How can we assure suffering friends that our God is both exalted far above all earthly powers and, at the same time, relentlessly and intimately loving? What comfort lies in that combination?\n\nZophar’s next words head down the path we so often take. Having professed the mystery of God’s ways, Zophar proceeded to speak for God, promising an array of hopeful results—if Job would just confess his sins!\n\nIt is no wonder Job was unimpressed. At the same time, he picked up on the most important part of what Zophar said and fleshed out his own perspective on it. Job indeed knew that nothing in God’s universe was outside God’s control, but he had come to know the dark side of that—devastation of land, degradation of the rich and powerful, whole nations destroyed and dispersed. The upshot for Job was that God was responsible for his suffering in that He allowed it. This is bold honesty. And that is where we need to be, frightening as it might actually be to say (and hear) these things. But we must remember that in the end, God affirmed what Job had said (Job 42:7–8). May that be a profound encouragement to us as we wrestle with how to express the truth of suffering.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day8.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 8:1-22, Job 9:1-35, Job 10:1-22, Nahum 1:3, Romans 3:23-26 ",
        "devo_title": "Bildad’s First Speech and Job’s Reply",
        "devo_summary": "\n\nBy Rebecca Faires\n\nOne of my kids got into trouble last week, and it was that kind of interesting trouble all the other kids love to talk about. Juicy trouble is everyone’s favorite kind of trouble. So his siblings talked, and he was furious at the humiliating injustice of being talked about. I overheard my husband trying to explain to him that if he had acted justly in the first place, the others would have nothing to say.\n\nMy little fella isn’t alone. We are all inclined to think that we are right and everyone else is wrong. We like our own version of justice. We are quick to condemn the faults of others and justify ourselves. But we cannot be our own standard of justice, because we are finite and fallen.\n\nThis is why it’s hard to understand the book of Job. Bildad’s perspective is more familiar than Job’s, because like Bildad, we redefine righteousness to suit our own ends and try to treat justice like karma. Want to know who has sinned? Look and see how they “got what was coming to them.” But justice isn’t karma. It’s a mistake to assume that when something good happens to us, it is because we’ve been good. When we hum along with The Sound of Music’s Fraulein Maria, saying, “Nothing comes from nothing… I must have done something good,” we are singing the same tune as Bildad.\n\nInstead of basing our outcomes on our actions, Job points out two things. First, justice is God’s, not ours: “Even if I were in the right, I could not answer. I could only beg my Judge for mercy” (Job 9:15). God is the righteous one. When He acts, no one can condemn Him. No one can contend with Him. This is uncomfortable, because we like justice to be defined our way.\n\nSecond, God is sovereign. Whether things go right or seemingly wrong for us, God is still in control. Nothing happens outside of His will. “If it isn’t he, then who is it?” Job asks rhetorically (v.24). We’ve already glimpsed into the heavens at the beginning of Job, where God gives Satan permission to torment a righteous man. God’s sovereignty is uncomfortable, especially when the wicked seem to succeed and the righteous suffer.\n\nSo we struggle with questions like these: “Does God pervert justice? Does the Almighty pervert what is right?” (8:3). The clear answer is a resounding “No!” God’s thoughts are higher than ours, and His ways higher than ours, and we cannot answer or contend with Him (Isaiah 55:8–9).\n\nLike Job, we want to know why God allows bad things to happen (Job 10:18). But there are a lot of things we don’t get to know in this life. It shouldn’t surprise us that we cannot fully comprehend the Almighty, that He doesn’t bow to our will. But there is good news: God is good, and we are safe in His care (v.12). We need not fear. When we, like children, don’t see the whole picture, we can still trust that God’s justice is good because He is good, and He cares for us.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day5.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 6:1-30, Job 7:1-21, Romans 8:18–25",
        "devo_title": "Job’s Reply to Eliphaz",
        "devo_summary": "\n\nBy Lisa Harper\n\nOne of my favorite lecture series from my first seminary experience (I’ve recently begun a second seminary adventure at the “mature” age of 55!) was about having a “high view” of God. We had lively discussions in class regarding how, in our modern era’s quest to make the gospel relevant, we’ve all but lost the kind of deep reverence prophets like Isaiah and psalmists like David displayed toward God. In our bumper-sticker theology, “God is my copilot” culture, we’ve unwittingly minimized the omniscience and omnipotence of the Alpha and Omega in an attempt to make Him more accessible.\n\nI remember being so convicted during those classes, realizing I didn’t revere God the way I should. I committed to being more circumspect in how I addressed Him in prayer and even how I carried His Word, holding my Bible as a precious treasure instead of carelessly shoving it into a suitcase or tossing it into the back seat of the car. I still hold to those convictions.\n\nHowever, as I look back over my walk of faith in the 20-plus years since that class, it’s clear I’ve often overcorrected, swinging into the opposite side of the doctrinal ditch. I didn’t always have the spiritual maturity to understand that having a high view of God doesn’t mean we need to have a degrading view of ourselves. Of course, humans are wicked and depraved apart from divine grace, but after we put our faith and hope in Jesus Christ, we’re allowed to shrug into His robes of righteousness, knowing we have been adopted into the family of God as full heirs! (Romans 8:14–17). A high view of God should open believers’ hearts and minds to what our heavenly Father says about us, His beloved children.\n\nNow, if we give Job’s three friends a big benefit of doubt, we can assume they had mostly good intentions when they delivered their self-righteous lectures. However, like a young seminarian armed with more head knowledge than spiritual maturity, their arrows missed the mark by a country mile!\n\nJob understands the situation well. He says, “What strength do I have, that I should continue to hope? What is my future, that I should be patient?… Since I cannot help myself, the hope for success has been banished from me” (6:11,13). Job cannot change his bleak situation, despite his innocence.\n\nBut that’s the point. Job’s friends recognized the frailty of humanity and our propensity to sin, but their view of God is way too small. Without the context of God’s redemptive grace, we still make everything about us! In Romans 8, Paul points to the future, complete redemption of all creation as our hope in the midst of present suffering. Though we are currently “subject to futility,” all things will one day be fully “set free from the bondage” into “glorious freedom” (Romans 8:20). This is our hope.\n\n“Now in this hope we were saved, but hope that is seen is not hope, because who hopes for what he sees? Now if we hope for what we do not see, we eagerly wait for it with patience” (Romans 8:24–25).\n\nJob’s friends got the frailty of humanity part right, but their concept of God’s attention missed His compassionate heart. The Lord was Job’s only hope, just as He is ours. With Christ, our mere humanity is transformed into glory befitting children of God, no matter what suffering we may be experiencing at the moment.\n\n\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day4.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 4:1-21, Job 5:1-27, Romans 5:1, 1 Corinthians 3:18-23",
        "devo_title": "Eliphaz’s First Speech",
        "devo_summary": "\n\nBy Lisa Harper\n\nSoon after my parents divorced, Dad remarried. Then, he moved out of the city to forty-two acres of flat, cactus-dotted pastureland in Central Florida to pursue his dream of becoming a cattleman-rancher. I loved helping Dad take care of our small herd, especially a solid black calf we named “Inky,” whose mama died while giving birth to him. I nursed Inky with a bottle until he got strong enough to fend for himself. But it wasn’t long before that baby Hereford bonded to me and no longer wanted to stay in the pasture with the rest of the cows. Instead, he followed me around like an oversized puppy, curled up and sleeping outside the house with the our pack of snoring dogs, who completely accepted him despite the fact that he mooed rather than barked.\n\nWhen my sweet baby bull was about a year old, Dad told me it was time to assimilate him back into the pasture with the herd. I cried, insisting that he didn’t know how to be a cow anymore because he’d become part of our family. But Dad gently encouraged me to think of what was best for Inky, and so I relented. Sadly, not long after we transitioned him from pet back to farm animal, a pack of rabid dogs attacked and killed several cows in the herd, including Inky. And while Inky was a yearling big enough to defend himself, he probably didn’t because he saw dogs as friends, not as potentially dangerous foes. I was inconsolable, devastated by the realization that had I not turned Inky into a pet, he might not have been savagely attacked and killed. My less-than-tender stepmother, however, was annoyed at my grief over a “stupid cow.”\n\nI was just an 11-year-old girl at the time of that mini-tragedy, but that’s when I learned that grief is not an inclusive emotion. Deep ache tends to be an isolating event, and despair tends to put uncomfortable distance between the heartbroken and observers—especially if those observers haven’t processed their own grief and loss. It reminds me of American poet Ella Wheeler Wilcox’s most observed and enduring line: “Laugh, and the world laughs with you; weep, and you weep alone.”\n\nJob certainly walked “the narrow aisles of pain” in solitude. Before the prologue of his story was even finished, he’d lost almost everyone who really mattered to him, except for his wife—who was more salt-in-his-wounds than a comfort at this point—and three so-called friends (Eliphaz, Bildad, and Zophar), a trio who quickly revealed their distaste for Job’s honest despair, distancing themselves from the awkward messiness of his grief with condescending admonitions. The low-blow gist of his loquacious buddy Eliphaz in chapters 4 and 5 is this: Job, you obviously have hidden sin in your life. That’s why you’re in this pit of destruction. So you may as well quit whining, because no one’s even listening to your prayers!\n\nWhen my stepmother callously referred to Inky as a “stupid cow,” she was technically correct; bovine creatures don’t have nearly as high of an intellectual capacity as humans. However, she was oblivious to the fact that I had a real bond with that baby bull, which is why she could so easily dismiss my grief as adolescent drama. And that’s essentially the chasm that becomes apparent between Job and his three miserable comforters. Not all of what they say to Job is technically wrong. In fact, most of what they say about God’s inscrutability is accurate in principle. But the spirit of their preaching is crooked because they ignore the fact that Job has a real relationship with God. And the messy, wildly honest grievances he airs actually prove the very real existence of that bond.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day3.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 3:1-26, Philippians 3:7–11, 2 Timothy 2:8–13",
        "devo_title": "Job’s Lament",
        "devo_summary": "\n\nBy Lisa Harper\n\nI once had a surgeon tell me I wasn’t a very good patient because I tried to “gut it out,” instead of being honest about the pain I was experiencing. Apparently, it’s hard on a healer when a patient masks their symptoms; making a diagnosis can become a bit like trying to shoot at a moving target.\n\nMy doctor believed my stubborn refusal to admit pain reflected my lack of trust in his competence as a physician. In Job chapter three, we see that Job is honest about his own pain, which is a clear indicator that he truly wants to be healed and trusts in the competence of the Great Physician. It would take me a long time to learn that instead of exacerbating a painful experience, honest tears and the acknowledgment of pain can actually serve as a soothing pressure relief valve.\n\nBy contrast, between the amped-up sensation of reality television, the shrieking discord of current political affairs, and the twenty-four/seven barrage of social media that has saturated our culture, it’s entirely possible for real trauma and suffering to go unnoticed and untended. We rush to triage emotional hangnails but completely ignore the people around us who are bleeding out. Silence doesn’t always indicate bravery, but it is a pretty good indicator that we might not notice when someone is truly suffering.\n\nJob’s outburst is a healthy reminder that our Redeemer doesn’t rank our emotions on a scale from good to bad, allowing only “good” emotions like joy and peace while barring “bad” emotions like grief and disappointment. We do not have to censor ourselves before the God who knows our hearts better than we do. Scripture doesn’t instruct us to smile on the outside while we die on the inside—just the opposite, in fact (see 1 Samuel 1). Frankly, I believe one of the biggest fallacies perpetrated in communities of faith is that the closer we get to Jesus, the more we need to keep a lid on it. Stoicism is not a spiritual gift, y’all!\n\nWe need to understand there’s a colossal difference between disagreeing with God and denying His existence altogether. Job cursed the day he was born and expressed confusion, frustration, and even anger, at God over allowing tragedy to befall him—but he did not reject God. In fact, the tormented exasperation Job hurls toward God proves that he is anything but an atheist! He knows God holds all things together.\n\nFaith powered by God can stretch us far beyond our own capacity to endure. Still, it’s not our anguish that distances us from God; it’s our apathy. The main takeaway from Job chapter three: we can and should continue to bring all of who we are—including our anger, confusion, and disappointment—before God. We can trust Him with every piece of our hearts.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day2.jpg"
    },
    {
        "book_title": "Job",
        "devo_passages": "Job 1:1-22, Job 2:1-13, Psalm 22:1-11",
        "devo_title": "The Setting of the Test",
        "devo_summary": "\n\nBy Lisa Harper\n\nDealing honestly, wisely, and compassionately with human pain is an integral part of our job description as followers of Jesus Christ. No one gets through this life unscathed. Everyone deals with pain and suffering at some level. If someone insists she hasn’t, she’s either lying, in denial, or has amnesia. And since God’s second most important command is for us to love our neighbors as we love ourselves, it behooves us to learn how to better comfort ourselves as well as our neighbors—both those we rub shoulders with daily, and also our global neighbors, who make up the lost and dying world we’re called to care for.\n\nBut let’s deal with the proverbial bull in the china shop, which is the fact that what happened to Job wasn’t what we like to think of as “fair.” I mean, goodnight! The very beginning of this Old Testament book describes Job as a really good guy who was doing really good things with his life. The mention of Job rising early to pray for his kids (Job 1:5) is a common Hebrew idiom denoting a conscientious habit, which means praying for his family was something he did consistently.\n\nReading about this righteous guy losing pretty much everything—his wealth, his health, and all ten of his children—it’s like biting into a warm brownie and breaking your tooth on a rock. This “divine test” is surprisingly unfair. Surely Job didn’t deserve such devastating loss.\n\nIn the New Testament, Jesus blows the idea of human deservedness right out of the water. In His Sermon on the Mount, He teaches that God throws fairness out the window to bless even the unrighteous (Matthew 5:43–45). In another place, He explains that bad things do indeed happen to good people (Luke 13:1–5). And in His parable about the workers in the vineyard (Matthew 20:1–16), He thoroughly deconstructs any notion that we can earn God’s blessings.\n\nThe bottom line is this: No matter how many Bible studies we’ve done, or meals we’ve served to the homeless, we cannot earn one of those immunity sticks like they do on Survivor. None of us can get “good enough” to shield ourselves and those we love from suffering. Job proves that “good” people, including people of faith, can and do experience horrific things through no particular fault of their own. And if you want to really blow your mental hard drive, reread Job chapter 1, which suggests that while Job’s faith was truly strong, it did not safeguard him from hardship (v.8).\n\nIn the economy of God, Job’s suffering was an honor, a privilege. After all, “should we accept only good from God and not adversity?” (2:10). Our Creator and Redeemer handpicked Job for the honorable position of carrying the weight of pain. While God is not the author of evil (Psalm 5:4), He did choose Job with the foreknowledge that he would carry suffering well, because even our pain is a great conduit for God’s glory.\n\nCan you imagine how different our lives could be if we began to view some of our pain and disappointment as a divine privilege? What if we saw a difficult journey as one God handpicked us to take, knowing that He Himself would strengthen us to make the trek, and more importantly, that His glory would be illuminated through our efforts? Changing our perspective on suffering—viewing it as an honor instead of dumb luck or cruelty—could absolutely change the course of our lives and deeply impact the world around us.\n\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/SRT-Job-Instagram-Day1.jpg"
    }
]