[
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Jude 1:1-25",
		"devo_title": "Chapter 1",
		"devo_summary": "",
		"img_url": ""
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 1:1-20, 1 Corinthians 15:54-57, 1 Thessalonians 4:13-17 ",
		"devo_title": "The Living One",
		"devo_summary": "\n\nBy Sharon Hodde Miller\n\nWhat do you do when God’s plans for your life unfold differently than you expected? \n\nThis question arises again and again throughout the Bible. Abraham is promised descendants, but then his wife is barren. Joseph is promised leadership, but then he is thrown into a pit. The disciples are promised a Messiah, but then He is arrested and killed.\n\nOver and over throughout the Bible, God’s people live in a tension between the promises of God and the reality of their present circumstances, and this tension is the context of Revelation.\n\nPrior to the writing of this book, the world had experienced an unprecedented outpouring of the Spirit of God. People saw miraculous signs and wonders. The gospel spread like wildfire. Thousands came to Christ. Lives were changed. It all must have felt fast and furious and wonderful.\n\nAnd then, as if someone had slowly turned off the faucet of God’s power, the revolution seemed to stall. In its place, persecution. Roman authorities increasingly pressured Christians to worship Caesar or face severe punishment. The hostility toward Christians intensified, and this left them wondering: \n\nWhere was God?  What happened to His promises? Is Jesus still coming back?  What do we do now?\n\nSooner or later, we all find ourselves in this place of uncertainty. We wonder if we misheard God or if we did something wrong to provoke Him—or if He is even there at all. And in this place of tension, it’s tempting for doubt to become our compass, instead of faith.\n\nThis is where the book of Revelation begins. The people of God are struggling, and the mission feels unclear. As a result, some Christians are compromising the truth of God’s Word and caving into the culture. Some are disobedient, while others are simply lukewarm. So God reiterates His promises with a “revelation” to John that is glorious and startling and surreal.\n\nIt’s easy to get lost in the imagery of this book, but the first chapter of Revelation holds the key. All we really need to know of “the First and the Last” (v.17) is that Jesus Himself is the definitive “revelation” for the world. Everything we need to know about God, we know through Christ. Everything we need to know about our past, we know through Christ. Everything we need to know about our future, we know through Christ. \n\nNot an inch of God’s Word or God’s plan is out of character with the Son of God, and this is the lens through which we should read everything contained in Revelation. It is tempting to be dogmatic about the meaning of these abstract images, but the point of this book is simple: to direct our trust toward the “Living One” who was dead and is now “alive forever and ever” (v.18).\n\nThis truth about Jesus—about His life, His death, and His resurrection—does not change with our circumstances or with our doubts. It holds. Whatever may come, Jesus is our unstoppable hope, from first to last. That is the message of Revelation, and the message for our lives.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day1-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 2:1-29, Revelation 3:1-22, Matthew 22:34-39 ",
		"devo_title": "The Seven Churches",
		"devo_summary": "\n\nBy Sharon Hodde Miller\n\n“Things are getting worse and worse.”\n\nWhen we look at the news, the culture, the entertainment, and even the Church today, it’s easy to feel as if everything is slowly getting worse. It’s tempting to believe that the world is gradually unraveling, and that we are moving further away from truth, instead of toward it.\n\nWhenever we feel this cynicism begin to creep in, the temptation is to idealize the generations that have gone before us. We think, Our parents’ generation, our grandparents’ generation, the earliest Christians—they had it all together. Things weren’t as bad back then!\n\nI struggle with this mentality often. There are days when I feel jaded about Christians and about the Church. I log onto social media and see division and in-fighting, or I read about a pastor failing his congregation and his family. I see name-calling and judgment and the drawing of big, deep lines, and my heart wants to harden toward it all.\n\nOn those days when we are tempted to dismiss the world with a flick of the wrist, when we find ourselves looking down on other Christians who “aren’t doing it right,” and when we despair that the Church’s reputation is hopelessly smeared, Revelation 2–3 has a word for us.\n\nIn these chapters, written just a generation after Jesus’s resurrection, many churches are distracted and lost. Although they are working hard and striving to be faithful, God also levels the following charges against them: \n\nThey had forsaken their first love (2:4).\n\nThey participated in pagan rituals (2:14).\n\nThey were sexually immoral (2:14).\n\nThey embraced false teaching (2:15, 20).\n\nThey had a reputation of being alive, but they were dead (3:1).\n\nThey were lukewarm, neither hot nor cold (3:16).\n\nAll this, only sixty years after Jesus walked the earth.\n\nWhat this tells us is that the world is not simply getting worse, and neither is the Church. Following Jesus has always been hard. Faithfulness to God has always come unnaturally. Ever since sin entered the world, human nature has found it difficult to obey. \n\nAnd that is exactly why we need a Savior. \n\nThe good news of Jesus Christ begins with the bad news that we are broken. We have always been distracted. We have always resisted the truth. It was true two thousand years ago, and it is just as true today. Therefore, these letters to the seven churches in Asia minor are important for us as well. “Let anyone who has ears to hear listen to what the Spirit says to the churches” (Revelation 2:29).\n\nBut our brokenness has never stopped God. Our division, our fighting, our apathy, our immorality, even our bad theology—none of it has ever stopped God. So when we read Revelation 2–3, we can do three things. First, we can remember that humanity is not getting worse, and neither is the Church—the temptation to turn away from God and His ways has always been there. Second, we can welcome this list of rebukes as an opportunity to identify our own areas of need. \n\nAnd finally, we can hope. In Revelation 3:19, God says, “Those whom I love I rebuke and discipline” (NIV). When we see darkness in the world—no matter how great—we don’t have to despair, and our hearts don’t have to grow hard. Instead, we can consider the possibility that God is allowing us to see these things, so that He can redeem them. \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day2-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 4:1-11, Revelation 5:1-14, Isaiah 6:1-6, Ezekiel 1:26-28",
		"devo_title": "The Lamb Is Worthy",
		"devo_summary": "\n\nBy Sharon Hodde Miller\n\nOne of my sons’ favorite bedtime stories is The Sword in the Stone. As a child, I grew up watching the animated version of this tale, in which a lanky, awkward boy named Arthur unwittingly prepares to become king. Set in twelfth century England, the legend describes a country in turmoil, where the king has died without an heir to take his place. In order to resolve this dilemma, a wizard named Merlin places a sword in an anvil with the following words inscribed upon it: “Whoso pulleth out this sword of this stone and anvil, is rightwise King born of all England.”\n\nAs the story goes, plenty of strong men and mighty warriors attempt to remove the sword, but every one of them fails. That is, until Arthur. This young, scrawny, misfit approaches the sword and is able to pull it from the anvil, finally restoring order to the kingdom.\n\nThe legend of Arthur is only a myth, but it echoes a story that is not. In chapters 4 and 5 of Revelation, we encounter a similar scene, but in place of a sword we have a scroll (5:1). We don’t know what exactly is inside the scroll, but New Testament scholar N.T. Wright speculates: “We rightly guess… that it contains God’s secret plan to undo and overthrow the world-destroying projects that have already gained so much ground, and to plant and nurture instead the world-rescuing project which will get creation itself back on track in the right direction.”\n\nMuch like the sword in the stone, what is significant about the scroll is not simply what is inside of it, but Who is able to unseal it. Like the sword, there is only one who is worthy to unleash its power. That chosen one, we soon discover, is Jesus—the “Lamb,” the “Root of David,” the “Lion from the tribe of Judah” (5:6,5). Christ alone can initiate God’s plan to rescue and redeem the world. \n\nThat is how the two stories are similar. This is how they differ:\n\nIn The Sword and the Stone, Arthur does nothing to earn the title of king. Although legend holds that he was secretly a royal heir, Arthur’s worthiness (much like Abraham, Moses, and David) comes solely from the fact that he is chosen for the task. He does not earn it, and he does not deserve it.\n\nChrist, on the other hand, is a different kind of hero. He is not simply plucked from thin air. Instead, the Lamb is worthy for two important reasons. First, He is worthy to redeem the brokenness of the world because He is the only one who did not contribute to it. And second, He is worthy to rescue humanity because He purchased us by His blood (5:9). \n\nUnlike most of our favorite heroes, Jesus was not chosen in spite of Himself. Even our greatest heroes, our noblest heroes, our most perfect heroes are still only a shadow of the Hero we have in Christ. By virtue of His identity and by the power of His blood, He alone is able to open the scroll and initiate God’s plan to redeem the world.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day3-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 6:1-17, Revelation 7:1-17, Psalm 13:1-6, Ephesians 1:11-14",
		"devo_title": "How Long, O Lord?",
		"devo_summary": "\n\nBy Rebecca Faires\n\nEvery year, wildfires break out on America’s west coast, decimating forests and grasslands, threatening homes, and turning the sunset skies into a haze of pink. The power of fire is terrifying and awesome, and we’ve all seen the danger it poses to homes and lives in its path. While fire holds a mighty power for destruction, the land on the west coast actually needs a certain amount of these fires; they clean forest floors, pare down the plants that consume the water, kill plant diseases, and release seeds from trees that require fire to start the next generation. Don’t let the power and terror of fire mask the severe good that it serves.\n\nThe coming of God’s judgment is a terror to the wicked, but it is a comfort to His children. God’s judgment is not blind punishment. It is the setting right of all things. God comes to judge sin and avenge injustice. And in Scripture we see that He holds back judgment for a time so that many more might come to repentance (2 Peter 3:9). To those who trust in Him, His judgment is a refining fire that strips away sin and removes the sting of death. God’s judgment sets the world right again.\n\nHe comes to undo the curse and make all things new. God’s judgment carries this beautiful promise: “They will no longer hunger; they will no longer thirst; the sun will no longer strike them, nor will any scorching heat” (Revelation 7:16). What a joyful declaration! Our king will take away the curse of sin and death and bring us to a place of satiety and comfort. I love that the God of the universe cares whether or not I’m hungry or too hot. Our personal comfort seems so small on the universal scale of things. God’s concern for even our thirst is an indication of His tender, personal love.\n\nGod’s final judgment comes to reveal His reign. For all things are His. The whole book of Revelation (indeed the whole canon of Scripture) is about Christ, and this is what it says about Him: He’s seated on a throne (v.17); He is wise and powerful, never caught off guard (v.12 ); He shelters us, and we are safe in Him (v.15); and His gospel is true (v.10).\n\nThe burning fire of God’s judgment is unquestionably a terror to those who do not know Him. But to those who are called by His name—to His own children—the coming of His judgment heralds the setting right of all things. He comes to rescue His children and bring them home.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day4-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 8:1-13, Revelation 9:1-21, 1 Peter 3:8-12, 1 Corinthians 15:51-52",
		"devo_title": "The Trumpets",
		"devo_summary": "\n\nBy Rebecca Faires\n\nThe language in today’s passage is full of rich imagery: a flaming mountain is thrown into the sea, a third of the stars are blackened, and crowned locusts ride horses with scorpion tails into battle. It’s both chillingly specific and massively cryptic—and why are there seven seals, anyway? Before we get carried away, we have to remember that Scripture must first be interpreted through the lens of Scripture. So where else in Scripture do we see the number seven? It’s a parallel to the seven days of creation, the seventh day of the week as the Sabbath, Jacob’s seven years of service to Laban, the seven trumpets of Jericho, etc. In God’s Word, seven is a number of completion.\n\nIn all the swirling imagery, the central purpose of all Scripture is to teach the good news of the gospel: Christ has come to save. And the whole book of Revelation is just the same. These judgments show us the completion of God’s good work. And the end purpose of God’s work of salvation is that He should abide with us, and we with Him. He is our God, and we are His people.\n\nBecause we are His, we can rejoice at His coming, and at the restoration of righteousness. Judgment must come. Justice is necessary because He is justice. He will make all things right. He will not allow wickedness to go on forever. \n\nGod’s judgment is total, and our only escape is Jesus. For those of us in Christ, our judgment was paid by Christ at the cross. The weight of our judgment has already fallen on Him. Therefore, we should rejoice at God’s coming judgment, because it will restore righteousness.\n\nWe are His, and so we need not fear any present tribulation. The consequences of evil in this world are scary, and the threat to believers is real. But the eyes of the Lord are on the righteous (1 Peter 3:12). He is always with us, and He cares for us. His ears are open to our prayers, and He is not indifferent to our cries. Even in judgment, God is merciful to those who love Him. \n\nWe need not fear, because we are His. Instead, we can be people of hope, joy, and peace. This is cause for great rejoicing. His justice is ongoing, and this passage is not the final judgment but a picture of God’s ongoing work in the world. He is constantly doling out mercy to us, deferring judgment, calling us back to Him. His work is not done in our families or in our communities. Therefore, have hope for your children, for your parents, and for your neighbors who are not yet believers. God is constantly at work.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day5-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "1 Corinthians 15:54-57",
		"devo_title": "Grace Day",
		"devo_summary": "\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nWhen this corruptible body is clothed with incorruptibility, and this mortal body is clothed with immortality, then the saying that is written will take place:\n\nDeath has been swallowed up in victory. Where, death, is your victory? Where, death, is your sting?\n\nThe sting of death is sin, and the power of sin is the law. 57 But thanks be to God, who gives us the victory through our Lord Jesus Christ! —1 Corinthians 15:54–57\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day6-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 7:10",
		"devo_title": "Weekly Truth",
		"devo_summary": "\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the proclamation of the multitude in white.\n\nSalvation belongs to our God, who is seated on the throne, and to the Lamb! —Revelation 7:10\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/4-Revelation-1-576x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 10:1-11, Revelation 11:1-19, Psalm 2:1-12, Daniel 2:36-44",
		"devo_title": "The Seventh Trumpet",
		"devo_summary": "\n\nBy Rebecca Faires\n\nThe Arctic Tern gets more sunlight than any other animal on earth. These birds migrate from pole to pole every year, covering about 25,000 miles. Summering at the north pole, they enjoy weeks of 24-hour sunlight, and at the other end of their migration, they bask in the same full-sun days at the south pole. They literally chase summer all over the globe. If it weren’t so hard, we might all be tempted to do it—imagine a beautiful summer that never ends.\n\nThe point of the whole book of Revelation is the glory of Christ. His glory is so big and so wonderful that I have to imagine endless, gorgeous, sunshine-filled days to get in the right frame of mind. We can’t even grasp what it would be like to live in the glow of His glory, but I know that it will be good. So good.\n\nWe get a glimpse of His glory in the mighty angel standing astride sea and land in today’s reading (Revelation 10:5). Based on the being’s majestic description, many commentators believe this “angel” to be Christ Himself. Regardless of one’s interpretation of this particular passage, however, the whole of Scripture points to this beautiful truth: Christ is worthy. The end result of the judgment and war brings us back to where we began: the Word made flesh mercifully for us.\n\nBecause Christ is worthy, we know that the nations and kingdoms of this world are only temporary. God’s kingdom is the only one that will last. The kingdom of the world has become the kingdom of our Lord and of His Christ, and He will reign forever and ever (Revelation 11:15). Christ receives all the kingdoms as His inheritance, which He delivers to the Father (1 Corinthians 15:24–28). And for those who love and trust in Him, the eternal kingdom becomes our inheritance in Christ (1 Peter 1:3–5).\n\nFinally, God finishes His work. “Then he said to me, ‘It is done! I am the Alpha and the Omega, the beginning and the end’” (Revelation 21:6). There is no stopping or undoing what God has done. Our redemption is sure and complete in Christ. And He will bring to completion the work of sanctification and glorification when He comes again. And so we pray: “Your kingdom come. Your will be done on earth as it is in heaven” (Matthew 6:10).\n\nIn Revelation we see Christ, fully worthy and glorified. He is the beginning and the end of all our stories. And we will bask in the warmth and light of His glory for all eternity. It is more than I can imagine. Come quickly, Lord Jesus!\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day8-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 12:1-18, Genesis 3:1-15, Colossians 2:13-15",
		"devo_title": "The Woman, the Child, and the Dragon",
		"devo_summary": "\n\nBy Elaine A. Phillips\n\nOne of my favorite hymns is “For All the Saints.” I was reminded of it when reflecting on today’s reading. Every verse of the song compels us to cling to “our Rock, our Fortress,” and “our Captain” in the battle, as we keep our eyes trained toward a more glorious day yet to come. It echoes this truth from Revelation: God is and forever will be seated on His throne, and all the heavenly hosts give glory, honor, and thanks to Him. The hymn continues:\n\nAnd when the strife is fierce, the warfare long; Steals on the ear the distant triumph song.  And hearts are brave again, and arms are strong.  Alleluia! Alleluia!\n\nThe strife really is fierce, and it has been since the serpent sowed deceit and destruction in the garden of Eden. Our fear of God, alienation from Him and one another, deceit and pride and endless greed—these things tore the fabric of our human existence before the curse was pronounced upon the serpent. \n\nAnd yet in the midst of Genesis 3, God declared a message of hope that has echoed throughout human history: the offspring of the woman would one day “crush” the serpent’s head (v.15). True, the serpent would “crush” (yes, it’s the same word in Hebrew) the heel of Eve’s offspring—a lethal blow, but one that would end in the greatest, most victorious event in human history: the death and resurrection of Jesus Christ. \n\nThat malevolent serpent has since donned many hideous characteristics, and Revelation 12 does not mince words when describing the evil one. We read that the “great fiery red dragon” has been intent on devouring the woman (representing Israel, God’s people) and her Son, Jesus the Messiah. There is an appallingly fierce war in the heavenly realms, one we can hardly imagine. The grim powers of evil and the mighty forces of good tangle with each other. The dragon is identified as the ancient serpent, the devil, who leads the whole world astray. This is serious in the extreme, not to be dismissed with a wave of our enlightened hand. (We often do that.)\n\nIn other words, our battle here on earth is not done. We face the rage of the devil who knows his time is short and his end sure (v.12). But we also know the perspective from God’s throne:\n\nThen I heard a loud voice in heaven say, “The salvation and the power and the kingdom of our God and the authority of his Christ have now come, because the accuser of our brothers and sisters, who accuses them before our God day and night,  has been thrown down” (v.10).\n\nAs painful as our suffering here on earth is, victory is ours by the blood of the Lamb (v.11). We are empowered by and rest in the assurance that God has made us alive in Christ, that Lamb sitting on the throne. His shed blood has cancelled out the debt we owe, and the enemy has been disarmed completely. The serpent’s head has been crushed at the cross (Colossians 2:13–15). \n\nAlleluia indeed. \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day9-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 13:1-18, Proverbs 1:7, Hebrews 10:32-39",
		"devo_title": "The Beast from the Sea and the Beast from the Earth",
		"devo_summary": "\n\nBy Elaine A. Phillips\n\nThere is just no way around it. The apocalyptic scene described in Revelation 13 is horrifying. It appears that every possible embodiment of sheer evil will be turned loose on the world—particularly against those who “hold firmly” to the testimony of Jesus (12:17). Add to that, supernatural deception and oppressive brutality will be the all-encompassing order of the day (13:13–17). Everything is utter calamity. How can we possibly face the prospect of such disasters? I don’t know about you, but I’d prefer to simply disappear before the catastrophe begins.\n\nBut what about today, here and now? As we consider our own times, what can we say to encourage God’s people who are currently facing such ferocious animosity? How do we pray for believers whose lives are threatened day in and day out by vicious, nearly unimaginable manifestations of hatred? While Revelation 13 may be part of a much more comprehensive and sober glimpse into the future, there are also crucial lessons for us today.\n\nBottom line for now: there are no easy answers when God’s people are faced with cruel injustices. There are no detours around the painful suffering brought about by those who practice evil. Instead, “this calls for endurance and faithfulness from the saints” (13:10). We are called to stand with those who are subjected to persecution, insults, and unjust treatment (Hebrews 10:33–34). \n\nAnd how can we best do that? With fervent intercessory prayer. Scripture tells us that God is always with us, but with fervent intercessory prayer, we can pray for His presence to be known and felt by those who suffer. We can cry out on their behalf, asking God to grant them peace. \n\nIn talking with friends and acquaintances whose suffering makes my own experiences pale in comparison, I have been both humbled and amazed by what their words have in common. As a result of their truly grim circumstances, they have come to know a deeper intimacy with God. May such be true for all of us!\n\nIt’s difficult to pray well, but it’s important to proclaim God’s “great and precious promises” (2 Peter 1:4) on behalf of those who need endurance for each coming hour. May they (and we) be assured that the One who is coming will not delay (Hebrews 10:37) and that there awaits us “a rich welcome into the eternal kingdom of our Lord Jesus Christ” (2 Peter 1:11, NIV). We cling to these truths even when everything else seems to give way at the very foundations (Psalm 46). \n\nThat “rich welcome” that awaits God’s faithful and enduring people has stayed generations of believers. The book of Hebrews assures us that we are surrounded by a great cloud of witnesses as we run the race set before us. I like to think of them cheering on God’s faithful people as we feebly struggle, yet keeping our eyes on “the source and perfecter of our faith” (Hebrews 12:1–2). \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day10-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 14:1-20, Psalm 107:1-3, Hebrews 12:18-24",
		"devo_title": "The Proclamation of Three Angels",
		"devo_summary": "\n\nBy Elaine A. Phillips\n\nThe thundering voice from heaven.The new song before God’s throne.The proclamation of the eternal gospel across the globe.\n\nIn reading Revelation 14, we begin to hear the echoes of hope, when each mighty angel from the heavenly realms announces that the final hour of judgment has come. We’re told there will be harvests—first the reaping of ripe grain and then the gathering of clusters of grapes for the winepress, God’s wrath. And while the image of God’s wrath and judgment seems unimaginable and terrifying, it’s actually good news: Those who’ve worshiped the beast, the embodiment of evil, and carried out his vicious schemes will one day drink the wine of God’s wrath (14:9–11).\n\nWine is an image reverberating out from Old Testament prophets (Isaiah 51:17–23; Jeremiah 25:15–31; Habakkuk 2:16), through Psalm 75:7–8, and into the garden of Gethsemane (Matthew 26). It’s there that Jesus, knowing full well what was coming, prayed that the “cup” might be taken from Him. Then in utter and complete submission to the perfect will of His Father, He said, “Yet not as I will, but as you will,” and took in the full cup of God’s righteous wrath (v.39).\n\nBut as the redeemed, we have hope, and this is where our hope lies: with the victorious Lamb who takes away the sin of the world and rescues us from God’s coming wrath (John 1:29; 1 Thessalonians 1:10). Until that day, we are called to remain faithful and endure (Revelation 14:12). Death has not yet been dealt its final lethal blow, but in the meantime, we trust in the promise that those saints “who die in the Lord” will one day find “rest from their labors” (v.13). \n\nLooking forward, the author of Hebrews assures us that we are headed for the heavenly Jerusalem, the city of the living God. We are headed to the welcome of thousands upon thousands of the angelic host, as well as other believers, whose names are written in heaven. It’s there that Jesus, our perfect Mediator, faithfully intercedes for us, even today (Hebrews 12:22–24).\n\nSo let those who have been redeemed from the hand of the enemy—those gathered from all the lands, east, west, north, and south—give thanks to the Lord, for He is good! (Psalm 107:1–3). Let those from every nation, tribe, language, and people join in a mighty chorus of praise for the Lamb who has overcome. And let us join as a mighty chorus, praising and worshiping “the one who made the heaven and earth” and then redeemed them for eternity (Revelation 14:7).\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day11-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 15:1-8, Revelation 16:1-21, Exodus 15:1-18",
		"devo_title": "The Seven Bowls",
		"devo_summary": "\n\nBy Erin Davis\n\nWhen it comes to how to respond to the righteous judgment of God, we only have two options. We can worship in wonder or we can wave a rebel fist. There is no middle ground, no gray area, no third option. Just worship or rebellion, reverence or revolt. \n\nHere, in Revelation 15–16 we see a picture of the wrath of God poured out. It’s a terrifying image, bowls filled to the brim with the righteous judgment of God. As squeamish as God’s wrath may make us, deep down, we know He is justified. We look around at mankind and inwardly at our own wicked hearts and must repeat the cry of heaven: \n\n“They deserve it!”…  “Yes, Lord God, the Almighty, True and just are your judgments” (Revelation 16:6–7).\n\nNotice that in these passages, no one is arguing with God’s justice. No scales are needed to weigh and consider the justice of God. Over and over we read that these grisly judgments are in line with a fair and true God. This is justice in its purest form. And yet it’s possible, even when His justice is deserved and devastating, to choose insurrection over His goodness and mercy. Though the judgments certainly take center stage here, there is still an undercurrent of the people’s rebellion within these passages:\n\nThey “blasphemed the name of God… and they did not repent and give him glory” (v.9). They “blasphemed the God of heaven… they did not repent of their works” (v.11).They “blasphemed God” (v.21).\n\nConsider those pummeled by the final bowl of wrath. Though buried under hailstones weighing a hundred pounds, they still shook rebel fists at God. If we are honest with our own hearts, we see that our own rebellious streak runs just as deep. Our own eye for justice is just as distorted. \n\nBut God, in His infinite mercy has unclenched our rebel fists. We are shielded from God’s ultimate judgment and are now “hidden with Christ in God” (Colossians 3:3). Instead of continuing in rebellion, God’s grace has taught us to respond like Israel when the nation witnessed God’s wrath on Pharaoh and His men. \n\n“Then Moses and the Israelites sang this song to the Lord. They said:\n\n ‘I will sing to the LORD, for he is highly exalted; he has thrown the horse and its rider into the sea… \n\nLORD, who is like you among the gods?\n\nWho is like you, glorious in holiness,\n\nrevered with praises, performing wonders?’” (Exodus 15:1,11). \n\nGod’s righteous wrath isn’t all penned up for the Day of Judgment. Even now He judges the wicked. Even now He has the right to rule our hearts and lives. When face to face with His judgment we only have two options. Because He is so worthy, may we choose to worship the God who is just. \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day12-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Psalm 107:1-3",
		"devo_title": "Grace Day",
		"devo_summary": "\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nGive thanks to the LORD, for he is good; his faithful love endures forever. Let the redeemed of the LORD proclaim that he has redeemed them from the power of the foe and has gathered them from the lands— from the east and the west, from the north and the south. —Psalm 107:1–3\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day13-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 16:7",
		"devo_title": "Weekly Truth",
		"devo_summary": "\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize a reminder of God’s power and justice.\n\nYes, Lord God, the Almighty, true and just are your judgments. —Revelation 16:7 \n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/4-Revelation-2-576x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 17:1-18, Psalm 90:1-17, 1 Timothy 6:11-16 ",
		"devo_title": "The Woman and the Scarlet Beast",
		"devo_summary": "\n\nBy Erin Davis\n\nJohn’s prophecy recorded in the book of Revelation is timeless. I am confident he wasn’t zeroed in on our current political climate when he described worldly leaders who were morally bankrupt and drunk on power. And yet, the shoe fits, doesn’t it? Sadly, since the fall of humanity in the garden of Eden, this shoe always seems to fit. \n\nHere in Revelation 17, we see humankind’s perversion of power personified in the prostitute. She is dressed to impress and mired in scandal. She is greedy, flashy, and horrid. I find it hard to look away. This passage has plenty of mysteries, and I won’t claim to understand them all. But life on planet earth has trained me to recognize the distorting effects of power. She is every ruler who has ever reigned and every heart twisted and broken by sin. \n\nShe is presidents and prime ministers, congressmen and counselors. She embodies parents and principals, laws and limitations. But one thing she is not—she is not the Lamb of God. Neither is the beast who is with her. Their rule and reign is fleeting. With that in mind, look closely at how the beast is described: \n\n“The beast that you saw was, and is not, and is about to come up from the abyss and go to destruction. Those who live on the earth whose names have not been written in the book of life from the foundation of the world will be astonished when they see the beast that was, and is not, and is to come” (Revelation 8, emphasis mine).\n\nStack those words up against these descriptions of Jesus (again, emphasis mine): \n\n“Grace and peace to you from the one who is, who was, and who is to come” (Revelation 1:4).\n\n“I am the Alpha and the Omega,” says the Lord God, “the one who is, who was, and who is to come, the Almighty” (Revelation 1:8). \n\n“Each of the four living creatures had six wings; they were covered with eyes around and inside. Day and night they never stop, saying,\n\nHoly, holy, holy,Lord God, the Almighty,who was, who is, and who is to come” (Revelation 4:8). \n\nThe beast will reign until he doesn’t. The prostitute may have a moment in the limelight, but she cannot diminish the Light of the World by a single lumen. Every leader who has ever ruled, every king who has ever been crowned, every circumstance that has ever terrorized you—all will come to an end. But Christ will remain. Only His throne is established forever. \n\nPolitical leaders aren’t the only ones with power over me. If I keep looking inward, at my own power-hungry heart, I see some of me in the prostitute as well. I keep clawing my way back onto the throne that sits in my heart. I keep trying to take control away from the only One who is worthy to rule. Yet, the reign of sin will not last forever inside of me because brokenness won’t always be king of this world. \n\nBecause of Jesus, sin’s power is not ultimate. Sin was, but will be no more. Only the spotless Lamb and His Bride will remain. Long live the King of kings! \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day15_-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 18:1-24, Isaiah 52:11, Jeremiah 51:47-50 ",
		"devo_title": "The Fall of Babylon",
		"devo_summary": "\n\nBy Erin Davis\n\nTheologians with far more degrees on their walls and books on their shelves than I have can continue to debate who Babylon represents in Revelation 18. I simply don’t have the brain cells to compete. But because of the wisdom granted by the Holy Spirit, I do have what it takes to read this passage and consider this question: Where is the redemptive hand of God in these verses?\n\nThe fall of Babylon, like so much of John’s revelation, is mysterious, but when we take a closer look, we see that the gospel thread is clearly present. God’s redemptive work, which stitches all of His Word together, is beautifully and unmistakably revealed throughout this book. \n\nConsider the angel’s loud declaration, “It has fallen, Babylon the Great has fallen!” (Revelation 18:2). And then compare that declaration to Christ’s quiet resolve at the crucifixion: “When Jesus had received the sour wine, he said, ‘It is finished.’ Then bowing his head, he gave up his spirit” (John 19:30). \n\nBecause of what He accomplished on the cross, all evil will crumble, every Babylon will fall, all “injustice [will shut] its mouth” (Psalm 107:42). Anything that opposes God will fall. Babylon’s sins were piled up to heaven—so were mine, so were yours—“and God remembered her crimes” (Revelation 18:5). As well He should have. But our transgressions? Our sins? He has forgotten them. \n\n“For I will forgive their wrongdoing, and I will never again remember their sins” (Hebrews 8:12).\n\nI have to remind myself often that God won’t dredge my sin back up. Not now. Not ever. Babylon’s ending is not my own. My sins have been thrown into the depths of the sea. I will receive undeserved grace, but Babylon will receive deserved destruction, paid according to her works of evil, and therefore, earning a double portion of wrath. \n\nBut “He has saved us and called us with a holy calling, not according to our works, but according to his own purpose and grace, which was given to us in Christ Jesus before time began” (2 Timothy 1:9). We are spared because of Christ’s work—not punished according to our own. \n\nGod certainly could have wiped me out forever. Instead, He has rebuilt my life on the precious cornerstone of His grace. And so as Christ-followers, we are to “rejoice… because God has pronounced on [Babylon] the judgment she passed” on us (Revelation 18:20).\n\nWicked Babylon is a picture of the enemy’s schemes. Seemingly secure in his triumph, fortified by the forces of darkness, for a fleeting moment he, too, appeared untouchable. And yet, our enemy has fallen. Call it out in a mighty voice! In a single hour he became a defeated foe (v.17). In a moment, with the flash of an angel, the stone rolled away, and evil crumbled. God’s plans for our redemption could not be stopped. Not then. Not now. Not ever.\n\nThe world may weep and mourn when evil crumbles, but heaven will always rejoice. Ours is a God who triumphs over evil. He redeems us for His glory. \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day16-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 19:1-21, Revelation 20:1-15, Isaiah 25:6-9, Isaiah 54:5-7, Ephesians 5:25-27",
		"devo_title": "Celebration in Heaven",
		"devo_summary": "\n\nBy Whitney Capps\n\nAs most brides do, I had high hopes (and perhaps delusions) that my wedding day would be perfect. For me, it almost was. Almost. \n\nOn a steamy Saturday in May 2001, Chad and I were preparing for our big day. My bridesmaids and I drove to the church and went to the make-shift bridal suite to start getting ready. I don’t remember how long we there before one of my bridesmaids came in and said, “Whit, you need to get upstairs because there’s a massive storm headed our way. If we don’t get you into the sanctuary now, you may have to walk in the rain.”\n\nThe church where we were getting married had two separate buildings. And there wasn’t a way for me to get from where I was to the vestibule, where I would walk down the aisle, unless I went outside. This was our window to avoid the storm, and we needed to go now. \n\nWe gathered up all our stuff and made the trek up to the sanctuary. The gorgeous blue sky that had welcomed us earlier when we first arrived was now hidden by ominous, dark clouds. Yes, a storm was imminent. Happy wedding day to us.\n\nWe piled into the foyer, but quickly realized that it wouldn’t do for the bride to be standing there greeting all the guests when they arrived. The only option we had was to file into the ladies’ restroom. It was like a bad joke: “How do you fit a bride and ten bridesmaids into a bathroom the size of a mid-size sedan?” As it turns out, not easily. \n\nI spent my last hour of single life stuffed into a church bathroom. But through it all though, my bridesmaids— my best friends dressed in sea-foam green (bless them!)—were so kind, faithful, funny, and selfless. Missi, my college roommate, had me laughing. Meredith, my soon- to-be sister-in-law, kept refilling my water. Lori and Ashley were loyal lookouts, reporting back to me who had just arrived. It’s now one of the sweetest memories of my wedding day, each of my friends making sure in her own way that I was wedding-day ready—the most beautiful, confident version of myself I could be. \n\nThe Church, the global and eternal collection of God’s people, is Christ’s Bride, and her wedding day is fast approaching. Despite the gathering clouds of external opposition and internal grumbling, all who are made alive in Christ—single, married, divorced, or widowed—need to be doing our part to make Her wedding-day ready. \n\nIt is theologically true that we, the Church, are the Bride of Christ, beautiful and beloved by Jesus Christ, our Bridegroom (Revelation 21:2). And one day, our wedding and reception, called the marriage supper of the Lamb, will be the most perfect, extravagant party you can imagine (19:6–10). \n\nHowever, I think in some ways we serve another wedding day role: that of bridesmaids. Part of our job is to make sure that the Bride is as lovely and wedding-day ready as she can be. Our goal is for the Bride to look radiant. We are partly responsible for what those outside the Christian faith think of the Bride. \n\nThat might sound good, but maybe you haven’t seen much of the resplendent Bride. Perhaps you’ve been bulldozed by a bit of a Bridezilla instead. And to that, I can relate all too well; I know the pain the Church can inflict. I truly, truly do. But while she may be messy, she is also redeemed. \n\nEven when our hurts are legitimately and deeply wounded, our challenge is to remember that Jesus loves His Bride. He doesn’t ignore her flaws or shortcomings, and He never, ever condones abuse of any kind—but make no mistake, Christ loves the Church He died to save.\n\nToday, we are standing in the vestibule of human history. We can’t know for sure when the doors will swing open and we’ll see Jesus coming for us. Between now and then, let’s do all we can to be ready for our Bridegroom.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day17-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 21:1-27, 1 Corinthians 15:42-49, Colossians 3:1-4",
		"devo_title": "The New Creation",
		"devo_summary": "\n\nBy Whitney Capps\n\nAs the consummation of redemptive history unfolds, God’s plan is nearly complete, and Revelation 21 and 22 tell us what will be regained and restored. But at this point in the narrative, it’s helpful to remind ourselves not just what we will gain, but what will be lost. \n\nIn the first garden, when sin entered the world, perfection was broken, marred and spoiled. A seemingly unbridgeable chasm was created between what God had intended and what humanity would now experience. Perfection was made imperfect. The devastating effect of our rebellion was all-encompassing, wrecking ourselves, our relationships, and creation. Nothing was left untouched. \n\nSin is the most aggressive of cancers. Let’s look at a few of its fatal symptoms.\n\nSin separates. The first and most catastrophic effect of the fall was how sin destroyed our intimacy with our Creator. Once His friends, we became His enemies. No longer able to enjoy intimate, unbroken fellowship with God, we hid. And as a result of our sin, we were ejected from the garden. In His mercy, God spared Adam and Eve from staying in Eden and eating from the tree of life, which would have left us forever broken (Genesis 3:22–24).\n\nSin sentences us to death. Expelled from Eden, humanity was lost, but not beyond restoration. There is hope for the fallen, but we are not spared death, which is the second consequence of sin. Every person will succumb. No one can escape it. Our bodies are breaking down. Death looms for us and our loved ones. Though we will be raised to life in Christ, most of us will mourn many times over before we see our Maker. Death, mourning, crying, and pain are the result of the fall, full of emotions we were never meant to experience. \n\nSin spoils everything. Not only does sin separate and sentence us to death, it spoils and ruins. Eden was pristine, peace-filled, and perfect. After the fall, what would have been eternally new was now destined for decay. Creation was fractured, and humanity was plunged into conflict with the rest of God’s creatures. Now creation groans and travails awaiting the restoration of what was lost. \n\nThis is the backdrop of Revelation 21. Separation. Ruin. Decay. Death. God isn’t just creating a new heaven and a new earth, glorious as that is. No, He is restoring perfection, ridding us of all the residue and side-effects of sin. Look at what He promises.\n\nWhat sin had separated, God rejoins. For the ancient Near East, water, particularly the sea, represented chaos and danger. Our new heaven and earth won’t have a sea. More profoundly, the chasm between Creator and creation has been closed. God now dwells with His people in a world where sin, decay, and death are no more. Where we once were destined for cyclical mourning, pain, and grief, we are now promised the joy and comfort of dwelling with God forever.\n\nWe were Adam and Eve’s co-conspirators, and we have lived with a death sentence ever since. But our God is now making all things new, putting an end to all that was broken. What we had forfeited, He has restored. \n\nHe was there at the beginning, our Alpha. And He is now standing at the End, our Omega. What He started, He is gloriously finishing.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day18-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 22:1-21, Psalm 12:6, Ezekiel 47:1-12",
		"devo_title": "The Source of Life",
		"devo_summary": "\n\nBy Whitney Capps\n\nRevelation 21 and 22 paint a lovely picture of the promised end of our story, but we are not home yet. Our destination is certain and secure, but friend, we have not arrived. There is still work to be done.\n\nBelievers living on this side of the cross live in a tenuous “now” and “not yet.” Because of the resurrection of Jesus and the indwelling of His Holy Spirit, we can experience some of the kingdom now. The fruit of the Spirit is a present promise for those of us who surrender to His Lordship. We can enjoy and display love, joy, peace, patience, and kindness today.\n\nWe can grieve in a unique and gospel-centered way. We do not grieve as those who have no hope (1 Thessalonians 4:13). We mourn, but we are comforted by the hope of heaven. We can live in a fallen and fractured world without succumbing to fear or a fatalistic perspective that nothing can redeem the brokenness around us. \n\nThe call to persevere is the command for us to live as sojourners who are passing through to our eternal Promised Land. But we don’t fix our eyes on Jesus, the author, source, and perfecter of our faith (Hebrews 12:2), to the exclusion of others. We cannot ignore those around us. Not at all. I believe this is why Christ commanded John to write instructions for God’s people before He unfolded what was coming. Revelation opens with a clarion call to the Church, and the letters to the seven churches (Revelation 2–3) should still be the filter through which we view this “end.” We have a job to do, and Jesus expects us to do it well. \n\nWe must persevere in the face of crushing secularism and punishing persecution, passionately clinging to the gospel. When we persevere, we live with the same kind of urgency that moved Jesus to say, “I am coming soon!” (Revelation 22:7). We stay mindful that none of us—not our lost neighbor, sinful co-worker, or rebellious family member—is promised tomorrow. We and the strangers all around us are walking toward a sure judgment. One day grief will be no more, but that day is not today. However, grief does serve a purpose. It arrests our hearts with compassion and compels us to action. We ought to grieve what is coming and then live a life that proclaims the hope that Jesus’s death and resurrection secured. \n\nYes, the kingdom is both now and not yet for you and me. We can experience it now, and we must proclaim it to those who have not yet received it. And whether they persist in doing evil, as Jesus says in Revelation 22, we stay the course in faithfully preaching of the gospel in word and deed. We preach it now because His return is not yet. There is still time, and we must steward it well.\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day19-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Psalm 113:1–3",
		"devo_title": "Grace Day",
		"devo_summary": "\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nHallelujah! Give praise, servants of the LORD; praise the name of the LORD. Let the name of the LORD be blessed both now and forever. From the rising of the sun to its setting, let the name of the LORD be praised. —Psalm 113:1–3\n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-Revelation-Instagram-Day20-1024x1024.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 21:6",
		"devo_title": "Weekly Truth",
		"devo_summary": "\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the key verse for the book of Revelation.\n\nThen he said to me, “It is done! I am the Alpha and the Omega, the beginning and the end.” —Revelation 21:6\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
		"img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/4-Revelation-3-576x1024.jpg"
	}
]