[
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 6:10-24, Isaiah 59:12-17, 1 Thessalonians 5:5-11 ",
        "devo_title": "Christian Warfare",
        "devo_summary": "\n\nBY Bailey Gillespie\n\nArmor isn’t something I spend too much of my imagination on. Historically, when I’ve heard Paul use the word in Ephesians 6, I’ve bristled a little and tried on a softer metaphor for my spiritual life. Armor is steely and defensive. It’s an outer shell that protects you from threats. As someone who struggles with defensiveness most days—with my walls as high up as they can go—putting on armor feels like the last thing I should be doing.\n\nHere’s what I’m learning more every hour, though. God relates to us so, so differently than our enemy does. God rescues us. He intercedes and shows us mercy. He seeks our good. We can feel safe letting down our walls in God’s presence and speaking with vulnerability because He has shown Himself to be trustworthy. The enemy, however, does not seek our good. He seeks to kill and destroy (John 10:10). Paul’s letter to the Ephesians describes how we battle against one who schemes against us, who is evil, and who partners with other leaders in the realm of darkness (Ephesians 5:11–12).\n\nThat’s a situation that calls for armor. But tough, steely armor wouldn’t be very effective at protecting us against all the armies of darkness. We need even better protection: the armor of God. We exchange belts for truth and sandals for peace. We exchange shields for faith and swords for the strong and Holy Spirit of God. “Put on the full armor of God,” said Paul to his audience, “so that you can stand against the schemes of the devil” (Ephesians 6:11). Suiting up in this way doesn’t mean we will always be fool-proof; even people who trust in Jesus can make foolish choices. But it does give us much better tools to defend ourselves against the enemy. Because it isn’t just us fighting now. We’re part of a supernatural partnership with our victorious God.\n\nFriends, there is a battle going on for our hearts and souls, and we have a part to play in defending them. As we lace up hiking boots before thrashing through poison ivy or strap on motorcycle helmets to avoid injury, shouldn’t we prepare ourselves even more for spiritual threats? Even though I still don’t love the imagery that armor conjures up, I think that’s the point—our enemy doesn’t like the imagery either. He knows how powerful truth, righteousness, faith, and peace really are. No matter how many flaming arrows get thrown, they still aren’t strong enough to penetrate when we have clothed ourselves in Christ. God has equipped us with everything we need to stand against the darkness.\n\nWe will have days that feel victorious.We will have days that feel less than victorious.But He is always with us.Lord, have mercy.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-19-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 6:5-9, Galatians 3:27-29, Philemon 1:8-22",
        "devo_title": "Slaves and Masters",
        "devo_summary": "\n\nBY Trillia Newbell\n\nHave you ever walked up in the middle of a conversation others were having and felt a little lost—or worse, shocked? How many misunderstandings could have been avoided by knowing the context of the comments! When I read Ephesians 6:5-9, I feel like I’ve walked up to a conversation that the first-century reader would have understood immediately, but without the context, it seems troublesome. But since we know that all Scripture is breathed out by God and useful for training (2 Timothy 3:16–17), we can read these texts asking what the Lord wants to teach us. So, let’s start with the context.\n\nWhen we see the word “slavery,” we immediately picture chattel slavery in the American context. However, slavery in the first century was not equivalent to the historical slavery of the modern world. In Greco-Roman culture, slaves were often considered a part of the household. So, in the context of Ephesians 6, it makes sense that Paul would be addressing the relational aspect of the slave and master. Another distinction is that slavery was considered indentured servanthood and not based on race. These were temporary positions and not considered as a person owning another person. It is good to note also that Paul is not mandating slavery. He is, as he often does, exhorting the listeners on how they should relate to one another. He, in no way, commands or condones the system of slavery.\n\nNow that we’ve got the context, we can explore the text further. Like many relationships with power dynamics, there’s a possibility for abuse. Paul urges the slaves to work in the fear of the Lord—for the Lord and not for man. They are to work happily in the Lord. I don’t know about you, but when I read that, I cringe. It seems like an impossible task. But Paul reminded them that their work was not in vain; the Lord will reward their work. And Paul warned the master to treat slaves with dignity. Both the slave and the master are regarded as equal by God because there is no favoritism in God (Ephesians 6:9). God will judge equally and reward equally. Both the slave and the master are called to a more excellent service: as unto the Lord and in the fear of the Lord. “Whatever good each one does, slave or free, he will receive this back from the Lord” (v.8).\n\nBy God’s grace and mercy, we won’t likely find ourselves in a system where we will be called slaves or masters. But we, too, are to work as unto the Lord: “So, whether you eat or drink, or whatever you do, do everything for the glory of God” (1 Corinthians 10:31). Today, whatever you do, know that God sees you work. He is not overlooking your hard work, whether it’s cleaning up after a meal, changing a dirty diaper, leading a corporate meeting, or teaching a class full of students. You and I can work heartily and happily, knowing that God is glorified in our work when we entrust our work to Him. People may not notice, but God does, and He is pleased.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-18-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 6:1-4, Exodus 20:12, Matthew 15:1-9",
        "devo_title": "Children and Parents",
        "devo_summary": "\n\nBY Jen Yokel\n\nOver thirty years later, I can still hear it: small children’s voices, chanting with precise cadence, “Children, obey your parents in the Lord: for this is right” (Ephesians 6:1, KJV). I was one of those children. Memory verses were a specialty for me, an overachieving, rule-following kid. And I can definitely see why this would’ve been a verse our teachers wanted to sink in.\n\nAs a child, I read this as a reminder to do good things, like clean my room and brush my teeth and share my toys. Now, as an adult, this instruction to children toward the end of Paul’s letter seems a little bit puzzling. Is it about telling six-year-olds to do what their parents say? Some of the verses around it suggest there’s a little bit more going on here.\n\nJust before Paul offers his instructions to husbands and wives, children and parents, and slaves and masters, he encourages the whole church community to live informed by the Holy Spirit, to let their lives reflect their deep transformation through God’s grace. It’s a big-picture view, one that encourages them to “walk in love,” stay wise, and pay attention to how they live (Ephesians 5:2,15). This new way of life applies to everyone, from the lowliest servants to the highest-ranking officials.\n\nSo Paul takes the time to address children, some of the most powerless, no-account people in Greco-Roman society. His instructions aren’t surprising; he tells them to obey their parents and reminds them of a commandment that goes all the way back to Mount Sinai: “Honor your father and mother” (Exodus 20:12; Ephesians 6:2). It’s the sort of instruction you’d give to a child, obedience in a technical sense, recognizing the grownup’s authority. But then Paul turns it around: “Fathers, don’t stir up anger in your children, but bring them up in the training and instruction of the Lord” (Ephesians 6:4).\n\nIt strikes me that all throughout these sections, Paul’s instruction to the powerless and the powerful is not so different. They’re all rooted in love, service, and care for each other. Though the greater culture may not think twice about fathers holding absolute power over their families, but in God’s economy, the powerful are asked to bend low, to love and care and nurture. Though the power structures exist, they’re made to be subverted by love. The law may call for honor in a technical sense, through traditions and household codes, but God seeks self-sacrifice motivated by grace, gentleness, love, and kindness—a way of life led by and filled with His Spirit.\n\nSo then, for children, simple obedience makes sense. But what of their fathers and mothers? What of the grownups tasked to care for, teach, and help show the way to adulthood? In the kingdom, all have the worth and dignity of being made in the image of God. This is where we begin.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-17-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 5:22-33, Genesis 2:4-25, Colossians 3:18-25",
        "devo_title": "Wives and Husbands",
        "devo_summary": "\n\nBY Melanie Rainer\n\nToday’s reading talks about the earthly union between a husband and wife, and expresses two commands with regard to that relationship: “Each one of you is to love his wife as himself, and the wife is to respect her husband” (Ephesians 5:33). The broader context of Ephesians 5 (and similar passages, like Colossians 3) is that the union between husband and wife should be an earthly expression of the heavenly love we receive from Christ, which is why Paul says he says he is “talking about Christ and the church” (Ephesians 5:32).\n\nThere’s a theological framework for studying Scripture called the “indicative and imperative” in which you identify what a passage says about God, and how we are called to act in response. In this passage, Paul offers many statements about the person and work of Jesus: Christ is the head of the Church and the Savior of the Body (v.23); He loves the Church and gave Himself up for her (v.25); He presents the Church in its full splendor, cleansed by His blood shed at His death (vv.26–27); and He provides and cares for the Church (v.29).\n\nPaul says that because of the way Christ loves you, you should treat each other in this way. The imperative is loving others (particularly spouses) sacrificially. The dual commands to “submit” and “love as Christ loved the church” are more similar than they are different, more parallel than hierarchical. What does it mean to “submit”? Verse 22 actually refers back to the same use of the word in verse 21, which tells us that everyone should be “submitting to one another in the fear of Christ.”\n\nThe concept of submission in Scripture is unpacked through the example of Christ, who washed the feet of His disciples, invited the poor to dine with Him, touched the sick, and “emptied himself by assuming the form of a servant” (Philippians 2:7). This is not altogether different from a call to “love just as Christ loved the church, and gave himself up for her” (Ephesians 5:25), which is the command Paul gives to husbands. Both of these commands, in fact, feel inextricably linked to the two greatest commandments Christ Himself gave His followers:\n\n“Love the Lord your God with all your heart, with all your soul,and with all your mind. This is the greatest and most important command.The second is like it: Love your neighbor as yourself” (Matthew 22:37–39).\n\nMarriage is an earthly gift that reveals to us our deepest capacity to love. And even that deepest love pales in comparison to the love Christ has for His beloved Church. In marriage and in all relationships, we are called to submit, to humble ourselves before others, to give and love sacrificially. But the imperative here—the seemingly impossible task of always putting others first—rides solely on the merit, grace, and mercy of the indicative: Christ first loved us, sacrificially and humbly, to the point of death. May we love, because He first loved us (1John 4:19).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-16-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 5:15-21, Amos 5:4-15, Colossians 3:12-17",
        "devo_title": "Consistency in the Christian Life",
        "devo_summary": "\n\nBY Jen Yokel\n\nIt’s easy to move through life, more or less, in an automatic way. Sometimes, it’s even essential. Consider small children learning how to walk, one wobbly step at a time, with lots of falling down in between. With practice, the wobbles turn into muscle memory, and soon they learn more complicated moves, like running or dancing. Or take a moment to think about your breathing. It’s going on all the time, but most of us rarely notice, even though this automatic action is literally keeping us alive.\n\nBut if you’ve ever had a respiratory illness, even mild one, you know how it feels to work for breath. And if you’ve ever arrived home at the end of your work day with no memory of the trip there, you can recognize how the complex, dangerous movement of driving a car needs an attention check now and then. In some ways, the Christian life is kind of like that too. Our basic life skills of kindness, gentleness, and peacemaking are mostly invisible to us, and the muscle memory we must develop begins somewhere deep in our hearts.\n\nAs his letter to the Ephesians winds down, Paul ends with some of his customary pastoral advice: “Pay careful attention, then, to how you live—not as unwise people but as wise” (Ephesians 5:15). He has given some practical advice and will continue to get more specific, but a list of things to avoid and behaviors to modify isn’t the answer. When it comes down to it, Paul’s instruction to “pay attention and be wise” is at the core of this message; it’s what we really need to know.\n\nGod desires good for us. Good, not evil. Life, not death. We can learn to live into this goodness through deepening our wisdom and keeping our minds sharp. We learn how to stay sober when we’re tempted toward distraction and numbing, cultivate generosity instead of reckless living, and practice gratitude instead of grasping for more. And this wisdom shapes our whole lives, from the inside out. Even if we don’t feel like we are doing great things for God, we can still “do everything in the name of the Lord Jesus” (Colossians 3:17). In our work, in our play, in our worship, in our chores, we receive God’s generosity and share it with each other.\n\nIt’s not easy. Neither is walking, at first. But as we pay attention to the way one foot moves in front of the other, it won’t be long before we can dance. It’s the same with living out the goodness God wants for us, as the flourishing kingdom takes root in our hearts, transforming us for abundant life.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-15-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 5:6-14, Psalm 36:9, 1 John 1:5-10",
        "devo_title": "Light Versus Darkness",
        "devo_summary": "\n\nBY Bailey Gillespie\n\nWhen we were kids, my brother and I often camped out on the front deck of our three-acre yard. In the California foothills, the sky is clear at night. You can see the stars with clarity, without the obstruction of any phone lines or city pollution. We liked to count how many moving objects we could find in a single night, counting everything from comet tails to satellites to bat wings. (Not to boast or anything, but we came out at forty-eight one summer.)\n\nOccasionally, our parents would come outside looking for an answer to a question, flipping on the flood lamp. Whenever this happened, the game was up. The expanse of stars in our sky theater evaporated by the intrusion of the light’s yellow glare. Only on evenings when our parents stayed in the house (where they belonged) could we experience the grandeur of counting stars in middle school.\n\nUnlike flood lamps exposing the enchantment of a night sky, Ephesians urges us to expose real darkness—more specifically, the works of darkness (Ephesians 5:11). The Lord we worship is light. He is untainted by evil, and “there is absolutely no darkness in him” (1John 1:5). As people of the Lord, we are called to live as children of the light (Ephesians 5:8). Scripture says that the fruit of the light “consists of all goodness, righteousness, and truth” (v.9). This begs me to ask the question: What darkness in my own life needs exposing in order to bear this fruit?\n\nUsually, works of darkness in my own life don’t look malicious. I’m not prowling around like a storybook villain, slashing down opera-house chandeliers or injuring my father-in-law. Most days, I look like a pretty decent human. But our external appearance is only the tip of the iceberg, right? We’re called to look inwardly, a little deeper (okay, a lot deeper), and discover what hidden or disguised sin might be harming ourselves and others. Most likely, I’m already aware of certain places where lies have been given a microphone or destructive behavioral patterns have persisted. But there are even deeper shadowlands that disrupt our intimacy with Christ that may not be as evident at first. This is why we must ask the Spirit to convict us. God is always faithful to shed light on the darkness.\n\n“Get up, sleeper,” says the author of Ephesians. “Rise up from the dead, and Christ will shine on you” (Ephesians 5:14). By exposing the darkness, we will experience the fruit of light. Christ and His attributes will shine on and through us. I’ll ask myself the question again, and I encourage you in the same reflective practice: What darkness in my own life needs to be exposed so that I’m free to bear the fruit of goodness, righteousness, and love in Christ?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-12-wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 4:17-5:5, Hosea 1:10, James 3:1-18",
        "devo_title": "Living the New Life",
        "devo_summary": "\n\nBY Jen Yokel\n\nWe dress for occasions and we dress for identity. We wear dressy blouses for work and switch to sweatpants at home—or maybe both, for all those who work from home via Zoom meetings. We use uniforms to signify ranks and roles. We choose different looks for holiday dinners, date nights, or a party with friends. And I’m pretty sure we all made some questionable fashion choices as teenagers, while signaling a desire for belonging through favorite band shirts and creative hairstyles. What we put on says something about who we are, sure. It also says something about who we belong to: families, fandoms, teams, or religions.\n\nPaul uses something like a clothing metaphor when he describes the Christian life. “Put on the new self,” he writes, “the one created according to God’s likeness” (Ephesians 4:24). After praising the Ephesians for their faithfulness and reminding them of God’s generous mercy, it’s time to give some practical guidelines to follow.\n\nMany of us may have grown up seeing the Bible as a rulebook, but in this section on living the new life, Paul starts with the heart. While taking off the old self and putting on the new is an active command, the first problem Paul highlights is how the old way is less about action and more about our inner state, our hearts and minds. He uses words like “ignorance” and “hardness of hearts” and “callous” to describe the opposite of life in Christ. And this callousness toward God and each other leads to all kinds of immoral behavior, “a desire for more and more” (Ephesians 4:17–19).\n\nTo stretch the clothing metaphor a bit, what are we trying to say when we wear an expensive designer piece? Is it coming from our delight in something beautiful and well-made, or is it an attempt at a status symbol? Is it coming from a place of confidence and belonging or insecurity and scarcity? We can see how good and beautiful things can be warped to darker ends. We could ask the same question about the way we dress to fit in a clique we want to be part of—or the one we want to stand against. At the center of it all, there is always the question of love and identity.\n\nBefore we can put on the new life, there are a few things we need to get rid of, like bitterness and anger, wrath and malice, envy and selfish ambition—things that lead to “disorder and every evil practice” (James 3:16). Instead of giving in to our insatiable greed, we are asked to learn contentment with all we’ve received. This removal is hard work. It means reorienting our hearts, acknowledging the ways the world has shaped us, and asking God to recreate us.\n\nBut when we get rid of our threadbare ways of being, we can put on newer, better things: gentleness that comes from wisdom (James 3:13). Kindness, compassion, and the same kind of forgiveness we’ve received. There’s more than enough of this goodness to go around. And then, we start to look a little more like who we really are: beloved children made in God’s image, who are following Jesus, clothed from head to toe in His belonging.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-11-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 4:1-16, Acts 2:42-47, 1 Corinthians 12:12-27",
        "devo_title": "Unity and Diversity in the Body of Christ",
        "devo_summary": "\n\nBY Melanie Rainer\n\nI work for a multisite church, which means we are one church with several congregations. We follow the same sermon series, share resources, and build joint efforts to serve our city, country, and the world. We contextualize for our specific locations, neighborhoods, and members, but at the end of the day, we are one church. Is it always easy? No. But it’s a beautiful exercise in practicing what it means to be God’s global Church: one holy Body serving the one holy God.\n\nWe live in a non-unique time in church history, where denominations are shrinking and splitting and the global Church is grappling with what it means to be the unified people of God. There are myriad ecclesiological debates about who or what makes a Christian, where and how we should worship, how we should engage in the public square, and many more issues.\n\nPaul knows more than a little about this, because church debates are nothing new. The entire letter of Galatians is about sifting the truth of the gospel out of the false teachers who add to it. In 1 Corinthians, we are warned against potential divisions in the church, while 1 Thessalonians celebrates the Church coming together in the face of persecution. Colossians urges believers to stay focused on Jesus in the midst of a world that isn’t.\n\nPaul’s letter to the Ephesians includes a series of “one” statements that describe the Church, and they appear in today’s reading from chapter four. The Church, preserved by the unity of the Holy Spirit, is one Body (Ephesians 4:4), has one Spirit (v.4), has one hope (v.4), with one Lord (v.5), one faith (v.5), one baptism (v.5), and one God and Father of all (v.6).\n\nLike wet clay on a pottery wheel, these seven statements spin together the foundation of the Church. Without form, clay stays lumpy, spread out, without shape or purpose. But when run through the wet hands of a skilled potter, the purpose, form, and intent become clear. The Church is made up of humans, fallible and foolish. But in the skilled and steadfast hands of our Father, the Church becomes beautiful, useful, and good.\n\nIn 1 Corinthians 12, Paul writes about the many expressions of the Body of Christ. When I was a child, I thought this meant something incredibly small: that if I was good at singing, someone else was good at preaching, and together we would make a church service. But the older I get, the more I see just how big the Church Paul is describing truly is. I make my home in a denomination that is known for certain things—certain strengths and convictions, a loyalty to Scripture and grace. I have dear friends who make their homes in very different denominations, but who bring to God’s kingdom an emphasis on justice and mercy, lovingkindness and care for the poor and marginalized. Still others emphasize the beauty of being born again, of fighting the ongoing stain of sin on our lives. We are a symphony, each bringing the strength of our instruments to bear in service of the whole.\n\nWhen we are raised together in resurrection days, the one thing that will unite us is our belief that Jesus Christ is the Son of God, and that He died, was buried, and rose again. We share, collectively, in one resurrection. I pray for Church unity. I pray for forgiveness and peace, and I am thankful for a God who reconciles all things to Himself. Being part of the Church Body isn’t always easy, but it is beautiful. May we rejoice in being one Body, with one Spirit, one hope, one Lord, one faith, one baptism—and of one God and Father.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-10-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 3:14-21, Psalm 103:1-22, Philippians 4:12-13",
        "devo_title": "Prayer for Spiritual Power",
        "devo_summary": "\n\nBY Ellen L. Taylor\n\nIn the days of the early Church, letters like this one Paul wrote to the church at Ephesus were often read out loud at a gathering of church members so that everyone could hear them. I’ll be honest, I can barely make it through reading Ephesians 3:14–21 silently and to myself without crying. Ask me to read it out loud and all bets are off. There is a 100% chance that my voice will crack and tears will begin to well up in my eyes and flow down my cheeks. I think it’s because I can’t read it out loud without beginning to read it as a prayer, which is likely how Paul intended the church at Ephesus to hear it.\n\nIn this passage, Paul is coming before the Father to ask that the church would be strengthened (Ephesians 3:14–16). Paul reminds the Ephesians of the immeasurable goodness that the Father has for them, and at the end, he closes with this: “Now to him who is able to do above and beyond all that we ask or think according to the power that works in us—to him be glory in the church and in Christ Jesus to all generations, forever and ever. Amen” (vv.20–21).\n\nWhat a beautiful prayer. I don’t know about you, but sometimes I can feel insecure that my prayers don’t sound as eloquent or “professional” as the ones I hear at church. I have had several friends in my life who I’ve always considered to be “good” at praying—and I haven’t ever put myself in that category. During a particularly difficult time in my life, all I could manage to get out while I was praying was, “God, please,” and “God, why?”\n\nSometimes, I didn’t even know what I was asking. But I knew that God knew, because His love for us surpasses our understanding of what love is. Paul is praying that the Ephesians will be able to “comprehend… what is the length and width, height and depth” of the love that God has for them. God loves His people so much that He was willing to sacrifice His Son for them, a love that surpasses knowledge or understanding (Ephesians 3:18–9). He forgives us of all our iniquities (Psalm 103:3), “as far as the east is from the west, so far he has removed our transgressions from us” (v.12).\n\nAll of our wordless prayers, all of our groans of pain and suffering and frustration, they are all held in His hands. Even when we are unsure of His love for us, even when we can’t feel it, even when He seems far away, He is there. And His love for us goes beyond our understanding. May we live our lives in such a way that glorifies Him, forever and ever.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 3:1-13, Romans 11:1-36, Colossians 1:24-29",
        "devo_title": "Paul’s Ministry to the Gentiles",
        "devo_summary": "\n\nBY Rebecca Faires\n\nI’m almost forty, but I sometimes still wonder if the other girls really like me. Our community is small and wonderful and welcoming; I’ve been here all my adult life. But I wonder… Are the other ladies having parties without me? Are they chatting with me because they enjoy my company or because they are very kind? Is everyone else in a club that I know nothing about? Is there something about me they don’t like? Should I not have let my hair go grey? Do they think I’m not doing a good job parenting my children? Is it my jokes?\n\nNo matter how loving and beloved we are, there are still little things that can make us doubt that we belong. And belonging is so important to us. I ache to feel cherished by my friends and family. And while it is possible my jokes are keeping some ladies at arm’s length, there is no doubt at all about my belonging in the family of God.\n\n“In him we have boldness and confident access through faith in him” (Ephesians 3:12). It’s a done deal with Christ. We aren’t just acquaintances; we are part and parcel of His family tree. “You, though a wild olive branch, were grafted in among them and have come to share in the rich root” (Romans 11:17). Yes! We are blessed to share in the rich root of God’s blessing. What a relief to be invited into confident access.\n\nAnd we don’t earn this boldness through our hard work at pleasing Him or trying to make our girlfriends laugh. “For [we] are saved by grace through faith, and this is not from yourselves; it is God’s gift—not from works, so that no one can boast” (Ephesians 2:8–9). Our belonging is God’s gift to us, and we are now servants of the gospel of grace that unites (Ephesians 3:7). There are no earthly relationships that come close to that totally one-sided deal. His love is a free gift to us, and in exchange, we have the favor and lovingkindness of a King.\n\nI like to imagine that the early Church was full of ladies just like us, hoping to belong, hoping to fit in, wondering if it was too soon to make jokes about the Pompeii earthquake. The beautiful truth is the Church is made up of all kinds of folks. But “God wanted to make known among the Gentiles the glorious wealth of this mystery, which is Christ in you, the hope of glory” (Colossians 1:27). The hope of Christ is our eternal belonging in His glory and presence.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 2:11-22, Psalm 118:22, Romans 12:1-8",
        "devo_title": "Unity in Christ",
        "devo_summary": "\n\nBY Jasmine Holmes\n\nWhen I was dating my husband Phillip, I could not go five minutes without making a crack on his home state. He liked to say that this is because I’m a Texan, and everything is bigger and more arrogant in Texas; I liked to say that it was because he’s from Mississippi, the state that is last in everything. One day, an older, wiser friend of mine took me aside during one of my classic Mississippi jabs and said, “Jasmine, you might live in Mississippi someday. You should respect the home of the man you love.”\n\nI assured her that I would never live in Mississippi.\n\nThis story ends, predictably, with me living in Mississippi. And all of the little jabs I made about the state are now jabs I made about my own home. And what a foreign home it was when I first moved here—the land of the Deep South is full of customs this southwestern girl had zero experience in. Bubble rompers, monograms, and china-pattern hospitality have met this foreigner and taken her in. And now, she’s home.\n\nMy Texan-turned-Mississippian transformation has been radical, but of course it’s nowhere near as radical as the change Paul talks about in Ephesians 2:11–22. These Gentiles were once excluded from citizenship, not just in the physical Israel, but in the spiritual family—foreigners, not only in the geographical sense, but in an eternal sense (v.12). But now, through the covenant God made with us through Christ, we have been “brought near” to Him and one another (v.13); we are in the family of faith. Through His sacrifice, He made both groups, one, tearing down the “dividing wall” of hostility (v.14).\n\nWe are the Bride of Christ, and much like this bride has been welcomed into a brand new family and a brand new home, we have been welcomed into the family of faith, putting an end to the hostility that once separated us (v.16). We were once diametrically opposed to everything that our new family stood for, and now we have been brought near and united in peace (v.17). We are no longer foreigners and strangers, but members of God’s household.\n\nI could wax eloquent about what it has meant for me to become truly at home in Mississippi, to say to my husband as Ruth once said to Naomi that “[his] people [are] my people” (Ruth 1:16), but the transformation into God’s family is even more radical because it captures the second part of Ruth’s promise: “your God will be my God.” Because of the covenant God made with us through the sacrifice of His Son, we have been invited to be members of a household of which Christ Himself is the cornerstone—meaning, this is a covenant that will never be broken because it is built on the foundation of the apostles and prophets and Christ Himself, who is holding the entire thing together (Ephesians 2:20–22)\n\nThrough His atoning death on the cross, Christ has transformed us from hostile foreigners to citizens (v.19). And not just citizens, but family members. And not just family members, but members of one Body. May we learn to rejoice in this transformative and foundational truth as we draw near to our family of faith.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 2:1-10, John 3:16-21, 1 John 5:1-13",
        "devo_title": "From Death to Life",
        "devo_summary": "\n\nBY Jen Yokel\n\nMy mom is one of the most generous people I know. I’m grateful to say that growing up, I never felt a lack of love or met needs, and to this day, she still delights in sending a care package, just because. Giving is her way to show care, even over great distances. I mention small things, like a spice for a recipe I want to try or a little bowl I broke, and then one day a box arrives with little bags of cumin seeds or a set of pretty measuring bowls or some other thing I never thought to ask for, all with sticky notes saying, “I thought you’d like this.”\n\nI confess, there have been times I’ve felt embarrassed by this overflowing generosity, or struggled to find ways to speak this love language back to her. But the older I get, and the longer I’m living far from home, the more her generosity and thoughtfulness mean to me. Because after all, it’s never really about the gifts, though I’m grateful to know I’ve been heard. To be remembered, even in seemingly small ways, reminds me that I am deeply loved.\n\nIn today’s reading, I can’t help but see God’s generosity and notice something similarly lavish, almost embarrassingly so. For most of my life, when I’ve read the words “you were dead in your trespasses and sins” (Ephesians 2:1), I’ve only thought of the ways I’ve gone wrong: Yep, that’s me! Broken and in need of fixing! But now I see it from a slightly different angle.\n\nConsider for a moment that this mindset is perhaps one of poverty mentality. Once I start to look for it, I can see God’s special interest in the poor all throughout Scripture, from the Law’s provisions for gleaning and Jubilee, to Jesus’s healing and humanizing the lowest members of society. God is in the business of meeting our lack and filling our empty hands. And death without hope is the ultimate kind of poverty.\n\nContrast this with God’s abundance: “But God who is rich in mercy, because of His great love that he had for us, made us alive with Christ, even though we were dead in trespasses” (Ephesians 2:4–5, emphasis mine). His is a wealth and generosity we cannot possibly come close to reciprocating or paying back. These “immeasurable riches of His grace through his kindness to us in Christ Jesus” are “God’s gift” to us, to all who trust in Jesus (vv.7–8).\n\nThese days, nothing makes more sense to me than the Incarnation. There’s a mystery at work where God, despite having power and wealth far surpassing anything we could imagine, extends His kind hand toward us. God takes on the human form of a rabbi, gets the dust of the earth in His clothes, touches the untouchable, debates the educated, and shares dinner with some of the most despised, forgotten people imaginable. God descended to suffer with us, experiencing the ultimate poverty of death, but then rising above it all to lead us in a better way, to lead us to Him.\n\nAnd where does that leave us? Well, Scripture says, “Everyone who has been born of God conquers the world” (1John 5:4). Or perhaps, as the father says to the eldest brother in the parable of the lost son (Luke 15:11–31), “Everything I have is yours” (v.31). All this abundance is ours: we are seen, remembered, and loved—if only we will choose to take hold of what is already ours because of Jesus.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-4-wordpress-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 1:20-23, Psalm 8:1-9, Isaiah 11:1-9",
        "devo_title": "God’s Power in Christ",
        "devo_summary": "\n\nBY Melanie Rainer\n\nHave you ever heard the story of Mike the Headless Chicken?\n\nIn 1945, Mike was a five-month-old chicken when his owner tried to kill him for dinner. But he missed the barnyard bird’s jugular vein and Mike somehow survived—with just a brain stem on top of his body. His owner figured out a way to feed him with an eyedropper, and Mike went on to live for eighteen more months.\n\nMike became a sideshow, a traveling, income-producing wonder whose existence was certified and studied. Here was a chicken with no head, not running around like a chicken with his head cut off, but rather running around like a chicken that still had a head even though its head really had been cut off.\n\nStick with me here.\n\nWhen Paul writes to the church in Ephesus, he explores what it means to be the Church. What does it mean to be the people of God saved by grace? (Ephesians 2). What does it mean for Jews and Gentiles to come together as one people? (Ephesians 4 and 5).\n\nIn Ephesians 1:20–23, Paul explores what it means to be the embodied Church on earth while the head of the Church, Jesus, is seated at the right hand of the Father in the heavens (v.20). Jesus, who is above all rulers and authorities, powers and dominions, and every title, is head over everything, over His entire body, the Church.\n\nThe Church is the embodied, flesh-and-bone, active Body of our beloved King Jesus, who rules with all things under His feet. When Jesus ascended into heaven, He left with these words: “All authority has been given to me in heaven and on earth,” which is the qualification for His command and is followed by “Go, therefore, and make disciples of all nations” (Matthew 28:18–19).\n\nJesus was telling believers to be the Church and build the Church, but to do so by His authority, which is the sentiment Paul echoes in the first chapter of Ephesians. Jesus is the head of the Body, the Church, an illustration Paul uses throughout his letters (Colossians 1:18; 1 Corinthians 12:27; Romans 12:5), and as such, we’re not left on our own to aimlessly wander through this life, directionless.\n\nWhen I read this passage from Ephesians 1, and I realize what it really means—that I am the hands and feet of Jesus in this broken world, called to exude His love to both my neighbor and my enemy, to fight for righteousness, justice, and truth—I am overwhelmed by my own inadequacy. I think of King David’s words in Psalm 8: “What is a human being that you remember him, a son of man that you look after him?” (v.4).\n\nJesus left the care and keeping of His Church to a wildly unqualified group of people. We sin, stumble, and soak in our own self-righteousness while we recklessly pursue our glory instead of His. Who am I? Part of the Body in which the fullness of Christ dwells. Why me? Because I am a sinner saved by grace, daily growing more like Christ through the power of the Holy Spirit. This is what qualifies us. To Him and Him alone be the glory now and forever more.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram3-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 1:15-19, Proverbs 2:1-11, Romans 8:18-27",
        "devo_title": "Prayer for Spiritual Insight",
        "devo_summary": "\n\nBY Rebecca Faires\n\nIn the early spring, my family and I began forging trails throughout our woods. We moved homes in deep midwinter, and we knew if we wanted trails in these dense woods, we would have to start them before the leaves returned or the ground cover made it impossible to beat a path. So all eight of us, plus a big dog, have been trodding heavily in and through the mud for months.\n\nWhen the mayapples and trillium started covering the paths, we picked flowers and continued stomping. The leaves burst out from the trees almost overnight after a big storm, and branches we hadn’t noticed enough to trim back were whacking us in the face on the new trails. We watched spring happen on our feet this year—the succession of blooms culminating in the crisp, white blackberry flowers has arrested our attention like never before. Now summer is here, and all at once, we are shoulder to shoulder with trees, our barren trails made into green, leafy hallways throughout the wood.\n\nFruit that lay dormant burst forth and winter gives way to life again and again. Paul opens his letter to the Ephesians with a prayer that sums up the whole intent of Scripture: “I pray that the eyes of your heart may be enlightened” (Ephesians 1:18). This is a prayer for insight, for revelation, for wisdom, for illumination. The central message of God’s Word to believers is not about what we do, but about what God does in us. The fruitfulness of the Christian life begins with the implanted Word, and the illumination of His Spirit.\n\nPaul reminds us that the gospel arrests us in the midst of our winter deadness, and it is the power of Christ that enlivens and enlightens us. He has not left us dead in our trespasses, but has given us a new hope and the wealth of our inheritance in Christ. He does not leave us to our own abilities but grants us the greatness of His power and strength.\n\nThese are the promises of the gospel. These are also the truths that we are so quick to forget. We do indeed need the eyes of our hearts enlightened. We too often fixate on the “sufferings of this present time” (Romans 8:18), and fail to look outward and upward. But when we fix our eyes on the glory of Christ, we also are able to see the transforming power of that hope in the present.\n\nBecause we are numbered among the saints, we no longer live in the barren winterland, but now walk in newness of life, full of His hope, His strength, His wisdom, His wealth. Therefore, like Paul, we should never stop giving thanks, should never cease from prayer and praise.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-2-1024x1024.jpg"
    },
    {
        "book_title": "Ephesians",
        "devo_passages": "Ephesians 1:1-14, John 1:12-13, 1 Peter 1:18-21",
        "devo_title": "God’s Rich Blessings",
        "devo_summary": "\n\nBY Jessica Lamb\n\nWhen my parents moved our family to Texas in the early ’90s, we joined a large church in our new town. We found our place at a contemporary Sunday service, where worship lyrics were projected onto walls and the pastor swapped his wooden pulpit for a music stand. After service, I’d run around back corridors of the auditorium with friends, playing hide-and-seek in racks of white baptismal robes.\n\nWe often made weekend trips back to our native Arkansas, where our presence on Sundays at my grandparents’ small church was always warmly noticed. We’d slide down the same pew my grandparents had held since the 1970s, and I practiced my reading skills in the order of service, asking my grandmother in loud whispers what words like invocation and kyrie meant.\n\nNow, my husband and I meet with our church in a middle school gym. Our four-year-old daughter delights in seeing the yellow school buses lined up outside every Sunday morning, almost as much as she enjoys refusing to high-five the greeters as she enters the building.\n\nThe list of differences between these churches isn’t short, spanning from order of service to how attendees dress, from views on baptism to how internal debates about new carpet might be resolved. Still, when I think about these church families—their love for Jesus and one another—I stop what I’m doing to thank God for them (Ephesians 1:15–16). Why?\n\nBecause as Paul constantly reminds his readers, our shared faith is more essential than our differences. The church at Ephesus needed to hear the call to focus on what they held in common, both as a local community and as believers who shared the same faith as the broader Church in places like Galatia, Philippi, Rome, and beyond. Don’t miss the words repeated over and over in these opening verses: as believers, we are defined both as individuals and as a people by who we are in Him. We share “spiritual blessings” from God with one another. We are called faithful saints in Christ Jesus. In Him we have redemption, forgiveness, grace. In Him we have received an inheritance. In Him we were sealed with the promised Holy Spirit. Our hope is in Him.\n\nThroughout this letter, Paul will call his readers to be unified, to not forget the goodness and truth of all we hold in common. Part of the miracle of our faith is that two thousand years later, we are a part of this same family. Our brothers and sisters are sitting next to us on Sunday mornings, they are reading the Word across our towns and around the world, and they were listening to Paul’s letter at a house in Ephesus in the early AD 60s. We are all brought together in Jesus Christ.\n\nAs the Church, we are the Body of Christ, His hands and feet, called to proclaim His goodness to a lost and broken world. We are a people raised to new life with Jesus. We can link arms with believers around the world and throughout the centuries because we are a people who can confidently say together, “Blessed is the God and Father of our Lord Jesus Christ who has blessed us with every spiritual blessing in the heavens in Christ” (v.3).\n\nPraise God, for the wild, enduring miracle that is the Body of Christ!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/SRT-Ephesians-Instagram-1-wordpress-1024x1024.jpg"
    }
]