[{
    "book_title": " Judges",
    "devo_passages": "Judges 21:1-25, Deuteronomy 12:8-14, 2 Samuel 24:18-25",
    "devo_title": "Brides for Benjamin",
    "devo_summary": "\n\n                    \n\n                    Martin Luther King, Jr., said, “Only when it’s dark enough can you then see the stars.” \n\nJudges ends on a dark note. As we come to the end of this book, we see a nation of people who have taken step after step away from the Lord. We’ve seen Israel take on the religious convictions and practices of their Canaanite neighbors. We’ve seen them abandon God. And we’ve seen their world unraveling.\n\nIn this last chapter, infighting among the tribes of Israel has led to Benjamin’s defeat at the hands of the others. But now those other tribes are beginning to fear that their victory will lead to Benjamin’s extinction. Panged with regret, they assemble to come up with a solution to ensure Benjamin’s survival. Their answer to this problem: wives. The tribes will find and deliver wives for the men of Benjamin so they can build up their numbers to a sustainable level.\n\nAs you read this chapter, let the ugliness of what’s happening hit you. People are being slaughtered. Oaths to never forgive are being taken. Young women—probably teenagers—are being kidnapped and given over to the men of Benjamin as part of a solution to a problem Israel brought upon itself. \n\nThis is where the road to apostasy had led God’s people—to violence and human trafficking, to vengeful hearts and survival of the fittest. They no longer look anything like the “blessing to the world” God told Abraham they would become. \n\nWhy is this book in the Bible? It certainly isn’t a book about how to follow after the Lord. If anything, it’s the opposite—a book about how to abandon the Lord. So where is the redemption in this book?\n\nThe redemption in Judges is in the ache for a king, for someone to come and lead God’s people with righteousness and peace. For someone to seek the Lord’s counsel and to love God’s people. For someone to not only serve themselves, but to lay down their life for their friends. \n\nWhen looking at the Bible as a whole, we see that Judges highlights Israel’s desperate need for God. The books of 1 and 2 Samuel follow, describing how Israel gets its king in young David—a man after God’s own heart and a focused warrior whose struggle is for peace. But even more than that, Israel’s need for a king is addressed in Christ, the eternal King who rules at the right hand of God as our Prince of Peace. \n\nOur need for Jesus, the bright morning star, runs deeper than we know or are willing to admit (Revelation 22:16). But the darkness of a book like Judges helps us see how much we need Him, and gives us cause to rejoice that He has come. The Lord has not left us in darkness. In fact, “In him was life, and that life was the light of men. That light shines in the darkness, and yet the darkness did not overcome it” (John 1:4–5). Amen. Thanks be to God.\n\nWritten by Russ Ramsey\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day26.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 20:1-48, Deuteronomy 18:1-5, Proverbs 16:33",
    "devo_title": "War Against Benjamin",
    "devo_summary": "\n\n                    \n\n                    We have all seen the gruesome pictures or heard the staggering reports of what happens on a battlefield. It seems like every day, one nation somewhere is at war with another nation. Death abounds. Suffering persists. Peace is nowhere in sight.\n\nWe pick up today in Judges chapter 20, where another battle is about to take place. After the rape and murder of a Levite’s concubine in chapter 19, four hundred thousand armed men from the tribes of Israel (except for the tribe of Benjamin) are commissioned to exact revenge and justice on her oppressors, men from the Benjaminite city of Gibeah. A civil war was at hand between the unrepentant tribe of Benjamin and the other tribes of Israel. After two costly battles for the combined Israelite forces, they continue to call on the Lord for help. \n\nThe Lord tells them to go back into battle and promises them He will give them victory the next day. His hand alone is mightier than every sword wielded by their foes.\n\nIt’s easy to focus here on the battle itself. We ask, “Why would God allow so many people to die? Why does the Bible condone war if death is the enemy? Why doesn’t He just fix everything right now?”\n\nIn some ways, we don’t have all the answers to these questions. There is a mystery to God’s work that we couldn’t understand, even if it were explained to us (Romans 11:33–36). That said, the Bible is not entirely silent on this issue, either.\n\nThe Bible records human history, so we should not be surprised to see sin and death and war in its pages and in our world. Indeed, God would be lying to us if He didn’t show us in Scripture how badly sin has affected us. That said, we know for sure that He will make all things new. This is clear throughout the Old Testament (Genesis 3:15; Ezekiel 36) and into the New Testament (Revelation 21–22). Our passage today gives us a glimpse of this. On the one hand, rape and murder and war are the result of life in a fallen world. On the other hand, we see God as a good Judge, dispensing justice for the oppressed and marginalized. In a perfect world, God does not need to judge evil; in a broken world, He would be a monster not to.\n\nPraise be to God that through Christ His wrath toward evil has been absorbed for us. Jesus went to the cross so we don’t have to. He took on the rightful judgment of God toward sin, bearing it all as a sacrifice for us. And by the Spirit, we can now walk in newness of life, working every day to join God in His mission of redeeming all things for His glory and our good (Matthew 28:18-20; 2 Corinthians 5:11-21).\n\nWritten by Brandon D. Smith\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day25.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 19:1-30, Jeremiah 8:18-9:3, 2 Corinthians 6:14-18",
    "devo_title": "Outrage in Benjamin",
    "devo_summary": "\n\n                    \n\n                    On a weekly basis, I get together with several other men from my church, and we read the passage from the daily He Reads Truth study. We try to listen to what the Holy Spirit is saying to us in His Word. Usually, we have a pretty vibrant discussion and reflection time together. However, after reading today’s passage, I am confident we will sit in silence for a while. And we should.\n\nThe horror of Judges 19 should stop our mouths and quiet our hearts. This chapter should make us angry. It should prompt outrage within us at the level of depravity and injustice that takes place. This passage should boil our blood at the treatment of women as property to be bartered, used, and discarded on a whim. Judges 19 should enrage us at the way a servant of the temple (the Levite) disregards God’s ways in order to please himself, and then plays the victim as if he were the one most deeply sinned against. We need passages like this to get our blood hot with indignation against rampant evil and wickedness. \n\nThe question is, what will we do with our righteous anger? As depraved and backward as this chapter sounds, injustice and corruption like this still exist in our world. Women are still used, abused, and discarded by men as if they were merely property. Church leaders act like they were the ones wronged when they are exposed for their indifference and pride. We may be tempted to take matters into our own hands and get vigilante justice. Alternatively, we may become indifferent to the needs of those hurting and compound the injustice against them with our own passivity. What will be done to uphold true justice in this world?\n\nChristians for generations have wrestled with these questions as we seek to live as people of faith and action in the world. Thankfully, Jesus shows us how to be full of mercy toward those downtrodden and broken, while bringing truth to the powers that create systems of injustice. He brought truth to power by His righteous life, and calls us to seek justice in His name. He was murdered unjustly because of our sin and rebellion. He was raised to life again and will bring full and final justice for all people when He returns (2 Timothy 4:1). \n\nWe should be broken over the brokenness within this world, within the church, and within ourselves (Jeremiah 8:21). Indeed, Judges 19 calls us to weep over sin. But Jesus calls us to trust Him for the forgiveness of our sin. \n\nWritten by Jeremy Writebol\n\n \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day24.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 18:1-31, Deuteronomy 17:18-20, Psalm 78:56-66",
    "devo_title": "Dan’s Invasion and Idolatry",
    "devo_summary": "\n\n                    \n\n                    Sometime last year, my father-in-law was certified to do controlled burnings on his farm. He had to go through extensive training so he could learn the procedures requisite to carrying out what is understood to be the lawful burning of brush on his property. He was literally licensed to play with fire. Needless to say, my three sons thought this was the coolest thing ever. After all, what little boys wouldn’t want to take a flamethrower and burn things! My mother-in-law, however, was insistent that the boys shouldn’t be allowed to be out with their grandfather while he did the burnings, since there was an enormous threat of getting burned, or of a wildfire starting and consuming everything in its path—including my boys. \n\nOnce individuals practice idolatry, there is the risk of it spreading like wildfire. We see this throughout Israel’s history, and perhaps nowhere so clearly as in the account of the Danites and Micah in Judges 17–18. No sooner had the members of the tribe of Dan heard about the household gods and personal Levite that Micah had taken to himself, than they wanted those things for themselves. \n\nThis was not pagan idolatry in the strictest sense of the term. This was synchronized idolatry among the covenant people of God. That’s what made it so exceedingly dangerous for them, and so abominable to the Lord. Micah had done what so many have sought to do throughout human history—he personalized his religion so that it would fit according to his own desires. The Danites then envied the idolatrous liberation that Micah had seemed to attain. Once they took the household gods and the Levitical priest to themselves, the synchronized idolatry burned among them like wildfire, and it burned for many generations (Judges 18:30). \n\nThere is a warning here for us today. While we may not be setting up carved idols in our homes or among our friends and family members, we are constantly being encouraged to synchronize the true worship of God based on Scripture with what seems to fit with our own desires and the practices and values of our culture. The path to hell really is paved with good intentions. However, idolatry is a wildfire of rebellion against the Most High God. \n\nJesus came into this world to be the Great High Priest of His people. He lived and died and rose again in order to bring us into the presence of God and to make us a people who worship Him in spirit and truth. Jesus dealt with the wildfire of our idolatry by extinguishing the fire of God’s wrath as He hung on the cross for our idolatrous sin. When we keep our eyes fixed on Him, we take them off the idolatries of this world and in our own hearts.\n\nWritten by Nick Batzig \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day23.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 17:1-13, Leviticus 26:1, Hosea 11:1-12, James 3:9-12",
    "devo_title": "Micah’s Priest",
    "devo_summary": "\n\n                    \n\n                    There is a subtle but deadly danger lurking in modern Christianity. It is found in a false religion that masquerades as true faith. This false faith seeks to control or tame God, recreating Him into a more palatable God we are comfortable with. It is found in the hearts of those who ignore or reject the commands of God. Too many people would rather have a god who does not contradict them or say “no” to their desires. This is idolatry, plain and simple. The mirror of Micah’s narrative in Judges is a haunting reminder of this.\n\nJudges chapter 17 opens with a thieving son (Micah), an unjustly forgiving mother, and both of them committing apostasy together. In the discussion between the two, it is revealed that some of the stolen silver is used for pagan purposes—namely, to violate God’s explicit command against making idols. Micah created a personal shrine apart from God’s tabernacle, and established his own priesthood apart from God’s directed system. This was the homemade worship of a homemade god. Remember these words of warning from Leviticus: “Do not make idols for yourselves … for I am the LORD your God” (26:1).\n\nThe devastating truth of this text is that Micah is attempting to worship God as he pleases. However, this is a form of worship that does not please God. It is the essence of idolatry. An idol is not necessarily a statue; it is most readily a posture of the heart. Idol worship reveals that we do not want to submit to the one true God as He is. Therefore, we depict God as we like and worship Him as we please. In the end, we will find that we are not worshiping the real God, but rather an idol that cannot express the full range of God’s glory, and cannot deliver the full force of God’s power. Idols can never deliver on their promises.\n\nIn verse 8 of Judges 17, the narrative takes another turn toward idolatry. Micah meets a Levite who had departed from Bethlehem in Judah in order to find a place to stay. This priest was dissatisfied with God’s arrangements for his life, and Micah was all too happy for this priest to legitimize his idolatrous shrine and homemade religion. So the priest found his place, and Micah wrongly thought he had secured the Lord’s blessing by hosting the priest.\n\nMicah wanted a proper Levitical priest to justify his rebellion. The priest wanted to live out his role according to his own desires. Both Micah and the Levite were shifting their lives, even their convictions, to do what was most comfortable for themselves. They rebelled against the one true God, and made a god of their own.\n\nThis is what happens when you eliminate anything from the Bible that offends your sensibilities and crosses your will. If you pick and choose what you want to believe and reject the rest, you will never have a God who can contradict you, only one who suits your desires. The emptiness of a Micah-like religion is shown when you try to recreate God in your own image. The God of the Bible has revealed Himself as He is. You either believe in Him, trust Him, and turn to Him in submission, or you pursue the detestable false idol of self-made religion.\n\nWritten by Matt Capps\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day22.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 2:16-17",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\n                    \n\n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nAs we read Judges, we have been memorizing verses that illustrate the tragic cycle of rebellion in this book. This week’s verses are the next phases of the cycle. \n\nThe Lord raised up judges, who saved them from the power of their marauders, but they did not listen to their judges.\n\n—Judges 2:16-17a\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/4-Judges-4.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Psalm 32:6-7",
    "devo_title": "Grace Day",
    "devo_summary": "\n\n                    \n\n                    Each Saturday we are turning from the tragedy of Judges to read of the hope of the gospel in Psalm 32, a psalm about the joy of forgiveness. Use this day to pray, rest, and reflect on the hope that is ours because of God’s grace toward a rebellious people.\n\nTherefore let everyone who is faithful pray to you immediately.\n\nWhen great floodwaters come,\n\nthey will not reach him.\n\nYou are my hiding place;\n\nyou protect me from trouble.\n\nYou surround me with joyful shouts of deliverance.    Selah\n\n—Psalm 32:6-7\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day20.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 16:1-31, Jeremiah 15:15–16, Hebrews 11:32–38",
    "devo_title": "Samson’s Defeat and Death",
    "devo_summary": "\n\n                    \n\n                    The Samson story hurts my heart. Reading it today, it struck a particular nerve. Let me try to explain what I mean. One thing I see in my own heart, and in the culture all around me, is a tendency to treat almost everything as a potential punch line to a joke. I worry that we don’t take enough of life seriously, and as a result, don’t take our own lives seriously.\n\nSamson was a man with a gift—a God-given gift. In the story of Delilah’s attempt to seduce him to learn the source of his strength, Samson treats this God-given power as a curiosity or a parlor trick. It’s almost like he and Delilah are playing a cat-and-mouse game, and he’s just messing with her.\n\nSamson doesn’t seem to regard his power as a gift to be used. He doesn’t seem to care that Delilah has openly told him she wants to learn how to break him. He doesn’t seem to revere the Lord much at all. We all know the type—the person born with a gift, who seems bent on squandering it for personal pleasure. It’s a hollow existence.\n\nThis struck a nerve with me today because I believe we live in an age when reverence is in decline. I worry how this loss of a sense of the sacred is shaping us as people and as a society. \n\nWhen Samson finally tells Delilah his secret—that his strength is in his hair—two things happen. First, Delilah gets to work stripping Samson of his gift. And second, we discover that Samson didn’t understand his gift. Judges 16:20 tells us that when Samson’s hair was cut off, it wasn’t his strength that left him; it was actually the Lord’s strength that left him. Samson’s strength was not merely physical. It was spiritual.\n\nGod has promised to never leave us or forsake us. We can rest in knowing this is true because He has purchased us by the blood of Christ and we are now and forever His. The deal is done. But God also tells us that when we bury our talents or use His gifts for our own pleasure at the expense of others, it is possible that His discipline will be to remove those gifts, or at least the opportunity to use them. I don’t want to live that way, but I see the potential for that in my heart. I bet you do too.\n\nAs you read this story about a very familiar character in Scripture, examine your own heart before the Lord. Do you treat sacred gifts as playthings? Do you use your unique abilities to exploit others, or to serve them? Do you treat your talents and gifts as personal traits, or as resources for the good of those around you? Our gifts don’t come from ourselves. They come from the Lord. May we take that truth seriously, and use our gifts for the good of others and for the glory of God.\n\nWritten by Russ Ramsey\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day19.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 15:1-20, Psalm 106:40-48, Isaiah 40:27-31",
    "devo_title": "Samson’s Revenge",
    "devo_summary": "\n\n                    \n\n                    Samson strikes out on his adventures equipped with incredible strength, overcoming his enemies. He spends most of his time affiliating with the worldly Philistines, and while we are told that Samson “judged Israel twenty years” (Judges 15:20), we rarely see him actually serving his own people. And the Israelites don’t seem to be aware that he is judging them either. “Don’t you realize that the Philistines rule us?” they ask (v.11). \n\nSamson hardly seems like a hero of the faith, yet we find him listed in the “hall of faith” in Hebrews chapter 11. Indeed, we see many moments of seeming spiritual triumph. “The Spirit of the LORD came powerfully upon him” at Lehi, as Samson single-handedly overthrew the Philistines there (Judges 15:14). It is difficult to know how to weigh this gift of the Spirit against the rash blood-feuds and turmoil in which Samson is constantly embroiled.  \n\nNot all of Samson’s actions are unjustifiable. In fact, in many ways the book of Judges is a bit ambiguous, leaving lots of room for interpretation. It can seem as if Samson is simultaneously rash and righteously indignant. He takes personal vengeance upon the Philistines, but also strikes a blow against the oppressors of Israel. He bases his actions on one of the most fundamental principles of justice: “I have done to them what they did to me” (v.11). Of course, this very principle is also cited by the Philistines: “We have come to tie Samson up and pay him back for what he did to us” (v.10). Human justice falls short, and man finds himself in an eternal cycle of revenge.\n\nThis cycle of revenge, like the cycle of the judges, is the human story. In some seasons, God sends human deliverers like Samson, imperfect though they may be, who endure affliction and persecution, yet whose weakness is turned to God’s purposes (Hebrews 11:34). \n\nThe cycle is unfulfilling and unending, except for the intrusion of unmerited grace. In Christ, God gives us what we don’t deserve: deliverance. Unlike Samson, Christ is perfect and holy, truly set apart. He took upon Himself the brunt of God’s just wrath. Unlike the temporary rescue of the judges, Christ’s salvation is eternal.\n\nGod has heard the cry of His people: “Save us, LORD our God, and gather us from the nations!” (Psalm 106:47). And He has sent His salvation in our just Deliverer, Jesus Christ.\n\nWritten by Caleb Faires\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day18.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 14:1-20, Isaiah 11:1–5, Matthew 13:16",
    "devo_title": "Samson’s Riddle",
    "devo_summary": "\n\n                    \n\n                    A number of years ago, I met a famous person I had long respected from afar. This is always a tense experience, isn’t it? Most of us, I think, when we encounter famous people, get nervous to some degree. It happens to me less now than it did before because I have interacted with a number of “famous” Christians through my job. But still, especially when meeting some people, my palms get sweaty. Beyond that tension, I’m afraid that when I meet a famous person he or she is not going to be nice. Meeting someone we admire only to learn he or she is human is disorienting and disappointing.\n\nIn Judges 14, we continue to read about Samson, a judge appointed by God, a distinguished leader of God’s people, and a massive disappointment. We have already been exposed to Samson and his background, but it is here in chapter 14 that we see his disobedience. In verses 1–4, Samson disobeys the will of his parents and seeks a Philistine woman “because she seemed right to [him]”  (v. 7). This is a foreshadowing of his weakness. For all his physical strength, for all his natural gifting, he is proving to be weak in character. \n\nSamson shares a riddle with Philistine men at his marriage feast. He will pay them handsomely if they solve the riddle within a week, and they will pay him if they don’t. Because they have trouble solving the riddle, they threaten Samson’s wife, which leads her to squeeze the answer out of him, despite Samson not giving the answer to his mother or father. He loses the bet because his wife gives the Philistine men the answer. This leads Samson to kill thirty other Philistine men in order to pay up his end of the bet.\n\nFlashes of Samson’s strength, reliance on the Spirit of God, and anointing give glimpses of what the true Savior of God’s people, Jesus, would one day look like. Some may have thought Samson would be the deliverer of Israel, but unfortunately, he sought his own way and was undermined by his weakness. \n\nIn Isaiah 11 we read that the Savior of the world would shoot up from the stump of Jesse, in the line of David, and deliver the people of God from their disobedience and weakness. His justice would be righteous because His wisdom is from above. Jesus, our perfect Judge (Matthew 25:31-46), “will not judge by what he sees with his eyes, he will not execute justice by what he hears with his ears” (Isaiah 11:3).\n\nWritten by Chris Martin\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day17.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 13:1-25, Numbers 6:1-12, Isaiah 9:6",
    "devo_title": "The Birth of Samson",
    "devo_summary": "\n\n                    \n\n                    One of my great joys as a pastor is visiting and praying with families who have just welcomed a new child. Even if the child is their third or fourth, there is still a palpable sense of joy in the room. No parent I’ve spoken with in the hospital has shown me their newborn child and said, “Look at him. He’s so ordinary.” In Scripture, God often interrupted dark days with the announcement of a child’s birth. The birth of the child signaled hope, that God was at work even when things were dark. \n\nThink about the beginning of Exodus. Pharaoh forgot about Joseph and enslaved Israel for 400 years. The dark days of Israel’s slavery seemed as if they would continue unabated. But then God protected Moses, one of the Hebrew children who should have been put to death. Here in Judges 13, Israel repeated the cycle of falling away from the Lord, and the Philistines ruled over them for more than a generation. Then the angel of the Lord appeared to Manoah’s wife to announce that she would have a son. Ruth gave birth to Obed during the days when the judges ruled in Israel. The book of 1 Samuel begins with the narrative of Samuel’s birth, and uses wording reminiscent of Judges chapter 13.\n\nWe know where this is headed, don’t we? The Old Testament narrative concluded, and then Israel did not hear from God for 400 years. They languished under the yoke of Roman rule, but God ended His silence with an angel visiting Zechariah, telling the priest that his barren wife would give birth to a son, John (Luke 1:5–25). And then the angel Gabriel visited a young virgin to tell her she would have a Son who would save His people from their sins (Luke 1:26–38).\n\nThe announcement of Samson’s birth came with the declaration that he would be “a Nazarite to God from birth” (Judges 13:5). Following the instructions of Numbers 6:1-12, he would be “holy to the Lord” all the days that he was separated from the things forbidden by the vow.\n\nThe hope God brings to His people is always accompanied by a call to be holy. This summons is not a call to abstain from cutting our hair, but rather a devotion of the entire heart, soul, mind, and strength to God. We give Him our whole selves, cutting ourselves off from the influence of the world around us, and putting our indwelling sin to death in Christ Jesus. We are not alone in the fight to be holy. It does not rely on us having enough fortitude to say “no” to temptation because God is always at work in us through the power of His Spirit. \n\nWritten by Scott Slayton\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day16.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 12:1-15, 1 Samuel 8:19-22, Ecclesiastes 5:4-7",
    "devo_title": "Conflict with Ephraim",
    "devo_summary": "\n\n                    \n\n                    My friends, Ross and Jake, like to tell a story about the day that forged their friendship. It was the day of Jake’s “intervention.” No, Jake was not a drug user or an alcoholic, but he did have a persistent issue that threatened to damage all of his friendships. You see, Jake had a frustrating tendency to break off plans at the last minute. \n\nOn this particular occasion, Ross, Jake, their wives, and a few other friends had planned a Saturday afternoon cookout. Ross’s wife had bought the burgers, brats, and all the fixings. They’d set up the patio furniture and the corn hole boards. They were less than an hour away from the party when the phone rang. A college buddy had offered Jake two tickets to the game that afternoon. He’d gotten a better offer, so he ditched the cookout and headed to the game instead. \n\nNow, this was hardly the first time that had happened, so Ross was angry. Later that night, he drove over to Jake’s place to confront him. When Jake tells the story now, he changes his voice to show just how gruff Ross was: “We can NOT be friends if you keep doing this. I want your friendship. I need your friendship, but your word has to MEAN something.”\n\nFriendship is built on fidelity. Broken commitments, on the other hand, can kill. Jephthah was a man who, on the surface, seemed to care a lot about keeping his vows. In fulfillment of a rash promise, he sinfully sacrificed his own daughter (Judges 11:30-40). And when the Ephraimites broke their covenant obligation to fight with him against the Ammonites (Psalm 78:9-11, 67-72), he turned his sword against their entire tribe, wiping out 42,000 men (Judges 12:4-6).\n\nBut while Jephthah seemed to care about vows, his rashness shows us the instability and infidelity of his heart. He was faithful to himself but lacked fidelity to God’s ways. In his heart, Jephthah only did what was right in his own eyes. His mouth spoke too quickly, and his words brought futility and destruction —both to his own household and to the Israelite tribes he was supposed to lead. Jephthah had a short judgeship—just six years compared to an entire generation for the judges who’d preceded him (Judges 3:11,30; 5:31; 8:28)—and it marked the beginning of a downward spiral for the nation. \n\nPerhaps you’ve never been as rash as Jephthah, but we’ve all been enamored with the “better offer.” It’s tempting to let our eyes wander to the next best thing, rather than being faithful to the friendships, spouse, family, or church community where we’ve been called. \n\nWhere do we find the strength to be faithful? Where do we find the power to keep our vows? We can only find this strength in remembering that God has been faithful to us. He is a loyal God who kept His promises by sending Jesus Christ to save us. Our God is faithful and true (Revelation 19:11), and in Christ, all of His promises are “Yes” and “Amen” (2 Corinthians 1:20).  \n\nWritten by Jared Kennedy\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/08/HRT-Judges-instragram-Day15.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 10:15",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\n                    \n\n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nAfter the Israelites turned to worship false gods, they experienced great oppression. This week’s verse is their cry for help to the one true God. \n\n But the Israelites said, “We have sinned. Deal with us as you see fit; only rescue us today!”\n\n-Judges 10:15\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/4-Judges-2.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Psalm 32:3-5",
    "devo_title": "Grace Day",
    "devo_summary": "\n\n                    \n\n                    Each Saturday we are turning from the tragedy of Judges to read of the hope of the gospel in Psalm 32, a psalm about the joy of forgiveness. Use this day to pray, rest, and reflect on the hope that is ours because of God’s grace toward a rebellious people.\n\nWhen I kept silent, my bones became brittle\n\nfrom my groaning all day long.\n\nFor day and night your hand was heavy on me;\n\nmy strength was drained\n\nas in the summer’s heat.    Selah\n\nThen I acknowledged my sin to you\n\nand did not conceal my iniquity.\n\nI said,\n\n“I will confess my transgressions to the LORD,”\n\nand you forgave the guilt of my sin.    Selah\n\n-Psalm 32:3-5\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day13.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 11:1-40, Leviticus 18:21, Leviticus 20:2-5, Matthew 5:34-37",
    "devo_title": "Jephthah Becomes Israel’s Leader",
    "devo_summary": "\n\n                    \n\n                    Judges is a historical account of one of the most tragic periods in Israel’s history. It’s a tragedy that reads like a Coen brothers’ movie, like Inside Llewyn Davis or A Serious Man, demonstrating a consistent, unmitigated downward spiral. Even the quick glimmers of hope propel people into deeper and darker circumstances. \n\nJudges 11 is no exception to that sort of downward progression into darkness, lawlessness, and brutality. It is not so much a handbook of how things should be, but rather a lesson in how terribly dark things become when God’s people abandon His guidance. \n\nJephthah came from humble and painful beginnings. The son of a prostitute, he was driven from his tribe by his half brothers (Judges 11:1). Had the Law of the Lord been faithfully taught in Israel in those days, and had the Israelites chosen to faithfully follow it, Jephthah would’ve had a much different framework for his decisions. \n\nLeviticus chapters 18 and 20—which significantly predate the Judges period and should have informed Israel’s conduct and culture during that time—unequivocally condemn child and human sacrifice. In fact, while many of Israel’s neighbors practiced child sacrifice, the punishment for such an act in Israel was death (Leviticus 20:2). \n\nReaders typically have a variety of reactions to Jephthah’s decision to fulfill his rash oath. Some believe that his decision to keep his word was honorable; others find it barbaric and evil. Frankly, it seems like the inciting problem was that he made such a foolish oath to begin with. The oath that Jephthah saw as piety, we can see now as utter folly.\n\nIn His Sermon on the Mount, Jesus offers a clear and helpful teaching on how we should make oaths, promises, and vows: \n\n“Again, you have heard that it was said to our ancestors, ‘You must not break your oath, but you must keep your oaths to the Lord.’ But I tell you, don’t take an oath at all: either by heaven, because it is God’s throne; or by the earth, because it is his footstool; or by Jerusalem, because it is the city of the great King” (Matthew 5:33-35).\n\nHe goes on to give a bit of rationale for this teaching, saying, “‘Do not swear by your head, because you cannot make a single hair white or black’” (Matthew 5:36). \n\nThough Jesus did not mention Jephthah’s actions directly, it’s reasonable to think that many of His Jewish listeners would’ve been very familiar with the story. While it would’ve been easy for them to see the foolishness apparent in Judges 11, Jesus helps them see the ways that this sort of hasty and faulty thinking has seeped into their own lives. His loving, compassionate, and wise counsel to His listeners also extends to us now: Our “yes” should mean “yes,” and our “no” should mean “no.” “Anything more than this is from the evil one” (Matthew 5:37).\n\nOur speech is an action. What you say and how you fulfill it is indicative of who you are and Whose you are. Jesus, in His lovingkindness, wants to remind us that we do not and cannot control or know all the hairs on our own head. When we make rash pronouncements and yoke ourselves to unpredictable variables rather than the eternally consistent God, we back ourselves into a corner. The real foolishness of swearing upon “your mother’s life” or “your wife’s honor” or even, as many do, “to God,” is that while you may be earnest, you do not control the future—not even a little bit. \n\nLetting your “yes” be “yes” and your “no” be “no” frees you from the uncontrollable uncertainty of tomorrow. It also strengthens the weight of your simple words in making commitments. Swearing “to XYZ” might seem like a stronger binding, but the real strength lies in simple and wise straight-shooting answers, rooted in a life anchored to Christ.\n\nWritten by Andrew Stoddard\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day12.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 10:1-18, Isaiah 30:15, Luke 15:11-32",
    "devo_title": "Israel’s Rebellion and Repentance",
    "devo_summary": "\n\n                    \n\n                    With two daughters under the age of five, it seems like my daily routine is trying to manage their fickle emotions. On the one hand, both are sweet and kind in their own unique ways, yet defiant and stubborn on the other. One moment, they want to love and hug one another and their parents. The next, they’re itching for a fight. Around and around we go, ad nauseam. \n\nAt my best, I can be extremely patient with them. I can pray in the moment and remind myself that God is patient with me, and He will help me to be patient with them. At my worst (and probably most often), I can be short-tempered and impatient, doing anything I can think of to appease the situation and have control over their emotions. Of course, as anyone with kids knows, trying to control a child’s emotions is like trying to contain the force of a hurricane with an umbrella.\n\nThe story of Israel in the Bible is not much different than what I just described about my own household. Just when you think Israel recognizes the goodness of the Lord and trusts Him to lead them, their hearts turn on a dime, as they grumble and complain about His apparent reluctance or inability to meet their every need in that moment. \n\nIn our passage today, the Israelites engage in the worship of other gods. It seems they do this primarily because of the instant gratification of receiving mercy from other nations. For them, the most expedient way to obtain comfort was to give into the demands of the other nations, bowing down and worshiping those gods over the Lord.\n\nRightly so, God is unhappy with this situation. He reminds them that He’s the one who delivered them from slavery in Egypt and so much more. As a result, He tells them He won’t deliver them—He’ll leave it up to the gods of the other nations.\n\nNow, unlike me when I’m frustrated or impatient with my children, God’s anger is righteous and perfect. He is not snapping at them because He is spiritually immature or because He wants His own comfort; rather, He’s frustrated because He knows the other gods cannot deliver them. He knows that worshiping idols will lead to not only immediate, but eternal, destruction.\n\nJust like my daughters, Israel’s hearts can be fickle and immature. But unlike me, God is consistently and immovably loving and patient and kind. His discipline is never a result of sinful emotion, but out of His perfect love for us (Hebrews 12:4-11). May we remember that God’s commands, and even His judgment, are ultimately for our good and His glory—found most clearly in the death and resurrection of Jesus and by the sealing of the Holy Spirit.\n\nWritten by Brandon D. Smith\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day11.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 9:1-57, Psalm 68:11-14, John 4:19-24",
    "devo_title": "Abimelech Becomes King",
    "devo_summary": "\n\n                    \n\n                    If you ever needed proof that the Bible isn’t G-rated, here it is. It seems like today’s reading was taken from a Hollywood plotline instead of the pages of Holy Scripture. Yet, here we are in the midst of a family conflict that would make the disputes of any mob family pale in comparison.\n\nIf we see anything in this story it should be ourselves and the corruption of our own hearts. Any one of us could be Abimelech. Instead of looking to the Lord and trusting in Him to provide a leader when his father Jerubbaal (Gideon) died, Abimelech took matters into his own hands. He took power by force, murdering any potential rivals to a supposed “throne” in Israel. He did whatever he thought necessary in order to win status and authority. We’re capable of doing the same.\n\nWe may read Abimelech’s story and feel as if we would never stoop so low as to murder our own brothers, yet Jesus teaches that whenever we possess hatred in our hearts toward our brothers we are murderers (Matthew 5:21-22). We may see the brazen way in which Abimelech torches his own people and his own city out of pure spite for their betrayal of him and think we’d never be so wicked. But each of us is capable of the same hatred and wickedness. Whenever we are divisive, gossiping, playing for power in the church, we believe and behave just as Abimelech did. We may scoff at the cowardly way Abimelech dies by having his servant armor-bearer run him through so that his reputation isn’t ruined because he was killed by a woman. But we, too, can be cowardly and seek to protect our reputations, lying and manipulating others to make ourselves look heroic instead of helpless.\n\nAll of this shows our radical need for God’s forgiveness and empowering grace. We need redemption. We need a Savior. Tragically, there is no redemption in Judges chapter 9—it’s all bad. But we do have a Savior who will rescue us from the curse our evil should bring upon us. We have Christ who died because of the anger we have toward our brothers. Christ laid down His life for our gossiping tongues, hateful hearts, and divisive actions against His people. His righteousness becomes ours through faith, so we don’t have to manipulate others to keep our reputation. Our identity is secure in Jesus Christ. \n\nWe are capable of great evil—just like Abimelech. But we are deeply loved in Christ, and His Spirit has given us new hearts and a desire to obey. Let’s repent and turn to Him again today. Let us be true worshipers of the Father in Spirit and in truth (John 4:23-24).\n\nWritten by Jeremy Writebol\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day10.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 8:1-35, Deuteronomy 20:5-8, 1 Corinthians 1:18-31",
    "devo_title": "Gideon Pursues the Kings of Midian",
    "devo_summary": "\n\n                    \n\n                    The church of God throughout the ages has always stumbled over a desire for success, sophistication, and status. The quest for one or more of these things in the church inevitably produces discontentment in the hearts of professing believers. A vicious cycle often follows, breeding disunity and then disdain. There is, of course, an irony to the quest for success, sophistication, and status. God’s ways are completely unlike our ways. God chooses to use what is weak and unimpressive in the world’s sight in order to confound the wisdom of the world. \n\nWe see this principle at work in the account of Gideon and his 300 men. God cut back Gideon’s army so that He would get the glory. We see it even more clearly in the account of Jesus Christ crucified. The Son of God came to die in weakness, foolishness, and failure in the sight of the world. In this way, God received maximum glory in the salvation of His people through His death on the cross. \n\nAfter Gideon and his reduced army of 300 return from the initial defeat of the Midianites, his brethren from the tribe of Ephraim scolded him for not calling them to come and assist him in battle. Gideon had been obedient to the call of God to cut back his army so that God would get the glory. Now, a division began to brew over who should get the glory with Gideon and his men. After wisely defusing the anger of the Ephraimites by humbly appealing to God’s glory, Gideon went back to the work of destroying the remainder of God’s enemies among the army of the Midianites. \n\nThis is a beautiful picture of the wisdom and power of Christ crucified that the apostle Paul mentions in his first letter to the Corinthians. When dealing with a division that was raging in the church over a desire for sophistication and worldly status, Paul reminded the members of that affluent church that God was glorified in the foolishness of the message preached. While many Christians strive after worldly success, sophistication, and status, God levels our pride and unites us together in Christian love by reminding us that “Christ is the wisdom and power of God” (1:24), though He is foolishness and weakness in the sight of the world. May we never lose sight of this precious and all-encompassing truth.\n\nWritten by Nick Batzig\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day9.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 7:1-25, Isaiah 41:10, Ephesians 6:10",
    "devo_title": "Gideon’s Army",
    "devo_summary": "\n\n                    \n\n                    Christianity is counter-cultural in ways that demand absolute trust in God from its adherents. One of the most notable differences between the message of Christianity and the message of American society is found in the relationship between power and weakness. In our culture, power is found in self-trust and subjecting others to our will. In Christianity, power is found in trusting God and submitting to His will. In Christianity, weakness is the way to true victory. \n\nThe testimony of Scripture recounts the many ways God has used the inadequacy and weakness of His servants to accomplish His will and accomplish His victory. The pattern is simple: When we fall at the Lord’s feet in our weakness, we will find the victory and power that comes from His hand. Judges 7 may be the most striking reminder that weakness is, in fact, the way.\n\nIn Judges 7, God teaches Gideon and his army to depend on Him in light of insurmountable odds they faced. The enemy armies, the Midianites, were 135,000 troops strong in facing Gideon and his 32,000 men. Place yourself in Gideon’s shoes for a moment and consider how terrifying this prospect would be. Based solely on human calculations, Gideon and his army have no chance.\n\nIn light of these odds, we read one of the most amazing sentences in the Bible. God tells Gideon, “You have too many troops” (v. 2). Yes, you read that right—too many troops. The reason for this assessment is even more staggering. Even though Gideon has more than 100,000 fewer men in his army, if God were to grant them victory, they would still be tempted to claim that victory by their own power. Therefore, God commands Gideon to send the fearful men home, resulting in 22,000 troops departing, and leaving 10,000 to fight. But that is still too many. God further shrinks the total, to just 300 men. Gideon and his army were stripped down so much that they had two choices: either fully trust God or perish.\n\nIsn’t it often the case that in times where we are tempted to trust in our abilities and power, God often removes our foundations of self-confidence in order that we would more fully trust in Him? Have you ever considered that one of the greatest dangers of victory is that of increased self-reliance? Spiritually, that can be more dangerous than defeat. You cannot be too small for God to use you.\n\nLet us be reminded of Gideon, a man from a weak family, from a weak tribe, with only a handful of men to fight the enemy. All of these factors lead Gideon and his men to understand that their victory came from God’s power, not their own. When it came to their victory, not one Israelite lifted a finger in battle; the only thing they did was trust and obey God. Therefore, the glory of victory belongs to God and God alone.\n\nGod’s power is most fully displayed in our weakness. Sometimes God insists that His people be reduced to utter helplessness so that they recognize that their deliverance can only be credited to His power and His power alone. This is why Paul argues in Ephesians 6:10, “Be strengthened by the Lord and by his vast strength.”\n\nIt is comforting that God knows the fears of His servants and how scared we can be in our circumstances. Yet, He does not ridicule us in our fears or mock us in our fragility. You see, God’s saving power moves through us when we admit that we have no power in ourselves.\n\nIn all of this, by God’s grace, we are brought to a place where we can say that any victory we experience is from the hand of God. Just as the hand of God saved Gideon and his army, every Christian has experienced the same grace in Jesus Christ. Did you clean yourself up before God saved you? Or did God save you while you were still dead in your sins, weak and inadequate? We have no chance for victory over sin apart from Christ. Praise be to God that He is our strength, and that His power has been made known in our weakness.\n\nWritten by Matt Capps \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day8.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 2:11-12",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\n                    \n\n                    Scripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nAs we read, we will memorize verses that illustrate the repeating cycle seen in the book of Judges—the tragedy of forgetting God. This week’s verse summarizes Israel’s recurring rebellion against God. \n\nThe Israelites did what was evil in the LORD’s sight. They worshiped the Baals and abandoned the LORD, the God of their fathers, who had brought them out of Egypt.\n\n-Judges 2:11–12a \n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/4-Judges-1.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Psalm 32:1-2",
    "devo_title": "Grace Day",
    "devo_summary": "\n\n                    \n\n                    Each Saturday we’ll turn from the tragedy of Judges to the hope of the gospel in Psalm 32, a psalm about the joy of forgiveness. Use this day to pray, rest, and reflect on the hope that is ours because of God’s grace toward a rebellious people.\n\nHow joyful is the one\n\nwhose transgression is forgiven,”\n\nwhose sin is covered!\n\nHow joyful is a person whom\n\nthe LORD does not charge with iniquity\n\nand in whose spirit is no deceit!\n\n-Psalm 32:1-2\n\n\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day6.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 6:1-40, Psalm 127:1, James 1:16-17",
    "devo_title": "The Lord Calls Gideon",
    "devo_summary": "\n\n                    \n\n                    We are naturally inclined to admire those who boldly champion their own cause, those self-defined, rugged individuals who declare, “I did it my way,” or “I am the captain of my soul.” But one of the most frightening lines in Scripture is this: “The LORD handed them over” (Judges 6:1).\n\nWhen God hands us over to our own ways, to the consequences of our own actions, when we are allowed to captain our own vessels, this is His judgment. Why? Because we were never designed to be self-determining,autonomous creatures. We were made for God, for His glory. As Augustine declared, “Our hearts are restless, Lord, until they find their rest in you.”\n\nWhen we’ve been allowed to go our own way and face the consequences of this judgment, we also tend to misunderstand the consequences. We tend to think of oppression in terms of what the oppressor is doing, or how we are suffering, but fail to account for what God is doing: God is always acting. Do we notice when God chastises us? Do we notice that His chastisements are designed to bring us back to Him?\n\nGod sent the Midianites like locusts to afflict rebellious Israel. Judgment also came in the form of cowardice and fear—Israel lost heart. When Israel finally called out to the Lord, His response addressed both of these. First, remember the God who brought you out of Egypt. He is the God who sends locusts in judgment on those who forget Him and His word. Second, do not fear. If we turn to Him, we will find a sure deliverer, for He is our salvation.\n\nWhy had they fallen prey to Midian and Amalek? Why had they given into fear? Because they had all decided to rely on themselves. “Each man did what was right in his own eyes” (Judges 17:6). Each man did it his own way. What this ultimately amounted to is that each man forgot God. God put it simply: “You did not obey me” (Judges 6:10).\n\nWhen God called Gideon, it was immediately apparent that God was doing more than raising up a strong man to lead His people to victory. Gideon was nothing like the deliverer Israel expected. The first time we encounter this “valiant warrior,” he is hiding from his enemy. As the youngest son of the weakest family in the lowliest tribe of Israel, Gideon cowers when God says, “Go in the strength you have” (v. 14). When he does act “bravely,” he only does so under cover of darkness, because he was afraid of his own family.\n\nHow could this man deliver Israel? How could this man be a hero? The answer is simple: God was with him (v. 16). Like Jacob’s “victory” wrestling the Lord at Peniel (Genesis 32), Gideon would not win by his own might. But God’s power is made perfect in our weakness, and He confounds the might and the wisdom of the world. To give up everything to God is to win everything; to yield to Him is victory. \n\nThe story of Gideon isn’t actually about Gideon. It isn’t chiefly about his doubting or his bravery. It is about God, who alone is victory. He is the one who builds the house. All the bold individuals who seek to build on their own labor in vain. \n\nMay God be gracious and keep us from having our own way. May He triumph in our weakness, and may He receive all the glory, for He alone is our deliverer.\n\nWritten by Caleb Faires\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day5.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 4:1-24, Judges 5:1-31, Job 19:25-27, Psalm 68:7-10",
    "devo_title": "Deborah Judges Israel",
    "devo_summary": "\n\n                    \n\n                    There’s about a foot of distance between our head and our heart. And there’s only about four to six feet between our heads and our feet. But it takes so long for obedience to go that distance! Too often I understand God’s commands and priorities in my head, but I fail to feel their importance. I may know what God has spoken, but I’m slow to put it into practice.  \n\nSometimes this is a problem with the way I think about leadership too. I can wrongly think that the person who is the most articulate—the one who seems to hear God’s voice most clearly—is a great leader. But true leadership doesn’t just hear and speak; it puts words and faith into action (James 2:14–26). Barak didn’t have any issues with understanding God’s command to deploy Israel’s troops. He and Deborah both heard God speak (Judges 4:6). But what held Barak back from true leadership was his lack of courage. He wasn’t brave enough to act.\n\nI have sympathy for Barak. It’s hard to step out in faith when circumstances are stacked against us. From a merely human perspective, Barak’s mission was doomed to failure. God told Barak to deploy his troops on Mount Tabor, but the mount was exposed, bordered only by the Kishon River basin, which was dried up most of the year. If he’d deployed his army there, Sisera’s chariots could easily surround them and cut off their escape. This was a suicide mission. No wonder Barak found God’s command so hard to obey! But despite the odds, Deborah and Jael boldly trusted God. Their courageous leadership succeeded where Barak’s petered out (v.9). \n\nDeborah boldly summoned Barak. She reminded him of God’s promise of victory. And when he continued to cower, she bravely went into battle with him (vv.6–10). God honored her faith and fought for the Israelites. From chapter 5, we learn that the Lord poured down rain, causing flash floods that trapped the enemy chariots (5:4). As a result, God threw Sisera and all his charioteers into a panic before Barak’s assault (4:15–16). \n\nThen, as the enemy Sisera fled on foot, Jael, the wife of Heber the Kenite, offered him a place to rest. Inviting the general into her tent was a risk. Sisera had hoped to carry off Israelite women after the battle— “a girl or two for each warrior” (5:30). He could have easily taken advantage of Jael sexually before he fell asleep. But God honored Jael’s courage (and quick thinking!) by delivering Sisera’s life into her hands (4:17–22; 5:24–27).\n\nWhere can we find courage like Deborah’s and Jael’s? Where do we find the kind of obedient faith that is willing to go to risky, vulnerable places in obedience to God’s call? This kind of leadership only comes from looking to the invulnerable God who made Himself vulnerable for us. \n\nGod’s own courageous mission teaches us courageous leadership. The Father loved the world and sent the Son. The Father and the Son sent the Spirit. The Spirit forms us as His church and calls us to courageously participate in His mission to the world. Even when we languish in courage, God promises to send His Holy Spirit like abundant rain. He revives us, so that we can leave behind what hinders, step out, and boldly obey His Word (Psalm 68:9).\n\nWritten by Jared Kennedy\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day4.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 3:1-31, Psalm 91:1-16",
    "devo_title": "The Lord Tests Israel",
    "devo_summary": "\n\n                    \n\n                    Children rarely see discipline as an act of mercy. When I was young, I disobeyed my parents enough that when they revoked certain privileges or imposed other consequences, I did not consider what other, worse disciplinary action they could have taken against me. When a parent grounds his or her child for a week and revokes phone privileges for a day, the child rarely considers the discipline merciful. Why? Because children are naturally more distraught over the presence of any consequence than they are considerate of the fact that the consequence could have been ten times worse.\n\nIn Judges 3, we see God discipline His people, Israel, but in a merciful way. Their resulting disobedience shows that they did not fully grasp the grace of God in the work of God.\n\nAfter Israel disobeyed God by not killing off all of the Canaanites He’d commanded them to eliminate, God could have punished His people by wiping them off the face of the earth. He could have sent nations of Gentiles to kill and enslave them immediately. But He didn’t. Why did God handle the disobedience of Israel this way? Scripture tells us, “This was to teach the future generations of the Israelites how to fight in battle, especially those who had not fought before” (Judges 3:2).\n\nThroughout the entire chapter, we see Israel repeatedly disobey God despite His mercy toward them. They find themselves in compromising situations because of their disobedience. They cry out to God, and in His mercy God delivers His people with a judge. Upon their deliverance and freedom from threat, Israel recedes into its patterns of disobedience and sin. This cycle continues throughout the chapter and throughout the book of Judges. Throughout its existence, God made clear to Israel that it was to maintain its purity and its holiness, yet despite His discipline and His mercy, they pursued their wants over God’s wisdom.\n\nAll of us are broken in some way. Our sin separates us from God and, apart from the cross, we are enslaved by our idolatry. In Judges, we see Israel’s continued cycle of self-destruction and disobedience. It’s the same cycle we find ourselves in if we do not cling to the finished work of Jesus Christ. \n\nSometimes the rules and wisdom of God may seem unattractive to us. At times we may be tempted by the wooing of worldly influences and idols like Israel was. In humility, we must maintain a posture of repentance that recognizes the mercy of God present in the commands of God.\n\nWritten by Chris Martin\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day3.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 2:1-23, Deuteronomy 4:9, 2 Timothy 2:2",
    "devo_title": "Sin and Judgment",
    "devo_summary": "\n\n                    \n\n                    If you were to ask me to name one image from my childhood, I would immediately tell you about our family dinner table. My dad was a state trooper, and each evening he would get home just in time for us to eat together. He sat at the end of the table and kept us entertained with stories about his childhood, friends, and work. I heard some of those stories dozens of times, and now I tell them to my children at our table. He died before two of my children were born, and I want them to feel like they know him. I don’t want the memories to die, so I keep telling the stories.\n\nJudges narrates the sad tragedy of a people who forgot their story, and highlights the unfaithfulness of Israel in the face of God’s unfailing faithfulness. Their fathers saw God part the Red Sea and drown Pharaoh’s army. Their fathers could tell stories of God providing bread from heaven and leading them through the desert with a cloud during the day and a pillar of fire by night. They had also heard of the consequences of not believing God’s promises and walking in obedience. This generation was the first to enter the land of promise because their fathers did not believe God could lead them there.\n\nThe victories God gave Joshua should be fresh in their minds. How could they forget the walls of Jericho crashing down? They were there the day the sun stood still, but they broke covenant with God and made agreements with the inhabitants of the land. They believed they were better served and protected by doing what God forbade than by doing what He commanded. More than anything, their actions showed they failed to trust the promises of God, even though they had seen ample evidence that He would always provide and protect them.\n\nWhen we remember how God has kept His promises in the past, it fuels our current faith and obedience. This is the point Moses made to the Israelites, to not “forget the things your eyes have seen” (Deuteronomy 4:9). Forgetting what God had done to deliver them would lead to present unfaithfulness in heart and life. Telling these stories of God’s faithfulness, providential care, and miraculous deliverance would burn them into the hearts of their children and keep them fresh in their own hearts.\n\nOn this side of the cross, we have the benefit of seeing the big picture of God’s redemptive story. We read about the Exodus and know that God’s people will one day be rescued by a better Deliverer than Moses, and from a deeper slavery than physical captivity in Egypt. Our deliverance through Jesus Christ is more miraculous than the Passover, and the great reward of eternity with Him is the best promised land imaginable. May we continue to tell this great story of God’s salvation to our children, our friends, and our neighbors, because we want them to know it well, and because we never want to stop remembering it ourselves.\n\nWritten by Scott Slayton\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day2.jpg"
},
{
    "book_title": " Judges",
    "devo_passages": "Judges 1:1-36, Genesis 49:8-12, Psalm 34:17",
    "devo_title": "Failure of the Tribes",
    "devo_summary": "\n\n                    \n\n                    When I was young, stories were simple. There were good guys and bad guys, and everyone could be divided into one of those two groups. I grew up thinking the key players in the book of Judges were the good guys. You have Gideon putting out the fleece as an act of heroic faith. You have Samson with his unmatched strength pulling down a pagan temple with his own two hands. You have the left-handed Ehud getting the drop on the evil King Eglon.\n\nAs an adult, I find myself shifting uncomfortably in my chair as I read back through these stories that once seemed so simple. The book of Judges is complicated. The people I once took as the heroes of the story look less like role models the older I get. In fact, sometimes the people I once assumed were the good guys now seem downright villainous. That’s because they often are.\n\nIn Judges, Israel experiences a downward spiral of rebellion and rescue with each new judge. We witness their fall from obedience into desolation. We long for the seed of hope that rises from the books (like Ruth and 1 Samuel) that follow to take root. But this book does not resolve. It just ends with everyone doing whatever seems right to them. It ends with people needing God to intervene—for the righteous to cry out and for the Lord to hear them and rescue them from all their troubles (Psalm 34:17).\n\nIt wasn’t supposed to go this way. Before the people of Israel entered the promised land, the Lord warned them not to embrace the religion of the Canaanites: “When you enter the land the LORD your God is giving you, do not imitate the detestable customs of those nations” (Deuteronomy 18:9).\n\nBut the book of Judges shows us that this is exactly what they did. They embraced the Canaanite religion in spite of God’s warning. This rejection of God led to some of the most catastrophic and sad stories in Scripture. \n\nJudges is not a collection of heroic tales. It is a tragedy, in both the literal and literary senses of the word. Judges recounts the true and tragic unraveling of the people of Israel as they chose to abandon God and live like their pagan neighbors. Like Macbeth or The Great Gatsby, Judges is told as a tragedy, where the arc of the story lands with a thud rather than a victory parade.\n\nGod is the hero of Scripture, and Judges demonstrates this in a pronounced way. I draw hope from the fact that God works through broken, morally compromised, deeply flawed people to bring about His perfect will. I draw hope because that perfect will is ultimately fulfilled in the finished work of our perfect Savior, Jesus Christ, who is also our righteous Judge. And His story does not end in ruin, but in peace and glory forever.\n\nWritten by Russ Ramsey\n\n                ",
    "img_url": "https://hereadstruth.com/wp-content/uploads/2018/07/HRT-Judges-instragram-Day1.jpg"
}]