[
  {
    "book_title": "Promises of God",
    "devo_passages": "2 Corinthians 1:20, Exodus 34:4-7, Deuteronomy 7:9, Luke 24:13-31, Colossians 1:15-20",
    "devo_title": "The Promises of God Are Yes in Christ",
    "devo_summary": "\n\nBy She Reads Truth\n\nThere are two chief mistakes we can make when we read the promises of God, and they are equally dangerous. The first is to assume that every promise can be lifted from the pages of Scripture and applied directly to our lives. The other is to believe that nearly all of the promises came and went in the ancient world—that the only one meant for us today is the promise of eternal life we receive when we place our trust in Christ. Neither approach is biblical, though, for Scripture says that, “no matter how many promises God has made, they are ‘Yes’ in Christ” (2Corinthians 1:20 NIV). \n\nAnd of course they are! How else would the plans of our “compassionate and gracious God” work (Exodus 34:6)? When every story in the Old Testament points forward to the coming of the Son of God, and every word in the New Testament is a response to His life and work, we should not be surprised to find that every promise is indeed “Yes” in Christ. \n\nNot only that, but all the promises in the Old Testament—the ones we thought were surely over and done with, or meant only for ethnic Israel—are transformed and enlarged in the wake of Christ’s ministry. In many cases, the New Testament writers help us see the way these promises are renewed in Christ. In this way, learning about the promises of God becomes a means of deepening our understanding of Christ and His work, and an occasion to worship our great Savior.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-1-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Genesis 12:1-7, Galatians 3:15-29, Romans 4:13-25, Hebrews 11:8-16",
    "devo_title": "I Will Bless You",
    "devo_summary": "\n\nBy She Reads Truth\n\nAs the story of the Bible opens, we encounter human failure at every turn. Adam and Eve invite sin and death into our world. Cain kills Abel, even after God warns him about the evil lurking in his heart. And there’s nearly everyone else—“every inclination of the human mind was nothing but evil all the time” (Genesis 6:5). Who could blame God if He had decided enough was enough? But in Genesis 12, God does something tremendously gracious: He chooses to befriend an elderly man from Mesopotamia and bless him beyond all imagination. \n\nThe promises God made to Abram, later renamed Abraham, seem too big for reality: descendants enough to replace the stars in the sky, with kings among their number; a name known far and wide; and a piece of real estate approximately the size of New Hampshire. These promises seem so removed from our everyday lives that we tend to leave them in the past, there among the tents and flocks of Abraham and Sarah. But the New Testament tells us that these promises are actually ours in Christ. \n\nWe are counted among the stars in the sky Abraham saw, heirs of the blessings bestowed upon the patriarch in response to his faith (Galatians 3:29). Abraham is our father by the way of the promise, just as he was Isaac’s (Romans 4:17). We are even “kings,” since we have been given a royal priesthood (Genesis 17:6; 1 Peter 2:9). And the land? That may be the best part. In Christ, that promise has been transformed, stretched out, and enlarged. It now encompasses the whole earth (Romans 4:13), including the city of New Jerusalem where we will one day live with God, just as Adam and Eve did so many years ago in Eden (Hebrews 11:16; Revelation 21:2–3). In God’s promises to Abraham, Christ has transformed our failures into blessings, not because we deserve it, but because He is just that good. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-2-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Joshua 1:1-9, Joshua 3:1-17, Psalm 73:21-28, Hebrews 13:1-6",
    "devo_title": "I Will Not Leave You or Abandon You",
    "devo_summary": "\n\nBy She Reads Truth\n\nWhat must it have been like to receive instructions directly from the mouth of the Lord? “Now you and all the people prepare to cross over the Jordan to the land I am giving the Israelites,” God told Joshua (Joshua 1:2). Moses had died, and now it was Joshua’s turn to lead—not because Joshua said so, but because God had said so. \n\nScripture does not describe Joshua’s emotional reaction to God’s directive, but we can infer from what God said next that Joshua was less than confident about the enormous task ahead of him: “I will be with you, just as I was with Moses. I will not leave you or abandon you” (Joshua 1:5). Put yourself in Joshua’s place, the weight of a nation’s survival on your shoulders and impossible battles before you. Let God’s promise sink in.\n\nGod was indeed with Joshua. In the chapters that follow, we see Joshua successfully lead the Israelite people across the Jordan accompanied by none other than the tangible presence of God with the ark of the covenant. And we see God fight for Israel as they take possession of the promised land under Joshua’s command. Everyone who followed Joshua benefited from God’s presence.\n\nBut Joshua’s life and mission point to someone greater: Jesus Christ. And just as God’s promise to Joshua was for the benefit of all those who followed and obeyed Joshua, the promise is extended today to all those who follow and obey Jesus. The Lord’s presence is with us, wherever Christ leads. We can, therefore, rejoice in the freedom from fear that is ours in Christ. “The Lord is my helper; I will not be afraid. What can man do to me?” (Hebrews 13:6).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-3-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "2 Samuel 7:4-17, Isaiah 9:2-7, Isaiah 11:1-9, Daniel 7:14, Matthew 4:12-17, Revelation 11:15-17, 2 Timothy 2:8-13",
    "devo_title": "I Will Give You an Everlasting Kingdom",
    "devo_summary": "\n\nBy She Reads Truth\n\nIn Jesus’s day, it was in the air—a collective desire that nearly everyone in Judea and Galilee felt. A thousand years had passed since God had made a promise to David, and it was the sort of promise that was only held onto because it had come from God Himself: “Your house and kingdom will endure before me forever, and your throne will be established forever” (2Samuel 7:16). \n\nIt certainly didn’t look like one of David’s descendants was poised to resurrect his father’s kingdom any time soon. Rome held the land and its people tightly. In fact, it was treason to speak of another king besides Caesar. Yet when Jesus began His public ministry, the coming kingdom was central to His message—only Jesus spoke of the kingdom as belonging not merely to David, but to God. \n\nJesus is the King who sits on David’s throne, but more than that, He sits at the right hand of the Father. And His kingdom is not limited to the land of Israel; it spreads across the whole earth as the gospel is preached and received, until one day when it will be said, “The kingdom of the world has become the kingdom of our Lord and of his Christ” (Revelation 11:15). \n\nThose of us who know Jesus as Lord also know the kingdom as the home we long for. In Christ, we are now its citizens (Philippians 3:20), and when He returns, we will reign with Him (2Timothy 2:12). Until that day comes, we join with David and every other faithful soul throughout history who has ached with longing for the promised kingdom.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-4-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Jeremiah 29:1-29, Psalm 33:11, Ephesians 1:4-5, Colossians 1:27, 2 Peter 1:3-11",
    "devo_title": "I Will Give You a Future and a Hope",
    "devo_summary": "\n\nBy She Reads Truth\n\nToo good to be true. The promise of Jeremiah 29:11 can feel just too good to be true. Often spoken over another person as an encouragement to combat a disappointment or setback, the words can ring hollow when understood in their original context. That’s because God wasn’t talking about career success, dating relationships, or winning the JV soccer game. And He wasn’t addressing anyone and everyone. He was talking specifically to the people of Judah in exile. The “plans” God had involved restoring them as a nation and bringing them back from Babylon into the promised land. So unless you happen to be a sixth-century-BC Jew stuck in Mesopotamia for the duration, keep on moving—there’s nothing to see here.\n\nIn one sense, this is true. It won’t do to simply pick up a promise meant for someone else and take hold of it for ourselves or someone we love. But God has grafted all believers into His family tree of God (Ephesians 1:4–5; see also Romans 11:17). So the “future” God promised to His people in the Old Testament is now ours in Christ if we know Him, and the “hope” is bigger and better than anything we can imagine, because it is the hope of glory (Colossians 1:27), of eternal life in the presence of the King (2Peter 1:4; Revelation 21:3), and of all things being made new (Revelation 21:5). \n\nWhen faced with life’s challenges, the promise we have in Jeremiah is not that everything will work out the way we want, but instead that Christ will bring good from even the darkest moments this world can dish out. And in that, there is something lasting to hold onto. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-5-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Psalm 33:11",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nThe counsel of the LORD stands forever, the plans of his heart from generation to generation. —Psalm 33:11\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-6-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "2 Corinthians 1:20",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the key verse for this reading plan, a reminder that all of God’s promises are true in Christ.\n\nFor no matter how many promises God has made, they are “Yes” in Christ. And so through him the “Amen” is spoken by us to the glory of God.  —2 Corinthians 1:20 NIV\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Lockscreen-7-473x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Matthew 6:9-14, Mark 2:1-12, Luke 7:36-50, Acts 10:34-43, Ephesians 1:7-8",
    "devo_title": "I Will Forgive Your Sins",
    "devo_summary": "\n\nBy She Reads Truth\n\nHad you been chosen as an Old Testament prophet, you would have had the unpopular job of giving people bad news. Judgment, punishment, destruction—these were the sort of words you might have become known for using. Sure, you would have also used their redemptive counterparts, like restoration and salvation, but often only after all the judgment, punishment, and destruction talk. When Jesus came along, He spoke words of warning like the prophets before Him, but He also offered forgiveness in a way that they, not being God in the flesh, could not. “For God did not send his Son into the world to condemn the world, but to save the world through him” (John 3:17).\n\nWhile some people were drawn to Jesus, many were offended by His words and actions. Scribes accused Him of blasphemy for telling a paralytic man his sins were forgiven (Mark 2:5–7). Pharisees were appalled that He let a notoriously sinful woman touch Him (Luke 7:39). Why did Jesus say these things and spend time with these people? \n\nJesus knew the Father’s heart, a heart that aches for sinners limping through this world under the weight of rebellion and brokenness. It had been His plan from the beginning to provide a way for sins to be forgiven. That way is Jesus. No matter how dark or scandalous our personal sins may be, God extends mercy to us—and to the entire world—because of the price Jesus paid on the cross. He laid down His life to secure pardon for every repentant sinner. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-8-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Matthew 11:28-30, John 14:27, John 20:19-23, Psalm 55:22, Isaiah 53:1-5, Philippians 4:4-7, Colossians 3:12-17",
    "devo_title": "I Will Give You Peace and Rest",
    "devo_summary": "\n\nBy She Reads Truth\n\nWhen you think of rest, you may envision a quiet weekend in a quaint cabin in the woods, or perhaps a peaceful morning on the beach. Maybe you just imagine a morning when you get to ignore the alarm and sleep for an extra thirty minutes. The image we often have of rest is one of stillness and quiet, but what Jesus promises us goes beyond mere tranquility.\n\nThe rest Jesus offers isn’t a retreat, but a new way of living, drawn from an Old Testament concept called shalom. Shalom is more than rest; it is peace, wholeness, blessing, and connection to the Lord. This is only possible when we learn to rely on God rather than our own efforts, to cast our worries onto His back rather than piling them up on our own. This is the rest Jesus calls us to. And when we accept His invitation, we find His peace that surpasses all understanding (Philippians 4:7). \n\nJesus tells His followers that His “yoke is easy and [His] burden is light” (Matthew 11:30). His “yoke” is a lifestyle, a commitment to walk in obedience to His teachings and in light of His example. Jesus taught the way of the kingdom, complete with the pace and priorities of heaven, and He modeled total dependence on God, the key to true shalom. When we follow His example, we learn we can take His peace with us wherever we go. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-9-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Psalm 16:11, John 17:3, John 3:1-17, John 10:7-10, Matthew 7:7-11, 1 John 2:24-25, Romans 6:23, 1 Corinthians 15:55",
    "devo_title": "I Will Give You Abundant and Eternal Life",
    "devo_summary": "\n\nBy She Reads Truth\n\nThe Bible tells us that death will be the last enemy to be destroyed (1Corinthians 15:26)—and death is indeed our enemy. A foreign invader in this world, death is out of place and unwelcome. This is why we mourn at a funeral—because funerals were never meant to be. In the Old Testament, King David trusted the Lord to rescue his soul from the grave, resting in the hope that in the life after death, he would find himself in the presence of God, where there is “abundant joy” (Psalm 16:11). \n\nBut the hope of the Christian life is not only life after death; it’s much more than that. Yes, Jesus promised His followers eternal life, but He also spoke of a new life that starts right here and now. It is life with God, and it is eternal because God is eternal. Praying to the Father, Jesus said, “This is eternal life: that they may know you, the only true God, and the one you have sent—Jesus Christ” (John 17:3).\n\nThis promised life is abundant life (John 10:10). And how could it not be? David was right when he wrote that there is joy in the presence of God. Through the Holy Spirit, we carry that presence with us wherever we go. Life is not easy, but we can be joyful no matter what happens, because God is with us. Whether we die before the Lord returns or are caught up to meet Him in the air when He does (1Thessalonians 4:17), the life we have in Christ will continue. “Where, death, is your sting?” (1Corinthians 15:55).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-10-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Matthew 10:16-42, John 16:16-33, 2 Timothy 2:8-13",
    "devo_title": "You Will Have Suffering in This World",
    "devo_summary": "\n\nBy She Reads Truth\n\nWhen we think about God’s promises, we tend to focus on the blessings: forgiveness, mercy, and eternal life, to name a few. But Jesus promised us something else as well: “You will have suffering in this world” (John 16:33). Read that again. That’s not You might or You may or You could. It’s You will. As sure as death and taxes and God’s love for sinners, we will suffer—Jesus guarantees it.\n\nFor many people, God and suffering are not compatible. If God exists, they reason, then there should be no suffering, for how could a good God allow it? But the true God is no stranger to pain. The Son allowed His body to be tormented and twisted by the most gruesome torture device of the ancient world, the cross. And He did so to put an end to the world’s suffering, once and for all. In the same breath that He promised us suffering, He made another promise, one so sure that it was spoken in the past tense: “I have conquered the world” (John 16:33). \n\nSin has so wormed itself in and through this world that we cannot avoid suffering entirely. It would be like trying to avoid sand at the beach. But we also suffer in a special way as Christ’s followers. We suffer because He suffered first. And when we endure this life and all it can throw at us, the same way He did, we display our faith that Christ has indeed conquered the world. For “if we died with him, we will also live with him; if we endure, we will also reign with him” (2Timothy 2:11–12).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-11-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Matthew 1:23, John 14:1-4, John 14:18-26, Matthew 28:16-20, 1 Thessalonians 4:13-18, Revelation 22:20",
    "devo_title": "I Will Be with You Always",
    "devo_summary": "\n\nBy She Reads Truth\n\n“God with us” has been the plan from the beginning. In the garden, God was tangibly present, walking with His image bearers in the evening breeze (Genesis 3:8). But that perfect fellowship was revoked when sin entered the picture, carving a deep, uncrossable chasm between fallen humanity and the holy Creator. Even still, “God with us” echoes throughout Scripture. The Lord appeared to men like Abraham and Moses. His presence filled the tabernacle and, later, the temple. And, of course, we have the prophets, who proclaimed that a Messiah would come to save us, forever restoring our relationship with the Lord (Isaiah 7:14). \n\nHe came just as the prophets foretold. Jesus was born Immanuel, the name that means “God with us” (Matthew 1:23). He is God incarnate, fully God and fully man, who walked among His people and brought the kingdom of heaven to earth. He is the Word made flesh—the living, breathing fulfillment of the promise who both restores and secures our fellowship with God for eternity (John 1:14). \n\nJesus’s disciples experienced the tangible presence of God with them, walking and talking in their midst. But the gift Jesus gave before ascending into heaven to sit at the Father’s right hand is the same gift He gives to us (John 14:26; 20:22). The Spirit of the living Christ dwells in all who have been saved by grace through faith in Him. He is with us—right here, right now, always (Matthew 28:20). Better still, we will one day experience that same joyful fellowship Adam and Eve knew in the garden; we, too, will live with God in a perfect, pain-free world of His creation. Jesus Himself is preparing a place for us, and He will call us there one glorious day. “Amen! Come, Lord Jesus!” (John 14:3; Revelation 22:20).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-12-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "John 14:26",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\n“But the Counselor, the Holy Spirit, whom the Father will send in my name, will teach you all things and remind you of everything I have told you.”—John 14:26\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-13-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Ephesians 1:7",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize a verse from Ephesians, a promise of the redemption we have in Jesus.\n\nIn him we have redemption through his blood, the forgiveness of our trespasses, according to the riches of his grace…—Ephesians 1:7\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Lockscreen-14-473x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Matthew 19:28-30, John 14:18, Galatians 4:1-7, Ephesians 1:3-14, Ephesians 2:1-10, 1 Peter 1:3-4",
    "devo_title": "I Will Adopt You into My Family",
    "devo_summary": "\n\nBy She Reads Truth\n\nThe word gospel simply means “good news,” but sometimes it can be difficult to fathom just how good the news really is. The gift of God is not only the forgiveness of sins, nor is the gift just everlasting life on a renewed earth, free from sin, death, and pain. God goes further than that: He brings us into His family, with all the rights and privileges that come with being a child of the King (Galatians 4:7).\n\nGod’s Word says, “He has also raised us up with him and seated us with him in the heavens in Christ Jesus” (Ephesians 2:6). Notice that this is our current status. According to this verse, we have already been raised up to take our place beside the Lord. We are God’s children, so we have a seat with the family, right next to Jesus. But that’s not all. We are there for a reason: “so that in the coming ages he might display the immeasurable riches of his grace through his kindness to us in Christ Jesus” (Ephesians 2:7).\n\nHow could we even begin to calculate or imagine what an infinite God might mean by “immeasurable riches”? Peter described them as “imperishable, undefiled, and unfading,” and “kept in heaven for you” (1Peter 1:4). We will need to wait for these. But there is a greater gift still, and it is ours right now: God Himself. “And because you are sons, God sent the Spirit of his Son into our hearts, crying, ‘Abba, Father!’” (Galatians 4:6). We get to call the Maker of heaven and earth Abba, the same intimate and familiar term Jesus used of the Father (Mark 14:36). Calling this news “good” doesn’t seem to quite do it justice.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-15-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "John 8:34-36, Romans 6:1-23, Romans 8:1-11, 2 Corinthians 5:21, Psalms 103:12, Revelation 21:22-27",
    "devo_title": "I Will Set You Free from Sin",
    "devo_summary": "\n\nBy She Reads Truth\n\nWe’ve all tasted the sweet relief that comes with a bit of freedom. But there is a world of difference between the temporary freedom of summer vacation and the eternal freedom we have in the kingdom of God. In the Gospel of John, Jesus proclaims that “if the Son sets you free, you really will be free” (John 8:36). Those listening to Him were undoubtedly confused. In offering freedom, Jesus was implying they were somehow slaves, but they weren’t enslaved to anyone, not legally or physically anyway. How can you be set free if you aren’t in chains?\n\nApart from Christ, we are bound to our sin. This was true of the people in Jesus’s day, and it’s true of us now. Scripture is saturated with references to what life apart from Christ looks like. We were once slaves to sin (John 8:34) and ruled by death (Romans 6:9). Sin reigned in our bodies (Romans 6:12), and we stood condemned (Romans 8:2). But Jesus went to battle for us against the powers of darkness and came out victorious. His promise of freedom is a timeless one meant for anyone who comes to Christ. It doesn’t elapse or depend on our own merit. If the Son frees you, then you are free.\n\nOur invitation into God’s family is an invitation into an abundant life that is no longer bent low under the weight of sin. It’s an invitation into an eternal way of being, one where our sin is uprooted and cast as far as the east is from the west (Psalm 103:12). It is an invitation to freedom.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-16-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Matthew 6:19-21, Matthew 6:25-34, Matthew 7:7-11, Philippians 4:10-20, Psalm 23:1-6, James 1:17",
    "devo_title": "I Will Provide for You",
    "devo_summary": "\n\nBy She Reads Truth\n\nGod will provide for you. This may seem like the easiest promise for God to fulfill, but for some of us it can be the most difficult to believe.\n\nSince the beginning, God has been our Provider, giving us the air in our lungs and the food in our bellies (Genesis 1:29; 2:7). But with the first temptation, our relationship with God’s provision has changed. The serpent convinced Adam and Eve that God was holding out on us, that it might be better if we provided for ourselves (Genesis 3:4–5). And that lie has governed much of our behavior ever since. We may still want God’s gifts, but in our sin, we want them on our own terms.\n\nWhen Jesus came, He modeled dependence on God, forsaking worry and the cares of this world for a life of contentment and abundance. He spoke truth to break the devil’s ancient lie, declaring that whatever we may build for ourselves on earth will crumble in the end; only that which is eternal—what is stored up in heaven—will last (Matthew 6:19–20). And He reminded people what had always been true: that “every good and perfect gift is from above” (James 1:17). God feeds the birds and clothes the flowers of the field, and we are much more valuable than these (Matthew 6:25–34). But greater than any gift from the Father’s hand is the Father Himself. As long as we have Him, we can have joy, for He is enough (Philippians 4:12–13).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-17-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "John 11:17-27, 2 Corinthians 4:17-18, 1 Corinthians 15:35-58, Romans 8:12-17, Daniel 12:2-3",
    "devo_title": "I Will Make You Glorious",
    "devo_summary": "\n\nBy She Reads Truth\n\nThe kingdom promise of a glorious resurrection can be a confusing one. It is hard to imagine a world where believers are raised in glory and power—their natural, earthly bodies having been transformed (1Corinthians 15:40, 42–44). The promise of glory stands in contrast to just about everything that we experience on a day-to-day basis here on earth.\n\nThe natural bodies that will be transformed in the final resurrection are the same bodies that endure all sorts of affliction here on earth. Similar to God’s promise to make everything new, His promise to make us glorious is the reimagination of biological life itself—a body without pain or hardship (Revelation 21). Inherent in this promise is an acknowledgement of the physical struggles we often experience on earth and a reminder that the pain and fatigue we experience will not last forever. The bodies of believers in this life battle sickness, heartache, and brokenness; in the new heaven and new earth, those things will be no more. Our bodies will “bear the image of the man of heaven” (1Corinthians 15:49), Jesus Christ. We will shine “like the stars” (Daniel 12:3), taking on a measure of beauty beyond what is possible in this age.\n\nLiving with this promise in view is an example of what it looks like to experience the already-not-yet nature of God’s kingdom. We have already been given the glory of having the Spirit of God reside within us (Ephesians 1:14), but have not yet experienced the glory of the new bodies we will one day inherit. That day may seem far off, but because of Christ, it is also a guarantee.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-18-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Revelation 21:1-7, Romans 8:28-30, 1 Corinthians 2:6-12, Psalm 31:1-24, Psalm 34:8",
    "devo_title": "I Will Bring Goodness from Every Broken and Twisted Thing",
    "devo_summary": "\n\nBy She Reads Truth\n\nThe best stories end with good triumphing over evil, the hero saving the day, and peace being restored to the land. But the story we are living will have a greater ending still. God promises to make all things new and to bring goodness from every broken and twisted thing. How this will happen is largely a mystery. In the midst of this world breaking and twisting around us, the heartache and sorrow we experience doesn’t seem to contain even a spark of goodness to be fanned into flame. So this, of all God’s promises, may require the greatest amount of faith.\n\nThe Bible does give us a glimpse into the final outcome: a world where God dwells with His people and “grief, crying, and pain will be no more” (Revelation 21:3–4). That God could take the murder and theft and lies of this world and transform it all into a place that feels like heaven is beyond our ability to comprehend. And yet, we see it in the cross. The most broken and twisted thing imaginable—the murder of the Son of God—became the greatest good thing the world has ever known.\n\nThrough the cross, God has made a way for His goodness to permeate our world and overtake the curse we all live under. Every pain and hardship we suffer is being worked “together for the good of those who love God, who are called according to his purpose” (Romans 8:28). Though we cannot fathom how it will be done, we can trust that it will be, because we can trust the One who has made this promise. All of the promises of God found in His Word are as certain as He is good. He is the reason for our hope, and the hope of the Lord does not disappoint (Romans 5:5).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-19-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "Romans 8:15",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nFor you did not receive a spirit of slavery to fall back into fear. Instead, you received the Spirit of adoption, by whom we cry out, “Abba, Father!”—Romans 8:15\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Instagram-20-1024x1024.jpg"
  },
  {
    "book_title": "Promises of God",
    "devo_passages": "John 11:26",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize these words of Jesus before He raised Lazarus from the dead.\n\n“Everyone who lives and believes in me will never die. Do you believe this?”—John 11:26\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-Promises-Lockscreen-21-473x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 1:1-10, Numbers 14:18-19, Matthew 28:18-20, John 1:1-5",
    "devo_title": "Fellowship with God",
    "devo_summary": "\n\nBy Raechel Myers\n\nEver doubt your salvation?\n\nI think I’ve got it right, but what if I’m wrong? I know the gospel story, but do I really understand it?I believe Jesus was who He said He was, but what does it mean for my life today?\n\nIf you and I are asking these questions now, imagine how early Christendom must have wrestled with the newness of the gospel message—a message that stood contrary to any attempt to earn salvation through the accumulation of knowledge and wisdom.\n\nJohn wrote three relatively short letters to assure the world then, and us now, that salvation is from God: the gospel is true. John’s Gospel is the historical, theological record of Christ’s life on earth, and his letters are the pastoral communication of the significance of Christ’s life. They build on what we already know. John begins by using four words we honestly need to hear from him:\n\nHeard. Seen. Observed. Touched. \n\nWe need to hear them because they are sensory, tangible. They communicate real events that were physically witnessed by many, including John himself. In short, they are “proofs” of the gospel. \n\nYou see, John was actually there for the Sermon on the Mount. He was there to hear Jesus’s own voice tell the parable of the prodigal son, and declare, “Before Abraham was, I Am” (John 8:58). John could still remember the sting of Christ’s rebuke about who should sit at His side in the coming kingdom. And “Here is your mother,” are words John would likely never forget hearing Jesus breathe out to him from the cross (John 19:27). John watched Jesus walk across the Sea of Galilee, and he was on the scene to partake in the institution of the Lord’s Supper. \n\nHeard. Seen. Observed. Touched. \n\nJohn begins by assuring us that his Gospel account (the book of John) is true. Then, he invites us down a path of holy concern to examine whether the message of the gospel has actually changed our lives. \n\nDo you say you have fellowship with Christ, but walk in darkness? Or do you have real, in-the-light fellowship with the Savior of the world?\n\nDo you say you have no sin? Or do you actively confess your sin, believing Christ is able and sufficient to cleanse you and bring you into the light? \n\nDo you fear the light? Prefer the darkness? Or do you live a life that combats darkness, seeking and shining?\n\nThese aren’t rhetorical questions. Let’s actually take some time today—real time—to ask ourselves and the Lord if we are actively struggling with darkness. The struggle itself is not sin. Ask any seasoned believer and they will testify to this truth: the Lord is always working in our hearts to bring light (Philippians 1:6). As long as we are on earth, there will always be darkness to drive out. And as long as we have breath in our lungs, the process of sanctification will be present. If we are not actively struggling with darkness, it isn’t because there is no darkness in our lives. It is because that darkness has become comfortable. The Christian life—the life of salvation through the gospel of Christ Jesus—is a life that will constantly battle the darkness until Perfection comes. \n\nJohn’s letters are written to assure us of our faith. But like any excellent pastor, he writes both to comfort the afflicted, and to afflict the comfortable. He delivers the healing balm of the gospel message, but that message calls for an ongoing death to self that is anything but comfortable (1Peter 2:24).\n\nAre you comfortable today, when perhaps there is darkness in and around you that you need to see? Let the Word of God bring about holy affliction, a conviction of sin and complacency that draws you closer to Him. \n\nLord, afflict us with your Truth, that we may be comforted. Shine light in our dark places. Let us never stop pursuing holiness. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-1-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 2:1-14, Matthew 11:25-30, Ephesians 6:10-20, 1 Timothy 2:5-6",
    "devo_title": "Keeping God’s Commands",
    "devo_summary": "\n\nBy Amanda Bible Williams\n\nI have a habit of romanticizing the morning.\n\nIn my mind, the perfect morning looks like this: Rising before the sun and the dogs and the kids. Drinking a fresh cup of French-pressed coffee by lamplight while the house is still and dark. Enjoying uninterrupted quiet while the sun inches over the horizon, my Bible open and my knees bent in prayer. Feeling filled up and ready by the time the light streams bright through the windows and four sets of little feet tromp down the stairs. \n\nIn reality, I’m so immune to my alarm that I have to change the tune weekly just so I won’t ignore it. Quiet time rarely happens in the quiet, and my coffee almost always grows cold during the mildly organized chaos of our current morning routine. That early light that streams into the dining room is my favorite of the day in theory, but actually sitting down at the table first thing in the morning can nearly blind a girl. \n\nIn my imagination, mornings are smooth and peaceful. In reality, they are a battle. I think this is, in part, what John wants his readers to see: the Christian life is beautiful, but it is also a battle. Light and darkness are always at odds, and we can expect to be involved in the clash.\n\nBut John’s message is not one of despair. On the contrary, it is one of confidence and bold encouragement. The light of Christ is already shining, and the darkness has no choice but to retreat in its wake. The presence of darkness in our world, and even in our hearts, is not something we have to muster up the strength to fix. It isn’t fodder for resolutions or self-help, like my lackluster morning routine. The darkness is both already conquered (2Timothy 1:10), and constantly being conquered by our light-bearing Savior (1John 2:8). Our battle is ultimately a matter of faith in Jesus, the conquering one. And so John reminds the Church of what they already know of their salvation.\n\nTo the “little children” of the faith, he reminds them: “Your sins have been forgiven” and “you have come to know the Father” (1John 2:12,14). Their salvation is secure, their reconciliation to the Father is complete (v.5). \n\nTo the “fathers,” the elders in the faith, he says (twice): “You have come to know the one who is from the beginning” (vv.13,14). God is the same God they’ve known, and known to be faithful, from the first day they believed.\n\nTo the “young men,” or those growing in the faith, he assures: “You are strong, God’s word remains in you, and you have conquered the evil one” (v.14). This is not “you can be” or “maybe one day you will be.” This is “you have” and “you are.”\n\nNotice a pattern here?\n\nThis battle is not a matter of mustering. This is a matter of trusting. The true light does not need me to flip the switch. He is already shining. My part is to stay close to Him, to walk with Him, to heed John’s warning not to sin or flirt with the darkness—not for lack of grace but out of a longing for the light of Christ to shine through (1John 2:1). With Christ in us, we are already equipped to battle the darkness. He has given us His strength and His armor (Ephesians 6:10–11). He has even conquered the foe. The darkness is not going down without a fight (1Peter 5:8), but the battle has already been won.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-2-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 2:15-27, Isaiah 61:1-4, James 4:4-7",
    "devo_title": "Remaining in God",
    "devo_summary": "\n\nBy Rebecca Faires\n\nOver coffee and croissants overseas, I listened to my new European friends talk about the United States. Together, we laughed over the stereotypes of Americans, but quietly, my little heart protested. After all, the people I love most and hold dearest are among those Americans. I’m one of those Americans. The thread that tied me to my family and friends at home is strong, and despite our national foibles, the States are my home.\n\nWhen I read this passage in 1 John, I immediately shrink back and mildly peep: But I love this world! It’s where all my favorites live! I’m crazy for the mess of small-town fall festivals, the sight of new dresses from fancy stores, and the secret glee that comes from winning at a game of cards. I love the world, and I miss going out and connecting with other people in it. What could John possibly mean when he says, “Do not love the world or the things in the world”? (1John 2:15). \n\nThe world, intrinsically speaking, is made to be good. God Himself declared it “very good indeed” (Genesis 1:31). So John isn’t questioning the beauty of a sunset, but rather the things of this world that pull our affections away from God. “For everything in the world—the lust of the flesh, the lust of the eyes, and the pride in one’s possessions—is not from the Father, but is from the world” (1John 2:16). Those three categories belong to the world, according to the inclinations of our hearts.\n\nThe lust of the flesh: Do we indulge our bodies with food, drink, touch, and comfort? Are we seeking luxury over knowing Christ?\n\nThe lust of the eyes: Do our minds crave worldly extravagance and grandeur? Do our ears strain for applause and accolades?\n\nThe pride in one’s possessions: Do our eyes rove for treasure, possessions, and delights? Do we covet the trinkets of the world?\n\nMy answer to all these questions is, “Yes, a thousand times, Yes!” Gimme those tacos, massage my feet, get me a robot butler, and bring down the house with your applause. We’re all enticed by the comforts of this world. But John is teaching us that all these delights belong to the world, and the world is passing away (v.17). We shouldn’t tie ourselves to a ship that’s sinking.\n\nInstead, we should tie ourselves to our anchor, Jesus Christ, who is pulling us heavenward. We should “remain in Him,” and keep His ways (1John 2:27). We should reserve our deepest affections for God, rather than throw them away on ice cream cones and iPhones. Before social distancing, the world seemed so readily available. Easter Sunday would come, and it was easy to distract ourselves with singing over a new dress, rather than genuinely praising the risen Christ.\n\nBut the love of the Lord is infinite and lasts forever. The Spirit’s peace never fails us. And while this world and its trappings are passing away, our hope in Christ’s promises is secure. He is our rock, quieting our hearts in the midst of whatever chaos the world throws at us. He is our real treasure, and our very great reward.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-3-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 2:28-29, 1 John 3:1-10, John 3:1-15, James 1:19-27",
    "devo_title": "We Are God’s Children",
    "devo_summary": "\n\nBy Erin Davis\n\nGod the Son is a concept I can wrap my brain around. His humanity makes Jesus feel approachable, relatable even. God the Spirit is a more abstract concept, but my head and heart can still connect the dots. I’ve felt the Spirit’s stirrings in my heart. I’ve seen Him bring peace and joy to His people. But God the Father? I’m afraid that’s where you lose me. Picturing Him feels like lying on my back and watching cloud pictures float across the sky. One second I can make out the edges of the image through squinted eyes; the next, it’s gone. I have a hard time grasping God the Father and an even harder time picturing God as my Father. \n\nYou don’t have to read too closely between the lines to discern that my relationship with my dad has been complicated. There’s affection there, but we’ve learned the hard way that the bumps and potholes of life can fracture our tender bond. There’s no reason to go into the specifics here because you’re likely already thinking of your own dad. Perhaps he’s been absent, apathetic, or abusive, and when you get to passages that describe God as Father, you can’t help but question His love for you. Or maybe when you count your lucky stars, your loving, attentive earthly father is among them. Even so, your earthly father is a sinner, incapable of loving you perfectly. \n\nSo when the Bible speaks of God’s love for us as a paternal love (1John 3:1), the kind between a loving father and a devoted daughter, it can be hard to see the full picture. John’s letter urges us to keep squinting, to keep trying to see God the Father. There’s a cadence, a rhythm that beats throughout the letter. John refers to God as Father over and over. That’s the downbeat: God is Father. God is Father. God is your Father. Look again and you’ll find a counter rhythm, the sweet language of childhood, gently referring to us, the readers, as little children, beloved and born of God (1John 3:2,7; 4:7). This language isn’t patronizing, but tender. The upbeat of the letter is this: You are His child. You are His child. You are His beloved child. \n\nI’m well into my adult years, but sometimes my heart still takes the posture of a little girl, doubting God’s love or wanting to hide from Him in fear. John’s words gently bid me to look up and see the love God the Father has lavished upon me. I imagine Him kneeling down, lifting my chin to say: \n\n“So now, little [child], remain in him so that when he appears [you] may have confidence and not be ashamed before him at his coming. If you know that he is righteous, you know this as well: Everyone who does what is right has been born of him” (1John 2:28–29). \n\nHow do we know we’re His? Because of the kind of love God offers. Though we were once sinners, separated from the Father, He reaches toward us with paternal love. We have assurance of God’s love because He does not treat us like strangers. He treats us like family. And not the way you treat a distant cousin, awkwardly kept at arm’s length. No, God lavishes love upon us. He responds to us like a perfect Father should. \n\nThe wonder of this truth may still be hard to grasp, but it doesn’t change the facts. God is the Father “who is able to do immeasurably more than all we ask or imagine” (Ephesians 3:20, NIV). And we are His beloved daughters.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-4-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 3:11-24, Deuteronomy 15:7-11, John 16:7-14, Romans 12:9",
    "devo_title": "Love in Action",
    "devo_summary": "\n\nBy Rebecca Faires\n\nThe weather had just changed from Southern hot to cool in Tennessee. Ordinarily this would have filled my little country heart with the brisk optimism that comes from a change in season: the autumnal joys of dark blues skies, scarlet leaves, and bright fires. But last year, the cold weather had me thinking crazy thoughts about swimming squirrels. Just a year before, we had three squirrels go for a swim in our pool over a stretch of three days. Now fall weather unexpectedly conjures up images of bushy tails, all wet and wilted, and tiny paws carefully paddling in cold turquoise water.\n\nWe’re not sure what exactly possessed the squirrels to swim, but I think they did it for love. I hypothesize that each successive swimmer was trying to rescue its predecessor. I think it’s a love story about a family of squirrels who were willing to stand up (or, in this case, dive in) and look death in the face as a way of looking after each other: Fear not, Mother Squirrel! I’m coming in after you! I don’t know a lot about the internal motivation of the squirrel, but I know the drive to protect loved ones is strong, no matter who you are.\n\nJohn learned about love from the Master. He got to spend years watching how Jesus loved people, and here is his conclusion: “Let us not love in word or speech, but in action and in truth” (1John 3:18). The love of Jesus is love in action. And this active love was not just limited to foot washing and lake fishing. “This is how we have come to know love: He laid down His life for us. We should also lay down our lives for our brothers and sisters” (v.16).\n\nWhew.\n\nI don’t know about you, but the kind of love I’m willing to offer is this: I’ll help you move into your apartment, I’ll let you choose the restaurant, and I’ll include you, even though you’re not that funny—and that’s for my friends! But when Jesus died for us, we were still His enemies; “while we were still sinners, Christ died for us” (Romans 5:8). How much more then, should we lay down our lives for our brothers and sisters? \n\nLove is hard. Real love means real sacrifice and compromise, and unpleasantness. Jesus is our example of love in action. He literally laid down His life for us. \n\nThis kind of love feels big. Most of us have experienced some great big feeling of love, so it seems like a natural step that we can grit our teeth and turn those feelings of love into huge, selfless actions of love. It’s sometimes possible for us to swing glorious acts and promises of love when we are at our very best, dressed in our finest, with our loved ones standing around sporting giant smiles. But we are also called upon to make good on those promises at three in the morning, when no one is watching and grand gestures are the last thing on our minds. No amount of effort is enough for me to love with the consistency, action, and sacrifice that I see in the life of Christ.\n\nHow can I follow Christ’s example? And how can I teach my children to love if I can’t even love them enough to make sure all six of them have clean teeth, let alone lay down my life for them day in and day out?\n\nHere’s the element that changes everything: I am God’s child; He calls us His children. This means that when we love, no matter what time of day it is, we aren’t loving out of our own strength—we love in His strength. Christ’s example isn’t just an example; His love is also what enables us to love with action, because “he remains in us” (1John 3:24).\n\nWe were certainly created for love. And in our effort to show love, we will find ourselves laying down our lives for each other in some scary places, like jumping into a cold swimming pool or giving care to someone with no hope of reward. We can’t cut it in our own strength, but Christ’s call to love in action comes with a promise that He is with us, even to the very end.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-5-Text-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 3:23",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\n“Now this is his command: that we believe in the name of his Son Jesus Christ, and love one another as he commanded us.” —1 John 3:23\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-6-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 1:9",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the key verse for 1 John, a declaration of God’s love and sacrifice.\n\nIf we confess our sins, he is faithful and righteous to forgive us our sins and to cleanse us from all unrighteousness. —1 John 1:9\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Lockscreens-7-473x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 4:1-19, Psalm 36:1-12, John 15:18-21, 1 Peter 2:1-3",
    "devo_title": "Knowing God Through Love",
    "devo_summary": "\n\nBy Kaitlin Wernet\n\nIt happened every night, first at 1:27 a.m. and then again at 4:02 a.m.. A low warning whistle would signal its arrival, followed by a roaring screech that thundered through our sleeping city, only waking me. Its rumble traveled from a cracked window to the front door to my bedpost, then disappeared as quickly as it came. \n\nThat train on nearby tracks opened my eyes to the darkness. I’d seen the sky turn black before going to bed, of course, but I hadn’t felt it. Suddenly, I was hyper aware that at any moment, my safe foundation could be shaken and destroyed. There, in my bed with white sheets and a black headboard, I began a countdown to sunrise, staying awake to prevent the darkness from swallowing me. \n\nEach morning, I’d attribute my sleepy eyes to the train, but each night, I’d remember it was fear. \n\nI began recognizing minor details as “warning” signs—ambulance sirens, missed calls, late arrivals—and became sure something dubious was headed my way. I didn’t know what that something was, but I knew its tracks were headed in my direction. \n\nFear is ominous and undefined in both feeling and concept. There are times I know exactly what I’m afraid of, and others when I’m just plain afraid. Many nights, I’d sit up on those white bed sheets, Bible open on my lap, wrestling with anxiety. Over and over again, I ran into the same command: Do not fear. It appears generously throughout God’s Word, yet I’d never come across a concrete definition of “fear” by itself. But what reason do we have to not fear? When the walls begin to shake and the darkness closes in, how exactly do we just “not fear”? \n\nWhen the train began to rumble into town, I wasn’t sure how to put the brakes on my fear—but I knew I could turn on the lights. Reaching over to turn on the lamp on my bedside table somehow illuminated my confidence enough to step out of bed and look outside. From my window, the street lights glowed and the train’s headlights shone in the darkness. I wonder if this is why fear isn’t clearly defined in the Bible, because it cannot stand alone. To really know it, we must turn on the lights. \n\nAnd in this case, when it comes to our fears, it is by His light, by knowing Him, that we are really able to see and make sense of what’s around us (Psalm 36:9). To know Him, we must remember His love; He Himself is love (1John 4:16). And when we know His love, we know what it is not: fear. Because “there is no fear in love… perfect love drives out fear” (v.18, emphasis mine).\n\nI’ve always read that verse in the context of my loving relationships, but what if we could also believe it in the context of our worst fears? If God is love, and there is no fear in love, then there is no fear in God. And because we are from God, He leaves the lights on for us. Held to the standard of God’s perfect love, fears don’t stand a chance. Maybe trying not to fear isn’t so impossible if it sends us searching for the light (John 8:12). May we always hold up pieces of darkness to the brilliance of His love. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-8-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 4:20-21, 1 John 5:1-13, Romans 13:8-14, 1 Corinthians 13:1-13, John 1:29-34",
    "devo_title": "Loving Our Brothers and Sisters",
    "devo_summary": "\n\nBy Kaitie Stoddard\n\nRecently, I received a text message from a friend asking about the Christian life. I read the text several times over with excitement, yes, but with anxiety too. Undoubtedly, it was an answer to over a decade of prayer, a small crack for the light to shine through. But the weight of this opportunity to share my faith in Jesus was also overwhelming.\n\nI think the apostle John would understand both my passion and my pause. Every word he writes drips with longing for people to know the truth: that Jesus is the Son of God, the way to salvation. I long for my friend to know the truth too. But sharing the gospel is on a different level than convincing someone to reduce their gluten intake; it’s a matter of spiritual life and death.\n\nMany churches utilize the personal testimonies of believers as a way to help others see the hand of the One they cannot see. We encourage each other with stories of how God has worked in our lives, how He’s freed us, and how we’ve come to know He is real. \n\nI love testimonies, but sometimes I wrongly believe my own testimony needs to convince people of God rather than simply tell them about what He’s done in my life. I automatically begin thinking about what I should and shouldn’t say, strategizing in my own strength instead of relying on God’s power to help me. No wonder I feel anxious at the mere thought of sharing the gospel.\n\nJohn rightly points us beyond his own testimony and on to God’s, which is far greater (1John 5:9). You and I aren’t the only ones testifying that Jesus is King; the Creator of the universe and everything He’s created declare the truth too (Psalm 19:1). God Himself declares the truth of Christ:\n\nThrough the Spirit, the water, and the blood (1John 5:7–8).Through prophecies and power (Matthew 1:18–24).Through the baptism of Christ Jesus (Matthew 3:16–17).Through Christ’s perfect sacrificial death (Matthew 26:28).\n\n“The one who loves God must also love his brother and sister,” in both word and deed (1John 4:21). When friends and family ask us where our hope comes from, we can let go of the pressure to find the perfect words or our need to convince them of the truth of the gospel of Christ. As God’s daughters, it is not just our testimony that matters. We are also bearing witness to God’s testimony—one that never fails. “And this is the testimony: God has given us eternal life, and this life is in his Son. The one who has the Son has life. The one who does not have the Son of God does not have life” (John 5:11–12).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-9-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 5:14-21, Deuteronomy 29:29, Luke 18:1-8, John 3:16-17\t",
    "devo_title": "Effective Prayer",
    "devo_summary": "\n\nBy Sharon Hodde Miller\n\nAbout ten years ago, I was struggling with gossip, a sin I couldn’t seem to kick, no matter how hard I tried. I had become convicted about it after living with a friend who didn’t gossip at all. Like, at all. She held her tongue and guarded confidences with patience and incredible grace. She was a wonderful example to me, and her integrity highlighted the cracks in my own. So, I decided to change. \n\nAt first, I simply tried to gossip less. I’d made up my mind and thought that would be enough. It wasn’t. Then, I decided to “fast” from gossip. Now, I know that’s not how fasting works; we aren’t supposed to fast from things we shouldn’t be doing in the first place. Even so, making the concerted effort really seemed to help. I limited the fast to forty days, cutting out gossip TV shows and magazines, and just trying to be more intentional. I took it one day at a time.\n\nDuring those forty days, I was able to avoid gossip. And for the first time, I felt a sense of victory over this area of my life. Unfortunately, it didn’t stick. A decade later, I still fall prey to this sin. I still spread rumors under the guise of concern, I still ask for personal details I don’t need to hear, and I freely discuss the personal lives of famous people. I don’t like that I do it, but I do it nonetheless. I’ve come to realize I’ll struggle with it the rest of my life.\n\nOngoing struggles with sin are one of the great mysteries of the Christian life. On the one hand, following Christ means we put on our identity of Christ. In Him, we are set free from our sinful nature, and it no longer exercises unbridled power over us (Ephesians 4:22–24). On the other hand, we still sin. Even when we don’t want to sin, we do (Romans 7:15–16). In Christ we are victorious over our flesh, but we still do battle against it.\n\nJohn alludes to this struggle, stating that we are victorious and should not continue to sin (1John 5:18), but he also encourages believers to pray for others while they’re in the midst of sinning. At first, it seems like John is contradicting himself. But what John is referring to is the tension between the “already, but not yet” of being a Christian. This concept means we have one foot in eternity and one foot here on earth. We already taste the victories of Christ’s resurrection, but we don’t yet possess them completely. We will continue to struggle with sin, but it will no longer define us. \n\nThis already-not-yet state of being can be frustrating, especially when you’re tired of struggling with sin. But even in that, God does not abandon us to struggle alone. We always have the help of prayer, which is why John encourages us to ask for anything “according to his will” (1John 5:14). When we ask God to deliver us from sin, He promises to hear us, and help us. He is the true God and our High Priest, and we can trust Him with our weaknesses (1John 5:20; Hebrews 4:15).\n\nThe struggle with our flesh is real, but take heart: God isn’t finished with us yet. We are already “in the true one—that is, in his Son Jesus Christ. He is the true God and eternal life” (1John 5:20). He is the only way to eternal life, and we are only just beginning to taste the fullness that awaits (Philippians 3:20).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-10-Text-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "2 John 1:1-13, John 8:31-32, 1 Corinthians 3:6-9",
    "devo_title": "Walking in Love",
    "devo_summary": "\n\nBy Lore Ferguson Wilbert\n\nThere is a foot of height between us, but I have learned to keep up, quicken my step, and match my stride to my husband’s. He ran Division 1 Track and Field for his university and, to this day, he can run a mile while I’m still changing into my sneakers. \n\nBut when we walk, we walk at a matched pace: he’s a little slower than normal and I’m a little faster. When he asks me to go for a walk, he does it because he loves me and he loves spending time with me. Walking at different paces—though more comfortable for each of us—would not be the loving thing to do.\n\nI think of this today while reading the second letter of John. He speaks of walking in love (2 John 6) and then goes on to warn of those who walk ahead on their own, rather than abide in Christ’s teaching (v.9). I can think of times when I’ve lagged behind or gotten ahead and someone else has paid the price for it. I tend to assume other people view the gospel through the same lens I do, and then I forget to communicate both love and truth to someone whose path has strayed (Ephesians 4:15).\n\nThere have been times when I have not abided in Christ’s teachings because, deep down, I think I can somehow say it better or faster or smarter. Or I have lagged behind, not kept up with the deep and fervent truth of the gospel, and become lazy in my sin and relationships with others.\n\nThe flurry of day-to-day life here on earth can cause us to forget what’s real, true, and eternal. We forget and we wander off, distracted. No wonder the writer of Hebrews said, “Let us lay aside every hindrance and the sin that so easily ensnares us. Let us run with endurance the race that lies before us, keeping our eyes on Jesus, the source and perfecter of our faith” (Hebrews 12:1–2). There is much to be said for the hard work of running the race toward Jesus, but here in his letter, John tells us to simply walk—to walk in love. \n\nFor me, it’s always easier to run ahead or lag behind, to grow distracted by what’s around me or impatient for what’s ahead of me. But John says, Beloved, walk. Match your pace to the One who loved you first and walk, one step in front of another, faithful in practice—not for a particular result, but simply to walk with your Father and enjoy His presence. This reminds me of Enoch, whose whole existence could be wrapped up with this line: he “walked faithfully with God; then he was no more because God took him away” (Genesis 5:24, NIV). \n\nTo walk in love is to match my stride to the love of God, the King of the universe, who put on flesh and became fully human to show us how to live (John 1:14; 1John 4:2). He slowed His pace to meet ours, to teach us how to run the race. In the end and by His grace, may our own lives echo these words: “I have fought the good fight, I have finished the race, I have kept the faith” (2Timothy 4:7).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-11-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "3 John 1:1-15, Matthew 20:25-28, Hebrews 13:1-6\t",
    "devo_title": "Imitating What Is Good",
    "devo_summary": "\n\nBy Amanda Bible Williams\n\n“I’m being bullied.”\n\nI’m ashamed to say I didn’t believe her at first. I know a good mother ought to give her daughter the benefit of the doubt when it comes to her word against the world’s, but my instinct was to push back anyway.\n\n“Are you sure? What did he say exactly? What did he do exactly?” \n\nI peppered her with questions as we drove down our favorite winding road, our minivan pointed toward home. She held her ground, insisting a kid in her grade was mistreating her, via verbal insults and the occasional kick or shove when walking past. A few days and a few more reports later, my posture toward the tale quickly changed. I went from skeptical (“Oh, I’m sure he didn’t mean it”) to certain (“Tell me his name again, Imma call his mama”) REAL FAST. Someone was pushing my dear child around, and that was not okay.\n\nFortunately, my daughter, though thirty years my junior, handled the situation with more grace than I would have. She even informed me today that she and her nemesis are now becoming friends. Kids are awesome that way.\n\nIn his last letter to the church, this one addressed specifically to his friend Gaius, John gives one final contrast to highlight the truth of the gospel. He juxtaposes Gaius’s faithfulness to the gospel to a man named Diotrephes’s rejection of it.\n\nOh, Diotrephes was “in” the church. In fact, he fancied himself to be quite a powerful figure in the church—so powerful, he took it upon himself to decide who was in and who was out. Forget that whole “for God so loved the world” thing—Diotrephes had a better idea. He would welcome who he wanted to welcome, and he would push out who he wanted to push out (3John 10).\n\nBullies like Diotrephes often seem to get their way. They kick and shove and call names until their victims slink away, feeling defeated. Unfortunately for them, the gospel of Jesus Christ is not a power play. The biggest and baddest have no advantage here. The gospel calls us to surrender, to decrease so that Christ might increase (John 3:30).\n\nThe message of Christ does not need us to lord our power or position over others to intimidate them into belief. No, the gospel calls us to love and to service (Matthew 20:26). It invites us to stay the course, to walk in the light, one foot in front of the other (3John 4). Jesus is not a taskmaster who demands a ransom in exchange for our freedom. He Himself became our ransom; He is our freedom (Matthew 20:28).\n\nI haven’t kicked anyone out of church lately (or ever), but I’ve played the part of Diotrephes in my own life. I’ve tried to twist the gospel into something that works for me, replacing biblical teachings that don’t fit my preferences with ones that do. But the gospel will not be rewritten. It is Truth, with a capital-T, immutable in its truthfulness and irreversible in its effect on those who believe it.\n\nAs we come to the end of John’s letters today, take to heart his encouragement and his earnest plea: “Dear friend, do not imitate what is evil, but what is good” (3John 11). Walk in Truth. Walk in light, imitating what is good as displayed by our Savior, Jesus Christ. Don’t mind the bullies. Whether they come dressed as self-appointed gatekeepers or as lies from inside your own head, they do not speak for God.\n\nKeep going. Keep close to Jesus. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-12-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "1 John 4:19",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nWe love because he first loved us. —1 John 4:19\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Instagram-13-1024x1024.jpg"
  },
  {
    "book_title": "1, 2 & 3 John",
    "devo_passages": "2 John 1:6",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize 2 John 1:6, a description of what it looks like to love God. \n\nThis is love: that we walk according to his commands.  —2 John 6a\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/SRT-123John-Lockscreens-14-473x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 1:1-11, Psalm 39:1-13, Matthew 11:28-30",
    "devo_title": "Everything Is Futile",
    "devo_summary": "\n\nBy Amanda Bible Williams\n\n“Am I the only one in this house who knows how to load the dishwasher?!” I bark my question loudly to everyone within earshot and no one in particular. Instead of listening for an answer, I groan and scrub another bowl with cereal flakes glued to the inside. I’m annoyed, and I need them to know it. But underneath my irritated sighs, there is another feeling—a fleeting but familiar twinge of disappointment in my heart’s bent toward temporary things.\n\nThis was the scene at my home last night. And banal as it is, it’s the one that comes to mind when I think of the word that echoes throughout the book of Ecclesiastes: futility. Looking for lasting meaning apart from God is futile—as futile as trying to keep the kitchen sink empty in a house filled with snack-obsessed kids and coffee-dependent adults. “‘Absolute futility,’ says the Teacher. ‘Absolute futility. Everything is futile’” (Ecclesiastes 1:2).\n\nIt feels silly to compare King Solmon’s words to my kitchen drama, and even to admit the drama to begin with. I’m a grown woman, for crying out loud! Do I really expect an empty sink to fill me up? The honest answer is, yes, I sometimes do. In the same way that I tie some bit of my self-worth to the cleanliness of my countertop, I try to craft meaning in a thousand other things: the work I do, the clothes I wear, the photos I take and captions I create, the behavior of my children, the affection of my husband, the size of my bank account and my waistline. It’s exhausting, really. Solomon knew it too: “All things are wearisome, more than anyone can say” (v.8).\n\nEcclesiastes is the wise king’s record of his own search for meaning in life “under the sun” (v.3)—that is, life here on earth. In it, Solomon found what we, too, find if we tug on our meaning threads hard enough: every earthly thing unravels. Nothing lasts. No man-crafted meaning can fill the human heart in a full and lasting way.\n\nAs hopeless as it sounds, this is good news because it points us to the only source of true meaning and fulfillment: Jesus Christ. In the kingdom of God, life’s meaning is not determined by a mortal king’s earthly research, but by the Eternal King’s perfect goodness, justice, and love. The world we see with our eyes is temporary and fraught with futility, but our life in Christ is everlasting and marked by mercy.\n\nEcclesiastes isn’t a light read, but it’s a worthwhile one. Like every other book of the Bible, it is the true and inspired Word of God, given to us that we might know and walk with Him. So, settle in and get out your spiritual bifocals, friends. Ask the Holy Spirit to guide you as you learn to view life through a kingdom lens. As we read, may we learn to find our heart’s home in Christ alone.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-1-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 1:12-18, Genesis 2:15-17, Genesis 3:1-7, James 3:13-17",
    "devo_title": "The Limitations of Wisdom",
    "devo_summary": "\n\nBy Ellen L. Taylor\n\nI’ve always loved school. I was never the kid who held up the thermometer to a lamp so I could stay home, and the only time I ever cried about having to go to school was when it was the last day before summer. Even in high school, when getting up at 6:30 in the morning seemed like the worst thing in the world, I was still so happy to be at school once I got there (as long as I got there with some coffee).\n\nBecause of my love for school, my family and I have often joked that being a life-long student would be my dream job. And it’s true, really, most of my current career aspirations involve school, school, and then more school. It’s even better that my subject of choice is theology; I get to learn about God every day.\n\nWhen I was in divinity school, I had a bit of a crisis of faith. I found myself asking, “What is the point of paying all this money to learn about a God who is so beyond our comprehension that we could never learn all there is to know?” The learning began to feel ominous, daunting, and scary, rather than invigorating and inviting.\n\nThe author of Ecclesiastes is asking a similar question in today’s reading. Many scholars believe that King Solomon wrote the book of Ecclesiastes, and he is known as one of the wisest men in the Bible. He has spent all of this time learning and seeking out wisdom, but for what? He writes, “I applied my mind to know wisdom and knowledge, madness and folly; I learned that this too is a pursuit of the wind” (Ecclesiastes 1:17). He has come to the realization that not even the greatest knowledge will satisfy his deepest desire. Nothing compares to a relationship with God.\n\nI found this out the hard way in grad school. One of the hardest things for me was that I couldn’t seem to find colleagues who talked about God like God is real. For so many, God is something to be studied, rather than someone to know. In my life as a writer and editor now, I make every effort to both study and know God, because there is always more to learn, but He already knows it all.\n\nThere is a vast difference in knowledge about God and knowledge of God. Even though I love learning more than any other earthly thing, knowledge about God can never compare to the contentment of knowing of God—having a personal relationship with the Creator of knowledge Himself.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-2-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 2:1-26, Genesis 1:26-28, John 15:9-11",
    "devo_title": "The Emptiness of Work",
    "devo_summary": "\n\nBy Ellen L. Taylor\n\nI turned sixteen the summer before my junior year of high school. Along with the new excitement of being able to drive came the responsibility of having my first “real” job. I worked as a cashier at a neighborhood pharmacy and gift shop in a suburb of Birmingham, Alabama, taking phone calls for prescription refills and stocking the shelves with face lotion and hand soap. But the best part of this summer job was something we lovingly referred to as “Christmas in July”—receiving all of the seasonal products for Christmas at the pharmacy, pricing them accordingly, and keeping track of inventory until they put out the Christmas items in late fall.\n\nI was constantly confused by the juxtaposition of the stifling Alabama summer heat with the Santa Claus figurines and snowflake ornaments. Even so, I loved that job. The fragile ornaments and figurines needed special care while unpacking, and even though it meant I left covered in glitter every day, I paid special attention to them, lifting them gingerly out of their boxes and placing them on the storage shelves where they would sit until they made their debut in the pharmacy. It might not have been the most important job, but I found purpose in it.\n\nKing Solomon had one of the most important jobs in the Old Testament. God called him to build the temple where God’s presence would dwell among the Israelites (1Chronicles 22:6–10). This was an incredible honor, one that God didn’t even entrust to King David, who was considered a “man after [God’s] own heart” (1Samuel 13:14).\n\nDespite all this, Ecclesiastes 2 tells us that King Solomon struggled with the purpose of work. He writes, “I hated all my work that I labored at under the sun because I must leave it to the one who comes after me. And who knows whether he will be wise or a fool? Yet he will take over all my work that I labored at skillfully under the sun. This too is futile” (Ecclesiastes 2:18–19). To the author of Ecclesiastes, leaving his work behind after death made it meaningless, a pursuit of the wind. But he goes on to explain that while he felt as though his work was meaningless, there is “nothing better for a person than to eat, drink, and enjoy his work” (v.24).\n\nIn Genesis 1, after the creation of humankind, God instructed Adam and Eve to work, telling them, “Be fruitful, multiply, fill the earth, and subdue it. Rule the fish of the sea, the birds of the sky, and every creature that crawls on the earth” (Genesis 1:28). God’s design for humanity always included work—it preceded the fall! Our work is not meaningless; we are called to it. And when we do our work for the glory of the one who worked first to create us, it has eternal meaning and significance.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-3-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 3:1-15, John 16:25-33, 1 Corinthians 2:9-10",
    "devo_title": "The Mystery of Time",
    "devo_summary": "\n\nBy Bailey Gillespie\n\nThere’s a word in the German language, sehnsucht, that C.S. Lewis popularized in his book Surprised by Joy. Sehnsucht refers to the yearning and longing our human hearts feel for more, for an unnamed place or the fulfillment of desires that cannot be quenched in this world alone. This Romantic concept was key to Lewis’s eventual belief in Christianity. He often encountered everyday things that evoked this pang of longing, like the smell of a bonfire or the sound of ocean waves, and filled him with an insatiable desire for more that he couldn’t quite explain. It was really the truth behind Ecclesiastes 3:11 that seized him: God has put eternity in our hearts.\n\nThink about that for a moment. Even taking into account what we do know, eternity is a bit of a mystery, isn’t it? From the Old Testament to Revelation, Scripture gives us clues, like tracks in the woods, but not enough to form a complete understanding.\n\nIn Scripture, the word eternity refers to the mind-bending truth that God has no beginning and no end, but it can also be used as shorthand for our future life with God—in heaven or in the coming kingdom. We will have the life of God, eternal by its very nature.\n\nBut in the same breath, the author also says that “no one can discover the work God has done from beginning to end” (v.11). This statement has always been a little confusing for me. If God put eternity in our hearts, why does He place limitations on our discovery? I want my longing to generate endless insight about what God is up to. Instead, I’m told “no one can discover” what God has done, at least not the full scope of it. There is knowledge He has reserved for His own purposes, which “no eye has seen” and “no human heart has conceived” (1Corinthians 2:9). And so our response to Him must be one of faith.\n\nAlthough there isn’t anything particularly special about bonfire smoke or sea salt, there are things in this life that catch our attention and draw us toward heaven. For you, it may be the feel of your baby’s hair. For another, maybe the taste of raspberry jam. Whatever it is, Scripture tells us that God has built eternity into the fabric of our hearts and that all creation declares His glory.\n\nBut it is still a mystery. God gives us some knowledge, but not enough to discover His full and perfect plan. So, as Christians, we acknowledge that, even if we don’t fully understand what eternity will be like or how time works in the kingdom of God, by faith we believe that God places this longing in us so that we seek and find Him. We pay attention to this “inner knowing” and choose to trust what God has revealed. What we see is not all there is. One day, the veil will be pulled back. Eternity is coming.\n\nUntil then, we have crackling bonfires and ocean waves to remind us.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-4-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 3:16-22, Genesis 3:19, Psalm 104:28-30, Psalm 119:25-26, 1 Corinthians 15:35-58",
    "devo_title": "The Mystery of Injustice and Death",
    "devo_summary": "\n\nBy Jessica Lamb\n\nI was recently given a robot vacuum. I’ve wanted one for several years, and the first night we turned it on, my husband and I watched it whir around our living room in awe. Then it stopped abruptly, full of dust, dirt, and who knows what else. We emptied it and ran it again. Then again. We ran it twelve times before it finally seemed satiated. But then when we ran it the next night, it had to be emptied multiple times yet again.\n\nI initially felt defeated. Foolishly, I’d imagined that this gift would mean the permanent end of my dirty floors, instead of understanding it to be a helpful tool in the inevitable. My life is one of perpetually dirty floors, of glitter shed from preschool art projects and baby food flung surprisingly far from the dining room table. There will always be dust for the Roomba at the end of each day. While I can’t stop cleaning, I’m happier when I focus my energy on the joys of the mess-makers instead of pretending like their mess can be fully avoided.\n\nAt first glance, the hopelessness of today’s passage seems almost aggressive. Like Adam after the fall (Genesis 3), we read that “all are going to the same place” (meaning we will all die), but then the author of Ecclesiastes seemingly pivots and tells us to “enjoy [our] activities’ (Ecclesiastes 3:20–22).\n\nHe tells us to enjoy this life because we know death is a part of our post-fall reality, not just in spite of it. We can’t outrun death any easier than I can outsweep dirt in my home. But if we remember to number our days, we gain wisdom (Psalm 90:12). Against the backdrop of eternity, of knowing that our time here is limited, we can rightly hold all the good and bad of this life in proper perspective.\n\nWe can enjoy the blessings in our lives without expecting them to fill us in a way they were never meant to. We can grieve, mourn, and endure pain, because we know those, too, have an expiration date. We can learn to invest our hopes in and entrust our sorrows to an eternal God who satisfies eternally.\n\nAnd on this side of the cross, we know God does not leave us in dust. Death is not our permanent end. As believers, we will also bear the image of Jesus, the man of heaven (1Corinthians 15:49), whose defeat over the grave is the first taste of a future harvest when all believers will be resurrected (v.20). We know that after death we will find ourselves in the presence of the Lord, where there is abundant joy (2Corinthians 5:8) and resurrection victory over death (1Corinthians 15:57). The gospel transforms the meaning of life, and it transforms the meaning of death.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-5-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "James 3:17",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nTake this day to catch up on your reading, pray, and rest in the presence of the Lord.\n\nBut the wisdom from above is first pure, then peace-loving, gentle, compliant, full of mercy and good fruits, unwavering, without pretense.—James 3:17\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-6-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 2:26",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of Jesus with us wherever we go.\n\nThis week we will memorize a verse from Ecclesiastes about the fruit that comes from following God.\n\nFor to the person who is pleasing in his sight, he gives wisdom, knowledge, and joy.—Ecclesiastes 2:26a\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Lockscreen-7-473x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 4:1-16, Proverbs 27:17, Luke 12:13-21, Acts 2:42-47, 1 Corinthians 12:18-21",
    "devo_title": "The Loneliness of Wealth",
    "devo_summary": "\n\nBy Ellen L. Taylor\n\nIn January of my sophomore year of college, I laced up my hiking boots and packed a backpack (and two huge suitcases) and set off for a semester abroad in Santiago, Chile. My then-boyfriend, whom I had begun dating just a mere three months prior to leaving, wrote me a letter to read while I was gone. There is one passage from the letter that I still think of occasionally. In it was Ecclesiastes 4:12: “A cord of three strands is not easily broken,” and below it, the words “and what a strong cord we will have: you, me, and the Lord of all creation.” And although that relationship didn’t survive the strain of a semester away from each other (long distance is hard when you’re nineteen!), I’ve applied that sentiment to many of my relationships over the years: friendships, romantic relationships, and familial relationships alike.\n\nWhen I was young, I didn’t know how to braid my hair. I would end up just separating my hair into two sections and twisting them around each other, until one year at church camp when a friend taught me how to correctly braid my hair. The secret? Separating it into three sections, like the author of Ecclesiastes says in chapter 4, the cord of three strands is not easily broken. I’ve found this to be true over and over again throughout my life. My relationships with other people are so much stronger when the relationship is built on a mutual desire to serve and love God first, then each other.\n\nSurrounding yourself with people who love the Lord is so important, especially during formational seasons of life. Lack of community makes it increasingly hard to find purpose. I have found that a life in pursuit of God is so much more meaningful when it is done in community. When surrounded by other believers, seasons of fruitfulness become even more sweet, and seasons of doubt are met with comfort and understanding. The cord of three strands provides a safe place to learn, to question, and to grow. It is important that we not only seek out this kind of community for ourselves, but commit to being this kind of community for those around us. The kingdom of God is a place where all who believe are welcome. May we seek to live this out in our own lives each and every day.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-8-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 5:1-20, 1 Samuel 15:22, Luke 12:22-34",
    "devo_title": "Caution in God’s Presence",
    "devo_summary": "\n\nBy Sharon Hodde Miller\n\nWhat does your prayer life look like in this season of life? How, specifically, do you pray each day?\n\nAs a mom with small kids and a church to help lead, I will confess that my prayer life is often rushed. I pray throughout the day, squeezing it in when I can. I pray when I wake up, I pray when I am driving, I pray at meals, I pray when someone comes to mind, and I pray as I fall asleep. Because of this rhythm, my prayer life is often hurried. And when I do pray, I am doing the majority of the talking.\n\nThis is how many of us pray, especially in hectic seasons of life. God functions as a touchstone throughout our schedule, and there is some good in this practice. It reminds us of the ever-present help we have in Him. However, I have recently become convicted that this practice lacks something important: listening.\n\nI recently heard a podcast describe the strange training regimen of NASA astronauts preparing for space. Because outer space is absolutely silent to a degree that we never experience on earth, astronauts must learn to adjust to it. They do this by spending time in a noiseless chamber where the silence is profound. In fact, the absence of noise is so absolute that you can hear the sound of your own body and its most basic, typically imperceivable, inner workings: the sound of your own breathing, or your heart beating and pumping blood to the rest of your body, the sound of skin sliding over sinew, of bones rubbing against one another—which is about when astronauts start hearing things that aren’t actually there.\n\nThis description is almost unsettling to read, but it helps us to grasp the loud volume of our everyday lives. We live in a world where silence, true silence, is difficult to come by. But as these astronauts have discovered, it is only through silence that we can hear things we’ve never heard before.\n\nFor many of us, silence is the missing ingredient from our prayer lives. We are unable to hear from God because we haven’t created the environment for it. This is what the author of Ecclesiastes is saying: He counsels, “Do not be hasty to speak, and do not be impulsive to make a speech before God. God is in heaven and you are on earth, so let your words be few” (Ecclesiastes 5:2). This is an invitation to turn our prayer life on its head by listening more to what God has to say, rather than solely bringing petitions and requests before Him.\n\nThis can be a challenge, but it is also a word of grace and good news to any of us who do not know what to pray, or those of us who feel pressure to pray in a certain manner. Instead, it reminds us that prayer is not simply about us speaking to God, but God speaking to us. If we will only make the space to listen.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-9-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 6:1-12, Matthew 6:19-24, Mark 10:17-31, 1 Timothy 6:6-7, Revelation 3:17-20",
    "devo_title": "The Tragedy of Wealth",
    "devo_summary": "\n\nBy Sharon Hodde Miller\n\nSeveral months ago, our oldest son earned a toy by accomplishing a series of educational milestones. He had worked hard, and we were eager to celebrate him, so we drove to the store and purchased a LEGO set as his reward. All seemed well until we were pulling out of the parking lot and I heard his little voice from the back seat: “I wish this part of the set was different.” Not five minutes after we had purchased the toy, he was already disappointed.\n\nI have watched my son experience the same disappointment again and again. The trinket he bought with his own money. The dessert he picked out. The Nerf gun he begged us to give him for Christmas. As soon as he gained possession of each promising new prize, his satisfaction evaporated into thin air.\n\nMy son and I have this conversation often. He complains when his latest present is disappointing. I explain that he cannot derive the fullness of his joy from material things. Around and around we go. It’s a struggle my son will experience for the rest of his life, and I know this because it’s a struggle I’ve had for all of mine.\n\nOn some level, we all know that money and possessions cannot satisfy us. And yet, if we are being honest, most of us seek after them anyway. Perhaps not as cravenly as the “wolves on Wall Street,” but who among us is not enticed, and then duped, by the promise and the security of having more?\n\nIn Ecclesiastes 5 and 6, the author explains the vanity of this search. He does so by describing multiple scenarios in which the accumulation of wealth amounts to nothing. One man spends his whole life growing his wealth, but is never fully satisfied by it (Ecclesiastes 5:10). Another accumulates wealth but then loses it all in a bad venture (v.13–14). Still another earns riches and honor, which are then taken by another (Ecclesiastes 6:1–2). Over and over he depicts the precarious fragility of money, and the spiritual futility of striving after it.\n\nIn these chapters the author is harsh, because he wants to communicate a counter-intuitive idea. Counter to our logic, the accumulation of wealth is not the answer to our problems. Instead, it has all the dependability of a house of cards. Wealth and possession look sturdy to the eye, but they snap like a toothpick under the weight of our souls. That is why so many wealthy people still feel insecure—because they are. Because wealth and material things are inherently fragile and empty, no matter how much we have.\n\nWhen “all of your labor is for your own stomach,” the truth is you “will never be satisfied” (Ecclesiastes 6:7). It’s a lesson that many of us will choose to learn the hard way, or never learn at all, but we cannot escape its reality: no matter how much we earn or gain or accomplish, the pursuit of wealth is like standing atop a house of cards, when we were created for the Rock of Ages.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-10-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 7:1-22, Matthew 9:13, James 1:19-21",
    "devo_title": "Wise Sayings",
    "devo_summary": "\n\nBy Ellen L. Taylor\n\nI was living in Santiago with two of my closest friends for a semester abroad when I earned my college nickname: Kellen. It was one of those dear friends who coined the term, after witnessing me declare that getting ice cubes out of the ice tray was “literally the hardest thing I have ever done in my entire life.” She softly sighed and said, “Ah, Kellen.” And thus my new name was born, and it’s stuck, apparently, given that some of my friends still call me some form of Kellen, Kel, or Kellie more than five years later.\n\nWhen we returned to school in the states, others asked what had inspired my new nickname. My friend explained that it happened because, as usual, I was living a life of emotional extremes. My friends have always described me this way, that I’m either having the best day of my life or the worst—there’s not really much room for anything in between.\n\nLiving a life of extremes is exactly what the author of Ecclesiastes is cautioning against in today’s reading. Although one of the major themes throughout the book of Ecclesiastes is the pursuit of wisdom, and King Solomon (to whom many scholars attribute Ecclesiastes) asked God specifically for wisdom (1Kings 3:9–12), he still cautions the reader to not be excessive in their pursuit of it.\n\nHave you ever heard the phrase “too much of a good thing”? I’ve often heard it used in reference to a delicious meal or dessert, when the decadence of the meal has caused a person to feel stuffed to the point of being uncomfortable. This is what the author of Ecclesiastes seems to be saying in this passage; there can be too much of a good thing. One’s pursuit of righteousness and wisdom can get to the point where it is excessive and no longer helpful, in the same way that a pursuit of foolishness can also be excessive. Instead, we are instructed to not be excessively righteous or overly wise (Ecclesiastes 7:16).\n\nThe key here seems to be the need for balance. Like we read in Ecclesiastes 1, when it comes to the pursuit of knowledge, we must be content with not knowing everything. There will always be more to learn, more to discover, and more ways to be wise. Our contentment can be found not in the extremes of pursuing all knowledge or in casting all wisdom aside for foolishness, but in fearing God while we are on earth, knowing that a greater glory awaits us.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-11-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 7:23-29, 1 Kings 11:1-10, Isaiah 53:6, Romans 11:33-35",
    "devo_title": "What the Teacher Found",
    "devo_summary": "\n\nBy Erin Davis\n\nI thought I knew him. We spent our whole childhoods in the same one-stoplight town. I recognized his momma, knew what sports he played and what kind of music he listened to, but as I glance back in life’s rearview mirror it’s clear to me: I didn’t know a thing.\n\nIt’s taken twenty years of marriage to discover all I didn’t know; things like how he likes his eggs cooked, how his lips turn when he’s sad, and what keeps him awake with worry in the wee hours of the morning. Time and commitment have pressed our knowing past the surface, down into the deepest crevices of our hearts.\n\nSolomon’s quest for knowledge about God was unmatched. With his jaw set and fists clenched, it seems he resolved to be wise. He stacked one fact about God on top of the next, yet a heart of wisdom seemed just out of reach (Ecclesiastes 7:27–28).\n\nIn the end, Solomon’s quest to know about God ended in cynicism (v.29) and sin (1 Kings 11:4). In contrast, history remembers Solomon’s father King David as a man after God’s own heart (1 Samuel 13:14; Acts 13:22). While Solomon sought to understand the ways of God, David sought to know the heart of God. The difference in their lives couldn’t have been more stark.\n\nSolomon considered knowing God and bemoaned, “What exists is beyond reach and very deep. Who can discover it?” (Ecclesiastes 7:24). His father, however, marveled, “LORD, you have searched me and known me… Your works are wondrous, I know this very well ” (Psalm 139:1,14). Solomon’s wisdom, it seems, stayed on the surface, while David’s was pressed down into the deepest crevices of his heart.\n\nFor all the hours he spent searching and all the ink he spilled teaching, Solomon isn’t the poster child for wisdom. Not really. Instead, he shows us clearly that there’s a difference between knowing about God and actually experiencing Him in relationship, for Solomon’s head knowledge didn’t lead to lasting heart transformation.\n\nHow do we avoid Solomon’s mistake, accumulating facts about God like dusty books unread on the shelf? How can we guard against studying wisdom while acting like a fool? We remember this: Wisdom isn’t an item to collect but a Person to be cherished.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-12-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Luke 12:22",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nTake this day to catch up on your reading, pray, and rest in the presence of the Lord.\n\n“Therefore I tell you, don’t worry about your life, what you will eat; or about the body,what you will wear.”—Luke 12:22\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-13-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 5:18",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of Jesus with us wherever we go.\n\nThis week we will memorize a verse from Ecclesiastes 5 about enjoying the life and work God has given us.\n\nIt is appropriate to eat, drink, and experience good in all the labor one does under the sun during the few days of his life God has given him.—Ecclesiastes 5:18b\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Lockscreen-14-473x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 8:1-17, Proverbs 10:7, 2 Corinthians 13:4",
    "devo_title": "Wisdom, Authorities, and Inequities",
    "devo_summary": "\n\nBy Bailey Gillespie\n\nOne summer, three friends and I strapped on our backpacks to hike the irrigation trail up the side of a canyon wall. This one canyon is a popular hiking spot because of its proximity to the Foresthill Bridge, the fourth highest bridge in the United States.\n\nHalfway up the mountain, nausea hit. Due to the intermingling of 90-degree heat and a limited water supply, I felt instant regret over suggesting this vertical trail that wasn’t even meant for hiking. (It’s an irrigation trail, after all.) Wisdom sure wasn’t the one leading the charge in this decision; it was my own ego and the myth of invincibility. After we almost passed out from dehydration, two of my friends had to shoulder my body weight and help carry me the rest of the way.\n\nScripture says that “a person’s wisdom brightens his face” (Ecclesiastes 8:1). At the time when Ecclesiastes was written, wisdom was attributed as coming from a divine source. A bright face was considered physical evidence of wisdom in the wise person’s life, just as Moses’s face shone with radiance after spending time with the Lord (Exodus 34:34–35).\n\nOur faces today may not emit a visible shining substance when we make good decisions or spend quality time with the Lord. But wisdom lingers with us the way campfire smoke stays on your clothes after hours roasting the perfect marshmallows. It favorably directs our steps and will be evident in our lives when we exercise it. Since our thoughts and actions affect those we are in community with, when we use wisdom in decision-making, we can also bring life to our collective environments. In doing so, perhaps our sphere of the world can better operate by kingdom values, such as justice, mercy, and love.\n\nProverbs offers the encouragement that “remembrance of the righteous is a blessing” (Proverbs 10:7). Those who live from a place of wisdom—whose faces are “brightened” by the Spirit of the Living God—are a blessing. It’s not that the wise avoid folly altogether. They just learn from their mistakes. As Jesus-followers, if our aim is to pursue abundant life, our lives will be marked by years that smell like wisdom.\n\nIn the end, climbing a mountain on a 90-degree day probably wasn’t wise. While our faces may have glistened, it wasn’t from nearing the Mount of Transfiguration, but from perspiring pearls of sweat that mocked our foolish decision. You’d better believe we learned from that mistake and will only plan future hikes up paths that are intended for human recreation.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-15-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 9:1-18, Psalm 16:11, James 1:17",
    "devo_title": "Enjoy Life Despite Death",
    "devo_summary": "\n\nBy Guest Writer\n\nA day will come for all of us when we are separated from the ones we love most. This is heartbreaking. It was never meant to be this way. Death was not a part of the design specs of the garden of Eden, and this is why death affects us so deeply; our minds and hearts were not engineered to handle the effects of death. But God has wisdom for us, and through Solomon, has given counsel for navigating “the vapor” that is life under the sun (Ecclesiastes 1:2–4).\n\nKing Solomon tells us to enjoy life while we’re living it. Plain, simple, to the point. We are to look at what God has given us—the blessings we acknowledge and everything we take for granted—and maximize our joy in those gifts from Him. We are to leverage them to care for His Church, and in the process, He makes us more aware of what we’ve been given: “The righteous, the wise, and their works are in God’s hands” (Ecclesiastes 9:1). Solomon tells us to savor our meals, to tell stories and clank our glasses with friends, looking into the eyes of our fellow image-bearers. Why? Because it won’t always be like this. These moments are fleeting, so grab them now.\n\nWisdom in this life involves more than just fighting sin; wisdom also means fully living the life God has given us. Because of Jesus’s death and rising, we realize it’s not unspiritual to enjoy life—it’s actually biblical—for the glory of God and for our good. Jesus defeating death shows us that God doesn’t ignore the beauties of physical human life; He redeems them. Therefore, we ought to enjoy them and give thanks for them in the moment, which is an act of those who are fully alive, “for the living know that they will die” (Ecclesiastes 9:5).\n\nThis does not mean that we can shirk our responsibilities in pursuit of our own personal pleasure and comfort—that’s worldliness. Disciples of Christ discover joy in the ordinariness of life. Today, resolve to be present and relish in what you have been given from God, enjoying and acknowledging “every good and perfect gift” from “the Father of lights, who does not change like shifting shadows,” despite our circumstances (James 1:17).\n\nWhatever you do in this life, do it all the way. Whatever it is that you’ve been called to do for work, family, church—do it with all your strength (Ecclesiastes 9:10). Life’s too fleeting for half-measures and good intentions. Both are ultimately empty acts, and Jesus came so that each of us “may have life and have it in abundance” (John 10:10). Love and live fully, laugh until you cry, embrace those around you. Enjoy life today, remembering that it is a vapor, but that in our God’s presence are abundant joys and eternal pleasures (Psalm 16:11).\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-16-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 10:1-20, Psalm 7:12-17, Proverbs 26:27",
    "devo_title": "The Burden of Folly",
    "devo_summary": "\n\nBy Erin Davis\n\n“What should you do when you’re in a hole, son?”\n\nThis is the question I often ask when one of my four boys responds to correction by arguing or deflecting blame. They know the routine. The question interrupts their defense mechanisms. Most of the time, their little arms drop to their sides as they sigh and answer: “Stop digging.”\n\nIt’s a word picture Scripture gives us, and one I like to imagine David used as he corrected his son, Solomon. It was King David who penned, “He dug a pit and hollowed it out but fell into the hole he had made” (Psalm 7:15). Solomon repeated his father’s wisdom when he wrote, “The one who digs a pit may fall into it, and the one who breaks through a wall may be bitten by a snake” (Ecclesiastes 10:8). (Don’t you like how he added that last part?)\n\nI don’t know about you, but I don’t do a lot of pit digging, let alone snake-infested wall-breaking, for that matter. Without context, I might be tempted to race right past these verses thinking they don’t apply. But as we study Scripture’s Wisdom Literature, we see that neither David nor Solomon were warning against a literal pit, the kind that is dug with an actual shovel. No, this is a pit of trouble, and the shovel, in this case, is our words.\n\nIt was Solomon who reflected, “The words from the mouth of a wise person are gracious, but the lips of a fool consume him” (Ecclesiastes 10:12), and his father David who prayed, “LORD, set up a guard for my mouth; keep watch at the door of my lips” (Psalm 141:3).\n\nIf you’ve ever felt buried under the weight of your foolish words, or wished there were a superglue that could seal your mouth shut, I’m sure you can relate. We all can. When our words have dug us into a pit of trouble, God’s Word and His Spirit remind us that wise words can only flow from a wise heart. When our speech reveals our folly we have a choice. Argue, deflect, defend, or stop digging and repent, asking the Lord to give us hearts more like His.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-17-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 11:1-10, Psalm 94:17-19, Colossians 3:21-25",
    "devo_title": "Invest in Life",
    "devo_summary": "\n\nBy Bailey Gillespie\n\nOne day after work, I stopped by a retail store on the way home. Everyone and their mother was in line waiting for this one poor girl to ring them up at the register. I couldn’t help but notice she looked upset—haggard, irritated, all the unhappy adjectives. My first reaction was to wish she had a better spirit of customer service, but then something softened, and I was convicted to strike up a conversation once it was my turn. The short story was this: No, she wasn’t having a good day, because her best friend had just died, and she was the one who had discovered the body. To intensify her grief, she couldn’t find someone to cover her shift that coming Saturday and had to miss the funeral.\n\nAs you can imagine, few words felt appropriate in this situation. Doing nothing felt cold, but offering words of false comfort felt colder. How would Jesus respond?\n\nLong story short, the Spirit prompted me to do something tangible for this girl—not to persuade her that everything would be okay or that knowing God would suddenly lessen the pain, but because the moments when I’ve felt most loved were moments when another human being did something unexpected to show God’s kindness to me. So, I returned to the store with a chocolate cupcake and a card that said this: “I’m so sorry you lost your best friend. Nobody should ever have to go through that. God sees you and grieves with you.”\n\nThe world encourages us to spend our days like money, trading them in for pleasure and recreation. But, friends, God urges us to invest our lives in the kingdom. He promises that we will reap a harvest one day (Galatians 6:9). We can’t guarantee that one conversation or random act of kindness will be the one to change someone’s life, but we can trust that God does not waste one moment of our lives. Ecclesiastes 11:6 says it this way: “In the morning sow your seed, and at evening do not let your hand rest.”\n\nEven while operating out of a focus on life under the sun, the writer of Ecclesiastes lifts his head for a moment to comment on what life looks like in the kingdom. He acknowledges there is a God, one who has the power to make what we sow flourish, as well as bring judgment on our actions.\n\nWe never know God’s timing or how He might multiply the work of our hands. So, we sink our teeth into each day. Investing, planting, watering, we pray for the flourishing of God’s movement in the world. But even when we don’t see the fruit, God is still trustworthy with the results.\n\n“Whatever you do, do it from the heart, as something done for the Lordand not for people, knowing that you will receive the rewardof an inheritance from the Lord” (Colossians 3:23–24).\n\nInstead of spending all our days like money, let’s look for ways to invest in life. Giving someone a cupcake to remind them that their grief isn’t insignificant feels so small—almost silly. But as I watched the girl behind the register run around the counter with a big smile and arms spread open, it felt like Jesus was up to something.\n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-18-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 12:1-14, Proverbs 22:17-21, John 11:25-26",
    "devo_title": "The Teacher’s Conclusion",
    "devo_summary": "\n\nBy Jessica Lamb\n\nMy second child recently turned seven months old. Though I experienced these same developmental milestones with my first, something about this second time around has left me even more in awe of how quickly babies grow and change. In his first few days, my son could only hold up his head for seconds at a time. When he came home from the hospital, he could only see about fifteen inches away, just far enough to make out my face as I held him and stared at his tiny features. He can now see me clearly from across the room and crawl toward me as fast as his not-so-tiny legs can move.\n\nI sometimes wonder if that’s one of the reasons he cries on occasion, even when every need I can think of is met. Because today, his world looks totally different than it did yesterday. The whole world is open for discovery, but that growth meant a sharp change in perspective.\n\nI imagined that sort of cry at the end of our reading today. The author of Ecclesiastes has been writing at length about life “under the sun.” A life where delight fades, strong men stoop, songs grow faint, and dust returns. A life where so much is “absolute futility.” Then, in the last few verses, there are these words:\n\nBe warned: there is no end to the making of many books, and much study wearies the body.When all has been heard, the conclusion of the matter is this:fear God and keep his commands, because this is for all humanity.For God will bring every act to judgment, including every hidden thing,whether good or evil (Ecclesiastes 12:12–14).\n\nFor almost the entirety of my professional career I have worked in publishing, and I always want to voice a hearty “Amen!” at verse 12. There is no end to the making of books, to writers and philosophers and poets and politicians and artists and parishioners trying to make sense of our place as humans in this world. But the path to seeing our days differently is made clear here, because there is more to see than we once thought. For every single one of us, the key to meaning is the same: fear God, and keep His commands.\n\nThis is for all of us, because God is for all of us. He is our Creator, whose eyes saw us while we were still being formed (Psalm 139). He is our Sustainer, who knows when a single sparrow falls, clothes the flowers of the field, and anticipates our needs and worries (Matthew 6:25–34;10:29–31; 1Peter 5:7). He is our Savior, who invites us to follow Him and be part of His kingdom work here and now. His Word equips us to see our world through His perspective, and recast all our days in light of eternity.\n\nSo remember your Creator, find your confidence in the Lord. He is the resurrection, He is the life. This is for all of us, if we’ll just take hold and believe it.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-19-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Psalm 94:19",
    "devo_title": "Grace Day",
    "devo_summary": "\n\nBy She Reads Truth\n\nTake this day to catch up on your reading, pray, and rest in the presence of the Lord.\n\nWhen I am filled with cares,your comfort brings me joy.—Psalm 94:19\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Instagram-20-1024x1024.jpg"
  },
  {
    "book_title": "Ecclesiastes",
    "devo_passages": "Ecclesiastes 12:13",
    "devo_title": "Weekly Truth",
    "devo_summary": "\n\nBy She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the good news of Jesus with us wherever we go.\n\nThis week we will memorize the key verse for Ecclesiastes.\n\nWhen all has been heard, the conclusion of the matter is this: fear God and keep his commands, because this is for all humanity.—Ecclesiastes 12:13\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/SRT-Ecclesiastes-Lockscreen-21-473x1024.jpg"
  }
]