[
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 1:1-14, Isaiah 17:10-11, Acts 2:17-21",
        "devo_title": "Joel’s Prophecy",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Joel 1:1-14, Isaiah 17:10-11, Acts 2:17-21\nHave you ever done something that was honestly deplorable, something you felt desperate to take back as soon as it was done? Even the memory of it can grind you down and make your fingers ache with regret. Shakespeare calls this “an expense of spirit in a waste of shame.”\nThe Minor Prophets show us the result of expending our energy to pursue sin: a locust-eaten wasteland of emptiness and shame. Joel’s assessment of sin is bleak: “Indeed, human joy has dried up” (Joel 1:12). It’s a prophecy similar to that of the other prophets. In a nutshell, he’s saying: “you have forgotten the God of your salvation”—repent and return (Isaiah 17:10).\nBut instead of just handing it to us in a nutshell, God shows us in sobering terms the plagues, wrath, and judgment that come from our sin. It is utterly devastating. When I read these words I know deep in my bones I can’t shoulder the weight of such miserable punishment. I can’t take my sins back. \nIgor Stravinksy devastatingly said, “Sins cannot be undone, only forgiven.” He’s right. We can’t unsay and undo the shameful things we’ve done. But the minor prophets give us real hope. The judgment for our sins is massive, but that is precisely the judgment Jesus paid on our behalf.\nGod the Father levies judgment against us because of our sin, and then takes that punishment on His own shoulders in the person of Christ. The tsunami of judgment that reared up and threatened to obliterate us splashes harmlessly back into the ocean because of Christ Jesus.\nWhen we read prophecy, it’s important to ask ourselves, What did it mean to them then? and What does it mean for us now? Joel was preaching a specific message to Israel in the midst of a locust crisis, and he is also preaching to us in the midst of our own crises, today. But in this case, his message is really the same: repent and return to your first love.\nThen and now, God is in a relationship with His people, censuring our sins with judgment, calling us to repentance, and extending His forgiveness. He is actively doing it all, all the time. We can respond by crying out to Him with deep thankfulness. \nLord, we cry out to you. Forgive us, and teach us to forgive.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram1.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 1:15-20, Joel 2:1-11, Psalm 43:4, Romans 10:13",
        "devo_title": "The Day of the Lord",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Joel 1:15-20, Joel 2:1-11, Psalm 43:4, Romans 10:13\nYou’re probably tired of hearing about the locusts. Welcome to the club.\nWell, I’m definitely not interested in talking about “cicadas,” a term which, until today, I thought was Southern slang for the locusts we read about in Joel chapter 1: “What the devouring locust has left, the swarming locust has eaten…” (v. 4). For the record, they’re not the same. But they’re still creepy and crawly, and although I’m probably hurting a scientist’s feelings right now, they’re the same in my book.\nNot long ago, the 13-year cicadas took over our city, which is why I can say for certain that the worst part about these little pests is the swarming noise. And while we’ve moved on in today’s Scripture passage without mention of locusts, that doesn’t mean they aren’t there. We’ve just needed to focus on other things Joel tells us will signal the day of the Lord—and it’s quite a list. Compared to food shortages and moaning cattle, the locusts are nothing.\nThat’s what I was beginning to think a few week’s into our recent cicada invasion: Maybe things weren’t so bad! In fact, the swarming sounds were sometimes soothing, like white noise, compared to newer frustrations like recent headlines, car repairs, and dental surgeries. Then, just when I was beginning to consider the cicadas old news, someone sent a mass email to our neighborhood with the subject line, “High-Pitched ‘Whirring’ Noise Throughout Neighborhood.” It read:\nDoes anyone know where the noise throughout the neighborhood over the past few days has been coming from? It’s loud over here! Hoping it will cease in the near future, but just wondered if anyone else is aware of the source?\nI’m not sure how our neighbor had successfully avoided them for weeks. But as I recalled my own miserable first encounter with the swarming bugs, I felt the urge to send her a sympathy casserole. \nWith the ever-increasing list of destruction headed our way in Joel, I think we, too, need a reminder of exactly how bad things actually are. Sin is real, and it is devastating. \nSomething I’ve learned about the locusts in Joel, versus the cicadas of my own experience: their swarming results from a collective desperation to be fed, and it is extremely damaging to crops in their path. The hungrier they get, the louder they become.\nIsn’t it the same for us? We are willing to destroy almost anything in the name of satisfaction. We are are willing to worship almost anything for a promise of fulfillment. Sin rages, and we continue to turn up the volume. \nWe cannot be counted on to stop and listen on our own, which is why it’s so beautiful that, above all the terrible noise we’ve grown accustomed to, God still makes Himself heard.\n“The Lord makes his voice heard\nin the presence of his army.\nHis camp is very large;\nthose who carry out his command are powerful.\nIndeed, the day of the Lord is terrible and dreadful—\nwho can endure it?”\n– Joel 2:11\nHe doesn’t just make His voice loud as the day of judgment approaches. He makes sure it’s heard by those who love Him, and beckons to those who don’t yet know the sound of His voice. Upon hearing Him, may our hearts respond in love and in praise, echoing the sentiment of the psalmist:\nThen I will come to the altar of God,\nto God, my greatest joy.\nI will praise you with the lyre,\nGod, my God.\n– Psalm 43:4\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram2.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 2:12-17, Zephaniah 1:7, Romans 5:18-21",
        "devo_title": "God’s Call for Repentance",
        "devo_summary": "\nBY Raechel Myers\n\nScripture Reading: Joel 2:12-17, Zephaniah 1:7, Romans 5:18-21\n“Repent and believe.” \nThese are the words Christ uses in the Gospel of Mark to begin His earthly ministry (Mark 1:15). But isn’t it funny how quickly we skate past that first part? Believing is beautiful, but repentance is less glamorous. Yet, right out of the gate, Jesus’ ministry began with a call for us to repent of our sin and believe He came to save us.\nIf we skip repentance, what do we believe He saves us from?\nI spent thirty years hearing the story of the prodigal son one way: a young foolish son squandering his inheritance, only to crawl back home when he had nowhere else to turn. To me, the story was always more about the father. I assumed the lesson here was that I should be as forgiving of foolish people as he was. Years passed, and now when I read that same story, I realize I’m not the father in this scenario. I’m the young fool. The story is as much about repentance as it is about forgiveness. \nScripture tells us the son came to his senses. He found clear eyes to look around and see the mess he’d made, then delivered a simple yet profound confession and repentance to his father: “Father, I have sinned against heaven and in your sight. I’m no longer worthy to be called your son” (Luke 15:21).\nRepentance wasn’t easy. The son wasn’t even sure if his father would take him back. But the father received him with open arms as a beloved son.\nIf Christ calls us to repent and believe, let’s not skip the first step. In doing so, we miss the fullness of the gospel. Let’s listen closely and hear the call to repentance spoken by the prophet Joel on behalf of God Himself:\n“Even now—this is the Lᴏʀᴅ’ꜱ declaration—turn to me with all your heart, with fasting, weeping, and mourning. Tear your hearts, not just your clothes, and return to the Lᴏʀᴅ your God. For he is gracious and compassionate, slow to anger, rich in faithful love, and he relents in sending disaster.”\n– Joel 2:12-13\nLet’s rend our hearts, like the prophet Joel said. But let’s do so with the confidence that we are returning to a Father who will receive us with open arms and forgive us. He will rejoice over us with singing” (Zephaniah 3:17). As my pastor sometimes says, when our repentance is at its deepest, the joy of our salvation is at its highest.  \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram3.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 2:18-32, Zechariah 10:6, 1 Thessalonians 5:2",
        "devo_title": "God’s Promise of His Spirit",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Joel 2:18-32, Zechariah 10:6, 1 Thessalonians 5:2\nIt feels like I am always waiting for the Holy Spirit to move, and I have grown weary in my waiting, angry with my unmet expectations of Him. I have distrusted Him and come to believe He has poured out Himself on every son and daughter but me. \nFor many years I believed the Spirit was a second blessing, the first being salvation alone through faith alone, and the second coming only through the laying on of hands and impartation of the gift. But when I began to read my Bible I began to see the gift of the Holy Spirit was not a second blessing as much as a coupled blessing: my salvation came with a built-in helper and comforter and teacher, just as Jesus promised it would (John 14:15-31). \nMy stumbling block then, it seemed, was struggling to believe this and live as though it were true—to live as though the Spirit Jesus said He would send had indeed come and lived within me, empowering me to bear His fruit, speak His truth, live in His fullness. Because I did not believe the Spirit came with my salvation, I had spun my wheels for years waiting for something. But what? More? Some evidence that I was a true believer? \nI believed I was not enough of anything for the Lord of the universe to condescend to me and give me gifts. I had read Joel 2:29 and the quoting of it in Acts, but had never noticed the words, “Even on my male and female servants in those days I will pour out my Spirit” (Acts 2:18).\nEven on.  \nThose two small words began to shift something in my belief about my salvation and story. God, the Creator of all, who came in the form of Jesus to earth, and left His Spirit to lead His children into all truth, had not omitted the male and female servants from the gift. He had not passed over the lowliest and poorest. He did not have levels of Christians or levels of the Spirit to give to those Christians, because the ground before the cross of Christ was level. \nJesus is not merely a respecter of persons but a hunter of faith. Faith is the only prerequisite for the gift of the Spirit. Faith alone, and nothing else. \nI know there are many views on the role of the Holy Spirit, and maybe you’ve felt confused by what you’ve heard. Today, if you’re wringing your hands and waiting, hoping and praying He won’t pass you over, I want to assure you that, if you are His child, He has not passed you over. He has given His Spirit to even the male and female servants, everyone who belongs to the household of God—no matter how long or short your walk of faith has been. \nIf you have trusted in the work of Christ to save you, the Holy Spirit is the seal of God upon you, helping and comforting you, strengthening and encouraging you, and empowering you for the work of God. He is the seal that was promised to the all the children of God, and if you are God’s, you have been given the seal, the guarantee, of redemption. Therefore, we need not fear, but rejoice and be glad. For the Lord has done astonishing things (Joel 2:21); He has come to rescue the souls of even you, and even me.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram4.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 3:1-21, Isaiah 33:20-22, Jeremiah 33:1-11",
        "devo_title": "Israel Blessed",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Joel 3:1-21, Isaiah 33:20-22, Jeremiah 33:1-11\nWhenever we witness injustice, or experience injustice ourselves, it feels as if vindication cannot come quickly enough. Whether it’s a friend who suffers character assassination, a neighbor who is victimized by crime, or children who are targeted by war—all of these injustices create a deep sense of urgency. We pine for justice, for God to make things right again, and in the meantime, every passing moment can feel like an eternal delay. \nThis is one of the most gut-wrenching challenges of being a human in a broken world. Jesus will come back one day, but that day is not here yet. And until then, we must wait for justice with all the agony of a woman in labor. \nThis agony is one the Israelites knew well. Joel 3 catalogs a long list of unspeakable suffering: young boys traded for prostitutes; young girls sold for wine; a people scattered from home and subjected to the torment of their enemies. Without a doubt, Israel longed for the day of restoration, the day when God would intervene on behalf of His people and bring an end to their misery. Surely there were days when they wondered if God’s justice would ever come.\nBut Joel 3 is the Lord’s response to Israel’s questions and longing: justice is indeed coming. One day, it will come like a roaring lion. All will be made well again. God’s people will be restored. Vengeance will be swift. “Shall I leave [my people’s] innocent blood unavenged? No, I will not,” He proclaims ( Joel 3:21). Because the Lord is, and always will be, a refuge for His people.\nThis is the promise of Joel, but it is also the promise of eternity. In Joel we see the character of God and the arc of human history, which guarantees two things:\nFirst, God’s justice is coming. Throughout Scripture, God promises that justice is coming. Sometimes the wait is long, but the promise is sure because we can trust the Promiser. As Christians, we bear witness to God’s in-breaking justice when we advocate for justice in the world, but on those days when evil seems triumphant and justice escapes us, we can have confidence that this is not the end of the story. We do not have to grow cynical or despair, because hope will have the final word.\nAnd second, God’s restoration is radical. It would be easy to read Joel as a story of two sides: God’s people versus the world. Throughout this chapter, God condemns “the nations” (meaning everyone who is not Israel), and He promises their demise. Destruction would seem to be their fate.\nBut if we zoom out and consider God’s heart for the nations, we realize this is not a story of “us versus them,” or “the good guys versus the bad guys.” In Isaiah 49:6, God tells Israel, “I will make you as a light for the nations, that my salvation may reach to the end of the earth.” In other words, God intends restoration for Israel, but He intends restoration for their oppressors as well.\nThis truth is radical, because it means God’s vision of restoration is much bigger than us and our individual injustices. While God promises vindication for the hurting, He desires restoration for all. \nThat is both the promise and the character of God. We can trust His justice and live in the hope of it, but His character also calls us into a vision of restoration much greater than ourselves. God’s plan of restoration—the good news of Jesus Christ—is so radical that it even lays claim to our enemies. Without a doubt, God intends to restore us, but He also intends to restore the world.  \n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She blogs at SheWorships.com, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram5.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Romans 5:20-21",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut where sin multiplied, grace multiplied even more so that, just as sin reigned in death, so also grace will reign through righteousness, resulting in eternal life through Jesus Christ our Lord.\n— Romans 5:20-21\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram6.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Joel 2:13",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we walk through these Minor Prophets together, we will memorize key verses from our reading. The key verse for the book of Joel calls us to true repentance. \nTear your hearts,\nnot just your clothes,\nand return to the Lord your God.\nFor he is gracious and compassionate,\nslow to anger, abounding in faithful love,\nand he relents from sending disaster.\n—Joel 2:13\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/4-MP-1.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 1:1-15, Amos 2:1-16, Psalm 33:13-22, Isaiah 42:10-13",
        "devo_title": "Judgment on Israel and Her Neighbors",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Amos 1:1-15, Amos 2:1-16, Psalm 33:13-22, Isaiah 42:10-13\nI have a kid who causes me to say things I never imagined myself saying. I wear myself out shouting unheeded warnings like, “Don’t make new friends in the men’s bathroom! Never ride on a bicycle without a seat! Don’t run your hands on the wooden railings!” Needless to say, when he gets a splinter in his hand, mama is not surprised.\nThis leaves me muttering to myself about punitive vs. natural consequences. The punitive variety means I have to impose a punishment, whereas a natural consequence means… if you walk off the edge of a cliff you naturally fall into the gorge below. It feels like a more just outcome when the judgment he needs results in a natural consequence. Then I believe the world is on my side, that he’s getting what he naturally deserves. \nIn the first chapter of Amos, the prophet pronounces judgment on somebody else: all the neighbors. Israel knew their neighbors were doing wrong, but did they listen? No, and now they were all going to get their just desserts. Sure, it was a pity, but there you have it: bad people getting in trouble for doing bad things.\nMaybe they felt relieved, because this prophecy begins with a judgment of all their neighbors. Finally! They’ll get what they deserve. Our God is going to send fire and break down their gates. I mean, it’s a shame, and we feel bad for them. But better them than us.\nBut in the second chapter of Amos, God turns His wrath toward His own people. One by one, He lists the regions of judgment: Judah, Israel, Nazareth. Suddenly, both empathy and Schadenfreude, the feeling of happiness over another’s misfortune, are out the window.\nThe judgment is crushing, and of course, much deserved. It is tempting, seeing God’s judgment against sin, to howl in despair. Wait—us, too, Lord? And, if judgment were the end of the story, there wouldn’t be much else to do.\nBut the darker it gets, the bigger the cross appears. The words of judgment Amos delivered were designed to drive us to the end of ourselves, to realize that we are just like the nations—just like our neighbors, just like naughty little boys—justly deserving God’s wrath. But this should not drive us to despair, but to Christ.\nTake hope, and “look, the Lord keeps his eye on those who fear him—those who depend on his faithful love” (Psalm 33:18). It is His faithful love we must look to, not ourselves. It is neither our own faithfulness, nor our own miserable failures that have the final word. All things are designed to drive us Christ-ward.\nMay your faithful love rest on us, Lord,\nfor we put our hope in you.\n– Psalm 33:22\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram8.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 3:1-15, Amos 4:1-13, Psalm 65:5-8, Romans 11:1-6",
        "devo_title": "God’s Discipline",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Amos 3:1-15, Amos 4:1-13, Psalm 65:5-8, Romans 11:1-6\nThe summer camp where I worked in college enforced a strict “no sweets” rule. The rule’s purpose was to prevent ants, attracted to the sugar, from invading our camp and overrunning our cabins. Therefore, if your mom mailed you a Tupperware container of brownies during the week, you had to abstain from eating them until Saturday, our day off. This posed a challenge to my demanding sweet tooth.\nOne afternoon, a package of brownies was delivered to a fellow camp counselor. A few of us gathered around the forbidden Tupperware, looking at it longingly. \n“I’m eating one,” I finally said, defiantly. I could not deny my sweet tooth for one more moment and, I reasoned, no one would know. What harm could it do? But just as I was raising the brownie to my mouth, the camp director—our boss—walked by. I paused.\n“You gonna eat that?” he asked.\nHe won’t do anything to me, I thought. I’m a great counselor. I’m responsible. He likes me. I’m above the rules. \nWith this confidence, I took a bite. Right in front of the camp director. Guess who had to spend her Saturday morning power-washing the bathroom floors?\nMy attitude in front of my camp director that day is not unlike the attitude of Israel we see described in Amos 3 and 4. Israel was prosperous during this time. They were victorious in their military pursuits and had grown wealthy, acquiring “great houses… inlaid with ivory” (Amos 3:15). But instead of using their wealth and status to do good, they oppressed the poor and crushed the needy (Amos 4:1), directly defying the law that enforced caring for the vulnerable (Deuteronomy 15:7). \nIsrael had let their status go to their heads and had begun to consider themselves above the rules. As a result, they slid deeper and deeper into sin. They needed to repent. They needed to change their behavior, and most of all, they needed to remember who God was. \nThe biggest pitfall when considering yourself above the rules is that you also begin to consider yourself above the rule-maker. And if you are above the rule-maker, you will naturally tend toward acts of defiance, for there is no longer anyone to defy. This is why I chomped on a forbidden brownie right in front of my camp director that summer. I incurred punishment as a reminder of who was in charge.\nIsrael would do the same. \nAmos reminds them in these chapters who their rule-maker is. No matter how successful Israel’s military pursuits had been, no matter how prosperous they had become, God still sat on His throne, and “the God of Armies is his name” (Amos 3:13). \nI often grow comfortable in my position as God’s child, adopted by the blood of Christ. But this does not set me above the rules; this sets me directly beneath the authority of Jesus, the King of kings. It is now His rule that I follow and not my own. \nLet’s praise the God of Armies today. He is the one “who forms the mountains, who creates the wind, and who reveals his thoughts to mankind, who turns dawn to darkness, and treads on the heights of the earth” (Amos 4:13). \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram9.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 5:1-27, Micah 6:8, Philippians 4:8-9",
        "devo_title": "Seek God and Live",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Amos 5:1-27, Micah 6:8, Philippians 4:8-9\nI am a first-born, Type-double-A achiever, fluent in the languages of performance and gold stars. Grace, on the other hand, consistently boggles my mind.  \nI can think back to one such moment several years ago. My husband was on staff at a small church. I did everything I could to partner with him in the ministry that became the functional nucleus of our existence. Ministry is time-consuming and, at times, gut-wrenching. And while my husband seemed to feel a tinge of external pressure, I faced a daily temptation to spontaneously combust. That’s what happens when you try to earn something that has already been freely given; things become volatile in a hurry. \nI was serving my guts out for all the wrong reasons, trying to earn God’s favor through church attendance and program planning. I was living for the gold stars that I hoped existed on a cosmic sticker chart in heaven. It’s not that anything I was doing was “wrong” or “bad.” It was just an outflow of a heart tied up in self-inflicted knots. The carrot that was always in front of me was the false gospel of good deeds, not the true gospel of Jesus Christ. That experience taught me that false gospels are terrible taskmasters—cruel, demanding, and ultimately hollow. \nGod’s people find themselves whipped by such a taskmaster in Amos 5. Instead of seeking the Lord, their hearts chase wildly after everything else. Amos promises destruction in return for their rebellion. God’s people find themselves fallen, forsaken, and on fire (vv. 2,6). And then comes the wailing, mourning, and lamenting (v. 16).\nAs dramatic as this sounds, it feels like the same old same old. God’s people turn to idols and He raises up a prophet to yank them back from the brink of judgment. But this time things are different. There is no golden calf, no Asherah poles, no altar set up to honor a pagan god. Instead, God is enraged by their offerings of “good things,” given for all the wrong reasons (Amos 5:21-23).\nGod’s people were following the rules. They gathered like He commanded them to (Exodus 12:16). They faithfully brought their offerings, just like their righteous forefathers had (Genesis 8:20, 22:3; Leviticus 1:3). They even held spirited worship services. What gives? \nI think back to that season of ministry and know there are no gold stars in heaven. There is only grace. And grace can never, ever be earned. So Amos might as well have been preaching to us because our hearts are not unlike those of the Israelites: our motives are misshapen, our goal is our own glory, and our worship is all wrong. \nYet, even as God breathes out judgment upon His people through Amos, He also offers redemption. He calls out to us even now, saying, “Seek me and live!… Seek the Lord and live” (vv. 4,6).\nWorship and sacrifice are meant to be an exclamation of God’s goodness toward us, not a means to try to grab more from Him. If we find our hearts tied up in knots, worrying that we  haven’t earned the gift He freely offers, then we must look for the thread of salvation woven into every tapestry of God’s judgment. \nIf you are tired and worn out and empty from striving and performing, look once again to Jesus. It’s His love and devotion—not ours—that turn our hearts back toward Him. \nSeek Him and live. \n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram10.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 6:1-14, Amos 7:1-17, Psalm 47:1-9, Acts 4:13-20",
        "devo_title": "Woe to the Complacent",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Amos 6:1-14, Amos 7:1-17, Psalm 47:1-9, Acts 4:13-20\nIt’s hard to read Amos without squirming. \nThroughout this short book—chapter 6, in particular—Amos paints a scene of extravagance and wealth. Israel is at the height of its splendor. Riches, comfort, leisure, and affluence are all theirs for the taking. They are privileged to the extreme, a portrait that sounds quite a bit like many countries and cultures we inhabit today.\nMistakenly, the Israelites hoarded their opulence as “blessing.” They saw the provision as an end in itself, a gift from God to be indulged. They also drew security from it. They took pride and comfort in being more powerful than the countries around them. They measured success by having more of it than their neighbors. \nGod rebuked them for their greed, and in the strongest possible terms, because He viewed blessing quite differently than the Israelites. God did not intend for the Israelites to prosper simply to luxuriate in it. He did not provide them with wealth simply as an assurance of security. And He did not allow them ease of life simply to grow complacent. The blessings of God were never meant to be stored up like grain. In the wake of God’s judgment on Israel’s pride, Amos cried out, “Lord God, please forgive!” (7:2). \nThousands of years later, Amos’s words are as relevant as ever. We continue to live in a world of vast economic disparity. From country to country, and even community to community, the range of prosperity is wide. In some cities, multi-million dollar homes sit within miles of homeless shelters and housing projects, and Christians populate them both. And so, wherever we fall on this spectrum of wealth, Amos challenges us with this question:\nWhat are we to do with our blessing? \nWhatever the size and the shape of our privilege, how are we to use it? Amos compels us to consider this question, but so does the witness of Christ. Jesus, after all, “did not count equality with God a thing to be grasped,” but “took the form of a servant” (Philippians 2:6-7), meaning He leveraged His privilege for others. Jesus denied Himself comfort and set His splendor aside out of love for God and the world. We cannot claim to follow Him without following Him in this also.\nJesus’ handling of His own privilege is the standard passed down to us. When we want to know what to do with our blessing, we look to Christ. When we enjoy success, gain, or even a leg up, we are never meant to hoard it for ourselves. Rather, as followers of Jesus, we are meant to leverage our blessing for others, just as He did for us.\nThis is radical. Even in the Church, this is radical. When blessing comes our way, it’s easy to receive it as a personal reward for faithfulness. Or it’s tempting to store it away for the sake of financial security. Neither response is wrong in itself, but our vision should always be bigger than ourselves. God’s intention for blessing is never individual; He always has a broader blessing in view. \nJust as Israel was meant to be a light to the nations, and the Church a light in the world, everything we are given has a greater purpose. May we steward our blessings accordingly.  \n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She blogs at SheWorships.com, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram11.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 8:1-14, Amos 9:1-15, Psalm 53:6, Ezekiel 37:25",
        "devo_title": "Judgment and Restoration",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Amos 8:1-14, Amos 9:1-15, Psalm 53:6, Ezekiel 37:25\nI live on the west side of a Civil War town in middle Tennessee. Our kitchen windows face the setting sun, the view framed by tall oaks and the distant red barn that sits on a neighboring horse farm. My mornings begin with coffee at the table, as I watch the settled fog lift to show the glory of the day; evenings end with the sun sliding behind the treeline, welcoming the scattering of stars. \nBut many summer afternoons, a strong wind comes and chases away the sun, and from the west we’ll see gathering clouds that can only mean one thing: a pop-up storm. Almost without warning, it will rain so hard we can’t see past our fence. The thunder will rock the ground, and lightning threatens to strike closer and closer with every bolt. \nWhen I read Amos 8 and 9, I feel the heavy heartbeat of a summer thunderstorm. I can imagine Amos, seeing the clouds gather, trying to warn the people that the storm of God’s judgment is coming and it will not miss them. \nAmos shows us a portrait of an angry God we often shy away from as the God of the Old Testament, as if we are any less culpable than the Israelites who repeatedly turned away from Him. This passage is an important reminder that who God is will never change. His hatred of sin, His anger at those who turn against Him—these are the hard mysteries of His glory, the things we have to wrestle through as we fight our way to the New Testament where we find the unfathomable, gracious, merciful gift of Jesus. \nBut we have to weather the storms with our ancestors in faith. We have to feel every thunderclap and lightning bolt to understand the power of our God, which makes His great mercy and faithfulness that much more unimaginable, His promises that much more precious.\nBecause after all of His promises of judgment, God makes another kind of promise in chapter 9, verse 11: \n“In that day I will raise up the booth of David that is fallen, and repair its breaches, and raise up its ruins, and rebuild it as in the days of old.”\nGod promises Israel that they will never be uprooted from the land He has given them. The storm will end—maybe not for these Israelites in their lifetime, and maybe not for us in ours. The brokenness of the world walks in lockstep with the calendar, each day bringing its own grief and reminders that Christ has not yet come again. But as God promised the Israelites at the end of Amos, restoration is coming. We will not be uprooted. We know the rest of the story. We know our pure, holy, and just God could never be content with the evil and brokenness of sin. But it’s His anger toward sin that led to the greatest mercy of all: the gift of His Son Jesus Christ. \nWhen those afternoon storms pass, our backyard is left in the humid haze of the setting sun. The world is clean, the earth watered and refreshed. God has not promised us a life free from storms, but He has promised that one day the storms will end. It’s then that we will dwell with Him in perfect peace forever.\n\nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram12.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Psalm 47:8",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod reigns over the nations;\nGod is seated on his holy throne.\n—Psalm 47:8\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-Instagram13.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Amos 5:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we walk through these Minor Prophets together, we are memorizing key verses from our reading. The key verse for the book of Amos reminds us that justice and righteousness are pleasing to the Lord.\nBut let justice flow like water,\nand righteousness, like an unfailing stream.\n—Amos 5:24\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/4-MP-2.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Obadiah 1:1-21, Genesis 27:41-42, Ezekiel 25:12-14",
        "devo_title": "Future Blessing",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Obadiah 1:1-21, Genesis 27:41-42, Ezekiel 25:12-14\nI am reading Obadiah from the front porch swing just before dark. It’s raining, as it has been all afternoon, though from my last glance at the forecast, I would have sworn today would be sunny and warm. That’s the way forecasts work—for weather and politics, finances and medical prognoses. They are guesses, by definition. But I still check the weather each day when I wake, to see if something bright or somber brews beyond the clouds. \nWe’ve heard that knowledge is power, so we look to those with more wisdom and experience than us to divvy out the forecasts. We look to them to tell us what to do, how to think, how to prevent, how to plan. And most of them do their honest best to deliver. Even so, not a single soul can keep the rain from falling. \nNo meteorologist can predict the path of every storm. No politician has perfect policy. No surgeon can conquer every cancer. No matter how lofty our intellect and noble our cause, none of us is God. \nWe know this in our heads, but sometimes—oftentimes—our hearts forget. \nThe Minor Prophets in the Old Testament proclaim God’s judgment on many nations, but the tiny book of Obadiah calls out only one—Edom. Edom is the nation descended from Esau, son of Isaac and twin brother of Jacob. And though Edom’s sins were surely many, Obadiah’s prophecy focuses on one sin that seems to be the root of all their others: pride. \nYour arrogant heart has deceived you,\nyou who live in clefts of the rock\nin your home on the heights,\nwho say to yourself,\n“Who can bring me down to the ground?” (vv.3-4).\nEdom had grown haughty in their position and power. They felt—and acted—untouchable, invincible. And while they indeed held a privileged position among their neighboring nations, they were not beyond the reach of the sovereign Lord of all nations. \nThough you seem to soar like an eagle\nand make your nest among the stars,\neven from there I will bring you down.\nThis is the Lord’s declaration (v.4).\nHistory, Scripture included, is filled with rulers and nations like Edom who failed to wield their power wisely. King Saul was lauded as a wise and good king at the start of his reign, but he later turned his back on God, endangering his people and losing his throne (1 Samuel 13). King David was beloved by his people, but his moral failure had disastrous consequences and his own son led a rebellion against him (2 Samuel 11). King Herod was so disillusioned by his power that he ordered a massacre of children in his kingdom (Matthew 2:16). \nThese examples may feel extreme or distant to our modern sensibilities, but they point to a truth that still stands: There is only one God worthy of our trust, one King worthy of our worship. \nThe Lord promises that Edom—and all nations—will get their due. They’d mocked their neighbors in distress; they’d lorded their position of power over others; they’d failed to offer justice and compassion. Perhaps we have, too. Thanks be to God for Jesus, the one who lived a life of justice, compassion, and righteousness in our place, then took the punishment for our injustice, pride, and sin upon Himself. Only in Him can we find the peace others seek in power, policy, health, and wealth. Only He gives the blessing and home our hearts long for. \nHumans will fall and plans will fail, but the kingdom will be the Lord’s. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram15.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 1:1-17, Psalm 104:24-26, Matthew 12:38-42",
        "devo_title": "Jonah’s Call",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Jonah 1:1-17, Psalm 104:24-26, Matthew 12:38-42\nPulling the coarse blanket tighter and rolling over, Jonah sighed as he sank deeper into sleep. The warm dark cabin around him creaked and groaned as the waves outside surged with increasing intensity. The sailors above deck scanned the horizon and glanced anxiously up at a grey sky heavy with the strength of the Lord Almighty. God was coming for Jonah.\nThe prophet was running away, but God pursued him like only the Creator and Lord of the sea could: with a furious ocean tempest. Jonah tried to flee from the very presence of the Lord, thinking he could hide if he found an old boat heading in a new direction.\nBut God is fierce and awesome in His pursuit. Jonah never had a chance of hiding. Even the inanimate dice the sailors used to cast lots pointed him out as the one running from God (Jonah 1:7). God had called to Jonah, “Get up! Go” (Jonah 1:2), and now all creation seemed to be shouting, “Return!” God uses wind and waves, even dice—everything in creation stands by to obey its Creator. In the face of the deafening storm and sure signs, the sailors feared for their lives, and looked to Jonah with eyes of blame and hands ready to heave-ho. \nGod’s pursuit is relentless exactly because He is so loving. He could’ve crushed Jonah under a tremendous sea surge and found another man. Jonah had his chance, and he clearly took the coward’s way out, right? God gave him a clear instruction (something we all long for), and Jonah ran like a frightened child in the other direction. Why didn’t God give up on Jonah?\nGod wanted Jonah. Goodness, isn’t that amazing? I sometimes feel like I’m a substandard version of the person who should actually be living my life. And the truth is, I do fall short. I do worry that there is someone who would be a better mother to my kids, wife to my husband, friend to my friends. But despite my imperfections and failings, I am the best mother for my children, wife for my husband, and friend for my friends. God gives specific callings to specific people (Ephesians 2:10). That means God wants me for my particular calling and life.  \nWe can’t escape God and His storm gale of purpose. He pursues us with love that is filled with a beautiful intensity unlike anything else we have ever known.\n“Where can I go to escape your Spirit?\nWhere can I flee from your presence?\nIf I go up to heaven, you are there;\nif I make my bed in Sheol, you are there.”\n– Psalm 139:7-8\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram16.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 2:1-10, Psalm 88:4-5, Hebrews 4:16",
        "devo_title": "Jonah’s Prayer",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Jonah 2:1-10, Psalm 88:4-5, Hebrews 4:16\nIf you had to choose a ride at Disney World to be stranded on, which would it be?\nOf course, the resounding answer is none, but if you really had to pick, would you choose one that didn’t go upside down? Would you pick your favorite? Maybe you’d go with one that at least overlooks a pretty view. My guess is you wouldn’t pick The Haunted Mansion, filled with ghosts and zombies and who-knows-what around the corner—the name speaks for itself.\nYet, speaking from experience, I’d give it five out of five stars. I would definitely recommend getting stuck on The Haunted Mansion. Because, here’s the thing: Florida is eleventy-billion degrees every single day of the year. The Haunted Mansion is dark. The seats recline. It is air conditioned. In fact, I think the best nap of my life happened on those plastic seats when the ride shut down unexpectedly. But if you’d told me this before I buckled my seatbelt, I never would have agreed to get on the ride.\nI bet if Jonah had known beforehand that he would get swallowed by a fish, he never would have stepped foot on that boat. Many of the places God brings us to are ones we would never choose for ourselves. But that is the point: When we stop trying to find ourselves, we can see that we’ve already been found.\nPastor and author A.W. Tozer said, “In every generation, the people who have found God have been those who have come to the end of themselves. Recognizing their hopelessness, they have been ready to throw themselves on the mercy and grace of a forgiving God.”\nThis is why Jonah’s prayer is so surprising to us: it doesn’t sound like Jonah. He hasn’t shown interest in obeying God up until this point, and although he didn’t drown, things aren’t looking especially bright for him. But when stripped of the stories he’s told himself, he sees clearly: Death is not the worst-case scenario; life without God is. \nThis is what grace and mercy sound like in the face of death:\n“Then you raised my life from the Pit, Lord my God!\nAs my life was fading away,\nI remembered the Lord,\nand my prayer came to you,\nto your holy temple” (Jonah 2:6-7).\nOf course, we don’t want to walk through storms and sit in darkness and sleep in the underbelly. But what if we remembered these are the places where grace usually meets us? Sometimes grace is messy and dark. Sometimes mercy is painful and scary. God does not need perfect circumstances to bring us closer to Him. In fact, it’s usually the opposite.\nLet’s not overlook that Jonah thanks God for raising his life from the pit while he is still in it. May we do the same today, allowing grace to meet us and mercy to surprise us. We can trust that even as we cry out to God in our distress, He is faithful to answer our call (Jonah 2:2). Thanks be to God.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram17.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 3:1-10, Jeremiah 18:7-10, Nahum 1:2-11",
        "devo_title": "Jonah’s Preaching",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Jonah 3:1-10, Jeremiah 18:7-10, Nahum 1:2-11\nNineveh was the worst.\nA chief city in the already brutal and wicked Assyrian empire, Nineveh removed the noses and ears of their prisoners to mark and maim them for life. And like most Mesopotamian civilizations, their culture was immoral and generally terrifying—temple prostitution, child sacrifice, and infanticide. \nI love my ears and nose, so I understand why Jonah didn’t want to go.\nThese are the people who heard God’s call to repentance. They listened to Jonah and to God. And they repented. They stopped, tore their clothes, rubbed ashes on their faces, and gave up eating. They were desperate to get God’s attention.\nGod had mercy on even these most wicked people. They didn’t know they were that wicked until God arrested them in their sin. But this story is only marginally about the repentant Ninevite hearts. Primarily, this is a story about God’s mercy and forgiveness.\nGod calls them to repent, and they respond by fasting.\nFasting hurts. It is tangible and practical repentance, and repentance must change how we live our lives. We turn from the things that give us false comfort, and only have God. \nFor the Ninevites, fasting meant giving up their means of power and energy, and depending only on God for power in a very real way. They humbled themselves publicly and didn’t hold back for pride or fear of what others would think. Even the king—who held an almost god-like status in the culture and had everything to lose—humbled himself, bowing before the one true God. It was a culture-wide repentance, extending from the greatest to the least.\nTheir repentance was not chiefly about how sorry they felt, but about casting themselves wholly upon God’s mercy. It wasn’t about what they could bring to the table. Rather, they said, “Who knows? God may turn and relent” (Jonah 3:9). They recognized that repentance is about what God is doing, not what we can do to gain any kind of merit. \nMercy is not a matter of merit; it is God’s gift. When we call out earnestly to Him in repentance (Jonah 3:8), He “is faithful and righteous to forgive us our sins and to cleanse us from all unrighteousness” (1 John 1:9).\nEven though Nineveh was awful by any standard, God had mercy on them. This is good news, because the truth is we are all more like the Ninevites than we are like God. I know I am. I don’t gouge eyes out, yet pride, envy, and wrath are always within arm’s reach for me.  \n“But I received mercy for this reason, so that in me, the worst of them, Christ Jesus might demonstrate his extraordinary patience as an example to those who would believe in him for eternal life.”\n– 1 Timothy 1:16\nThe story of Nineveh’s repentance is about God’s perfect patience, His deep mercy, and His profound forgiveness. Call out earnestly to Him.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram18.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 4:1-11, Acts 11:15-18, Romans 5:6-11",
        "devo_title": "Jonah’s Anger",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Jonah 4:1-11, Acts 11:15-18, Romans 5:6-11\nThe final chapter of Jonah gives us a unique glimpse into a conversation between God and His prophet. The majority of prophecy depicts the prophets relaying God’s message. Here, we get to see the struggle between the reluctant prophet and a faithful God. I’m almost uncomfortable with Jonah’s level of irreverence, confessing he is angry that God has been merciful. It’s cringe-worthy.\nAnd yet, Jonah was not the first, nor would he be the last, to express discontent with God’s mercy toward a wayward people. In fact, Scripture is full of stories like this. The older brother in the parable of the prodigal son is angry at his father for throwing the rebellious sibling a party (Luke 15:11-32). The Pharisees are angry at Jesus for not following the law like they think he should (John 9:13-16). The disciples are concerned when Jesus addresses a Samaritan woman, someone whose ethnicity and gender signified a person to avoid, not converse with (John 4:1-24). \nWe like to belong, and we like to decide who doesn’t belong. They deserve God’s mercy. They don’t. They do. They don’t. Maybe this is why I cringe at Jonah’s anger; because I’ve seen that same anger in me. I’ve seen it on a personal level when blessing and favor are poured out on someone’s life whom I don’t feel “deserves” it. I’ve also seen it on a more global level when I generalize an entire people group as “evil” or “lost,” beyond God’s redemption. \nThis sin tendency was in Jonah, and it is in me too. \nHow quick I am to forget that I was an outsider once! As Romans says, “For while we were still helpless, at the appointed moment, Christ died for the ungodly” (Romans 5:6). I was ungodly—as evil as a Ninevite. It is only because of God’s mercy through His Son Jesus that I am now in the family as an adopted child of God.\nI think it’s interesting that God has the last word in the book of Jonah. We don’t know what Jonah’s response was to God’s question, “Should I not care about the great city of Nineveh…?” (Jonah 4:11). But we know what Jonah’s answer should have been. We see it modeled much later in the story, in the book of Acts. \nPeter is trying to convince his fellow Jews that Gentiles can indeed follow the way of Christ. He tells the group that he saw the Holy Spirit descend on a group of Gentiles, just as it had descended upon them. When Peter’s audience heard this, Scripture says, “they became silent. Then they glorified God, saying, ‘So God has granted repentance resulting in life even to the Gentiles!’” (Acts 11:18). \nPerhaps they fell silent in awe. Perhaps they fell silent in skepticism. We don’t know. What we do know is ultimately, instead of feeling anger toward God, they glorified Him. They rejoiced that His mercy reached further than they had ever fathomed it could. \nOh that our response would be the same. That we would never underestimate the breadth and depth of God’s mercy. That we would rejoice every time His mercy blesses someone around us, remembering that it was this same mercy that welcomed us into His family. And that it is only by grace that we remain.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram19.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Hebrews 4:16",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nTherefore, let us approach the throne of grace with boldness, so that we may receive mercy and find grace to help us in time of need.\n—Hebrews 4:16\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram20.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Jonah 4:2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we walk through these Minor Prophets together, we are memorizing key verses from our reading. The key verse for the book of Jonah reminds us of God’s compassion.\nI knew that you are a gracious and compassionate God, slow to anger, abounding in faithful love, and one who relents from sending disaster.\n—Jonah 4:2\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/4-MP-3.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 1:1-16, Micah 2:1-13, Psalm 46:1-11, Hebrews 6:13-20",
        "devo_title": "Micah’s Lament",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Micah 1:1-16, Micah 2:1-13, Psalm 46:1-11, Hebrews 6:13-20\nOur air conditioner broke this week. I’m from the far north, where central air is a foreign thing and window units are turned on maybe thrice a summer. I live in Texas now, though, and while a heater is a thing you could maybe do without, an air conditioner is not optional. My husband called me today and gave me the estimate of a new system and I felt my stomach drop into my pinky toe. \nHow much? I asked him. This much, he said. My mind immediately turned to our savings account. Finally, after a year of beginning to accumulate some savings, we were hoping to have enough to repair our foundation or put some equity into the home itself. WelI, I said, there goes that.\nA year ago this month we had a colossal financial loss. It was a perfect storm of sudden job loss, multiple moves cross-country to and from high-priced cities, the sale on our house falling through five times before (finally) selling at nearly a $100k loss to us. We hemorrhaged money for nine months until there was nothing left. I felt as physically defeated as I have ever felt, and our bank account actually was. \nIn that space, God did not come through with astounding miracles or great hurrahs. He came in quietly, through a sentence from a friend or a glimmer of hope—for months and months and months. I ached, but I began, eventually, to ache toward healing. He began to hem me in, though in an even a greater way than before, so I could learn to rest in His protection and care for me.\nAnd with that healing I imagined God would deeply plant the lessons I’d learned in the process, that I would never have to repeat the same struggle to the same degree. Surely, I knew now that God was my provider, my shepherd, my caregiver? And because I knew it, I assumed He would never take the time to prove it to me again.\nI sometimes believe we’re alike, God and I. I reason that because my mind changes, His must too. I’m positive He’s scheming a switcheroo, some grande finale where I’ll be the one left on the outside of the fence. I mistakenly believe I’m saved upon my own merits; the things I have learned or the lessons I have accumulated. I begin to believe I bring myself into the fold and am not simply brought in by Him.\nBut God, in His goodness, swore by Himself that He’d bring me in (Hebrews 6:13-20). From the get-go and from the start, before the foundations of the earth, before Eve ate the fruit, before the twelve tribes scattered, before the cross of Calvary, He counted me in. He gathered me in, “like sheep in a fold, like a flock in its pasture” (Micah 2:12)—kept, secure, and protected. \nSheep can still get hurt in the fold. They can still sprain a leg or trip over a stump. Today I’m reminded of that as I sit directly in front of my oscillating fan and try hard not to think about our savings account. But sheep in the pasture have a Shepherd who is near to them—caring, attentive, and present. I sometimes begin to believe God has ousted me when things are going badly, that I have sinned too grievously or disappointed Him too greatly. But, the God who does not change, brought me in, and there I remain, His.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram22.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 3:1-12, Micah 4:1-13, Psalm 25:8-9, 1 Corinthians 10:31",
        "devo_title": "From Exile to Victory",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Micah 3:1-12, Micah 4:1-13, Psalm 25:8-9, 1 Corinthians 10:31\nThe book of Micah is a cry for justice, with a pattern of rebuke and restoration throughout its chapters. Micah reads as a defense of justice, and a judgment of those in Israel who do not practice it. \nMicah chapter 3 begins with a stunning, almost disgusting, rebuke of the powerful leaders, using cannibalistic metaphor to charge them with oppressing the poor. The prophet spares no words, addressing them as those who “hate good and love evil” and “abhor justice and pervert everything that is right” (vv. 2, 9).\nIn his book Generous Justice, Tim Keller writes: \n“It is the generosity of God, the freeness of his salvation, that lays the foundation for the society of justice for all. Even in the seemingly boring rules and regulations of tabernacle rituals, we see that God cares about the poor, that his laws make provision for the disadvantaged. God’s concern for justice permeated every part of Israel’s life. It should also permeate our lives.”\nMicah’s words—and Keller’s—are disquieting because of how easily I see myself in the oppressors. I have lived a fairly fortunate life, physically and monetarily, and it is so natural to continue to live my fortunate life, day to day, without seeing the ways people are oppressed around me and all around the world. And even when those blinders fall off, it’s easy to merely throw money at a good cause or say an earnest prayer. But both can be done without engaging my heart. \nThankfully, we can read on to Micah chapter 4, and see that true justice and knowledge comes from the Lord—not from us. We can go to the mountain of God, where “he may teach us his ways and that we may walk in his path” (v. 2). \nThis is a beautiful passage, full of some of the most well-known images of peace and prosperity found in the whole Old Testament. From a promise that the people of Israel would be able to turn their swords and spears into plowshares, to the picture of sitting peacefully under vines and fig trees, Micah reveals the end result of loving justice and living God’s way. \nMicah’s vision of justice is a vision of the restoration of shalom, God’s original design for the world. In his book Not the Way It’s Supposed to Be, Cornelius Platinga describes shalom as a “universal flourishing, wholeness and delight—a rich state of affairs in which natural needs are satisfied and natural gifts fruitfully employed.” This is the world as it ought to be, as God intended it to be. \nMicah shows us two very different visions of the world. Chapter 3 shows us the consequences of not pursuing justice, mercy, and loving our neighbors. And then chapter 4 shows us a restored, peaceful world where we walk with God and in His ways.\nMy heart longs for the redeemed world Micah describes, for God’s creation to be restored. This longing makes me want to walk in His ways. It leads me to pray He will rewire my stubborn, entitled, fortunate heart toward justice, to ask that He give me His eyes to see the poor and oppressed. With the Lord leading, the pursuit of justice and shalom becomes a daily endeavor, one we pursue with our Creator God. \n\nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram23.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 5:1-15, Psalm 72:1-11, Luke 1:26-33",
        "devo_title": "From Defeated Ruler to Conquering King",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Micah 5:1-15, Psalm 72:1-11, Luke 1:26-33\nThe weight of the gospel sunk deep into my bones when I started looking for Jesus on every page of His Word. Sure, He’s in the Gospels. Paul mentions Jesus often in his letters too. I even knew Jesus got the occasional Old Testament shout out in places like Isaiah chapter 9: “For to us a child is born, to us a son is given…” (v. 6).\nBut as God graciously grew my understanding of His Word, He also helped me see that the gospel is the thread stitching the entire Bible together. Jesus weaves in and out of every book. He is the point of every chapter and verse. \nSuddenly, I saw Jesus at creation when the Godhead declared, “Let us make man in our image, after our likeness” (Genesis 1:26, emphasis mine).  \nI recognized Him at the first Passover (Exodus 12). As the Israelites sprinkled their doorposts with the blood of a spotless lamb, they were acting out the gospel. When the angel of death passed over God’s people because of the blood of that lamb, God was shooting up a beacon of hope throughout history. Jesus’ blood would soon save us from death’s wrath in much the same way. Our sin would be passed over because of Christ’s sacrifice on our behalf. \nAs I read about the scarlet cord Rahab the prostitute threw from her window as a sign of deliverance (Joshua 2), I saw the gospel thread there too. For I am a sinner who deserves destruction, yet Christ’s blood is the symbol that I shall be delivered from my enemies and some day live at peace with God’s people in the promised land. Here, in Micah 5, we find a prophet picking up the needle and threading it with the gospel story once again. \nWe’ve seen enough kids’ Christmas programs to recognize the significance of Bethlehem. It is the spot on the map where Christ was born in a stable “for there was no place for them in the inn” (Luke 2:7). We’ve probably also seen Jesus painted as a shepherd in a Sunday school classroom or two. There are enough dots here for us to connect and realize that Micah is prophesying about Jesus. But let’s look at Micah’s words again, searching for every fray of that gospel thread. Don’t race past this. The implications are too wonderful: \n“But you, O Bethlehem… from you shall come forth for me one who is to be ruler in Israel, whose coming forth is from old, from ancient days… and he shall be their peace.”\n– Micah 5:2, 5\nJesus was always at work to come and rescue us, from the moment He poured the foundations of the earth. Way back in the ancient of days, He was already riding toward us with redemption on His mind. Christ’s sacrifice for the sins of man was always Plan A. No Plan B is necessary. \nWhen I worry my sin might make the gospel give way, when I secretly fear I’m the one sinner whose brokenness grace isn’t big enough to cover, I can open God’s Word and trace the gospel thread back to the start. There I find Jesus, the Hero throughout the ages, who always had a plan to win me back, and I see that hope was always on the way. We were never for one nanosecond without the promise of it.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram24.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 6:1-16, Jeremiah 22:3, Colossians 3:12-17",
        "devo_title": "God’s Lawsuit Against Judah",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Micah 6:1-16, Jeremiah 22:3, Colossians 3:12-17\nThey say women love a man in uniform, but they may not have been talking about the Boy Scouts. Unfortunately, no one relayed this message to my kerchief-wearing, popcorn-selling, Eagle Scout of a little brother.\nWith socks to his knees and badges across his chest, he’d proudly hold up his fingers, reciting the Boy Scout motto every night before brushing his teeth. His newfound pack became his identity, and while it didn’t earn him a swarm of girlfriends, it certainly brought the shy boy out of his shell. He threw himself into first aid, emergency preparedness, environmental science, and camping, checking off as many merit badge requirements as possible.\nIn Micah 6, that’s exactly what the Israelites were hoping for: a checklist for how to please God. They had failed at manufacturing goodness for themselves, and their idols hadn’t produced any fruit. Assuming the answer was to work harder, they wondered when God would ever be satisfied with what they had to offer.\nIsrael wanted to earn their ranking in faith through burnt offerings, year-old calves, rams, and streams of oil, but even these expensive gifts were not an equal trade for righteousness. And the instructions God provided were not what they expected. \n“Mankind, he has told you what is good\nand what it is the Lᴏʀᴅ requires of you:\nto act justly,\nto love faithfulness,\nand to walk humbly with your God.”\n– Micah 6:8\nUpon hearing these words from the prophet, I bet the Israelites were ready to tie their kerchiefs around their necks and get to work achieving their merit badges with God. But looking at the specific commands, we can guess they became a little confused when they realized everything had already been accomplished. Their assigned tasks were not primarily about their own sacrifice, strength, or anything else the Israelites could offer. They were simply called to mirror the character of God. \nInstead of just giving them rules to follow, He pointed forward to the work He’d later accomplish on the cross.\nWe, like Israel, forget that the only merit we have is the blood of the Messiah.\n\nWe can only act justly because we have been justified through Christ.\nWe can only love faithfulness because He defined it for us on the cross.\nWe can only walk humbly because His footsteps went before us.\nWe can only be with our God because Christ joined us to Him.\nThe only thing left on our to-do list is to worship the God who does not change. May we fear His name alone.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram25.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 7:1-20, Psalm 103:8-9, Romans 6:12-14",
        "devo_title": "Micah’s Prayer Answered",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Micah 7:1-20, Psalm 103:8-9, Romans 6:12-14\nBoth my husband and I are mostly unemployed. I’m trying not to be anxious about it. We are here on purpose. We left our jobs so we could have freedom to spend time with our kids and create art together. And we have a lot of ideas, but nothing has panned out yet. As I watch our savings descend further and further from black to red, I try to stay focused on positively creating something new instead of choking with panic and imagining my children begging for food.\nWhen we try out a new idea, and it doesn’t yield any results, we feel defeated and isolated. Defeat and isolation are paralyzing emotions we all feel in different ways. One of my smallest sons feels total defeat when he gets shampoo in his eyes, and deep isolation if everyone else has already had a snack without him.\nWhether you are looking for a job or a snack, feeling alone can be terrifying. And Micah’s isolation was chilling on both a physical and spiritual level. He actually had real and profound reasons to feel alone. He believed there was no one left, and howled out, “Faithful people have vanished from the land; there is no one upright among the people” (Micah 7:2). He felt defeated and searched for a few good men, but he couldn’t find even one.\nMicah saw corruption in every corner. You know the old saying about “they get you coming and going”? Micah must have felt the same way—like there was no safe place, no one he could trust. When he reaches out to the best men he can find, he discovers them to be more like razor blades than friends (Micah 7:4).\nRemember how Elijah, after his victory at Mt. Carmel, looked around and despaired, believing that he was the only faithful man left in Israel. While he felt alone, God assured him that there were yet 7000 left in Israel who refused to bend their knees to Baal (1 Kings 18:16-45). Still, for both Micah and Elijah, the skies looked very dark, their hearts felt alone, and their vision felt dim. But darkness is not dark to God. He does not leave His people alone, and His vision never falters. No matter how alone we feel, there is still hope.\nEven in his darkness, Micah knows the truth. He declares that our only hope, our only safe confidant is the Lord (Micah 7:7). And we know that He cares, not just abstractly or on our birthdays, but presently. He invites us into ongoing relationship with Him even now (Micah 6:3-5). He does not leave us alone, even at night, even when we’re unemployed, even when we’re hungry.\nMicah urges those who still sit in darkness to cling to the God of salvation, the God who hears. No matter how dark the night, hope is close at hand: “though I sit in darkness, the Lord will be my light” (Micah 7:8).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram26.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Psalm 46:1",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod is our refuge and strength,\na helper who is always found\nin times of trouble.\n—Psalm 46:1\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/SRT-MinorProphets-instagram27.jpg"
    },
    {
        "book_title": "Joel, Amos, Obadiah, Jonah, and Micah",
        "devo_passages": "Micah 6:8",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we walk through these Minor Prophets together, we are memorizing key verses from our reading. The key verse for the book of Micah tells us how God calls His people to live.\nMankind, he has told each of you what is good\nand what it is the Lord requires of you:\nto act justly,\nto love faithfulness,\nand to walk humbly with your God.\n—Micah 6:8\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/4-MP-4.jpg"
    }
]