[
    {
        "book_title": "Judges",
        "devo_passages": "Judges 21:25",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Judges.\nIn those days there was no king in Israel; everyone did whatever seemed right to him.\n– Judges 21:25\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/4-Judges-4.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Psalm 32:8-11",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nEach Saturday we’ve turned from the tragedy of Judges to read of the hope of the gospel in Psalm 32, a psalm about the joy of forgiveness. Use this day to pray, rest, and reflect on the hope that is ours because of God’s grace toward a rebellious people.\nI will instruct you and show you the way to go;\nwith my eye on you, I will give counsel.\nDo not be like a horse or mule,\nwithout understanding,\nthat must be controlled with bit and bridle\nor else it will not come near you.\nMany pains come to the wicked,\nbut the one who trusts in the LORD\nwill have faithful love surrounding him.\nBe glad in the LORD and rejoice,\nyou righteous ones;\nshout for joy,\nall you upright in heart.\n-Psalm 32:8–11\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day27.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 21:1-25, Deuteronomy 12:8-14, 2 Samuel 24:18-25\t",
        "devo_title": "Brides for Benjamin",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 21:1-25, Deuteronomy 12:8-14, 2 Samuel 24:18-25\n“The Hollow Men” is a haunting, exquisite poem by T.S. Eliot. You may have heard the closing lines referenced in pop culture: “This is the way the world ends / Not with a bang but a whimper.” \nI reread the poem after walking backward and forward through today’s passage in Judges, the final chapter of a brutal journey. We are trained, when reading stories, to settle into a conclusion not long after the climax. We long to be satisfied. The book of Judges doesn’t do that. \nEarlier in the poem, Eliot writes:\nThe eyes are not here\nThere are no eyes here\nIn this valley of dying stars\nIn this hollow valley\nThis broken jaw of our lost kingdoms\n… death’s twilight kingdom,\nThe hope only\nOf empty men.\nEliot’s “empty men” are a helpful comparison as we end our study of Judges. The weight and power of Eliot’s words capture, in ways I never could, the heart-wailing of the tribes of Israel. When death is the only hope, we are left in total darkness. \nWe know that Jesus is our conquering King, the life and light of men. But Judges doesn’t end with Jesus. Judges ends with a “valley of dying stars,” empty men grasping together at nothing. “In those days there was no king in Israel. Everyone did what was right in his own eyes” (v. 25). As modern readers, we can read this last verse in Judges and know it’ll all be okay because Jesus is coming. Even though that is true, would you be willing to resist that temptation for closure with me today? \nLet us whimper. Let us feel the ache of the ages, the desperation for something we cannot name. The longing for a king that led the Israelites in caustic circles, is the same longing that leads us to fill our lives with stuff that distracts and tries to counteract that epic ache. \nThe inclination to grasp at goodness is the right response to reading the book of Judges. Our hearts are magnetized to light, not darkness. Judges provokes that tension in us, leaving us with an unsettled feeling. It is a historical book, a true tragedy tucked in the middle of the greatest book ever written. And yet, its darkness is unparalleled. Its darkness makes us crave light. \nChiaroscuro is an art technique that utilizes sharp contrasts—light and dark—for dramatic impact. Judges is a book of chiaroscuro. The whole picture of the Bible is made more vibrant, more impactful, more necessary because of these dark corners. We can thank God for the book of Judges, and we can thank Him for wiring our hearts to long for the goodness and light that only He provides.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing, and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day26.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 20:1-48, Deuteronomy 18:1-5, Proverbs 16:33",
        "devo_title": "War Against Benjamin",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Judges 20:1-48, Deuteronomy 18:1-5, Proverbs 16:33\nIt all started with a little boy and itchy skin, which is honestly the worst way for anything to begin. He was my little brother, two years old at the time, and as the scratching continued, it became clear the cause was more than an irritation from running around in the grass or an aggravated mosquito bite. Still, my parents applied Cortisone cream and hoped for the best, leaving a message for the pediatrician to call in the morning.\nBut overnight, I, too, began to scratch my skin, and red bumps proved the cause to be more than an allergy to something we’d eaten for dinner the night before. By morning, my mom was also itchy, the final straw to explain our fate: chicken pox.\nSo there we were, all three of us, left to schedule back-to-back oatmeal baths, share anti-itch cream, take turns complaining, and inconvenience our one remaining caretaker, my father. To think this all started with a little boy and itchy skin.\nIsrael was quick to assume sin was a “someone else” problem, and if I’m being honest, I’m often guilty of doing the same. The crime at Gibeah? Certainly it was someone else’s fault. Surely, the people of Benjamin were the only ones who didn’t have it all together, and war needed to be waged against them to make everything right.\nBut first, God used the war against Benjamin to point out the ways Israel, too, was infected with sin. While these accounts are difficult to take in and unfold like a horror story, they all play a part in God reminding His children what happens when they forget Him and rely only on what they can see. Everyone was doing what appeared to be right in their own eyes, and that lead to death and destruction. \nThe Israelites first defeat at the hands of the badly outnumbered Benjaminites caused them to weep before the Lord and inquire of Him if they should attack again the next day. It wasn’t until their second failure that they turned to fasting and making sacrifices for their sins. It’s dangerous to keep on living in sickness, but unfortunately, many times it takes something truly terrible to recognize the destructiveness of sin.\nChapter 20 of Judges isn’t necessarily something you’d want to write on your dry erase board or commit to needlepoint, but it’s significant to the heartbeat of humanity. It’s been said that sometimes, to receive the depth of the good news, we must first be able to swallow the bad. And yet, here is my favorite part of this passage: God answered the Israelites, despite their sin. When they asked questions, no matter how infected their souls were, He answered. And that is the God we serve. \nWe may waver from Him and, for a time, commit to our own selfish ways, but by the grace of God, His commitment is to the changing of hearts. Our stories will all end with our sinful selves redeemed by the faithful Father. Thanks be to Him.\n\nKaitlin Wernet is a twenty-something who lives to tell stories with a backbone of hope. Armed with too many exclamation points and not enough goat cheese, she spends her days as a writer and editor in Nashville, TN. With a journalism degree and football-induced stress from the University of South Carolina, Kaitlin is happiest with plane tickets in hand or a kitten in her lap. Thankful to be a “She” who Reads Truth, she can also be found writing more of her favorite words at KaitlinWernet.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day25.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 19:1-30, Jeremiah 8:18-9:3, 2 Corinthians 6:14-18",
        "devo_title": "Outrage in Benjamin",
        "devo_summary": "\nBY Rebecca Faires\n\nEditor’s Note: Some passages in Judges deal in subject matter that might be especially painful for some readers. Though many of the wounds we receive in this life are deeply personal and unimaginably painful, when they appear in God’s Word, we are reminded that He sees them. Whenever sin is addressed in Scripture—whether through teaching or story—it comes to us in the context of God’s unwavering commitment to bring an end to all evil in this world through the finished work of Christ (Revelation 21:3-4). We are praying for and with you as you read.\n//\nScripture Reading: Judges 19:1-30, Jeremiah 8:18-9:3, 2 Corinthians 6:14-18\nThis is dark. I don’t like to think about horrible things. And I would like to think this story has nothing to do with me. Because I am A) not a terrorizer of women, B) not a concubine, and C) not a murderer. So I would like to be excused from this exercise and come back when we are talking about the wonderful grace of Jesus instead. Or maybe we could (please!) gloss over this and talk about how heaven will be paved with streets of gold. I’m here for all of that. \nBut perhaps we could be brave and try to look at this Judges 19 passage together.\nFirst, before we get too angry with the Levite for having a concubine in the first place, let’s consider what some scholars have to say about her: the concubine was probably the Levite’s wife, but was called a “concubine” because she was not endowed with a dowry. Either way, it looks like she was unfaithful to him and left him. \nThe delay caused by all the over-politeness in the house of her father meant that they stayed longer and later than intended. When they finally arrive in an Israelite city, there is only one man willing to take them in. Just as Lot was the only hospitable man in Sodom (Genesis 19:1–29), this old Ephraimite is the only refuge in Gibeah.\nThe men of Gibeah, like the men of Sodom, surrounded the house and sought to do great wickedness to the guests. The old Ephraimite, like Lot, offered a wicked substitution to preserve the Levite: he offered up his own daughter and the Levite’s concubine. The men of Gibeah took only the concubine, but abused her to death that night.\nThe Levite’s role that night seems to be one of passivity and cowardice. It is unclear how his action or inaction enter into the matter, although it seems his “eating and drinking” in this story are twice his undoing: first in delaying his departure from the house of her father, and second, in occupying him on this night of the wickedness of Gibeah.\nIn the morning, when he exited the house, he found his concubine on the steps, seemingly asleep. But when he found her to be dead, he took her up, returned home, and then sent out his bloody message to the chiefs of Israel, a testimony of the wickedness of Gibeah.\nThe Bible is brief and thrifty in its narratives. As with so much of Scripture, it comes to us in parables, in examples, often without explicit explanation of what we are to take away from it all. This passage, however, seems to give us direct instruction: “Think it over, discuss it, and speak up!” (Judges 19:30).\nWe are to be broken by the brokenness of this world, but not only of the world. We are to be broken by the brokenness of the Church, of God’s own people, of ourselves, and our own hearts (Jeremiah 8:21). Consider how profound a warning this story is against our passivity toward sin. Any sin, left to itself, can end in horrors unthinkable. \nMay we be broken over our own sin, over the sins of our people, and in the world! May Christ have mercy on us. May He deal kindly and gently with us, and give not to us as our sins deserve, but preserve us by His good will.\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day24.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 18:1-31, Deuteronomy 17:18-20, Psalm 78:56-66",
        "devo_title": "Dan’s Invasion and Idolatry",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 18:1-31, Deuteronomy 17:18-20, Psalm 78:56-66\n“Just look away, look away. There’s nothing but horror and inconvenience on the way.” \nThis theme song plays grimly at the start of each episode of the television show, A Series of Unfortunate Events. Despite the warning, I kept watching and hoping the show’s main characters, three orphans, would eventually find relief. Each episode ended in dismay as the orphans’ lives spiraled further out of control. The story became more tragic at every turn. As I read Judges 18, the same theme song crept into the back of my mind: “Just look away, look away… ”\nIsrael’s story took dark turn after dark turn, as the people made bad choice after bad choice. Redeemed out of slavery, all their needs were taken care of by the Lord, yet they forgot their God and lost their way. Quickly they fell into sin and idolatry. We’re talking idol worship, murder, absolute lawlessness. How could God’s chosen people fall so far so fast?\nFrom the outside looking in, the Israelites’ missteps are plain to see. But in our own lives, it’s much easier to lose perspective. The Israelites thought they could run their lives better than God could. For example, we saw in today’s reading that God provided land for the tribe of the Danites, but they found a quiet town to conquer instead. Veering from God’s provision, they left behind a wake of physical and spiritual destruction. The Lord also asked the Israelites for their sole devotion, but the Danites opted for idol worship in instead (Judges 18:27–31).  \nThe Danites, a tribe of Israel, thought they could make a better, happier, more abundant future for themselves than the one the Lord had laid out for them. Sometimes I wonder, Am I guilty of this sort of arrogance too? Do I ever believe my plan is superior to the Lord’s? When I forget the goodness and wisdom of God, I’m likely to fall into the same trap of disobedience, foolishly thinking I can create a brighter future for myself than the one God has planned.\nWe choose our own plans because we don’t trust God’s plan is actually good for us. Or maybe, like the Danites, we forget that our God has the power to move mountains. Perhaps God calls us to give our money or time or energy, but we hold back. Or maybe He lays it on our hearts to repair a relationship, but we decide it’s better to sweep the issue under the rug. In the short term, we think our plan is less painful, more effective. But if we look at what happened with Israel when they forgot God’s instruction, it’s clear that a life of disobedience only brings pain and suffering.\nMay the Danites’ story remind us that we are all utterly lost without God’s guidance. We have access to God’s wisdom in Word and Spirit. Our Father in heaven knows what is best for us and works for our good. Placing our trust in the Lord and obeying Him will not always be easy, but we have a powerful promise of true life, flourishing, and full of purpose when we look to Jesus and walk in His ways.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day23.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 17:1-13, Leviticus 26:1, Hosea 11:1-12, James 3:9-12",
        "devo_title": "Micah’s Priest",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Judges 17:1-13, Leviticus 26:1, Hosea 11:1-12, James 3:9-12\nSometimes idolatry is easy to identify. For instance, when I find myself wanting to be more like my favorite Instagram celebrity than Jesus, I know I am idolizing the Instagram celebrity. Or, when I start prioritizing my body image over my spiritual health and well-being, I know I am idolizing how I look. But idolatry can also be stealthy, especially when it is disguised as piety. This is certainly the case for Micah, his shrines, and his priests.\nMicah’s story is a slow progression down a dangerous path. It begins with an offering to the Lord—the silver he had stolen from his mother. However, part of the offering is melted down and formed into an idol, something strictly forbidden by Hebrew law (Leviticus 26:1). This idol is then joined by other idols and set up as a shrine in Micah’s household. Micah even makes an ephod, which was a garment worn only by priests, and installs one of his sons as a priest to oversee the shrine.\nSlowly but surely, we see what Micah is doing: he is turning his home into a tabernacle. The transformation is complete when a young Levite shows up at his door. “Stay with me,” invites Micah, “and be my father and priest” (Judges 17:10). And the Levite stays, legitimizing Micah’s efforts. Then Micah says, “Now I know that the Lord will be good to me, because a Levite has become my priest” (v.13).\nThe elements are there—a priest from the appropriate tribe, the priestly garments, an offering of silver to the Lord—but Micah’s heart exposes his transactional relationship with God, and these motives reveal his idolatry: Now I know the Lord will be good to me.\nIdolatry in the name of the Lord is often the hardest to spot and the most destructive. I can easily idolize my religion over my Savior. I can lose trust in the promise of Christ and begin trusting in my church attendance or how often I volunteer or read Scripture. These rituals in and of themselves are good, but they are meant as an avenue to commune with God, not to be my own god. What often begins as an attempt to be near God can put distance between my heart and His.  \nMicah did not need to turn his home into a tabernacle and his family into priests, because God was already dwelling among the Israelites. In the same way, I don’t have to idolize my religion in an attempt to be nearer to God because He has already come near to me through the person of Jesus Christ, and He remains with me by the Holy Spirit.  \nMicah’s story proves that the line is fine between being active participants in our religion and idolizing it. What starts as piety can quickly slip into idolatry if we’re not careful. And in our attempt to be closer to God, we actually end up turning away from true and intimate relationship with Him.\nMay I heed the warning in Micah’s story and honestly examine my heart: Do I worship my religion, or do I worship the Lord, my God? \n\nAndrea Lucado is a freelance writer, Texas native, and the author of the memoir English Lessons: The Crooked Path of Growing Toward Faith. When she is not conducting interviews or writing stories, you can find Andrea laughing with friends at a coffee shop or creating yet another nearly edible baking creation in her kitchen. One of these days she’ll get the recipe right.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day22.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 2:16-17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nAs we read Judges, we have been memorizing verses that illustrate the tragic cycle of rebellion in this book. This week’s verses are the next phases of the cycle. \nThe Lord raised up judges, who saved them from the power of their marauders, but they did not listen to their judges.\n—Judges 2:16-17a\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/4-Judges-3.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Psalm 32:6-7",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nEach Saturday we are turning from the tragedy of Judges to read of the hope of the gospel in Psalm 32, a psalm about the joy of forgiveness. Use this day to pray, rest, and reflect on the hope that is ours because of God’s grace toward a rebellious people.\nTherefore let everyone who is faithful pray to you immediately.\nWhen great floodwaters come,\nthey will not reach him.\nYou are my hiding place;\nyou protect me from trouble.\nYou surround me with joyful shouts of deliverance.    Selah\n—Psalm 32:6-7\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day20.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 16:1-31, Jeremiah 15:15–16, Hebrews 11:32–38",
        "devo_title": "Samson’s Defeat and Death",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 16:1-31, Jeremiah 15:15–16, Hebrews 11:32–38\nIt’s hard to know how to feel about Samson. Sure, he’s listed among the judges of Israel and later manages a nod in the Hebrews “Hall of Faith” (chapter 11). But every time I read his story, I scratch my head and wonder, Why?\nAfter all, he did sleep with prostitutes (Judges 16:1). His affair with Delilah was so toxic it reads like an episode of a certain popular dating reality TV series (vv. 4–20). He seems both arrogant and unwise, not exactly typical “man of God” material—not to mention all the killing. Isolated as a stand-alone narrative, this one feels like an outlier. But the flawed character of Samson (and the rest of the judges) is merely a lower layer of a greater story.\nThe heroes of our faith didn’t secure their status through flawless holiness. Every judge, every prophet, every disciple, and every deliverer had the same broken nature we do. From Genesis to Revelation, the Bible is the story of the most ragtag, rebellious, disappointing disciples imaginable—unless the story is not about them at all.\nThe stories of the judges of Israel, including Samson, and the stories of our own broken lives are merely footnotes in the bigger story—the story of a God who redeems, restores, and uses everything for our good and His glory.\nInstead of trying to convince ourselves that Samson is a worthy hero, we ought to let his flaws and failures remind us of the true Judge (Matthew 25:31–46), who rescues God’s people perfectly. Like a prism, let us hold Samson’s story up to the light, looking for the truth of who God is.\nSamson loved an undeserving woman who eventually betrayed him.\nJesus loves the bride of Christ, the Church, despite our long history of running from Him into the arms of other lovers.\nSamson was betrayed for a few pieces of silver.\nJesus was betrayed for an even lower price, His monetary value even less than a lustful, violent Nazarite.\nSamson was bound, humiliated, and tormented by the Philistines (Judges 16:19-21).\nJesus endured even worse for our sake (Isaiah 53).\nSamson’s enemies rejoiced too soon. The battle was not yet over. So must it have been with the powers of darkness, as Jesus lay dead and lifeless in a borrowed tomb. But just as Samson would rise again to bring down the house of his enemies, Jesus would rise from the grave on the third day to bring down the house on sin and death. Samson secured a limited and scandalous legacy (Judges 16:31). Not Jesus! He ripped history in two. Samson died among his enemies in a heap of rubble, while Jesus kept His promise that when His enemies tore down the temple, He would rebuild it in three days (John 2:19).\nSamson is a flawed frontrunner to our true Savior; therefore, Samson’s story is worth reading because it points to Someone so much better. God has provided something infinitely better for us in Jesus Christ (Hebrews 11:39–40), and because of Him, sin and death have been defeated once and for all (Romans 6:10).\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day19.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 15:1-20, Psalm 106:40-48, Isaiah 40:27-31",
        "devo_title": "Samson’s Revenge",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 15:1-20, Psalm 106:40-48, Isaiah 40:27-31\nGoodness, things just keep getting worse. \nReading Samson’s life story feels like watching a particularly dark television series. Death and destruction follow him everywhere he goes. In Judges 15, Samson sets fire to the tails of 300 foxes and sets the Philistines’ farmland and vineyards ablaze. His wife and father-in-law are burned to death in a gruesome retaliation. Men are ripped limb from limb. And when it’s all said and done, Samson, infused with the Spirit of the Lord, single-handedly kills 1,000 men with the jawbone of a donkey (Judges 15:16).\nWhat in the world is going on here? \nIt’s important to remember that in the midst of this bloody, heartbreaking story, God is still present, and that He has endowed Samson with great strength and fervor in order to free the Israelites from the Philistines. It’s also important to remember that redemption is never clean and simple. It is a bloody business. Samson is caught in a web of back-and-forth retaliation, and he knows in his heart that in the end, it is his job to rid the Israelites of their oppressors. \nWhen the Israelites find Samson hiding out in a cave, they do not join him to fight the way the Israelites have done in the past. No, they bind him and hand him over to the enemy. They cower. They see his strength, but they do not see him as a savior. Instead of recognizing Samson as a deliverer, they hand him over to the Philistines, bound and ready for death. But Samson inflicts justice on the Philistines through this small, weak weapon: the jawbone of a donkey. It is an unexpected, bloody redemption.\nDoes this story sound familiar at all? \nMany years after the time of the judges, God sent the Israelites a Savior who is one with God and full of the Spirit (John 1:1–18; Luke 3:21–22). Rather than recognize His strength, the Israelites handed Jesus over to their oppressors and Pontius Pilate to be crucified.\nBut this time—this final time—the blood that was shed was not of the enemy. God turned the story on its head. Rather than kill off the Romans, Jesus went to the cross willingly to shed His own blood for us. It is an unexpected, bloody redemption. \nThanks be to God for saving us from ourselves, our sin, and the schemes of the enemy. May we give thanks to His holy name, and rejoice in praising Him (Psalm 106:47).\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day18.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 14:1-20, Isaiah 11:1-5, Matthew 13:16",
        "devo_title": "Samson’s Riddle",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 14:1-20, Isaiah 11:1-5, Matthew 13:16\nEditor’s Note: Today’s devotional initially appeared with biblical errors that have since been corrected (it wasn’t the author—she had it right!). We are committed to faithfully reading and presenting God’s Word and appreciate your grace and partnership today.\nA number of years ago, I met a famous person I had long respected from afar. This is always a tense experience, isn’t it? Most of us, I think, when we encounter famous people, get nervous to some degree. It happens to me less now than it did before because I have interacted with a number of “famous” Christians through my job. But still, especially when meeting some people, my palms get sweaty. Beyond that tension, I’m afraid that when I meet a famous person he or she is not going to be nice. Meeting someone we admire only to learn he or she is human is disorienting and disappointing.\nIn Judges 14, we continue to read about Samson, a judge appointed by God, a distinguished leader of God’s people, and a massive disappointment. We have already been exposed to Samson and his background, but it is here in chapter 14 that we see his disobedience. In verses 1–4, Samson disobeys the will of his parents and seeks a Philistine woman “because she seemed right to [him]”  (v. 7). This is a foreshadowing of his weakness. For all his physical strength, for all his natural gifting, he is proving to be weak in character. \nSamson shares a riddle with Philistine men at his marriage feast. He will pay them handsomely if they solve the riddle within a week, and they will pay him if they don’t. Because they have trouble solving the riddle, they threaten Samson’s wife, which leads her to squeeze the answer out of him, despite Samson not giving the answer to his mother or father. He loses the bet because his wife gives the Philistine men the answer. This leads Samson to kill thirty other Philistine men in order to pay up his end of the bet.\nFlashes of Samson’s strength, reliance on the Spirit of God, and anointing give glimpses of what the true Savior of God’s people, Jesus, would one day look like. Some may have thought Samson would be the deliverer of Israel, but unfortunately, he sought his own way and was undermined by his weakness. \nIn Isaiah 11 we read that the Savior of the world would shoot up from the stump of Jesse, in the line of David, and deliver the people of God from their disobedience and weakness. His justice would be righteous because His wisdom is from above. Jesus, our perfect Judge (Matthew 25:31-46), “will not judge by what he sees with his eyes, he will not execute justice by what he hears with his ears” (Isaiah 11:3).\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day17.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 13:1-25, Numbers 6:1-12, Isaiah 9:6\t",
        "devo_title": "The Birth of Samson",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Judges 13:1-25, Numbers 6:1-12, Isaiah 9:6\nI have always wanted to need glasses. While my peers growing up feared being called “four eyes” as a result of their impaired vision, I teemed with jealousy over their newest accessory. While I’m, of course, very grateful for my 20/20 vision, I secretly fear reading glasses will no longer be in style when I actually (fingers crossed) need them one day. \nWhen it comes to this life, I think we all secretly hope that there’s more than meets the eye, that we aren’t quite seeing the full truth just yet. When we experience pain we don’t understand and our circumstances don’t turn out the way we’d hoped, we try to analyze things from all angles. How did this happen? Did I miss something? How could I have avoided all this suffering? Wouldn’t it be a huge relief to look through a viewfinder and have someone adjust things until they appear more clearly, until we’re able to make sense of what we see?\nThe gospel is the viewfinder through which all things make sense. Sin has damaged our vision for God’s goodness and plan, making it impossible for us to see with clarity until He removes the veils from our eyes in the heavenly realm. Then we will see the details that go into God’s promise to make all things new. Only then will we begin to fathom the lengths to which He’s gone to keep His promises. But until that time, life on earth is full of hoping and longing, and the occasional glimpse into God’s bigger story at play.\nAll throughout the book of Judges, it’s obvious that Israel is blinded by their own sin. In fact, this ominous phrase occurs for the seventh time in today’s reading: “The Israelites again did what was evil in the Lord’s sight” (Judges 13:1). Israel had come to trust only what their own eyes could see.\nImagine the surprise Manoah and his wife must have felt when, after years of barrenness, the angel of the Lord announced that they would have a son. It’s doubtful they saw this blessed, yet baffling, news coming. Many questions followed: How can this be? What will the boy’s responsibilities and work be? What is this angel’s name, who has brought us this great news? While they didn’t receive answers to those questions, the angel’s instruction made it clear that this son was to be set apart and “holy to the LORD during the time of consecration” (Numbers 6:8).\nClearly, there was more at work than what their human eyes could see. Samson’s impending birth was an introduction to the birth of new possibilities they never could have dreamt up for themselves, an unexpected form of redemption, bringing God’s heart a little more into focus. As God’s children, this is where we can settle our trust: Christ’s coming keeps us focused on hope. Even if all the other details of life seem blurry and unknown, we know we can put our trust in Him. May we view this story and our own as just a small piece of the grander reality of God’s great plan for His people. \n\nKaitlin Wernet is a twenty-something who lives to tell stories with a backbone of hope. Armed with too many exclamation points and not enough goat cheese, she spends her days as a writer and editor in Nashville, TN. With a journalism degree and football-induced stress from the University of South Carolina, Kaitlin is happiest with plane tickets in hand or a kitten in her lap. Thankful to be a “She” who Reads Truth, she can also be found writing more of her favorite words at KaitlinWernet.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day16.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 12:1-15, 1 Samuel 8:19-22, Ecclesiastes 5:4-7",
        "devo_title": "Conflict with Ephraim",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Judges 12:1-15, 1 Samuel 8:19-22, Ecclesiastes 5:4-7\nJephthah’s life is starting to unravel. Because of his rash vow, his daughter is dead and his family is broken. Jephthah was wrong to make that vow, and he was wrong to keep it. Because he was called into leadership by men instead of being raised up by God, he was man’s solution to a problem that can only be solved by God. And now, after a seemingly great victory over the Ammonites, the Ephraimites are pounding at his door and threatening to burn his house down over a ridiculous tiff.\nIronically, Jephthah’s house is really already on fire by the time the Ephraimites come for him, sharpening their flints. And the fire that burned was kindled by Jephthah’s very own hands and lips. It was the destructive fire of his sin. And he couldn’t keep the smoldering smoke a secret for long.\nThe Ephraimites have no good reason to pick a fight with Jephthah. They are angry because he didn’t summon them to help fight the Ammonites. Since he had been called to leadership by the Gileadites, Jephthah really had no authority to summon the tribe of Ephraim to war in the first place. But once they Jephthah is victorious over the Ammonites, they want a piece of that juicy victory and rise up against Jephthah.\nIn Shakespeare’s epic tragedy, Hamlet, Queen Gertrude groans, “When sorrows come, they come not as single spies, but in battalions.” In the same way, as Jephthah’s sins pile up, he continues to trudge forward in his own strength, his wrongs and sorrows compounding. Before he knows it, his own house is in shambles. A threat from foreigners to burn his house down is laughable because he has already burned what is valuable with his own actions. No amount of water could douse the flames ignited by the murder of his own daughter. This sin that was closest to his heart ended his career. His time as a judge was over. Jephthah was so burned by the evil that cauterized his family, he could not recover.\nOur darkest and most burning sins damage us in profound ways. But hope is never lost. Sometimes fire is the severe mercy we require. “This third I will put into the fire; I will refine them like silver and test them like gold. They will call on my name and I will answer them; I will say, ‘They are my people,’ and they will say, ‘The Lord is our God’” (Zechariah 13:9). Even if the house of your heart is on fire, call on His name and He will answer you.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-Judges-Instagram-Day15.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 10:15",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nAfter the Israelites turned to worship false gods, they experienced great oppression. This week’s verse is their cry for help to the one true God. \n But the Israelites said, “We have sinned. Deal with us as you see fit; only rescue us today!”\n-Judges 10:15\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/4-Judges-2-1.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Psalm 32:3-5",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nEach Saturday we are turning from the tragedy of Judges to read of the hope of the gospel in Psalm 32, a psalm about the joy of forgiveness. Use this day to pray, rest, and reflect on the hope that is ours because of God’s grace toward a rebellious people.\nWhen I kept silent, my bones became brittle\nfrom my groaning all day long.\nFor day and night your hand was heavy on me;\nmy strength was drained\nas in the summer’s heat.    Selah\nThen I acknowledged my sin to you\nand did not conceal my iniquity.\nI said,\n“I will confess my transgressions to the LORD,”\nand you forgave the guilt of my sin.    Selah\n-Psalm 32:3-5\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day13.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 11:1-40, Leviticus 18:21, Leviticus 20:2-5, Matthew 5:34-37",
        "devo_title": "Jephthah Becomes Israel’s Leader",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Judges 11:1-40, Leviticus 18:21, Leviticus 20:2-5, Matthew 5:34-37\nWhen God delivers His people, He “raises up” a deliverer to lead them. Take Moses and Gideon (Exodus 9:16; Judges 6:12), Othniel and Samuel (Judges 3:9; 1 Samuel 2:35), Jeroboam and Cyrus (1 Kings 14:7; Isaiah 45:13), and of course, Jesus (Jeremiah 23:5)—just to name a few.\nBut when we read about these deliverers in Scripture, we see that God’s people were often impatient, just like we so often are. And so instead of waiting for God to raise up a leader of His choosing for them, they would drudge up their own. They sought out their own solutions instead of seeking God’s perfect will. \nThat’s what’s happening in this passage with Jephthah. God didn’t raise up Jephthah to be Israel’s leader.  Instead Jephthah, who had surrounded himself with worthless men (Judges 11:3), got the call to lead from the elders. He wasn’t raised up by God—he was urged to leadership by men who were gripped with fear and desperation.\nThat should have been their first red flag: the desire to circumvent God’s way of doing things. David later explained it this way, “Unless the Lord builds the house, the builders labor in vain” (Psalm 127:1). But it’s hard to wait on God, and it seems much easier to just get on with our own solutions. However, apart from God, our own solutions can go terrifically wrong. But God is also kind, and He often forestalls judgment as we find our way back to Him.\nJephthah wasn’t a totally bad guy. He knew the Scriptures, and he knew the history of Israel. He tried to get the land back and reclaim Israel’s territories. But, like you and me, while Jephthah loved goodness and sought to do right, he also had some sneaky, low-dealing tendencies.\nThe combination of human error and ignoring God’s way brings us to Jephthah’s horrifically rash vow. I don’t know if human sacrifice was on his mind when he made the extravagant promise, or why he persisted in carrying out the vow after he realized his daughter would be its victim. But it’s a chilling image of what can happen when a people ignore God’s way and stubbornly turn away from His principles. Jephthah took his bad promise too far, and a celebration was turned into a funeral.\nMay the Lord protect our hearts from rushing to do things—even good things—our own way and on our own terms. May He give us courage to relent and humility to repent when we make bad decisions. May we lean on His strength and His promises, not our own, and may our “yes” mean “yes,” and our “no” mean “no” (Matthew 5:36-37). We can stop and turn our hearts toward Him. Even when it seems like we are already too committed to our own way, God waits to lead us back to His.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day12.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 10:1-18, Isaiah 30:15, Luke 15:11-32",
        "devo_title": "Israel’s Rebellion and Repentance",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 10:1-18, Isaiah 30:15, Luke 15:11-32\nMy mother became a Christian when she was just a few months pregnant with me. I now realize she literally grew in her relationship with Christ while simultaneously teaching and leading me as she learned. In short, I grew up learning a lot about God. I participated in Bible memory contests, collected money for missionaries around the world, and had a part in both Christmas and Easter performances annually. My mother led me the best she knew how, yet I still rebelled.\nI knew biblical principles,\nbut I did not apply them to my everyday life.\nI knew the Bible as God’s Word, that He is the Creator of the universe,\nbut I did not honor Him as my Father.\nI knew Jesus lived a perfect, holy, and blameless life,\nbut I did not know He loves me even though I cannot do the same.\nI knew Jesus died to save the world from sin,\nbut I did not live as God’s forgiven daughter.\nHaving knowledge of God and choosing to live a life that honors Him are two very different things, and they will lead to two very different life experiences. This is exactly what is happening in today’s passage. There is no mistaking that the Israelites knew God. Judges 10:11 reminds us they had experienced His deliverance, His protection, and His love over and over again. Yet time after time they forsook the God they knew, preferring the comforts of what they could see and touch. They chose the false gods and cultural influences of surrounding nations over their faithful God. \nOur struggles today remain the same. While we may not be tempted to worship the god of Baal, our false gods are just as dangerous. The tangible items we are so tempted to chase—money, people, success—are just as dishonoring when worshiped in place of the one true God. God did not want the Israelites to simply know of Him. He wanted them to know Him personally, to trust Him, confide in Him, and find their lives in Him. God wants the same for us now; He wants His people to choose Him.  \nIt’s easy to look at the stories we read in the Bible and wonder how God’s people could experience His patience, love, and miraculous intervention and yet still put their trust in other things. It’s easy to point the finger in judgment, but it would be far more beneficial for us to reflect on our own idolatry. In doing so, we will likely find places in our own hearts where we need to repent, seeking forgiveness and healing from the God who longs to be gracious to us (Isaiah 30:18). \nGod is compassionate and merciful. He provides leadership, guidance, and personal opportunities to experience His love. But as His children, we must take action, choosing to surrender to Him and worship Him with our lives. The ultimate provision of His faithful love comes in the very person of Jesus Christ—the sure image of the invisible God the Israelites so longed for and the Savior we all need. He alone stands by ready to rescue. In our surrender to Him, we will experience the deliverance, forgiveness, compassion, and rest promised to His children (Isaiah 30:15).\n\nIt is with great sadness, yet greater hope still, that we share in the loss of Wynter Pitts, one of our She Reads Truth writers. As the founder of For Girls Like You, a resource ministry for tweens and their parents, Wynter’s mission was to empower and equip women of all ages to know, love, and serve Jesus. We are grateful to her for sharing her words and her voice with the SRT community (including today’s devotional, her final piece written for SRT), and we praise the loving, living God who she now knows fully, face to face in glory. “In [His] presence, we need nothing more, nothing but Him… His love fills us up to overflowing.” — Wynter Pitts\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day11.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 9:1-57, Psalm 68:11-14, John 4:19-24",
        "devo_title": "Abimelech Becomes King",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 9:1-57, Psalm 68:11-14, John 4:19-24\nThe book of Judges is bleak, but chapter 9 is particularly devastating. A passage like this forces us to see the devastation that bad men can wreak. Sometimes the only appropriate response to something like this is, “How long, O Lord?” That is my posture today. \nGideon died and the people of Israel once again worshiped Baal, the fake god. When he passed, Gideon left behind seventy (yes, 70) sons. Abimelech was one of those sons, born to a prostitute and bent on being king. So he killed all but one of his brothers (Jotham), and rallied the people of Shechem to make him king. \nAbimelech was awful and opportunistic, a greedy and prideful man. Knowing this, Jotham floated him a warning in the form of a parable: A forest of cedar trees wanted a king, and so they asked an olive tree, fig tree, and grape vine to do the job. All three declined, and instead asked the trees of the forest to consider what it would be like to no longer produce the fruit that pleases both people and God. \nTurns out the olive tree, fig tree, and grape vine knew their place and their calling; they were content in the roles given to them by the Lord. But the bramble, an opportunistic and destructive plant, said yes—he would be their king (vv. 7–15). One commentary I read compared the bramble to the Southern vine kudzu, which ruthlessly takes over anything in its path. Jotham knew Abimelech would do the same. \nGod sought vengeance for the murder of Abimelech’s brothers, sending “an evil spirit between Abimelech and the citizens of Shechem” (v. 22). A man named Gaal started a coup against him, and when Abimelech learned of the plot to overthrow him, he unleashed a violent terror against his people. He “razed the city and sowed it with salt” (v. 45), making it infertile land, destroying it not just for the present, but for generations after. To round out his wrath, he burned a tower filled with people, killing more than a thousand.\nAbimelech’s anger would echo for decades. We don’t know exactly how Abimelech salted the earth, but Scripture describes just how destructive this practice might have been, leaving behind soil as a “burning waste of sulfur and salt, unsown, producing nothing, with no plant growing on it” (Deuteronomy 29:23). \nThis is the definition of “scorched earth,” a turn-of-phrase typically reserved for military strategies. It is Sherman’s march to the sea in the Civil War and the campaign of Agent Orange in the Vietnam War. It is the devastation we see throughout both history and Scripture. It leaves us to cry out, “How long, O Lord?” \nSin has scorched the whole earth, and our whole hearts. It leaves nothing to satisfy us. We are only refreshed, rebuilt, and renewed when we look to Jesus. He is the only One who can water a scorched earth and a hardened heart, and He does. And He will. Thanks be to God. \n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day10.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 8:1-35, Deuteronomy 20:5-8, 1 Corinthians 1:18-31",
        "devo_title": "Gideon Pursues the Kings of Midian",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 8:1-35, Deuteronomy 20:5-8, 1 Corinthians 1:18-31\nWhere did we get the idea that the battle should be easy? Why did we start calling the Christian life a “walk” when it is more like a war? After all, “our struggle is not against flesh and blood, but against the rulers, against the authorities, against the cosmic powers of this darkness, against evil, spiritual forces in the heavens” (Ephesians 6:12). \nYes, we’re the sheep of God’s flock (Psalm 95:7), the tiny chicks He tucks up under His wings (Psalm 91:4) and His dearly loved children (Ephesians 5:1). But these tender images don’t tell the whole story. We are warriors, enlisted for battle against an enemy bent on rebellion against God and the destruction of His image bearers. Truth, peace, faith, and salvation are standard issue armor for Christ’s followers (Ephesians 6:14-17). Why fit us for battle if we’ll never be expected to fight?\nIn Judges 8 we find Gideon serving as the general of God’s army. He’s already led the charge in a battle that left the enemy bleeding and scattered (Judges 7:19-25). From our view on the sidelines, we wouldn’t have faulted this band of brothers if they’d simply let the remaining rebels limp away toward the hills. Instead we find them in hot pursuit. The front of darkness had been pushed back, yet they knew the fighting was not over. They were worn out, battle weary, low on energy and strength, and yet they pursued because there was still an enemy at large.\nThese words from Gideon’s story have sunk deeply into my gut: “exhausted yet pursuing” (v.4, ESV). They jar me into remembering that for the army of God, the orders haven’t changed. Until Christ returns for us, there will always been skirmishes between flesh and blood, good and evil, light and darkness. There will be times when God’s strength will empower us to push back the front of darkness, but the enemy hasn’t yet raised the flag of surrender. And in the words of Bible teacher Kay Arthur, “There’s no retirement in the time of war.”\nAs long as our enemy is on the run and still gunning for the people of God, retirement isn’t an option. Though we may find ourselves weary and worn out from the battle, or celebrating a God-given victory, let us not sit back and rest on our laurels. Let us raise our swords and keep fighting.\nFighting for truth.\nFighting for hope.\nFighting for love.\nFighting to make the gospel known.\nIn other words, “Let us not get tired of doing good, for we will reap at the proper time if we don’t give up” (Galatians 6:9). Until the Lord blasts His trumpet, signaling the final fall of our enemy, may He find us like Gideon’s army—exhausted yet pursuing, and empowered by the strength of our Savior, who “is the power and the wisdom of God” (1 Corinthians 1:24).\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day9.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 7:1-25, Isaiah 41:10, Ephesians 6:10",
        "devo_title": "Gideon’s Army",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 7:1-25, Isaiah 41:10, Ephesians 6:10\nWhen was the last time you were in a battle you could not win without divine intervention?\nIt’s hard for me to find an answer. Sure, I enjoy the occasional challenge, but I like to keep those challenges to a minimum, so I can feel capable and in control. And if I’m honest, I’m happy with this life of manageable risks—enough to create some drama, but not so much that it requires great faith. There’s an underlying pride to living like this, because when things go well, I can answer, “Oh that’s easy. I did it myself.”\nNews flash: God doesn’t need me, and He doesn’t need you.\nI know that sounds harsh, but that’s kind of the point of Judges 7. I wonder if that’s what Gideon told his men that day as they prepared to face down the greatest enemy of their time. “Are you scared? You can leave. God doesn’t need you.” In that one moment, two-thirds of Gideon’s army walked away. Can you imagine? You’re standing there, covered in armor, and the person to your left and your right both leave. The field must have felt very empty. \nBut God wasn’t done whittling down the troops. He told Gideon to take his men to the water and split them into “kneelers” and “lappers.” Commentaries disagree about the “How do they drink water?” test; some argue that it was an arbitrary way to narrow down the fighting force quickly, while others wonder if the “lappers” let down their guard. Could it be that God chose to use the most irresponsible men to make the victory that much more miraculous? Regardless, what was a force of more than 30,000 at the beginning of the day had been narrowed to just 300.\nWe know how this story ends, but the men in Gideon’s army did not. And as much as God reassured them, on paper it was a suicide mission. This risk didn’t require strength or chariots or better weapons or more “hustle.” It required faith in divine intervention. It required them to rely on God alone, to “be strengthened by the Lord and by his vast strength” (Ephesians 6:10).\nThe men who went into the valley needed faith, but the men who were sent away needed it just the same. I can imagine their startled disbelief as Gideon pointed them away from the water. “Wait! We’re the fearless ones! Surely God needs us!” But He didn’t, and those men needed to know where their power came from. For the men who left and the men who went down into the valley, God’s strength combined with their faith led to an epic victory.\nGod loves you, but He doesn’t need you. And that isn’t harsh news—it’s freedom. No matter how deep the valley, no matter how big the army you’re up against, He’s not waiting for you to build some spiritual muscle in order to handle that challenge. He already has the strength. All He needs if for you to have faith in Him—whether He’s calling you to face it or walk away.\nGideon wasn’t the only warrior who God sent seemingly outnumbered into battle. In the war for our souls, God sent His Son Jesus to take down humanity’s greatest enemy. Jesus went into the valley alone,  voluntarily laying down His life, taking the punishment we deserve, so we could claim His victory over death as our own. This is how strong our God is. Nothing can stand up to Him. Not even death itself.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day8.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 2:11-12",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nAs we read, we will memorize verses that illustrate the repeating cycle seen in the book of Judges—the tragedy of forgetting God. This week’s verse summarizes Israel’s recurring rebellion against God. \nThe Israelites did what was evil in the LORD’s sight. They worshiped the Baals and abandoned the LORD, the God of their fathers, who had brought them out of Egypt.\n-Judges 2:11-12a\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/4-Judges-1.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Psalm 32:1-2",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nEach Saturday we’ll turn from the tragedy of Judges to the hope of the gospel in Psalm 32, a psalm about the joy of forgiveness. Use this day to pray, rest, and reflect on the hope that is ours because of God’s grace toward a rebellious people.\nHow joyful is the one\nwhose transgression is forgiven,\nwhose sin is covered!\nHow joyful is a person whom\nthe LORD does not charge with iniquity\nand in whose spirit is no deceit!|\n-Psalm 32:1-2\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day6.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 6:1-40, Psalm 127:1, James 1:16-17",
        "devo_title": "The Lord Calls Gideon",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Judges 6:1-40, Psalm 127:1, James 1:16-17\nWhen we read Judges 6, we see that Gideon is certainly having a low moment. We find this youngest son from the weakest tribe crouching in the winepress trying to thresh wheat in secret, so the mighty Midianite army won’t get a whiff of his harvest and swoop down to steal it. All of Israel was feeling abandoned by God and their hearts were confused and resentful. Every time they tried to get back up, they were gleefully knocked down by some neighboring pagan army. God’s chosen people wondered if He had given up on them and chosen someone else to love, protect, and set apart for Himself.\nBut Israel wasn’t down because God had forgotten them. They were hiding in caves because they had stubbornly and persistently chased after evil for many years. They had established traditions and patterns that avoided God altogether. The paths their feet traced in their homes and in their towns led them in the ways of wickedness. They were in a rut, and it’s hard to look up and figure your way out of habitual sin.\nIt takes something dramatic to turn our hearts back toward God.\nGideon was trudging his sweaty rut like the rest of Israel, when an angel of the Lord appeared to him. Why would an angel appear to him? It wasn’t because Gideon was the one honorable man among thousands; it was because God’s time was right to raise up a leader in Israel. It is God who marks the seasons, who raises up leaders, and who brings down empires. “Unless the Lord builds the house, its builders labor over it in vain” (Psalm 127:1). All other planning and plotting is futile. \nI’ve never had to hide from an army, but I have had some low moments. I’m sure many of us can remember feeling confused and resentful at some point. In spite of our doubts and ruts, and the habitual trails that lead us to wickedness, God can lift us up to victory with Him. Gideon didn’t just decide to grit his teeth and pitch his military plan to the leaders. God chose him, called him, and promised him victory “as if Mideon were one man” (Judges 6:16).\nWhatever your circumstances may be today, don’t let them scare you. Don’t let the worn pathways of sin lure you into hopelessness. Don’t be deceived by the voices that tell you that your sin is too great, that your habits can never be broken. Our God can rescue and redeem even the most lost. He is light in the blackest night. Run to the One who controls the sea and the stars, and trust Him with your darkest secrets. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day5.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 4:1-24, Judges 5:1-31, Job 19:25-27, Psalm 68:7-10",
        "devo_title": "Deborah Judges Israel",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Judges 4:1-24, Judges 5:1-31, Job 19:25-27, Psalm 68:7-10\nMy husband and I have the privilege of shepherding three little ladies through life, and our evenings often end with the same bedtime ritual. We read a story, pray together, and sing. For my middle daughter, it is quite important that we sing the same three songs every evening: “Before the Throne of God Above,” “Magnificat,” and “The Lord’s Prayer”—usually in that order. If I’m honest, this sometimes frustrates me. Why can’t we have some variety in our song choice? But, as I continued to think through today’s readings, I have come to see our same three songs in a new light. \nThe book of Judges recounts the tragedy of forgetfulness. It is a story of the Israelites’ downward spiral, culminating in Judges 21:25: “In those days there was no king in Israel; everyone did whatever seemed right to him.” However, there is a momentary break in this downward spiral with the arrival of Deborah. \nWe first meet Deborah in Judges 4. She is sitting under a tree conducting business as usual, judging and prophesying. The Israelites, having suffered oppression at the hands of the Canaanites for twenty years, cry out to the Lord for deliverance. He inclines His ear, and speaking through Deborah, reveals a rescue plan by way of a woman named Jael, who ultimately kills King Jabin’s military leader, Sisera. This victory sets in motion the unraveling of Canaan’s defense and, ultimately, makes way for the Israelites to enjoy forty years of peace—double the amount of time they originally spent under King Jabin’s oppression. \nWhat is Deborah and Barak’s response? They break out into a victory song! They sing, detailing how God provided deliverance from their enemies. But their praise did more than serve as a celebration in that moment. It became a vehicle for future generations to remember God’s faithfulness. Compared to the rest of the book in its entirety, the song of Judges 5 interrupts the narrative flow, and is an intentional break in the story for the purpose of remembering. Like David in Psalm 68, Deborah and Barak are recalling and recounting the faithfulness of God. May we do the same. \nMay we remember what God has done: “God, when you went out before your people, when you marched through the desert… You, God, showered abundant rain; you revived your inheritance when it languished” (Psalm 68:7,9). \nMay we remember what God is doing: “Israel’s leaders took charge, and the people gladly followed. Praise the LORD!” (Judges 5:2).\nMay we remember what God has promised to do: “But I know that my Redeemer lives, and at the end he will stand on the dust… I will see him myself; my eyes will look at him, and not as a stranger” (Job 19:25,27).\nWhich brings me back to those same three songs my family sings together at bedtime. We, like the Israelites, are tempted to forget, to lose sight of who we are and why we are here. It is our remembrance of what God has done for us that fights forgetfulness and propels us forward in our mission as followers of Jesus. May today, tomorrow, and all the days we’ve been given, be spent singing the praises of our holy, just, and infinitely loving God. \n\nEmily Chapman Richards is the daughter of Grammy® award-winning recording artist, Steven Curtis Chapman, and his wife, Mary Beth Chapman. She graduated with a BA from Baylor University (’07) and received her Master of Theology (MTh) degree from Queen’s University, Belfast, in 2012. Emily currently serves as the Vice President of Show Hope, a nationally recognized voice for adoption advocacy and orphan care support work. She and her husband, Tanner, reside in Franklin, Tennessee, with their three daughters Eiley, Della, and Verity.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day4.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 3:1-31, Psalm 91:1-16",
        "devo_title": "The Lord Tests Israel",
        "devo_summary": "\nBY Guest Writer\n\nScripture reading: Judges 3:1-31, Psalm 91:1-16\nJust over a hundred years ago, a funny belief began to crop up among Western Christians. In Europe especially, Christians had enjoyed a long season of prosperity and peace, which began to shape their theology. They concluded that humans were evolving, outgrowing the bad habits of violence, war, and sin. Humans, they reasoned, were essentially good, and getting better with every generation.\nWhat these Christians developed was a weak view of sin and an idealistic view of human nature, and it remained popular for a while. It shaped Christians’ faith and the way they read Scripture, but it didn’t last very long. In 1914, the world was plunged into World War I, which shattered all of those illusions. As it turned out, humans were not evolving out of sin. In fact, we were no different than any generation before us. If anything, humans were only “advancing” in our technology for fighting each other. \nThis bit of Church history is good to keep in mind while reading the book of Judges, because it demonstrates a principle we will see again and again. Old Testament scholar Walter Brueggemann once wrote, “Prosperity breeds amnesia,” and there is perhaps no better description of what happened to Christians a century ago, and what happened to the Israelites in Judges. Every time the Israelites prospered, they didn’t simply forget God; they forgot what it means to be human in the world. They forgot their own sin. They forgot the world’s brokenness. And they forgot how desperately they needed God. So they lived as if they didn’t.  \nWe should never be too quick to explain the stories of violence and suffering in Judges. Neat and tidy answers almost always do a disservice to these difficult passages. That said, it is safe to say that the cycle of foreign invasions had an eye-opening effect on the Israelites, in the same way that World War I shattered the rose-colored glasses of idealistic Christians. When God tested “all those Israelites who had not experienced any of the wars” (Judges 3:1), you can’t help but wonder if this was another way of saying, “In the absence of war, the Israelites had forgotten. They had forgotten their weakness. They had forgotten their vulnerability. They had forgotten that they needed God.” \nIt was true then and it is still true today: prosperity breeds amnesia. In times of comfort, we do not simply forget God, but we also forget the seriousness of sin, the brokenness of this world, and why we so desperately need a Savior to mend it. That said, this kind of forgetting is one that most people in the world are never afforded. In regions of famine and civil war, it’s impossible to ignore that this world is not as it should be. But for those of us living in relative comfort, who rarely bump up against the jagged edges of this fractured planet, we can forget just how devastating the effects of sin have been.\nThat is one lesson we can take from Judges. It challenges us not only to remember God, but to remember our brokenness and the brokenness of the world. When we downplay sin, we downplay grace, and we downplay our dependency on it. So as ugly and horrible as suffering can be, and as much as it grieves God most of all, through it we can detect the still, small voice of the Spirit whispering to us: “This is why you need a Savior. This is why I came.”\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She blogs at SheWorships.com, and is the author of Free of Me: Why Life Is Better When It’s Not about You.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day3.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 2:1-23, Deuteronomy 4:9, 2 Timothy 2:2",
        "devo_title": "Sin and Judgment",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Judges 2:1-23, Deuteronomy 4:9, 2 Timothy 2:2\nIn Judges 2, we read about two generations of Israelites: the Joshua generation and the post-Joshua generation. Joshua’s generation was faithful. Scripture says, “The people worshiped the LORD throughout Joshua’s lifetime and during the lifetimes of the elders who outlived Joshua. They had seen all the LORD’s great works He had done for Israel” (Judges 2:7).\nHowever, the post-Joshua generation was not faithful. After Joshua’s death and after the death of the elders who outlived him, this generation rose up as one who “did not know the LORD or the works He had done for Israel.” Therefore, they “did what was evil in the LORD’s sight” (Judges 2:10-11).\nOne generation had witnessed the great works the Lord had done for His people on their journey to claiming the promised land—the other had not. Because of this, this new generation turned from God to worship idols instead.\nIn graduate school, I had a good friend who was an atheist. We often talked about faith and Christianity. He thought it was odd that Christians felt the need to gather together once a week. “If the whole Jesus story is really true,” he said, “why do you all need to gather once a week to remind each other of it?”\nIt was a good question. At the time, I didn’t have a good answer, but I think Judges 2 speaks to this question. When we don’t remember the works of the Lord, we turn from him, and because we are made for worship, we look for other gods to worship. Like the children of Israel began to worship the gods of the Canaanites, we may begin to worship the gods our friends are worshiping, or the gods the media tells us to worship. We can easily lose sight of the one true God.\nThis is why Christians gather each Sunday and tell the same story again and again. This is why we drink from the cup and eat the bread. Jesus said, “Do this in remembrance of me” (Luke 22:19). He wanted us to remember, because He knew what would happen if we forgot.\nI don’t know what happened between Joshua’s generation and the next. Did they stop telling the story of what the Lord had done? Did this generation not hear about the parting of the Red Sea? The manna? The cloud that led the people by day and the pillar of fire that led them by night? Did they not heed this charge in Deuteronomy?\nBe on your guard and diligently watch yourselves, so that you don’t forget the things your eyes have seen and so that they don’t slip from your mind as long as you live.\nTeach them to your children and your grandchildren.\n-Deuteronomy 4:9\nWe don’t really know the answer. What we do know is one generation was faithful to God because they had seen what the Lord had done. The next generation was not, because they did not know what the Lord had done.\nHow grateful I am for those who’ve gone before me, telling their children of the great works the Lord has done. How thankful I am for those children, who then went on to tell their children about God, until the story trickled down through generations into a Church that is still gathering, still remembering, still passing the cup.\nLord, help us to remember your works and to never stop telling others about Your goodness. In continuing to worship You, the one true God, may we bring you glory, so the next generation might do the same.\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day2.jpg"
    },
    {
        "book_title": "Judges",
        "devo_passages": "Judges 1:1-36, Genesis 49:8-12, Psalm 34:17",
        "devo_title": "Failure of the Tribes",
        "devo_summary": "\nBY Jessica Lamb\n\nScripture Reading: Judges 1:1-36, Genesis 49:8-12, Psalm 34:17\nI still remember the misguided giddiness I felt when my eighth grade English teacher announced we would be reading Romeo and Juliet. I knew little of Shakespeare at the time, beyond the belief that he was someone I should read and appreciate. All I really knew of the star-crossed pair was that they, and their love story, were famous. \nSo when I came to the end of the play, I was livid. Romeo and Juliet were both dead, and there was no happily ever after. What sort of love story was this? \nIt isn’t one, really. It’s a tragedy. Every twist and turn that leads to the demise of the young couple is meant to bring an ache to our hearts, because we realize how easily it could have been avoided. We’re meant to feel upset and distressed at the ending. That’s how tragedy works.\nThe book of Judges is the tragic, true story of the people of Israel ignoring God’s instructions, and then abandoning their faith to live like their pagan neighbors. After God’s people endured 400 years of slavery in Egypt, followed by forty years of wandering in the wilderness, Joshua led Israel into the promised land. Toward the end of his life, Joshua warned the Israelites to worship the Lord and serve Him only, and instructed them to drive the Canaanite people out of the land, so they would not be tempted to follow a false religion (Joshua 24:14-15). \nBut these opening verses in the book of Judges warn us that the Israelites didn’t obey. They repeated the sins of the Egyptians and enslaved the Canaanite people. They failed to drive the Canaanites out completely, and failed to fully establish a land of their own. And like the opening lines of Romeo and Juliet, we are warned that what we are about to read is a tragedy. \nIn Judges, the people of Israel forsake the Lord and adopt the worship practices of the Canaanites. They experience chaos and catastrophe in a time of unprecedented violence and oppression, led by mostly corrupt and cowardly judges. The Israelites become almost unrecognizable as the people of God. And then the book of Judges abruptly ends, with everyone doing whatever seems right to them (17:6). As readers, we’re left with a sense of longing for how things ought to be.\nBut God continues to work. The book of Ruth tells us that during this time, famine in Israel sent Naomi’s family to Moab, where her son married a woman named Ruth before he died. Ruth, a Moabite, pledged to stay with Naomi, an Israelite, and embrace the God of Israel. She went on to give birth to Obed, King David’s grandfather. From this lineage came Jesus, the Savior of the world. Our hope, the hope of all creation, is rooted in a foreign widow’s decision to follow God during the bleak time of the judges.\nI pray that as we read Judges, we will discover the source of true redemption, and turn back to the One who redeems. For when “the righteous cry out… the LORD hears, and rescues them from all their troubles” (Psalm 34:17).\nWe can draw hope from the fact that God continues to work through morally compromised, deeply flawed people and circumstances. He isn’t limited by our shortcomings. He isn’t stopped by the brokenness in our world. His story—and because of Him, our story—is not one of tragedy, but one of profound beauty and hope in Jesus Christ. Thanks be to God.\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/SRT-Judges-Instagram-Day1.jpg"
    }
]