[
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 1:1-53, 1 Kings 2:1-46, 2 Samuel 7:12-13",
        "devo_title": "King David’s Last Days",
        "devo_summary": "\nBY Melanie Rainer\n\nBy whatever stroke of chance or luck (or the-opposite-of-luck), I’ve never had to follow in anyone’s footsteps when starting a new job. I’ve always stepped into an unformed role and had the joy (and challenge) of shaping it to fit the opportunities before me. \nBut a few months ago, that changed. I took a job that someone had held previously, and the awkwardness of learning to walk in your own shoes on someone else’s tightrope has required more grace and patience than I ever could have expected. It’s like constantly looking in a mirror but the reflection isn’t you. I feel like I’m tipping over all the sacred cows, even as I try to tread lightly while I also prove myself. It’s a mess of idols and pride, and it’s hard. \nDavid was the king. He was King David, a man after God’s own heart. He was King David, who brought the ark of the covenant back to Jerusalem. He was David, to whom God promised a descendant on his throne forever. The shepherd boy who became king, David was the standard against whom all other kings of Israel would be judged. Taking his place would have been daunting, but it would also lead to unprecedented power. \nWhen David was on his deathbed, two men believed they held claim to his throne: Adonijah and Solomon. Both wanted to step into his shoes, lead his people, and claim his fame. Adonijah was David’s oldest surviving son, but David had promised Bathsheba that their son Solomon would be the next king (1 Kings 1:13). Chaos ensued, with back-room conversations and an attempted coup. But David, when told that “the eyes of all Israel are on you to tell them who will sit on the throne” (v.20), affirmed that Solomon was his choice. \nChapter 2 opens with David’s charge to Solomon. It is full of encouragement to “be strong and be a man” (v.2), and admonishes the soon-to-be king to walk in God’s “ways [and] keep his statutes, commands, ordinances, and decrees” (v.3). David then reminds his son of the covenant promise God made to him: “If your sons guard their way to walk faithfully before me with all their heart and all their soul, you will never fail to have a man on the throne of Israel” (v.4).\nOur privilege as those who hold the entire canon of the Bible is that we know how this story goes: Solomon didn’t always follow the Lord and His ways. His father David didn’t. Nor did the rest of Israel and Judah’s other kings. \nBut despite the failures of humankind, our God reigns. In Israel’s time of transition, God reigned. In every second before and every second after, God reigned, is reigning, and will reign forever. While our earthly leaders matter, our ultimate allegiance is to God’s Kingdom and to the perfect King of kings, Jesus. It means we can live lightly but intentionally, resting in the holy, sovereign kingship of the One who will make everything new as we advocate for His Kingdom to grow on earth here and now. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-12Kings-Instagram-1-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 3:1-28, 1 Kings 4:1-34, 1 Kings 5:1-12, Proverbs 15:33, James 1:5",
        "devo_title": "The Lord Appears to Solomon",
        "devo_summary": "\nBY Melanie Rainer\n\nFor a couple of years in the late ’90s, it was “cool” for girls to be ditzy. It was, like… so cute to act like you didn’t have a lot of common sense. This trend permeated culture with its linguistic “valleyspeak,” and was reinforced by iconic, pop culture movies like Clueless. As an awkward but intelligent middle school girl, I often bought into the false cultural narrative that smart girls aren’t as worthy or attractive or likely to succeed as the popular sort. I was tempted to “play dumb” in front of my peers, hoping they would like me more. It seemed (as it does so often today), that money and brands and clothes and cars were the most important things. \nThankfully, this phase–and middle school itself–didn’t last very long. I found bookish friends and kindred spirits, and we made it through high school with some confidence still intact. But the temptation to present myself as something more or different than who I truly am exists to this day. In every area of life, I believe I am not enough of what I ought to be, that there are things I can do to create an image of enough-ness. \nAfter Solomon inherited the kingship from his father David, the Lord appeared to him in a dream. God offered Solomon anything he wanted: “Ask. What should I give you?” (1 Kings 3:5).\nWhat temptation must have presented itself in that moment! I wonder how I would answer that question, but in my heart I know. I would probably ask for financial security, or health and safety for everyone I love. I would ask for everyone to love me. I would ask for freedom from fear and pain. I would ask for many things—all of them for me. \nBut Solomon asked for others, and he asked for an invisible thing: wisdom. “Yet I am just a youth with no experience in leadership,” Solomon said. “Your servant is among your people you have chosen, a people too many to be numbered or counted. So give your servant a receptive heart to judge your people and to discern between good and evil” (1 Kings 3:7–9). \nSolomon asked for a heart and mind shaped more by God than by the world. And God answered that prayer lavishly. Solomon gained supernatural wisdom but also fame, wealth, and honor worldwide. “Emissaries of all peoples, sent by every king on earth who had heard of his wisdom, came to listen to Solomon’s wisdom,” (1 Kings 4:34).\nWhen Solomon judged wisely, he didn’t claim the fame for himself either—at least, not at first. After the infamous baby cutting story (1 Kings 3:16–28), the glory was God’s. “All Israel heard about the judgment the king had given, and they stood in awe of the king because they saw that God’s wisdom was in him to carry out justice” (v.28). \nGod doesn’t regularly appear to me in dreams, offering me whatever my heart desires. But Scripture does tell me that when I petition the Lord, He hears me. “This is the confidence we have before him: If we ask anything according to his will, he hears us. And if we know that he hears whatever we ask, we know that we have what we have asked of him,” (1 John 5:14–15). When we seek wisdom, we should seek “God—who gives to all generously and ungrudgingly—and it will be given” to us (James 1:5).\nWhen I measure my prayers against Solomon’s, I see how material and vapid they tend to be. Yes, health, financial security, and safety are valid requests to bring to God. But the undergirding theme of my prayers should be about the shape of my heart, mind, and will, that they would be abounding with the wisdom of God and aligned with His mission to bring peace, shalom, and abundance to His people and His world. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-2-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 5:13-18, 1 Kings 6:1-38, 1 Kings 7:1-51, Leviticus 26:11-13, Ephesians 2:19-22",
        "devo_title": "Building the Temple",
        "devo_summary": "\nBY Melanie Rainer\n\nI love looking at real estate online. I love flipping open an app and scanning houses both nearby and far away, homes that I might one day be able to afford (probably not), and dream about the parties I could host, the backyard adventures my kids could have, and the ideal life one of these houses would surely provide me. \nCurrently, I live in a very nice house that we built a few years ago. We chose the finishes and the floors, everything down to the grout. I love every room, and it is more than I ever could have imagined owning. And yet, I spend a lot of time window shopping for a new house. My heart beats to the rhythm of what’s next, what’s better, what would make my life more. More what? I don’t always know. But I am always chasing it. \nSolomon built an extravagant temple for the Lord. Every detail mattered, the length of the doorways and the beveled frames for each window. It mattered where the stones were finished (at the quarry) and how gold was overlaid on the interior walls. We know the details mattered because they are written in Scripture, in God’s revelation to His people. The temple was a stunning architectural achievement, built with detail for the holy God of Israel. \nAnd yet, Solomon kept building. This time, he built for himself. He was chasing more. It took twenty years to build God’s temple and then Solomon’s palace. Solomon’s story will unfold over the next few chapters of 1 Kings, but we start to see glimpses here of what is to come. Solomon’s itch for more—a bigger palace, more wives, places of worship for other gods—begins to present itself, and it will slowly unravel his kingship. \nKing Solomon was on top of his world. He was the most famous, wealthiest, wisest king in all the earth. But his need for more would eventually be his undoing. In 1 Kings 6:13, God made this promise to Solomon: “If you walk in my statutes, observe my ordinances, and keep all my commands by walking in them, I will fulfill my promise to you, which I made to your father David. I will dwell among the Israelites and not abandon my people Israel.”\nSolomon didn’t keep God’s commands, but the Lord did keep His promise. I think we will always itch for more until the fulfillment of God’s kingdom, when all tears will dry and we will dwell in the house of the Lord forever. That is the house I should crave, not this world’s version of a perfect home or false security. I want to crave the perfect peace, righteousness, and future that God promises me through Jesus. One day in His presence is better than a thousand elsewhere (Psalm 84:10). May God continue to make over my heart with a longing for Him and His house alone.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-3-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 8:1-66, 1 Kings 9:1-28, Exodus 25:10-22",
        "devo_title": "Solomon’s Prayer",
        "devo_summary": "\nBY Claire Gibson\n\nOur house is a wreck. At the moment, each piece of furniture we own resides in the middle of its designated room, covered in plastic wrap. The master bathroom is halfway through a renovation, which means that it currently looks worse than it did before the hammer first fell. A crew of painters came last week and rolled our walls white. There are a few unfinished places: a patch in the living room, a circle around the dining room chandelier. Yesterday, our contractor went to open a box containing two porcelain sinks for the bathroom, and as soon as he touched the box, the contents inside clinked and scratched like a windchime. We knew they were broken. He laughed and wiped his nose. I, on the other hand, said some things I’m not so proud of.\nConstruction is not easy. But through it all, I’ve held onto the hope of what’s to come: a restful, fresh retreat for our family to enjoy for years to come. A place to connect with the people I love, where I will leave renewed to face the trials of the world. When it’s finished—God, please let them finish—I will be the first to sing, “Hallelujah!”\nThat’s what’s happening in today’s reading of 1 Kings on a far grander, more historic scale. King David dreamed of building a temple worthy of God’s glory—but God reserved the joy of building that temple for his son Solomon. Temple construction had ended, but Solomon knew the job wasn’t complete until the ark of the covenant resided inside. For context, keep in mind that, years earlier, when the Israelites moved the ark, someone died (2 Samuel 6). This was no laughing matter. And though Solomon threw an epic celebration to welcome the ark, no doubt the people trembled with fear and as it was moved into its rightful home. \nIt’s interesting to me that Solomon’s prayer of dedication addresses a list of worst-case-scenarios: When we are defeated. When there is a drought. When there is famine. If his prayer tells us anything, it’s that the temple wasn’t a magical place to avoid the pain of the world. It was a sacred place to be with God in the midst of that sorrow. He prays that God will forgive, save, and redeem His people, even in the midst of every possible catastrophe. Solomon’s prayer ends with a reminder of why they built the temple in the first place: so that “all the peoples of the earth would know that the LORD is God. There is no other!” (1 Kings 8:60). All this work was to remind the world of the truth: God wants to be with his people. \nAnd he wants to be with us too. So much so, that He didn’t stop moving toward us after Solomon built his temple. Several hundred years later, Jesus was born in Bethlehem. When He began His teaching ministry, Jesus shared radically great news—a time was coming when we wouldn’t have to go to a particular place to commune with God (John 4:21, 23). Because of Jesus’s work on the cross, God can commune with us always, without the barrier of a building. By God’s Spirit, we are welcome to be present in the holy of holies, near to God, sharing in Jesus’s glory right this second. \nHow do we know this is true? In His final prayer before He was betrayed and crucified, Jesus asks God the Father to be as near to us as He was to Jesus. Jesus asks for God to do a construction project in our hearts. He prays for us, saying, “I have made you known to them, and will continue to make you known in order that the love you have for me may be in them and that I myself may be in them” (John 17:26).\nEven Solomon’s temple in all of its splendor wasn’t as remarkable as the temple that God occupies in the center of our spirit. God is where He wants to be: with us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-4-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 10:1-29, 1 Kings 11:1-43, Matthew 1:1-16",
        "devo_title": "Solomon’s Unfaithfulness to God",
        "devo_summary": "\nBY Claire Gibson\n\nI recently discovered a website that sells bona fide designer items at discounted prices. (However, even at a “discount,” everything is still way out of my price range.) Surfing this site is like taking a sneak peek into a famous, wildly wealthy person’s closet. I’m not actually indulging. I’m just browsing! But the slope is steep. I know from past experience that I can easily go from browsing, to buying, to justifying in about two-point-five seconds flat. \nOur culture is obsessed with wealth, beauty, and sexuality. Social media influencers attempt to sell me expensive clothes, face oils, and procedures, showing me what life could look like if I had access to more—more money, more freedom, more of everything. And yet, for all their photos of fancy clothes, private jets, and exotic places, no one has risen to the level of King Solomon at the height of his wealth and influence. It was out of control and unfathomable.\nLong story short? Solomon got caught up in the things of this world, not only in the trappings of his wealth, but in the sexual power it gave him over women. The numbers are staggering: seven hundred wives, three hundred concubines— I mean, how would one even have the time for a thousand lovers? It’s safe to say that many of these women weren’t there by choice. The evil in many of Solomon’s actions would be hard to calculate in terms that would translate to today’s world. At the very least, he was an idolator and an adulterer to the highest degree. In the beginning, wealth gave Solomon freedom. In the end, it enslaved him.\nEvery time he added possessions and people to his entourage, Solomon believed he was gaining power. In reality, he was giving himself away. Bit by bit, the wisdom and character that had made him famous faded as his unfaithfulness to a faithful God grew. But it wasn’t wisdom and character or wealth that had built his kingdom—the Lord did all of that. While He did bless Solomon with “a wise and understanding heart” and even the “riches and honor” he hadn’t asked for, the blessing was always tied to Solomon’s commitment to walk in God’s “ways and keep [His] statutes” (1 Kings 3:12–14). In other words, Solomon would have to choose God’s wisdom over his own—every single day. Instead, “Solomon did what was evil in the LORD’s sight, and unlike his father David, he did not remain loyal to the LORD” (1 Kings 11:6).\nWealth has a way of making me believe the absolute lie that I don’t need God. I know the slippery slope firsthand. And while Solomon’s actions are unfathomable, if I had been given all the wealth in the world, I hope that my heart would remain pure. But I don’t know for sure. Solomon lost sight of his need for God. It’s easy for me to do the same. \nJesus, help me to fix my eyes on You. Close my eyes to anything that would give me the illusion of power, pleasure, or position. May my life remain fully dependent on You, the One who creates all, gives all, and has within Him the power, wisdom, and the right to take it all away.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-12Kings-Instagram-5-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "James 1:5",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nNow if any of you lacks wisdom, he should ask God—who gives to all generously and ungrudgingly—and it will be given to him. —James 1:5\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-6-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 2:4",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a portion of 1 Kings 2:4, when King David reminds Solomon of God’s covenant and the purpose of the kings.\n“If your sons guard their way to walk faithfully before me with all their heart and all their soul, you will never fail to have a man on the throne of Israel.” —1 Kings 2:4\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/4-Kings-1-576x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 12:1-33, 1 Kings 13:1-34, 1 Kings 14:1-20, Ephesians 4:1-6",
        "devo_title": "The Kingdom Divided",
        "devo_summary": "\nBY Claire Gibson\n\nAs far as I know, there were no prophecies about me when I was born. I was one of those blissful “surprise” babies, a child that arrived into the world without permission from her parents. My mother has recounted the tale many times, and I won’t bore you with the details, but needless to say, many “security gates” were jumped in order for me to exist. Today, my mother tells me that, while they might not have thought they wanted me, God knew they needed me. And I believe her. After all, He went through quite a bit of trouble to make sure I got here.\nWhen I sat down to read this long passage in 1 Kings, I was immediately struck by the number of prophecies that are attached to this one family. How did they keep track? And when Rehoboam came to power after his father Solomon died, did he know that the Lord was about to tear his kingdom in two? \nImagine if he had known of the prophecy. Was his ego puffed up by fear, fueled by the prophecies—prophecies that were not in his favor? It would be a deadly mix leading to a whole lot of posturing, pretending to have strength, rather than turning to God to be strengthened by Him. After all, He is the source of all true wisdom and strength. \nRehoboam’s leadership style was vindictive and harsh, perhaps because he assumed that those qualities and that leadership style would translate into strength. Maybe he thought that if he took control of the reins, he could avoid the prophesied loss of power. Instead, his feigned strength led to the exact result he was trying to avoid. After watching his father Solomon rise in wealth and power, Rehoboam was cut down to size. \nWhat does this mean for us? And what does it tell us about God?\nFirst, we must see that God takes His vows seriously. What He says happens. There is no false posturing, no ego, no vindictive stripe in our God. He doesn’t punish in order to prove His power. He follows through on His word, because His word is good and always comes to fruition. Second, we must see that God holds a high standard for His people, one that requires our faith and trust be placed in Him alone. The division and destruction we see in 1 Kings happened because God allows it, but not because He wants it. Instead, He calls us to live “with all humility and gentleness, with patience, bearing with one another in love, making every effort to keep the unity of the Spirit through the bond of peace” (Ephesians 4:2–3).\nGod wants His people to be united as one, and so, the Bible is ultimately a tale of restoration—how one man born of one tiny tribe, Judah, is the true and righteous King. He came not just for Israel, and not just for Judah. He came for the entire world.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-12Kings-Instagram-8-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 14:21-31, 1 Kings 15:1-34, 1 Kings 16:1-34, 2 Samuel 7:14-17, Isaiah 41:28-29",
        "devo_title": "Judah and Israel’s Kings",
        "devo_summary": "\nBY Guest Writer\n\nAt this point in our reading, the nation of Israel is divided into the two kingdoms of Israel and Judah. Both kingdoms and their kings are in political turmoil as they face mounting instability, warfare, revolts, and murder. The kingdoms are also in spiritual crisis. King after king “did what was evil in the LORD’s sight” (1 Kings 15:26). They endorsed detestable idol worship, which emboldened the people to set up poles and stones and high places for pagan gods and to engage in shrine prostitution, along with other evil practices. Verse after verse, we read of people who have forsaken the one true God in exchange for worthless, false gods. \nAs I read of one evil king after another, I find myself hoping that maybe, just maybe, the next one might be faithful. With that in mind, I find myself cheering as I finally read about Asa, King of Judah, a king who finally “did what was right in the eyes of the Lord.” He abolished shrine prostitution, removed idols, and directed his people back to the Lord’s laws and commands. Asa ruled for 41 years and promoted flourishing and peace for most of his reign.\nAsa’s life is a picture of the good, gracious provision of God. His father, Abijam, was not faithful to the Lord, “but for the sake of David, the LORD his God gave him a lamp in Jerusalem by raising up his son after him and preserving Jerusalem” (v.4). In the midst of Abijah’s disobedience, God provided a righteous son who would lead his people. King Asa was a lamp shining God’s light and truth. Finally, a hero in this story!\nEh. Not so fast. In 2 Chronicles 16 we read that toward the end of Asa’s reign, as the northern kingdom was threatening Judah, he faltered and trusted in his own power and plans instead of relying on the Lord. Despite shining like a lamp of righteousness for a time, Asa would not even seek help from the Lord as he suffered at the end of his days. While Israel and Judah’s kings floundered in the face of their commitment to the Lord, He remained true to them, keeping this promise to David: \n“My faithful love will never leave him as it did when I removed it from Saul,  whom I removed from before you. Your house and kingdom will endure before me forever,  and your throne will be established forever” (2 Samuel 17:15–16).\nThe life of King Asa gives us a glimmer of the deliverance that we long for, as well as the realization that it’s futile to trust in kings, or anyone, really—even ourselves. But we sure do try, looking to friends and parents, pastors and employers and political leaders—only to be disappointed, because they stumble and fall and fail too. Though our hope is misplaced, it isn’t pointless; God plants this hope and hunger in us to point us to the King of kings, the ultimate hero, Jesus, who never falters. He is not only a lamp for Jerusalem, but the light of the world (John 8:12).\n\nPatti Sauls lives in Nashville, Tennessee, with her husband Scott and daughters, Abby and Ellie, where they serve alongside the people of Christ Presbyterian Church. Prior to living in Nashville, the Sauls planted churches in Kansas City and Saint Louis and served at New York City’s Redeemer Presbyterian Church. A trained speech therapist, Patti also enjoys serving behind the scenes, hiking with friends, and reading good books.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-9-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 17:1-24, 1 Kings 18:1-46, 1 Kings 19:1-21, Joshua 6:26-27",
        "devo_title": "The Ministry of Elijah",
        "devo_summary": "\nBY Guest Writer\n\nCue the following: a wicked king, a brave prophet, provisions delivered by ravens, a showdown between heavenly powers, and divine fire and rain. Oh, and pass the popcorn, please.\nNo, this is not the plot summary of a Hollywood blockbuster. It’s a battle between idolatry and faithfulness found in 1 Kings. This account certainly doesn’t lack drama. The prophet Elijah has been called by God to confront King Ahab. Idolatry had infiltrated Israel as this unfaithful king promoted the worship of Baal, a pagan god of fertility and rain. \nGod chose Elijah, whose name means “Yahweh is my God,” to be His mouthpiece to His people. But Elijah’s name was also a heads-up, a signal to His uncompromising message: there is only one God, Yahweh, and only He should be worshiped.\nA clear line is drawn as the showdown reaches its climax. Two altars piled high with wood are assembled, and a sacrificial, slaughtered bull is placed atop each altar. One is presented to Baal and the other to Yahweh. Elijah instructs, “Then you call on the name of your god, and I will call on the name of the LORD. The God who answers by fire, he is God” (1 Kings 18:24). The false prophets of Baal call out to their god, shouting, dancing, and working themselves into a frenzy—but not a peep nor a spark comes from Baal.\nThen, to further prove his point, Elijah has his altar drenched with water three times before he humbly prays that God would answer and turn the hearts of the people back to Himself (1 Kings 18:37). Of course, the fire of the Lord does fall, completely incinerating the offering and its altar. But God does more than answer with intense fire; He releases a heavy rain, ending years of drought. The one, true God is revealed. At the same time, the false god of fertility is exposed as impotent, and the false god of storms is all washed up.\nWhat a picture of mercy! After their rejection of Him, God could have brought punishment, but instead He shows compassion. His people had turned from Him, forgotten His love and provision, and abandoned His commands. Yet, God doesn’t turn away, nor is He is silent or indifferent to them. He answers and gathers His people back to Himself. \nIf I’m honest, I can relate; I, too, can work myself into a frenzy seeking action from false, futile gods. I may not dance for Baal, but how often do I bow down to money, image, achievement, reputation, health, or people pleasing? Any and all things can function as an idol, if we place them ahead of God. But don’t be fooled: every idol demands worship, and in the end delivers nothing. God alone should be our source of identity and worth, safety and hope.\nI’m ashamed to admit that in the morning, before my feet even hit the floor, my mind spins with what I think I must accomplish. My anxiety about managing my world revs up. Ignoring God and depending solely on myself is as tempting as hitting the snooze button. I so easily forget God and His commands, promises, and provision. Is it any wonder that my efforts can seem impotent and my plans washed up?\nBut God doesn’t leave me with my head hanging down in shame. Instead of rejecting or abandoning me, He rains down mercy as He speaks to me through His Word and gently turns my face back toward Him. God is not silent, and He does not turn away. \n\nPatti Sauls lives in Nashville, Tennessee, with her husband Scott and daughters, Abby and Ellie, where they serve alongside the people of Christ Presbyterian Church. Prior to living in Nashville, the Sauls planted churches in Kansas City and Saint Louis and served at New York City’s Redeemer Presbyterian Church. A trained speech therapist, Patti also enjoys serving behind the scenes, hiking with friends, and reading good books.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-10-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 20:1-43, 1 Kings 21:1-29, 1 Kings 22:1-53, Psalm 103:20-22",
        "devo_title": "Judgment on Ahab",
        "devo_summary": "\nBY Guest Writer\n\nConfession: I am a people-pleaser, which means I often put people on the throne of my life when, in reality, that is God’s rightful place. I know this truth, but I still fall into worrying about what people think of me, my words, and my actions.\nBut people-pleasing was apparently not much of an issue for the prophet Micaiah, who was perfectly fine with upsetting evil King Ahab—he only wanted to please and honor God. Ahab isn’t too fond of Micaiah’s prophesying, admitting to Jehosophat, “There is still one man who can inquire of the Lord, but I hate him because he never prophesies good about me, but only disaster” (1 Kings 22:8). \nKnowing this to be true, Ahab’s servant “who went to call Micaiah instructed him, ‘Look, the words of the prophets are unanimously favorable for the king. So let your words be like theirs, and speak favorably’” (v.13). The messenger wanted the Lord’s prophet to choose to side with the majority, to make things easy. But to Micaiah, the choice was not his to make. “As the LORD lives,” he says, “I will say whatever the LORD says to me” (v.14).\nAhab called four hundred prophets to assure him he would be victorious in battle—four hundred prophets who had been instructed by a lying, evil spirit to tell King Ahab what he wanted to hear: that he would be successful (vv.20–23). But Jehosophat, the king of Judah who’d been witness to all of this, did not trust them, which is why he’d asked to see “a prophet of the LORD” in the first place (v.7).\nUpon his arrival, “Micaiah told him, ‘March up and succeed. The LORD will hand it over to the king”—a message Ahab doesn’t believe because he doesn’t like the messenger (vv.15–16). And that’s when the Lord allows Micaiah to pull back the curtain to reveal Ahab’s true fate: “You see, the LORD has put a lying spirit into the mouth of all these prophets of yours, and the LORD has pronounced disaster against you” (vv.17,19–23). But Ahab does not listen, and he dies in battle (vv.29–38).\nMicaiah stood against the word of four hundred other prophets. He spoke the truth boldly to Ahab, who hated him. And he declared before them all, “I saw the LORD sitting on his throne, and the whole heavenly army was standing by him at his right hand and at his left hand” (1 Kings 22:19). Micaiah chose to be obedient to the Lord who is enthroned above all kingdoms and rulers, all powers and principalities (Colossians 1:16; Ephesians 6:12; 1:20–23).\nThis is our reality as well, even when we choose to put someone or something else on the throne of our lives, elevating them above Him in our hearts. The truth of who God is does not change. He still graciously pursues us, drawing us into repentance, offering His mercy again and again, even in the midst of our sin (Romans 5:8). The one who has power over all shows compassion to those who fear Him (Psalm 103:12–13). “Bless the LORD, all his works in all the places where he rules. My soul, bless the LORD!” (v.22)\n\nKimberly Girard is a well-loved child of God, wife of an extraordinary man, mother of three amazing kids, and writer living in Pittsburgh, Pennsylvania. You can find her at Loud Singing and on Twitter. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-11-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 1:1-18, 2 Kings 2:1-25, Romans 11:1-6",
        "devo_title": "Elijah in the Whirlwind",
        "devo_summary": "\nBY Erin Davis\n\nWay back in the Garden of Eden, our foreparents enjoyed a fleeting moment of sin-free existence. This meant, among other things, that separation was a foriegn concept to them. Adam and Eve were united with creation, united with each other, and united with their Creator. No sin was present to drive a wedge between their hearts and God’s. Unity was the natural order of things. In contrast, our lives are lived in the fallen world. Painful separations are nearly constant as a result. Sin separates hearts. Sin divides homes. Sin keeps us from Eden, pulling us away from perfect unity with our holy God. \nHere, in 2 Kings 2, Elisha was dealing with separation anxiety. His instincts told him he would soon be disconnected from his predecessor, Elijah. Everyone he met felt the need to confirm these suspicions but Elisha couldn’t seem to bear the thought. “Keep quiet,” he whispered when Elijah’s departure was mentioned (2 Kings 2:3)—as if failure to discuss it could have prevented him from losing someone dear. Every time Elijah tried to pull away, Elisha held on a little tighter. He refused to separate from his mentor one second before he had to. \nElisha must have known Elijah was heaven-bound. After seeing the ways God had used the life of his friend, he surely did not grieve without hope in God’s power and care. Any doubts that Elijah was heading somewhere better surely evaporated when he was taken up on chariots of fire within a supernatural whirlwind (vv.11–12). And yet, even when we know the promises of God to be true, even when we trust He has something more for us, separation stings. We simply weren’t built for it. \nWhen the moment of separation finally came, Elisha cried out, “My father, my father!” (v.12), tore his clothes, and sat down in the dirt, giving outward expression to His deep grief over the loss of Elijah. His words remind me of another moment in Scripture—the moment on the cross when the Son cried out in anguish to the Father:\n“About three in the afternoon Jesus cried out with a loud voice, ‘Elí, Elí, lemá sabachtháni?’ that is, ‘My God, my God, why have you abandoned me?’” (Matthew 27:46). \nJesus uttered these words right before the temple curtain was torn from top to bottom (Mark 15:38), an outward expressions of God’s power and His grace toward us. Jesus knew heaven was near and trusted the power and care of His Father, and yet, what He endured was tremendously painful. For once and for all time, our sinless Savior willingly endured the punishment for sins we deserved so that we might be united with Him again for all eternity.\nYes, this broken world is painful. We’re in good company if we respond with worried whispers and white knuckles when death comes for someone we love. But because of Jesus, separation is only temporary. Through the cross He built a bridge, a way back to Eden’s promise that someday we will be fully united with Christ, never to be separated again.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-12-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "Psalm 103:22",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBless the LORD, all his works in all the places where he rules. My soul, bless the LORD! —Psalm 103:22\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-13-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "1 Kings 18:39",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 1 Kings, a reminder that God is Lord over all.\nWhen all the people saw it, they fell facedown and said, “The Lᴏʀᴅ, he is God! The Lᴏʀᴅ, he is God!” —1 Kings 18:39\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/4-Kings-2-576x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 3:1-27, 2 Kings 4:1-44, 2 Kings 5:1-27, John 4:10",
        "devo_title": "Elisha’s Ministry",
        "devo_summary": "\nBY Erin Davis\n\nIn Genesis chapter 18, the Lord asked the patriarch Abraham this very important question: “Is anything impossible for the LORD?” (v.14). It was a rhetorical question, of course. I doubt that God was expecting Abraham to somehow calculate and answer Him based on some silly human formula. He was, after all, about to give Abraham a baby at the age of one hundred, and then use Abraham’s family line to birth both a nation and a Savior. \nThe answer to God’s question was “no,” of course—nothing is impossible for God. The angel Gabriel came right out with it when he told Mary she would become the mother of the world’s Savior (Luke 1:37). And Jesus Himself relayed the same truth in Matthew 19, “With man this is impossible, but with God all things are possible” (v.26).\nA core belief in God’s unlimited power seems to be the backbone of Elisha’s ministry, a steel rod running through His life that allowed him to pray and serve with remarkable conviction, and with good cause. He had seen a number of astonishing miracles: wicked kings dethroned (1 Kings 22:37), armies consumed by fire from heaven (2 Kings 1:10), his mentor, Elijah, carried up into heaven in a whirlwind (2 Kings 2:11), and unhealthy water transformed into clean water with a pinch of salt (2 Kings 2:21–22).\nOver and over again, Elisha had a front row seat to the power of God. So when the kings of Israel, Judah, and Edom commanded him to bring forth water from a dry ditch, Elisha’s faith was automatic, when he responded, “This is an easy thing in the LORD’s sight” (2 Kings 3:18).\nMaybe, like me, you’re tempted to compare notes with Elisha, to explain away weak faith with all you haven’t seen. True, I’ve never seen an army consumed with fire from heaven, and I haven’t watched anyone ride a whirlwind up to heaven. But I’ve seen the goodness of the Lord in the land of the living (Psalm 27:13). I’ve seen Him heal. I’ve felt His comfort. I’ve been transformed by His grace. \nWhen faced with the impossible, I press in to this truth: the greatest indicator of what God will do is what He has already done. He is a God who does not change, the healer who keeps healing, the deliverer who keeps delivering, and our Savior who keeps saving. \nGo on. Look around your life. Do you see the dry places where you need God’s Spirit to move? Dare to ask the angel’s question, “Is anything impossible for the Lord?” The answer is in every moment of goodness and mercy He has already shown you. May you pray with renewed confidence knowing that, whatever your need is, it is an easy thing in the Lord’s sight. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-15-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 6:1-33, 2 Kings 7:1-20, 2 Kings 8:1-15, Deuteronomy 6:10-12",
        "devo_title": "Elisha’s Ministry Continues",
        "devo_summary": "\nBY Guest Writer\n\nWar, murder, and unthinkable tragedies are all a part of today’s reading. Yet even in the face of horrific evil, we see the Lord providing. From recovering an axe head to providing food to a starving people, the Lord provides again and again. The atrocities we see in the world around us, or even in our own hearts, can sometimes blind us from seeing the Lord at work on our behalf. But it is in the especially difficult seasons and situations that we need to pray, as Elisha did, that God would open our eyes to all the ways He provides for us.\nRecently, a good friend shared how, over the course of several weeks, she had prayed for eyes to see the ways the Lord provides for her family—and how He did just that, abundantly so. Her faith encouraged me to pray that the Lord would also open my eyes to see how He provides for my family. And it was unbelievable! He graciously revealed all the big and small ways He works to supply us with what we need, how He has been providing for us all along. In big and small and unexpected ways, I began to see that His provision was all around us—even in the form of a canceled baseball game that freed us up to enjoy a rare, unrushed afternoon.\nGod is in the details of our lives, just as surely as He was in the details of Elisha’s life. The prophet clearly saw the Lord’s provision, and He wanted his servant to see it too. \n“Then Elisha prayed, ‘LORD, please open his eyes and let him see.’  So the LORD opened the servant’s eyes,  and he saw that the mountain was covered with horses and chariots of fire all around Elisha” (2 Kings 6:17).\nWhen we are able to see beyond our myopic perception of the world—free to behold the reality of God’s glory and majesty, sovereignty and grace—that is a gift from Him. All Elisha did was humbly ask for God to open the servant’s eyes, to let him see God’s power in that moment, as it really is. \nSome days we may see huge, miraculous provision from Him, like those Elisha saw. Other days, we may see what seem like smaller glimpses of Him at work, and sometimes, we may be called to lean in to the promise of His presence. And on those days when we cannot see His provision at all, we are free to approach the throne of grace with confidence (Hebrews 4:16) and ask our Father to open our eyes, remembering that His ultimate provision for us is His Son, our Savior, Jesus Christ, who said, “Don’t be afraid, little flock, because your Father delights to give you the kingdom” (Luke 12:32).\n\nKimberly Girard is a well-loved child of God, wife of an extraordinary man, mother of three amazing kids, and writer living in Pittsburgh, Pennsylvania. You can find her at Loud Singing and on Twitter. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-16-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 8:16-29, 2 Kings 9:1-37, 2 Kings 10:1-36, Psalm 72:1-20",
        "devo_title": "Attempts at Reform",
        "devo_summary": "\nBY Maria Furlough\n\nHow does it make you feel to hear someone blame God when bad things happen? Or when you find something difficult to understand or accept in Scripture—how does that affect you? For me, so many conflicting thoughts, theories, and perceptions can seep into my heart, creating doubt that threatens to weaken my faith. This is what I thought of when reading through today’s passages, when God calls Elisha to anoint Jehu as Israel’s king.\n“This is what the LORD God of Israel says: ‘I anoint you king  over the LORD’s people, Israel. You are to strike down the house  of your master Ahab so that I may avenge the blood shed by the hand of Jezebel— the blood of my servants the prophets and of all the servants of the LORD’” (2 Kings 9:6–7).\nI am so grateful that we know the context of all that came before this! Reading through 1 and 2 Kings, I am often reminded of why God’s story needs to be read straight through and in its entirety. Out of context, some pieces of the story do not fit, and can even seem to conflict. But with the whole story, we see God working in and through all things, which strengthens our hope in a powerful God, who is who He says He is and does what He says He will do. We see through the entirety of Scripture that God gives His people ample opportunities to reform, warning them that should they not repent and turn back to Him, the outcome will not be good. Still, they don’t always listen. \nBut rest assured, when God says something will happen, it will happen. In 2 Kings 9:22, King Jehu goes to Jezebel to fulfill what God predicted through the prophet Elijah fourteen years earlier (1 Kings 21:23–24). And so when Jehu obeys God’s command to kill Jezebel, who brought about “so much prostitution and sorcery,” his actions were “[fulfilling] the LORD’s word that he spoke through his servant Elijah the Tishbite” (2 Kings 9:36).\nThe God we serve is mighty and just. He cannot be overthrown and will not be mocked, yet He is gracious to give us fair warning as to where our sinful choices will ultimately lead us. Though these verses describing violent scenes might cause us to squirm, may we instead rest our eyes on our Savior, whose death and resurrection have brought us redemption and hope through His own blood being shed. These passages point to our need for salvation, our need for Jesus.\nThe God of Israel is the one “who does wonders… the whole earth is filled with his glory” (Psalm 72:18–19). Jehu trusted this, despite not fully understanding what God was doing. He knew that when God calls, you answer that call. When He commands, you obey. Through the difficult, uncomfortable, and hard-to-explain things of this life, may our devotion and zeal for the Lord sustain us in all situations (2 Kings 10:16).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-17-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 11:1-20, 2 Kings 12:1-21, 2 Kings 13:1-25, Psalm 125:1-5",
        "devo_title": "Further Attempts at Reform",
        "devo_summary": "\nBY Maria Furlough\n\nYes! The Israelites finally figured it out! God’s people are finally back in step with Him, and everything looks so promising (2 Kings 11:17). No more altars to worship Baal, no more Jezebel. Instead, a king has been appointed who will listen to instruction from the Lord’s priest. Israel has changed its ways! \nWe long for the complete demolishing of idolatry to be true in our own lives. Our very spirits grieve knowing that we were created for perfect unity with God, yet our sinfulness continually gets in the way. Like us, Israel doesn’t keep it together for long. “Throughout the time the priest Johoiada instructed him, Joash did what was right in the LORD’s sight. Yet the high places were not taken away; the people continued sacrificing and burning incense on the high places” (2 Kings 12:2–3). God’s people held on to just a few of their old ways. The Israelites wanted to serve God, but they wouldn’t do it fully. Old cultural habits would seep in and distract them and pull them away from worshiping the one true God. \nAt the onset, it’s tempting to judge the Israelites for their failures. We can look back and see all the ways God has proven Himself faithful. We see all the times they were warned about coming judgment and consequences, and we stand shocked at their perpetual disobedience. But are we really so different from them?\nIf I’m honest, sometimes I like a side dish of God while I leave the main course of my life to idol worship. I give my main allegiance to the high places I build up to worship such things as physical attractiveness, success, health, comfort, control, security, money. My altars may look different, but they still push God to the side. Still, God is faithful, even when I am not.\nGod never left Israel. Through all their division, defiance, and death, God always stayed true. He didn’t give up on them, and He will never give up on us. Despite their philandering hearts, “the LORD was gracious to them, had compassion on them, and turned toward them because of his covenant with Abraham, Isaac, and Jacob. He was not willing to destroy them. Even now he has not banished them from his presence” (2 Kings 13:23).\nAt times we may become discouraged—sad that our world, our culture, our church, our neighborhood, or our school will never get it “right.” This sadness is right and good, because in our sorrow, we are agreeing with God that all is not as it should be. God knows this world is broken, and He knows us inside and out. He still loves us and always will. He pursues us with relentless passion. It is because of God’s determinate love that we have unstoppable hope. “Those who trust in the LORD are like Mount Zion. It cannot be shaken” (Psalm 125:1). Yes, we should be diligent in tearing down any altars that threaten to lure our affection away from Christ—they all have to go—but our ability to trust in the Lord is sustained by Him alone. God’s story for Israel does not end in 2 Kings. It is only a part of God’s eternal love story with His people. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-18-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 14:1-29, 2 Kings 15:1-38, Ezekiel 37:1-14, Luke 5:32",
        "devo_title": "Flawed Kings and Kingdoms",
        "devo_summary": "\nBY Kaitie Stoddard\n\nEvery fall I get the strange urge to flip on a football game. Not because I particularly like, or even really understand, football. But because there is something cozy about a game playing in the background as I consume cheese-filled dips and nod off on the couch. Growing up, my family was into football, so I guess it brings a sense of familiarity. As one who doesn’t follow the sport with any real investment, I tend to cheer for whichever team is predicted to lose. There is just something compelling about an underdog. When all the odds are stacked against them, nobody believes they can pull it off. And yet, seemingly out of nowhere, they can make an interception and turn the whole game around in their favor. It’s not only the unexpected excitement of a good underdog story that I love, but also the perseverance of the team that I admire. \nThe Bible is full of underdog stories. One of the greatest underdog stories in the Bible is the story of Israel. God chose to perform His mightiest acts through a small, obscure people. In choosing to bless the world through the descendants of Abraham, the Lord backed the underdogs. Not the wealthiest or most powerful, Israel was ruled by broken rulers. Why would God choose this group of people? Perhaps so there could be no doubt about whose saving power was at work. \nDuring the reign of the wicked king Jeroboam son of Jehoash, the people were suffering, and “there was no one to help Israel” (2 Kings 14:26). God showed mercy to the Israelites because He had made a promise. And when God makes a promise, He does not break it. The Lord promised to preserve His people, so He saved them by the hand of their broken leader. It looked like they would meet their demise, but by the power of the Lord, the dry bones of Israel were given new life (Ezekiel 37:1–14).\nThis story should give us confidence in what the Lord has called us to. No matter what circumstances you may be facing, if the Lord has called you to a mighty work, He will see it through. You may feel like the underdog, with all the odds stacked against you, but you’re not in this fight alone. No, you have the great High King in your corner, and He cannot lose. You may be questioning the call God has placed in your heart, asking, Why would God choose me? But like Israel, God does not bestow His favor on those who are worthy, but on those whom He loves.\n“Let us not become weary in doing good,” but hold on to our hope in the Lord, continuing to fight the good fight (Galatians 6:9). God has the power to breathe new life into our bones, so me must drink deeply of His Spirit. In the end, we have nothing to sweat because Christ has already defeated death, and we will rise victorious by the power of His resurrection. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-12Kings-Instagram-19-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "Psalm 72:18–19",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBlessed be the LORD God, the God of Israel, who alone does wonders. Blessed be his glorious name forever; the whole earth is filled with his glory. Amen and amen. —Psalm 72:18–19\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-20-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 8:19",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for 2 Kings, a reminder of the Lord’s faithfulness to His people.\nFor the sake of his servant David, the Lᴏʀᴅ was unwilling to destroy Judah… —2 Kings 8:19\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/4-Kings-3-576x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 16:1-20, 2 Kings 17:1-41, Proverbs 29:2, 1 Peter 2:21-25",
        "devo_title": "The Fall of Israel",
        "devo_summary": "\nBY Kaitie Stoddard\n\nMy first year of college I was blessed with a Southern roommate. We became the best of friends, but it wasn’t without some cultural clashes. One such example was when we stayed up late into the night debating the value of grits versus oatmeal, to the dismay of our third roommate. That year, I visited my friend’s childhood home over Thanksgiving break, and that is when my Yankee eyes were truly opened to the strong influences of the South. Surrounded by sweet tea, I found myself effortlessly adopting a phrase I’d sworn off completely: “y’all.” Not two weeks earlier, I’d argued, “It’s not even a real word!” Yet there I was, sounding as if I’d always been a Southern belle. \nIt’s a silly example of a larger principle. If we’re not careful, we can easily change our beliefs to fit our surroundings. This was certainly true for the Israelites. God established His covenant with them and taught them the right way to live, but they adopted the false gods of the nations they had defeated. They worshiped the idols around them even though they knew the one true God. The Lord warned them to turn back to Him through “every prophet and every seer” but they would not listen (2 Kings 17:13). And ultimately, God allowed them to become captives so they could realize their captivity. \nThere is a warning for us in this story—the question is whether or not we will heed it. We are all aware that today’s culture worships many idols: from financial status to career achievement, personal beauty to perfect-looking families. These things become idols when we bow down to them in worship. When we hang our happiness on their outcomes instead of turning to God for true joy. \nIf we’re really honest with ourselves, I’m guessing every one of us will find we struggle with some idol or another. None of us are perfect, and by the blood of Jesus, there is grace for that. But what should really scare us is that we so easily make the same mistakes Israel once made, when they “followed worthless idols and became worthless themselves” (2 Kings 17:15). \nIf we get so wrapped up in chasing the American Dream or building our social media platforms, we might look up one day and realize we’ve wasted our lives. We might find that we were only giving lip service to God, while giving actual power to much lesser things. Although the false gods of our culture don’t have literal golden shrines, they are very real and very seductive. And like Israel, we are at risk of ignoring the warning and willingly enslaving ourselves to idols that will never satisfy.\nLet’s not wait for the Lord to issue us a painful wakeup call before we turn back to Him. Let’s not waste weeks, months, or even years of our lives chasing idols that leave us wanting. Instead, may we listen to the warning from our God and direct our worship to Him. He alone can satisfy. He alone is good. “Let anyone who has ears listen” (Matthew 11:15). \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-22-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 18:1-37, 2 Kings 19:1-37, Numbers 21:4-9, Isaiah 9:6-7",
        "devo_title": "Hezekiah’s Prayer",
        "devo_summary": "\nBY Kaitlin Wernet\n\nI remember waking up at night when I was a little girl and feeling the heat of a Florida summer in my grandparents’ house. Tiptoeing down the hallway that held childhood photos of my mom, her siblings, and a painting of Jesus (we’d always joke that He was the favorite child), I’d sneak into the bathroom for a sip of water, only to realize the adults were still awake. Quietly scurrying down the hallway and pausing where the carpet met the hardwood floors of the living room, I’d hide behind the entryway and listen in. \nMy Grandmother and Papa were almost always reading the Bible aloud to each other, taking turns reading chapters and nodding heads. Then, they’d bow their heads in prayer. I always felt an urge to leave when this happened, feeling that it was too intimate of a moment to secretly witness, but I was also extremely curious. What did adults talk about after the kids went to bed? What do they ask God for?\nSometimes I feel the same way when I read prayers in the Bible, and Hezekiah’s is no exception. He’d already declared, “Today day is a day of trouble” (2 Kings 19:3, NLT), and he was in deep mourning after receiving a report that confirmed the enemy’s dedication to to the destruction of Jerusalem. But as we read this account and get to peer into how someone else handles the darkness, there are two things that stand out.\nFirst, Hezekiah doesn’t sugarcoat his situation. He doesn’t ignore how bad it is or try to find the silver lining right away. He is in trouble, and he is honest about it. Second, he immediately takes it to the house of God. He doesn’t spend time strategizing solutions or wondering, Why me? He doesn’t try to clean up the situation before he invites God into the mess of it. \nGod does not call us to deny our circumstances, nor does He ask us to sit in them alone. The words of Hezekiah’s prayer weren’t as important as the act of his asking. The same goes for us when we want to take note of the eloquent phrases our loved ones use in prayer, or when we feel like we don’t have any words left. Prayer is not a one-sided speech; it is an ongoing invitation to conversation with God. May we approach our own prayers in the darkness in the same way. May we see them as an opportunity to invite God into our daily lives and ask Him to intervene on our behalf. And may we pursue God in prayer, seeking to glorify Him and acknowledge His goodness, even when both seem hidden to us. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-23-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": " 2 Kings 20:1-21, 2 Kings 21:1-26, Proverbs 11:2, John 14:13-14 ",
        "devo_title": "The End of Hezekiah’s Reign",
        "devo_summary": "\nBY Kaitlin Wernet\n\nSometimes I joke about writing a memoir called, Parking Lots I’ve Cried In. Now that I think about it, it will have to be a picture book, full of maps, graphs, and infographics like, “The bowling alley parking lot where I got in my first fender bender,” “The church parking lot where my high school boyfriend dumped me,” and “The grocery store parking lot where I bought and ate an entire cookie cake after a bad day.”\nAs you’ve probably gathered, these instances weren’t planned, nor were they content set-ups for my future bestseller. The last thing I want is to cry in public, but I usually can’t hold in my tears until I’m behind closed doors. (Incidentally, one of my friends recently taught me that forcing yourself to rhyme—lime, crime, time, etc.—can distract your brain enough to stop you from crying.) I don’t want to feel myself crying, and I definitely don’t want anyone to see my tears. \nOf course, most of the things we cry about are those we’d want to forget entirely, not write in a memoir. That was the case of Hezekiah when he became very ill, and while he prayed facing a wall (instead of in a parking lot), we can see that he, too, was in a very vulnerable position. In 2 Kings 20, we read the words of his prayer: “‘Please, LORD, remember how I have walked before you faithfully and wholeheartedly and have done what pleases you’” (v.3). And then he wept bitterly, and honestly before God. \nHezekiah’s prayer points to the old covenant, in which God blessed His people in response to their faithfulness to the covenant. In his most desperate time of need, Hezekiah asks God to validate whether or not he is worthy to approach the throne and ask for healing. And It’s easy to believe that this is the takeaway of Hezekiah’s story, that “good people” deserve good things. I don’t know about you, but that hasn’t always been my personal experience. \nThe most important part of this story isn’t Hezekiah’s healing, his ultimate death, or the end of his reign. It’s that under the new covenant, we no longer have to question our standing with God, because in Christ Jesus, we have been justified. Jesus died in our place so that, by placing our trust in Him, we could gain eternal life (Romans 6:23). \nThe Lord said to Hezekiah, “This is what the LORD God of your ancestor David says: I have heard your prayer; I have seen your tears,” (2 Kings 20:5). Because of Jesus’s work on the cross, the same God who acknowledges our every sorrow, is now present with us in all things (Psalm 56:8; John 14:15–31). Thanks be to God for all the ways He teaches us about our original sin under the old covenant, so that we may fully know the gift of His Son under the new covenant.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-24-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 22:1-20, 2 Kings 23:1-37, 2 Corinthians 5:21, Galatians 3:13-14",
        "devo_title": "Covenant Renewal",
        "devo_summary": "\nBY Rebecca Faires\n\nHas anyone ever told you were were “too much”? I am such a shameless enthusiast that I often quietly remind myself to just calm down. Case in point: a few years ago I needed a juicer. But I couldn’t afford the one I wanted—nay, needed. Luckily I found one on Craigslist. Joy of joys! After exchanging about ten thrilling and delightful messages with the seller, out of the blue he hit me with this: “I am thinking there’s a game going on here. It would be better if you stopped emailing me, because you’re making this too hard. I won’t respond to you any more.”\nI blew the deal! All my overly enthusiastic nonsense pushed him away. Yes, it’s possible he wasn’t interested in hearing what I was planning to juice and for whom. Naturally, this wasn’t enough to deter me, so I asked my husband to reach out as a totally unrelated prospective buyer. They easily arranged the sale, and as my husband paid, the juice man confided, “You wouldn’t believe the crazy people I’ve had to deal with on Craigslist over this juicer!” To which my husband shook his head, “Don’t I know it.”\nMaybe I should calm down about juicing delicious fruits and vegetables and reserve my zeal for something that truly merits all my energy, but what if there were an appropriate reason to be “too much”? King Josiah would probably not be very popular today; in his day, some might have called him a fanatic. The kings of Judah before him just allowed the country to drift along in the idolatry of their neighbors. What’s more, even the kings that followed him fell back into the same pattern.\nBut the words of the Lord were real to Josiah, and he took them seriously. Josiah knew he had fallen deep into the idolatry of the world. The Word of God, like a two-edged sword (Hebrews 4:12), pierced Josiah with conviction and roused in him a zeal that may be foreign to many of us. Consider how fiercely and fervently he repented. If the Lord’s anger burned against it, Josiah was ready to smash it—idols, altars, towers, temples. He brought that same zeal to the whole of his kingdom, destroying every false idol and every false prophet in the land. He was a fanatic, and I think it’s safe to assume that many thought he was “too much.”\nBut look at the commendation he received from the Lord: “Before him there was no king like him who turned to the LORD with all his heart and with all his soul and with all his strength according to all the law of Moses, and no one like him arose after him” (2 Kings 23:25). Do you see it? He isn’t chided for overbearing zeal or reminded to calm down. Instead, he is lauded for keeping what Christ declared the first and greatest commandment: “Love the Lord your God with all your heart, with all your soul, with all your mind, and with all your strength” (Mark 12:30). The first and greatest commandment is the territory of all us. And is this what it means to love the Lord with all your heart, mind, and strength—to give all your energy to the destruction of idols and the defense of God’s words? \nWhat if Josiah’s zeal wasn’t too much? What if it was the only right response to the conviction of God’s Word? The first and greatest commandment is the summation of the whole law of God, and it is this very commandment that Christ bids us to keep without wavering. Many of us live without much zeal, and some of us direct our zeal toward things that don’t matter. Instead, we should yield our hearts, all our enthusiasm—our heart, soul, mind, and strength—to the unchanging Word of the Lord. Go ahead and be “too much” for Him.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-25-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 24:1-20, 2 Kings 25:1-30, Joshua 5:10-12, John 2:19-22",
        "devo_title": "Jerusalem Destroyed",
        "devo_summary": "\nBY Rebecca Faires\n\nAt the breakfast table this morning, I overheard a four-year-old eagerly explaining the key to getting what he wants: “I just ask, and ask, and ask, and ask until Mama says yes.” Okay, it was my four-year-old. And I usually do give in to him after he has asked seven times. Tired isn’t even the word for how this makes me feel. His simple solution to getting what he wants is actually a really terrible solution. What I want to teach my kids is this: ask, learn, and then obey. Let’s just say that his commitment to setting up his own standard of what is right and wrong is why he still has to take a nap every day.\nWe ask God questions all the time. And if we don’t like the answer we get, we ask, and ask, and ask, and ask again. But here’s the thing: God doesn’t get squishy and worn out and depressed about life situations—He is unchanging. So the hilariously pushy methods that sometimes work on parents (and teachers and bosses) don’t change eternal truth. We can’t insist on getting our own way with Him. In a culture that is driven by individualistic self interest, we are lured to believe the opposite—that we can choose what is right.\nBut the wages of sin is death (Romans 6:23). And even though God loved Judah, He sent them into exile and allowed Jerusalem to be destroyed (2 Kings 25:21). These same events are recorded in the book of Jeremiah. As one of the Lord’s prophets, Jeremiah warned Jehoiakim, who warned Jehoiachin, who warned Zedekiah—and he witnessed the judgment God brought against each of these kings. But folly came after folly, and they didn’t listen. \n“You have seen all the disaster I brought against Jerusalem…  because of the evil they committed to anger me…  So I sent you all my servants the prophets time and time again, saying,  ‘Don’t commit this detestable action that I hate.’  But they did not listen or pay attention; they did not turn from their evil” (Jeremiah 44:2–5).\nLike children, we want our own way and don’t want to listen. But we are called to heed God’s ways and His words. Don’t accept a sham when the truth is available to you. We don’t have to pretend to be Christians; we are His children. Jerusalem was on the road to destruction because they refused to listen to the Lord and instead substituted their own truth for the truth of God’s Word. \nBut we must be of good hope, because God does generously give us His answers and teach us about His ways and His character through Scripture. Listen today and pay attention. Why push your own truth forward when eternal truth is available to you? Write His words on the tablet of your heart and when you are in need—or busy or scared or overwhelmed or somehow “squishy” and not at your best—they will stay with you (Deuteronomy 11:18).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-12Kings-Instagram-26-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": " 2 Corinthians 5:21",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nHe made the one who did not know sin to be sin for us, so that in him we might become the righteousness of God. —2 Corinthians 5:21\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/SRT-KINGS-Instagram-27-1024x1024.jpg"
    },
    {
        "book_title": "1 & 2 Kings",
        "devo_passages": "2 Kings 19:27",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse from God’s reply to King Hezekiah through the prophet Isaiah in day 23, a reminder that God is intimately involved in the lives of His people.\n“But I know your sitting down, your going out and your coming in, and your raging against me.” —2 Kings 19:27\nFind the corresponding memory card in the back of this book.\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/10/4-Kings-4-576x1024.jpg"
    }
]