[
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 1:1-11, Deuteronomy 30:1-5, Deuteronomy 30:11-15, Hebrews 7:25",
        "devo_title": "My Prayer to the God of Heaven",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Nehemiah 1:1-11, Deuteronomy 30:1-5, Deuteronomy 30:11-15, Hebrews 7:25\nBack in 2014, when the She Reads Truth community was not quite two years old, Raechel and I felt called to something unexpected and, frankly, a little terrifying. Feeling a kinship to Nehemiah and his call to rebuild the walls of his city to establish a safe place for his people to gather and worship, we believed the Lord laid it on our hearts to build a Bible app with our Shes—a place for them read Truth together, every day. As that app was being built, the community read Nehemiah—some with the very first She Reads Truth study book in hand. \nToday, four years later, we are reading Nehemiah together once again. \nThe Lord has done remarkable things in this community of Bible-readers in those four years. So many women have opened their Bibles for the first time—or for the first time in a long time—and have kept coming back, day after day. Together, we’ve approached God’s Word again and again as days and weeks have stretched into months and years. And together, we’ve marveled at what we’ve found: God is still faithful, and His Word is still true. \nWhen Nehemiah heard that Jerusalem’s walls had been destroyed and her gates burned to the ground, he was devastated. As he wept for his home and his people, he did the one thing he knew to do: he sought the Lord. With prayer and fasting and confession, Nehemiah petitioned the Lord on behalf of Jerusalem. He declared God’s goodness and recalled God’s faithfulness. He spoke the Lord’s promises  back to Him, believing those promises to be true while also petitioning the Lord to act on them. \nNehemiah longed for his city to be restored, and we can guess from the gumption we’ll see from him in later chapters that he felt a fire inside to bring about that restoration with his own two hands. But before he put a hand to a hammer, he bowed his knees in prayer. In his humility we see a truth confirmed throughout Scripture: any sense of calling we have, even those directly related to our faith in Christ, rests on the strength, sovereignty, and grace found only in Him. Any good work is God’s work. He invites and equips us to participate in it, which we do by faith in Him, not in ourselves. \nAs we read this Old Testament narrative together over the next three weeks, we’ll see how God indeed called Nehemiah to lead the rebuilding of Jerusalem’s wall. But today, as we read this prayer from a broken man for his broken city, may we, too, begin with prayer and confession. Let’s declare God’s goodness and recall His faithfulness. Let’s speak His promises back to Him, knowing that He has both fulfilled them and is fulfilling them right where we are. \nMay the Holy Spirit teach us more about God the Father and Christ the Son as we read this book together. And may God give us strength and courage for whatever work He puts before us—both the grand endeavors and the single acts of faithfulness—to the honor and glory of His name.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day1-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 2:1-10, Psalm 137:1-9, Hebrews 12:18-24",
        "devo_title": "The King Sent Me to Jerusalem",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Nehemiah 2:1-10, Psalm 137:1-9, Hebrews 12:18-24\nHave you ever been so worried you couldn’t do your job? You’re supposed to be watercolor painting, but all you can think about is the outcome of your mom’s surgery? Or you’ve tried to be present in a classroom full of third graders, but you can hardly see their faces because all you can think about is the broken heart of your sister? Beyond even these pains, have you ever felt a burning passion that you might be called to something else while you must continue to intone, “Thank you for your purchase, have a nice day”?\nI imagine this is how Nehemiah felt as he worked in the service of King Artaxerxes. He had a great job, but while working, he heard really terrible news from Jerusalem: The walls are down! The gates are burned! Our people are living in shame! (Nehemiah 1:3). This news was heartbreaking for him. \nThe first thing Nehemiah did was pray. But then he went back to work. For about four months, he showed up to work every day and did his job, not saying a word about his own personal bad news, even though his heart ached. It’s shocking how the world mercilessly grinds forward in spite of our personal griefs. Regardless, sometimes we just have to show up and keep on doing our work.\nDuring this time Nehemiah prayed continually and earnestly. And even though he hadn’t breathed a word of his personal anguish to the king, the king saw it written on his face and reached out to him, saying, “Why are you sad?” Nehemiah then confessed his heartbreak, to which the king immediately asked, “What is your request?” (2:2,4).\nAnd here is a wonderful moment. The very thing he had longed for—a chance to get exactly what he needed to rebuild Jerusalem—appeared right in front of his nose: a king ready to hear his request, with all the power of the Persian empire in his hands. What did Nehemiah do? Rush in with his five-year plan? Build a case to woo the king’s heart to support his passion project? No. None of that. The first thing Nehemiah did was pray. As my pastor, George Grant, would say, “Instead of running to the throne of the world, [Nehemiah] runs to the throne of the Lord.”\nNehemiah was a man committed to prayer. And once he had prayed, he was a man ready for hard work. He asked the king to send him to rebuild the city and a people. By trade, Nehemiah was a white collar palace worker; he attended the king and brought him wine. He wasn’t a city planner, and he didn’t have experience rebuilding walls. But God had called him to rebuild a city, and Nehemiah was a willing worker.\nWhether he was working for the king in Persia or rebuilding his homeland in Jerusalem, Nehemiah worked for the Lord. This can be such a difficult and painful thing to do. As the psalmist cries out, “How can we sing the Lord’s song on foreign soil?”(Psalm 137:4). How can we continue to praise the Lord when things are terrible, when everything has gone spectacularly wrong? How can we obey when obedience is the furthest thing from our hearts? By continually turning to the Lord in prayer. \nBefore we decide what to do: pray.\nBefore we do it: pray.\nAfter we begin: pray.\nIn this manner, our relationship with God is written on all the hours of our days. May we learn to humble ourselves before Him and submit our requests to Him, instead of bowing to the powers of this world. May our lives become a song of prayer unto the Lord.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day2-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 2:11-20, Isaiah 62:8-12, Ephesians 2:19-22, James 2:14-26",
        "devo_title": "We Prepared to Rebuild the Walls",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Nehemiah 2:11-20, Isaiah 62:8-12, Ephesians 2:19-22, James 2:14-26\nAsk any of my friends and they will tell you this: I am terrible at the game of Jenga. It’s the one with wooden blocks stacked tall and intricately as a puzzle of sorts, criss-crossed in a stack that begs to remain unbroken. And yet, that is exactly the point of the game: taking turns slowly choosing just the right block to strategically remove, all while keeping the tower standing and intact. The first few rounds include some easy takeaways, but as the blocks continue to be removed the chances of the tower tumbling increase. And trust me, you do not want to be the one choosing the wrong block, causing the tumble, and ending the game. \nMany days, it feels as if tragedy is looming and pain is just around the corner. Afraid, we don’t want to be the one to make our joys tumble into sadness, or witness our hopes disintegrating into ruin. No one wants to fall.\nJerusalem’s wall fell. Torn down and destroyed by fire, the walls and gates surrounding Nehemiah’s beloved city whispered a disgraceful story of shame and abandonment. Like standing beside a spilled tower of blocks, Jerusalem was filled with nothing but past memories and lost hopes. That is, until Nehemiah showed up with plans only God could have laid on His heart: \n“You see the trouble we are in. Jerusalem lies in ruins and its gates have been burned. Come, let’s rebuild Jerusalem’s wall, so that we will no longer be a disgrace” (Nehemiah 2:17).\nWhile we fear destruction and are anticipating all the ways we could mess things up, God has already planned restoration. Where we stand in ruin, He sees new creation. \nUnfortunately, I have a hard time remembering this truth when I’m in the midst of painful circumstances. And every time I choose the wrong Jenga block, so to speak, I vow to never play again, wondering what I could have done differently to avoid pain. The thought that doesn’t cross my mind so easily is this: rebuild. I don’t see the point in stacking the blocks up again, only to fall once more.\nBut rebuilding is not an afterthought to God. Restoration and redemption are His priority. By God’s mercy, He allows our eyes to see glimpses of the restoration plan and invites our hands and hearts into the work. Nehemiah trusted in the good work God was doing through him, even when he could not yet envision the final product. He knew the God of the heavens would grant them success (v.20).\nA new wall for Jerusalem meant much more than one more round of Jenga. The rebuilt walls protected a temple, creating a safe and sacred space for worship. In the same way, our God is always building us up to know and adore Him more. This is true restoration. Thanks be to Him.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day3-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 3:1-32, Romans 12:3-8, Psalm 8:1",
        "devo_title": "We Began Rebuilding the Walls",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 3:1-32, Romans 12:3-8, Psalm 8:1\nSummer 2017 was a doozy for hurricanes. We could hardly flip on the television or open Twitter without seeing brutal images of destruction, people desperate for power and food, and endless press conferences from emergency officials. In Houston and Florida and Puerto Rico—the storms came in vicious waves.\nWhen the storms stopped, aid rushed in from all corners. The money came from donors big and small, celebrities and ordinary people alike. Houston Texans defensive end JJ Watt raised millions of dollars for recovery in Houston. Celebrity chef José Andrés and his non-profit cooked more than three million meals for people without power in Puerto Rico. Alongside many of his famous friends, Lin-Manuel Miranda—creator and star of the Broadway musical Hamilton—recorded a song for Puerto Rico and dedicated the profits to relief efforts.\nHouston and Puerto Rico are still recovering, and it will take decades to rebuild them both. I don’t want to assume the efforts of these varied groups of people allow us to tie these devastating events up with a pretty bow, or draw moralistic and clichéd conclusions about how disasters bring people together. These aren’t joyful barn raisings; they are the direct result of tragedy.\nWe see the same in the book of Nehemiah. Jerusalem was burned and pillaged by the Babylonians. God’s people had repeatedly turned away from Him, and they were displaced, their homes destroyed. But when the time came to return and rebuild, a diverse group of people banded together to do the work.\nIn Nehemiah 3, the author records at least 43 distinct groups or named persons who rebuilt the gates and the walls around Jerusalem. They were all types of people: the high priest Eliashib (v.1); the Tekoites (v.5); the daughters of Shallum, who was the son of the ruler of half of Jerusalem (v.12); Hashabiah, who was the ruler of his own district (v.17); temple servants (v.26); goldsmiths and merchants (v.31).\nThey were rulers and servants, men and women, tradesmen and priests. The work knew no distinction between rich and poor, the same way the tragedy of the exile touched every person in Israel and Judah. Tragedies flatten. They knock down walls and homes indiscriminately, across class, race, gender, and age. And when it comes time to rebuild, the work falls on everyone as well.\nNehemiah 3 is a story, not just a list of who did what while rebuilding the gates. It’s a story of a broken people finding their way home again, and then laying aside titles, traditional roles, and expectations to build the walls around their city. Not unlike the body of Christ the apostle Paul describes in Romans 12, those who rebuilt Jerusalem’s walls worked as one body with many parts (v.4).\nAnd while Nehemiah 3 isn’t really our story, one of the beautiful gifts of the gospel is that it is for everyone. We are all flattened by sin, by the tragedy of the fall. But rather than each of us doing the hard, back-breaking work of redeeming and rebuilding our own hearts, our story has a different ending. No matter how hard we work, whether individually or together, we cannot fix sin. Instead, we all have to rely on the power and work of one person alone: Jesus Christ. \n Thanks be to God!\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day4-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 4:1-23, Genesis 28:15, Ephesians 1:18-23",
        "devo_title": "We Kept Rebuilding in Spite of Opposition",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 4:1-23, Genesis 28:15, Ephesians 1:18-23\nIn my second year of college, I flunked out. Well, maybe not “flunked out,” but I was definitely placed on academic probation. I couldn’t take classes at the university for a full year. Humiliated and miserable, I returned home to wait out my year off. I took that year very seriously. With the help of a coach, I learned the value of delayed gratification and self-governance. It was the hardest work I’d ever undertaken, and that hard work paid off when I returned and graduated.\nA few years later, I decided I wanted to get healthy. Eating well and exercising were more challenging than I’d expected, and there were several times I wanted to give up. But each time I felt overwhelmed, I remembered the hard work of teaching myself to self-govern and to delay immediate gratification, and how those skills had earned me a diploma. Remembering these things spurred me on toward health. \nIn Scripture, the command to “remember” certain things is common. The Israelites were instructed to remember God delivered them from slavery in Egypt (Exodus 13:3), and they were charged with committing the law to their memory (34:27). Similarly, the New Testament church was instructed to remember the victorious work of Christ on the cross through observing holy communion (Luke 22:7-19). It seems that “remembering” is the bridge that connects the past to the future—a present action that recalls the past and serves to propel us into our future. \nThe author of Nehemiah is recounting an experience during the rebuilding of the wall, when the circumstances of the present seem to be overwhelming the promise of the future. External forces were devising a plan to obstruct the building of Jerusalem’s walls. The opposition first tried to plant seeds of doubt. They hurled taunts and ridicule as the Jews were beginning their work, yet the Jewish builders persisted. But when they were about halfway through, the naysayers decided to destroy the work. \nUnderstandably, the prospect of battle put fear in the hearts of the Jews who were working, and they began to doubt. Nehemiah assessed the danger and found that it was indeed very real. And so he told the workers to outfit themselves with the accoutrements of battle, and he directed them to “remember the great and awe-inspiring God” (Nehemiah 4:14). \nAnd remember they did. They remembered the battles previously fought and won with Jehovah as their commander-in-chief, and they prepared to fight to protect their wives, their children, and the future of their holy city, Jerusalem. The remembering brought them strength—not just strength to arm themselves, but strength to continue the work. \nToday, I’m encouraged to continue the work God has called me to, remembering His faithfulness in my past. The opposition of my present circumstances might be a very real threat—funky finances, a broken relationship, systemic injustice—but today I choose to remember the character and promises of the God I serve. \n“Look, I am with you and will watch over you wherever you go. I will bring you back to this land,\nfor I will not leave you until I have done what I have promised you.”\n—Genesis 28:15\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day5-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Psalm 8:1",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nLORD, our Lord,\nhow magnificent is your name throughout the earth!\nYou have covered the heavens with your majesty.\n—Psalm 8:1\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day6-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 2:17",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for the book of Nehemiah.\nSo I said to them, “You see the trouble we are in. Jerusalem lies in ruins and its gates have been burned. Come, let’s rebuild Jerusalem’s wall, so that we will no longer be a disgrace.”\n—Nehemiah 2:17\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/4-Nehemiah-1-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 5:1-19, Exodus 22:25, 2 Corinthians 8:9",
        "devo_title": "I Stood Against Social Injustice",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 5:1-19, Exodus 22:25, 2 Corinthians 8:9\nI’m no bargain hunter when it comes to shopping and did not inherit whatever gene it is my grandmother and mother and at least three of my brothers seem to have. I want and weigh and debate and discuss until finally I buy at full price. There is one place, though, where I have no problem hunting for bargains: my standing before God. \nIt seems I’m always being measured and measuring myself up against the standards of others, and therefore, against the standard of God. Unconsciously, I list my good deeds against my less than good deeds and, finding myself short, try to make it up to God. \nI’ll be more faithful here.\nI’ll give more of myself there.\nI’ll be a better friend here.\nA better wife there.\nI’ll be quick to say I’m sorry here.\nAnd I’ll be slow to take offense there.\nSurely the scales will be weighed and I’ll not be found wanting?\nSurely my generosity must count for something?\nWhat I love about Nehemiah chapter 5 is that while Nehemiah is a man who is known and loved by God and loves Him in return, somehow he still feels the need to present his list of good deeds before God. It’s as if he is a small child who’s come in from a long day of playing outside to then dump out the contents of his pockets and present them as treasures before his father.\nI found this rock and this stick.\nLook at this leaf and this frog.\nI played with this boy and then we built this fort.\nCome see it…\nAnd instead of ignoring or rebuking the child for distracting him, the father delights in the boy’s account. This child is not earning the love of his father; he is simply overflowing with the gift of who and what he is—a child, about the work of being a child, doing the things a child does, and certain in the love of his father.\nIt is not a bargain Nehemiah is on the hunt for here. He’s not listing his deeds to God in order to gain His approval. He knows who he is and what he is called to do: rebuild the walls of Jerusalem and call the people to repentance. It is not scales on which Nehemiah lays the goodness of his deeds—it is for the delight of his Father. \nWe know that as children of God, our “good deeds” are like filthy rags before the goodness of Christ (Isaiah 64:6). We are fully covered in the sacrifice of Christ’s death; therefore, we can no more justify our good deeds or count our bad ones against us. Jesus’ work on the cross is complete, as is our justification through Him (Galatians 2:16).\nSo since we are children of God, as we go about our lives today, let’s not tally mark our good deeds or our  bad ones, but instead be about our Father’s business, being faithful with what He has called us to today. And at the end of the day, whether we’re tempted to feel self-sufficient and justified or ashamed and unworthy, based on what we did or did not accomplish—let us instead empty our hearts before the Father and show Him the treasures of a life lived in faithfulness for our joy and His glory.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day8.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 6:1-19, Isaiah 9:6-7, Jeremiah 23:5-6",
        "devo_title": "We Completed the Wall",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 6:1-19, Isaiah 9:6-7, Jeremiah 23:5-6\nWhether it’s creeping doubts or, in the case of Nehemiah, a determined band of enemies with names like Sanballat (boo!), the work that Christ has for us rarely goes unopposed. \nAs I consider the ways God has used His Word to call me to serve and go and share, I am bolstered by Nehemiah’s tenacious faithfulness. Though his opponents sought to distract and discourage him, Nehemiah stood firm. His eyes were on the prize. His mission was God’s glory. His feet were firmly planted in the idea that he was building something bigger than himself. When his enemies accused him of plotting a coup to take the throne, Nehemiah simply sent this message:\n“I am doing a great work and I cannot come down” (Nehemiah 6:3). \nHis words have the power to equip and encourage us. As we minister, as we obey, as we ask God to shape us into the image-bearers we were made to become, the voice of the enemy will continuously ring in our ears. But we do not have to listen. Christ is doing an important work in us, after all. There’s more to see. Nehemiah is pointing us toward something bigger. \nFast forward nearly 500 years past the construction of Nehemiah’s wall. Jesus, our Savior, hangs on a cross. Just like Nehemiah, Christ’s enemies accused Him of vying for a human throne. A sign carved by hatred was placed above His head, declaring sarcastically, “This is Jesus, King of the Jews” (Matthew 27:37). Sanballat, Tobiah, Geshem, and the rest stood at the base of Nehemiah’s wall and hurled insults. \nChrist’s accusers stood at the base of the cross and did the same. \n“He saved others; he cannot save himself. He is the King of Israel; let him come down now from the cross, and we will believe in him” (Matthew 27:42). \nJesus didn’t flinch. He didn’t rush to His own defense. He didn’t climb off the cross and put His opponents in their place, though He certainly could have. His eyes were glued to the Father, and His mission was our salvation. With His actions Christ was, in essence, declaring, “I am doing a great work and I cannot come down.”\nNehemiah rebuilt the temple walls, and Jesus rebuilt the temple. Nehemiah stayed the course until the wall was finished, and Jesus stayed on the cross until the veil was torn. Nehemiah couldn’t have known it, but he was declaring the gospel with his life and work. Because Jesus was not deterred by His accusers, we can declare the same.\nI reckon Nehemiah would tell us there is no cost to count when compared to the privilege of pointing to Jesus. And through His death, Jesus declares there is no cost too high to pay in order to ransom us. With the gospel as our grid, we can stay the course, embracing Christ’s words as He reminds us, \n“If anyone wants to follow after me, let him deny himself, take up his cross daily, and follow me.\nFor whoever wants to save his life will lose it,\nbut whoever loses his life because of me will save it” (Luke 9:23-24).\nPick up your cross. Tune out the enemy. Let’s keep building.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day9-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 7:1-73, Exodus 28:29-30, Psalm 34:19-22",
        "devo_title": "The Exiles Came Back Home",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Nehemiah 7:1-73, Exodus 28:29-30, Psalm 34:19-22\nYES! Genealogies!! Who needs stories when you can just cozy up with a good list of who begat whom, am I right? I bet you love them just a little bit too. I mean, who hasn’t gotten the chills from the genealogy at the end of Ruth, when you realize she fits right into the line of Judah and became the great grandmother of King David? That list prompts the realization that God had a plan for our sweet Ruth all along. Genealogies show us God’s sovereign plan for our salvation and His intimate love for individual people.\nWhen Nehemiah arrived in Jerusalem, he needed to do more than stack bricks and hang gates; he needed to rebuild a people. These people were born into exile. They had never actually seen Jerusalem. They’d only heard stories about it. All they knew was life without a home, without traditions, and without community. They had nothing. So as Nehemiah began to rebuild Jerusalem, he also had to learn how to rebuild a people. And each one of those people mattered. \nThis genealogy in Nehemiah chapter 7 is a list of the Israelites released by Cyrus from exile in 538 BC. It’s a wonderfully meticulous list that even includes the number of mules that moved back to the city (there were 245). More importantly, it tells us a lot about who these people were, and how much people matter to God. In verse 7, twelve leaders are listed, and those twelve are representatives of the twelve tribes—showing us that they’re not just a part of the covenant, but are once again whole and entitled to the full blessings of God’s covenant promises.\nEach family’s descendants are also counted. Some families were massive (Senaah had 3,930 descendants!), and some families’ reunions were more modest (Beth Azmaveth had only 42). Regardless of how large or small, they were counted as families and not all heaped together, because individuals and families matter to God.\nPriests, Levites, musicians, and gatekeepers were also counted, indicating that our callings matter to God. Temple servants are listed using their foreign names because they were not Hebrew-born, having joined with Israel through conversion to their God. Because God redeems the lives of His servants (Psalm 34:22), He makes them equal inheritors of the covenant with those who could trace their lineage all the way back to Abraham.\nAnd finally, there were some who searched the records but were unable to discover their heritage because their families had been so torn apart by the exile. These, too, are listed, and their value is not diminished. Children born into captivity are valued just the same, regardless of their parentage.\nFrom there, the people settled back into their towns and began to knit their lives together. That’s as close as we get to “happily every after” in the book of Nehemiah. But in reading this book, we see that God’s eye is always on His people, restoring not just a broken city, but a broken people as well. He cares about each one of us, our families, our homes, and our lives. And if we are in Christ, we are co-inheritors of His covenant blessings just as much as any son of Abraham. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day10-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 7:73, Nehemiah 8:1-18, Romans 1:16-17, 2 Timothy 3:16-17",
        "devo_title": "Ezra Read God’s Law to the People",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 7:73, Nehemiah 8:1-18, Romans 1:16-17, 2 Timothy 3:16-17\nDo you remember the first time you understood a crucial part of the gospel? The day something just clicked? You knew the words of it one day, but in that one moment you understood the absolute truth of it. For me one of those “Aha!” moments happened when I came to understand the Bible wasn’t primarily a book about me, but rather a book about God. \nThat may seem silly to some. It may be something every Sunday School kid armed with The Jesus Storybook Bible already knows. But for me, as a 30-year-old woman, it was astounding to realize that my entire life I had read the Bible one way, when it was intended to be read an entirely different way. It changed everything for me. It made the gospel come alive to me. It made Scripture come alive to me. It made Jesus come alive to me. \nBut it also made my sin more real to me. \nI was rejoicing because this book held the words of life, but I was weeping because this book also showed me my sin. It wasn’t just a book about how if I did good things, good things would happen in return for me. It wasn’t just a book of stories about that “nice man” Jesus. It wasn’t a book that held the key to getting an eternity with God. It was a whole book that had to be believed in its entirety—even the really hard bits.\nI imagine this is how the Israelites felt when the book of the law was read to them. The weightiness of all the ways they couldn’t measure up were read clearly to them so the people could understand it fully. And as we would expect, they wanted to mourn and weep, because who could keep a law like this one? But look what Nehemiah says to them—and to us, who still sometimes buckle under the weight of a law fulfilled: \n“Do not grieve, because the joy of the Lord is your strength” (Nehemiah 8:10).\nThe same strength given to those who did not yet have full understanding of God’s redemptive plan is given to us today when we understand the full weight of Scripture, our sin, and the Savior’s sacrifice. The joy of the Lord is our strength when under the weight of conviction and in the midst of mourning our sin. \nThe joy of the Lord, the goodness of His sovereign plan and His deep love, His careful attention and His unmerited mercy—these are why we can rejoice in the face of what seems terribly, terribly hard, irrevocably broken, or unattainably high. We can trust in the joy of the Lord.\n\nLore Ferguson Wilbert is a writer, thinker, and learner. She blogs at Sayable, and tweets and instagrams at @lorewilbert. She has a husband named Nate, a puppy named Harper Nelle, and too many books to read in one lifetime.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day11-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 9:1-37, 2 Corinthians 1:20-22",
        "devo_title": "Our Nation Confessed Our Sin",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Nehemiah 9:1-37, 2 Corinthians 1:20-22\nThe last thing you want after a long week away is a bad ride home from the airport. But that’s where I found myself last week, hailing an Uber ride from the arrivals entrance. A frequent traveler, I typically enjoy these modern-day “cabs.” The driver who came to pick me up late that night was kind and hospitable, hoisting my luggage into the trunk and respecting my lack of desire to make small talk. Like I said, it had been a long week, and I was grateful for the relative quiet.\nMy ride home from the airport should have been simple—one I could probably drive with my eyes closed. That’s why I noticed the two U-turns, the missed stop sign, the turnaround in a grocery store parking lot, and the driver who became increasingly silent. Maybe I should have spoken up sooner, but when I finally asked, “Where are we?” it was because I already knew the answer: we were lost. Very, very lost. The driver had missed the intended destination entirely. \nThe word “sin” comes from the idea of failure, “the act or state of missing the mark.” I confess that every time I sin, I am acting out of my humanity and turning my heart away from my Father. I turn away from the intended place He has created for me: living in His presence and in relationship with Him. In day-to-day life sin can become much more than just my actions; it can begin to feel more like my permanent residence. \nLike the embarrassed apology my driver made when we finally made it home, returning to the reality of my sin always makes me feel ashamed. But in Nehemiah 9, we have an opportunity to reframe this together, watching as the children of Israel gather together to confess their sin. However, instead of being driven by guilt, they are empowered by celebration. Just days after the feast of the tabernacles, one of the most joyful parties they’d ever had, they paused to realign their hearts with God’s—not because they were hurt or afraid, but because they were thankful.\nIt is a grace that God “[acts] faithfully, while we have acted wickedly” (Nehemiah 9:33). It is a gift that He keeps covenants, even when we do not. At the intersection of our lack and His goodness, may we return to Him, remembering and cherishing what it is to be considered His. All promises are “yes” in the Savior who calls His wandering children home, again and again (2 Corinthians 1:20).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day12-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Romans 1:16-17",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor I am not ashamed of the gospel, because it is the power of God for salvation to everyone who believes, first to the Jew, and also to the Greek. For in it the righteousness of God is revealed from faith to faith, just as it is written: The righteous will live by faith.\n—Romans 1:16-17\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day13-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 6:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a prayer for continuing to do the work God sets before us.\nBut now, my God, strengthen my hands.\n—Nehemiah 6:9\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/4-Nehemiah-2.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 9:38, Nehemiah 10:1-39, John 14:15, Hebrews 4:15",
        "devo_title": "We Promised to Be Faithful to God",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 9:38, Nehemiah 10:1-39, John 14:15, Hebrews 4:15\nFind me managing a tantrum in the middle of the bread aisle and I might sing a different tune, but I want more from my children than blind obedience. I don’t want them to toe the line based strictly on fear of consequences. Our home is not a police state, after all. I want my children’s obedience to reflect the condition of their hearts, for their actions to be a response to the love and care they’ve been given. \nAs I consider my role in the family of God, I know the Father wants the same from me. As an unbeliever, I couldn’t work up the oomph to care much about what God said about how I should live. At best, He seemed like an aloof father figure, and at worst, an unreasonable tyrant. Like a toddler determined to have her own way, I rebelled. \nAs a new believer, I swung the pendulum of obedience to extremes. I wanted to obey all the rules, do all the right things, avoid all the wrong ones. I saw God as a hyper-attentive helicopter parent. I lived in constant fear of disappointing Him. But I’ve been walking with Christ for twenty years now, and a beautiful shift has transpired. Much like what happened with my earthly parents as I hit my mid-twenties, I want to please God—not because of fear of consequences, but because He is so clearly worthy of my unequivocal devotion and respect. Rather than being motivated by fear, my obedience has become the way I say “thank you” for all He has done for me. \nHere, in Nehemiah 9-10, we see God’s people growing up, maturing. They’ve been through a rebellious phase, and it has cost them dearly. In the eras preceding Nehemiah’s day, God’s people saw Him as an oppressive and unreasonable Father, and their warped view of Him fueled generations of rebellion. But because He is a loving Father, He graciously gathered them together again. He reminded them of His expectations and gave them another chance to get it right. They looked around at their scattered tribes, their rubbled city, their fallen comrades, and their perspective shifted. \nGod is good.\nHis ways are best.\nRebellion leads to destruction.\nFor all of chapter 10, God’s children declared what they would and would not do in response to God’s love. We’ve heard it all before, but the tone is different here. Just like the children I tuck into bed every night, they would not obey perfectly, but their hearts had changed. For the first time in a long time, they wanted to obey their Father. In all things, they were determined to “not neglect the house of God” (Nehemiah 10:39).\nLove and obedience are tied together with a sacred cord. That’s why Christ cut to the chase with these words: “If you love me, you will keep my commands” (John 14:15). Author Paul David Tripp puts it this way: “Obedience is not what gets you grace. It’s the evidence that grace has gotten you.” Belief leads to obedience, because when we see who God really is, we want to live like He asks us to. It is our loving response to the God who is Love.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day15-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 11:1-21, Deuteronomy 7:9, Hebrews 11:13-16",
        "devo_title": "We Resettled Jerusalem",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 11:1-21, Deuteronomy 7:9, Hebrews 11:13-16\nTwo summers ago, one of my best friends went to Greece. He didn’t go to see the Acropolis or the Parthenon, or to eat feta and olives by the handful. Instead, he spent several months on the island of Lesbos tending to thousands of refugees who had flooded there from war-ravaged Syria.\nHe sent pictures of little children, of lines of people waiting for blankets and clothes, of tents, of towers made of life jackets used to keep people afloat after their lifeboats sank. And he sent one picture of a fence post with these words scribbled across it, a holy graffiti: On earth as it is in heaven.\nEvery text, every story, every picture made me catch my breath and whisper a prayer. If you search online for his camp, you see headlines with words like “trapped” and “welcome to prison,” “horrific” and “languishing.” A few months after he left, his camp burned to ground. Tears flow as I write this, just thinking about it.\nThe people of God were hardly strangers to displacement. I hesitate to pull a direct parallel to the refugees from Syria, because in reading Nehemiah 11 we see a cautious return to their forsaken home. The Syrian refugees haven’t had that yet (and may not), and it feels odd to use them as an illustration here without being able to do something to ease the tragedy of their situation. But I believe we have to sit in that together, and feel the unease and discomfort.\nWe know that God’s people felt the pain of being dispersed during the exile. They were torn apart from their families, and they watched their cities burn. But now, at the end of Nehemiah, Jerusalem was ready. The walls were strong again. And yet, the people didn’t come willingly.\nNehemiah 11:1-2 tells us that they had to cast lots to decide who had to live in Jerusalem. They blessed the people who volunteered to live there. Why? Because Jerusalem would be the target of all of Israel’s enemies. John Wesley described the situation so poetically in his commentary on Nehemiah, saying, “This city was the butt of all the malicious plots of their enemies.” The return to David’s holy city wasn’t marked by a parade, by triumphant singing, or by celebration. It was marked by trepidation, a slow and careful entrance into the city that God had given them once again.\nI can imagine the Israelites were tired, limping across a finish line that still didn’t seem ideal. They were home, but they still had only the Lord to keep them safe. They knew the walls of Jerusalem had been burned once, and they could be burned again.\nLike the Israelites, we are still seeking a safe haven, a homeland. We, too, serve a God who is preparing a city for us—a heavenly city, where there will be no need for walls to protect us because we will dwell with God in perfect peace forever (Hebrews 11:16).\nThese promises from God remind me of the hymn “Guide Me O Thou Great Jehovah.” It is the mournful cry of a pilgrim people who know that one day, we will be home.\nWhen I tread the verge of Jordan,\nbid my anxious fears subside.\nDeath of death, and hell’s destruction,\nLand me safe on Canaan’s side.\n…\nLand me safe on Canaan’s side,\nbid my anxious fears,\nbid my anxious fears goodbye.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day16-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 11:22-36, Nehemiah 12:1-26, Isaiah 48:1-11, Philippians 3:18-20",
        "devo_title": "The Priests Served Us",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 11:22-36, Nehemiah 12:1-26, Isaiah 48:1-11, Philippians 3:18-20\nAs a child in elementary school, I was always scared to read aloud in class. It wasn’t because I was a bad reader. In fact, I always read a bit faster than everyone else, skipping ahead to read a paragraph or two before the rest of the class. But even still, I was constantly nervous I would say something wrong or lose my place in the reading, and as a result, make a fool of myself if called on by the teacher. \nIt’s easy to get lost in this passage from Nehemiah 11 and 12, because it’s full of the names of people and places that are hard to read and even harder to pronounce. It’s also easy to acknowledge that there are a lot of names, decide they’re too difficult to pronounce, and then skip ahead to the more interesting part of the story. \nBut names are important. The names in this passage are the names of the priests who came back to live in Jerusalem. At the time, Jerusalem wasn’t exactly the hip, new place to live. It was dangerous to the point that the people had to cast lots to see who would go back and build their lives there. The names of these priests listed in Nehemiah 11 and 12 are the priests who took the risk, voluntarily or not, because the people moving to Jerusalem needed priests too. \nThese lists tell us more than just who these people were; they tell us where they came from, their history. There is a lot of interest nowadays in finding out more about your ancestry. You send in a sample of your DNA, and some laboratory sends you back a full report of your global ancestry. Human nature leans toward wanting more knowledge, more information, which is probably why these kinds of tests have become so popular. We just want to know what we want to know. \nThese lists of priests serve a similar purpose: to help future generations of priests know where they came from. When we know where we come from, it’s easier to know what we’re moving toward, to take a glimpse at the bigger picture. But our full understanding of where we come from lies in the knowledge and belief of this truth: our citizenship is in heaven (Philippians 3:20). \nOur most important family name is the one given to us as children of God. We are His sons and daughters, and He is our Father. We belong to Him. He is our ancestry. He is our past, present, and future. Our citizenship and our family name rests fully with Him, and Him alone.\n\nEllen Taylor was born and raised in sweet home Alabama, but has called Nashville home since 2013. When she’s not working as the editorial assistant at She Reads Truth, you can find her enjoying good food and good conversation with her friends and family. She is a lover of iced coffee, ugly dogs, and the Oxford comma. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day17.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 12:27-47, Hebrews 13:15, Revelation 19:1-8",
        "devo_title": "We Dedicated the Wall",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Nehemiah 12:27-47, Hebrews 13:15, Revelation 19:1-8\nI love parties. Love them. Any excuse to celebrate is good enough for me. New baby, new job, new spouse, new house, renovated house, new car, reupholstered car, birthday, anniversary, church holiday, national holiday—doesn’t matter. I’m here for the celebration. There’s something special about gathering with a group of people for a purpose that isn’t work-related, where the only objective is to have a great time. I have to admit, I’ve walked past a group of strangers having a party at a restaurant and secretly wished I could take part in their merry-making. \nIn reading today’s passage, I was happy to see I’m not the only one who likes to have a good time. When the wall was completed and the time came to dedicate the fruit of their labor to the Lord, the Jews held nothing back—and they were well within their rights! “On that day they offered great sacrifices and rejoiced because God had given them great joy” (Nehemiah 12:43). \nThe wall had been rebuilt despite external threats and internal fatigue. And chile, if those folks didn’t rejoice! There were choirs and cymbals and harps and singers rocking the house with their jubilant praise. The people sang and offered sacrifices to God with great joy—praise that was heard far and wide.\nIt’s a sincere prayer of mine today that I would learn to look on achievements, victories, and answered prayers with that same exuberance. I don’t want to look back on an answered prayer and think, Welp! I’m glad that’s over with! and quickly rush on to other matters. I want to see every triumph for what it is: a victory won by my great and glorious God. I want to take time to honor God by celebrating His works and plans and victories well.\nAnd Scripture tells us the Jewish people did just that, rejoicing like wild over a wall. They lifted a resounding praise that neighboring cities could hear because of a wall. To those other cities and nations, rebuilding a wall might have been an insignificant accomplishment, maybe something to jot down in a history book for posterity’s sake, but nothing major. But for the people of God, the rebuilding of the wall meant something. \nIt meant increased protection from enemies who would try to conquer Jerusalem.\nIt meant that their God hadn’t forsaken them, even though they’d sinned against Him.\nIt meant that He still dwelt in their holy city and would continue to fight for them.\nI’m assuming that, after years in exile, that kind of knowledge was life-giving and joy-fueling for God’s people. I imagine it continued to bring them joy as they remembered it years later. This passage makes me want to do the same, to consider and reconsider God’s hand in my life, to look again and again for His goodness and power at work on my behalf. It also makes me want to learn how to celebrate—really celebrate—those victories, achievements, and even (seemingly) unanswered prayers in such a way that my joy can be heard far and wide.  \nBecause if my joy can be seen or heard coming from a mile away, my neighbors and friends will start to wonder, What’s she so happy about? Which may just lead to, How can I have the kind of joy she has? And when asked, I can confidently point them to the great and glorious God who gives me the victory in Him, again and again and again.\n\nErin Rose lives and works in vibrant Richmond, Virginia, where she serves as Worship & Teaching Pastor at East End Fellowship.  She is a graduate of the University of Virginia, and is currently enrolled as a graduate student at Gordon-Conwell Theological Seminary.  Erin is a member of Urban Doxology, a ministry that is writing the soundtrack of reconciliation for the church. Her greatest joy lies in leading God’s people in authentic worship, and teaching them the truth found in God’s Word. She also enjoys eating delicious food, spending time with loved ones, and indulging in the occasional Netflix binge.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day18-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 13:1-31, John 14:2-3",
        "devo_title": "Remember Me, My God",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Nehemiah 13:1-31, John 14:2-3\nThe Tower of London was built around the year 1000 AD, and it still stands on the banks of the Thames River today. But a castle that old needs tending to keep looking good, no matter how many famous ravens live there. The regular maintenance is never finished, and every task, once complete, needs to be done again every 75 years. The old castle is never really “finished.” It’s just going through its stages of the 75-year upkeep plan.\nWhen Nehemiah returns to Jerusalem, the walls are still standing, but the people have fallen apart. They have forgotten who they are and what God has called them to do. It’s so discouraging after the celebration and commemoration ceremonies in the previous chapters. We all want a happy ending for these people who worked so hard and endured so much.\nOn this side of heaven, things will never be perfect. Because of the curse of sin, we will always struggle. But there are three things I think we can learn about the gospel from this passage.\nFirst, notice what Nehemiah does before he lets his righteous anger fly. He gathers the whole community and reads the book of Moses. I think it’s safe to say that he read the Pentateuch—at the very least, the Ten Commandments, and at the most, he sat them down for hours and read the whole thing. Either way, before He brings them to justice for breaking God’s law, he reminds them of God’s law. He establishes their common ground. When we are struggling, we must return to God’s Word to remember who we are and to whom we belong.\nSecond, remember that Nehemiah is a man of prayer. He prayed before he even answered the king. He is a steady and continuous man of prayer. While he brings judgment to the people, he keeps stopping to pray. He cries out: “Remember me for this, my God, and don’t erase the deeds of faithful love I have done for the house of my God and for its services… look on me with compassion according to the abundance of your faithful love” (Nehemiah 13:14, 22). It’s clear that prayer is an integral part of Nehemiah’s actions. When we find that we are inadequate, when things have gone wrong, we must turn to God in prayer.\nFinally, let’s notice that even Nehemiah, the guy who is known for prayer and Scripture reading, couldn’t get it perfectly right. He was a great leader and a true man of God, but he still wasn’t able to create a perfect city. He couldn’t totally stamp out corruption. He couldn’t get people to follow the rules. The people fell into the same sins that sent them into exile in the first place, and Nehemiah couldn’t fix them.\nChrist is the only One who can complete the work. He changes hearts, He mends families, and He is making all things new. We are called to read His Word, submit ourselves to prayer, and realize that no matter how dedicated or good we think we are at self-maintenance, we cannot achieve a perfect utopia. We can barely keep the Tower of London from falling down! So we ought to do the work He has called to do, and rest in Christ who is the only One who can truly call a task finished.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day19-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "2 Corinthians 1:20-22",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor every one of God’s promises is “Yes” in him. Therefore, through him we also say “Amen” to the glory of God. Now it is God who strengthens us together with you in Christ, and who has anointed us. He has also put his seal on us and given us the Spirit in our hearts as a down payment.\n —2 Corinthians 1:20-22\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/SRT-Nehemiah-Shareimage-Day20-1.jpg"
    },
    {
        "book_title": "Nehemiah",
        "devo_passages": "Nehemiah 13:22",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week’s verse is a reminder of God’s grace and compassion. \nRemember me for this also, my God, and look on me with compassion according to the abundance of your faithful love.\n—Nehemiah 13:22\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/4-Nehemiah-3-1.jpg"
    }
]