[
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 1:1-2:36, Jeremiah 7:12-14, Luke 1:46-55",
        "devo_title": "The Birth of Samuel",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: 1 Samuel 1:1-2:36, Jeremiah 7:12-14, Luke 1:46-55\nI listen to film soundtracks while I work because they somehow help me feel connected to the world of words where I spend my days. The sweeping scores are fuel for my fingers on the keyboard, providing a level of focus and intensity I’m not sure I could achieve in silence. \nIn the same way that music brings words to life on my computer screen, the books of 1 & 2 Samuel lend new vibrancy to my reading of Scripture. These ancient words were breathed out by God and remain “living and active” (Hebrews 4:12). Even so, I forget. I can read the words yet fail to see the story. \nThis is the story of an eternal King and His eternal kingdom. The epic battles and legendary tales found in 1 & 2 Samuel wake me up to a reality that’s as true for me as it was for David: our God reigns. \nThe books of 1 & 2 Samuel tell the stories of Samuel, Saul, and David—three broken heroes used by God to establish a kingdom for His people. Samuel was the revered last judge, Saul the impressive first king of Israel, and David the flawed poet-warrior. But beyond the page-turning adventure of kings and battles and political gamesmanship, these books tell the story of a greater King. The life of David, his defeat of Goliath, and the epic victories of his mighty men all point to the coming of Christ—the true and forever-reigning King.\nAnd where does it all begin? With the desperate prayers of a heartbroken woman named Hannah. \n“Deeply hurt, Hannah prayed to the Lord and wept with many tears. Making a vow, she pleaded, ‘Lord of Armies, if you will take notice of your servant’s affliction, remember and not forget me, and give your servant a son, I will give him to the Lord all the days of his life…’” (1 Samuel 1:10-11).\nI read Hannah’s story and I see myself—not because our struggle is the same, but because our hearts are. Like Hannah, I long for what this imperfect life on earth does not give. Like Hannah, I want to be known and remembered by my God. And while all my prayers to Him are not answered with a “yes,” they are heard and I am known. I am remembered. Just like Hannah. \n“My heart rejoices in the Lord;\nmy horn is lifted up by the Lord.\nMy mouth boasts over my enemies,\nbecause I rejoice in your salvation” (1 Samuel 2:1).\nFirst Samuel begins with a beautiful picture of a heart bowed in earnest before the Lord of all creation, asking for what only He can give. And while all the stories in this study will not be quite so tender, they all point to the same reality. The Lord of Hannah—and Samuel, and Saul, and David, and Israel—is the Lord of you and me. He reigns throughout all generations. \nI pray our five weeks in 1 & 2 Samuel bring this truth to life for us as we read, ushering us into the knowledge of the truer kingdom and truest King. In Jesus, God has given us the only King who can satisfy our desire for protection, provision, and peace—a King whose throne cannot be defeated.\nOur King and His kingdom are forever. Thanks be to God. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-12Samuel-instagram1.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 3:1-21, 1 Samuel 4:1-22, Psalm 78:58-66, Acts 4:23-31",
        "devo_title": "Samuel’s Call",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 3:1-21, 1 Samuel 4:1-22, Psalm 78:58-66, Acts 4:23-31\nCalling is rarely simple. I know this from my own life, but I’ve observed it in the lives of others as well. \nSeveral years ago, I sat down with women from several different seminaries to ask them why they were going into ministry. These interviews were part of my doctoral research in which I explored the experiences of women and personal calling. For most, their stories were complicated and full of self-doubt. Their calling didn’t necessarily make sense to them. It was a huge risk or a financial sacrifice. As a result, some had resisted the call, while others had rejected it outright. But for nearly all of them, their story of calling was neither simple nor clear.\nToo often, we assume calling is straightforward. If it’s really from God, there shouldn’t be any confusion, right? And yet, most biblical stories of calling are complex. Samuel’s is no exception. Three times the Lord called Samuel, and three times Samuel failed to recognize God’s voice. It was the fourth time, and only after receiving wise counsel from Eli, that Samuel finally came to recognize and answer the voice of the Caller (1 Samuel 3:10).\nThis is tremendously comforting to all of us who are discerning a call. After all, Samuel heard the literal voice of God, and still he was confused! This tells me that uncertainty, fear, and doubt do not negate the validity of a calling. Instead, they are the norm. In Scripture, nearly every person called by God for a task initially felt afraid, unqualified, or unprepared for the task. Few are the stories of confident leaders who trusted God without pause.\nSo, how do we discern God’s calling when it’s unclear? In their  commentary on 1 & 2 Samuel, J.D. Greear and Heath Thomas highlight four key obstacles to discernment: inexperience, expectation, unwillingness, and sin. Samuel was inhibited by the first two; he didn’t know the voice of God, and he wasn’t expecting to hear it. For some of us, it’s our own sin that blinds us; we’re too committed to our own security and comfort.\nNo matter the obstacle, Samuel’s story points to one great help in our discernment: wise counsel. Without Eli, Samuel might’ve circled the house twenty times that night, hearing the call but never recognizing it. Thankfully, Eli explained what was happening. Not only did he recognize God’s voice and know His ways, but he also named Samuel’s calling and instructed him on how to respond.\nThe women I interviewed reported similar counsel from pastors, parents, mentors and friends—individuals who were able to help them name their gifts, pointed them to Scripture, and encouraged them to boldly trust God. This is a blueprint for us all: it’s always best to discern God’s leading in the context of Christian community.\nThe good news is, our God is a pursuer. Over and over again, He called out to Samuel, and He does the same with us. God repeatedly beckons us in big and small ways until we hear and respond to Him. And all the while, He sends us the help of His Church, His Word, and His Spirit as guides. He does all this because no one is more committed to our God-given calling than the One who issues the call.\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She is a regular contributor to Propel, blogs at SheWorships.com, and her first book releases in October 2017.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram2.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 5:1-12, 1 Samuel 6:1-21, Exodus 10:1-2, Leviticus 5:14-17",
        "devo_title": "The Ark of the Covenant",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: 1 Samuel 5:1-12, 1 Samuel 6:1-21, Exodus 10:1-2, Leviticus 5:14-17\nI imagine the cassette tape is the kind of thing that will make my grandchildren’s eyes grow wide. They will giggle at these long gone, barely imaginable pieces of technology that have been replaced by something that is faster, smarter, and better. It will be to them what my own grandparents’ stories of their first radios and 45 records were to me.\nI could tell them how my brother and I used to make recordings of our favorite songs when they came on the radio, one of us pressing play on our tape recorder at exactly the right moment while we sat there, silent and completely still, for the entirety of the song. Despite our best efforts, these recordings always seemed to consist of muffled versions of our favorite tunes, featuring the sounds of our breathing and restless fidgeting. \nOur most beloved cassette tape not only included the theme from Raiders of the Lost Ark, but also the static of the television we recorded it from. We could never seem to get it right, but at the time, it was worth it for the chance to carry our favorite tunes with us, playing them over and over again.\nI can’t read about the Philistines carrying the ark with them without getting that same theme song stuck in my head. Of course, I could now easily pull the song up online to hear the track clearly and without distraction, but I like my crackly, static version just fine.\nIf I’m honest, I’m still easily persuaded that I can break God and His glory down into “good enough” pieces of religious comfort—pieces I can carry with me. The Philistines seemed to think this, too. The problem is, we’re not the ones in charge of the carrying.\nThe ark, roughly four feet long, was gold-plated and carried on poles that hung through rings on its sides. It was holy, created to house the tablets of the Ten Commandments and serve as a representation of God’s covenant with His people. As we read these passages together, we can all agree that things get pretty weird, right? Dagon, Ashdod’s idol-god, falls onto the ark, and then the city is afflicted with tumors (1 Samuel 5:6). Somewhere along the way, the Philistines began to believe they could move the ark however they pleased, that all of God’s goodness could be contained in a four-foot-long box.\nI wonder what kind of boxes we carry with us today. Maybe it’s containing God to a specific place or restricting His character to the confines of our own small experiences. Perhaps the problem is that we’re stuffing the box with selfish pride and hopeful gain but still calling it God’s will.\nRegardless, our boxes are all our own cheap versions of the one true Father, muffled by our sin and covered in the static of our humanity. Let us not mistake them for the substance of the Spirit. If we choose to carry anything with us let it be the full arc of the gospel story. Even better, let’s remember that we are the ones who need to be carried.\nThat’s what Jesus does for us. He carries us into the very presence of our God, in all His holiness. When the question is asked, “Who is able to stand in the presence of the Lord this holy God?” (1 Samuel 6:20), we can trust that Jesus has made a way for us to do just that. He stood in our place and died the death we deserved so that we could approach our holy God with confidence (Ephesians 3:12).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram3.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 7:1-17, 1 Samuel 8:1-22, Proverbs 1:29-33, Hebrews 1:1-3",
        "devo_title": "Israel’s Demand for a King",
        "devo_summary": "\nBY Missy Fuller\n\nScripture Reading: 1 Samuel 7:1-17, 1 Samuel 8:1-22, Proverbs 1:29-33, Hebrews 1:1-3\nIn 1 Samuel 8, we find Israel rejecting their God, the One who rescued them from slavery, provided for them in the desert, and gave them victory over their enemies.\nIsrael instead demanded a king who would judge them, go before them, and fight their battles (1 Samuel 8:20). Ironically, the King they rejected was the only king to fulfill this request. God had already been their Judge (Deuteronomy 32:36), gone out before them (Exodus 13:21), and fought their battles (Exodus 14:14).\nBut they wanted a king “the same as all the other nations” (1 Samuel 8:5). So they rejected their true King, the God of heaven and earth. God granted their request and gave them over to their desires, but not without a warning. He promised to give them a king like all the other nations. He would give them one who was selfish, oppressive, and ruthless. They didn’t heed His warning.\nI want to be like everyone else, too. I want to look like everyone else, to be both beautiful and adorable, and so I make my appearance king. Then I find myself overcome by my obsessive eating habits and exercise routine. Turns out that king won’t provide what I need.\nI want to have what everyone else has, to feel important and sophisticated, and so I make my possessions king. I spend my time, money, and energy, filling my closet with pretty new dresses. But I’ll never have enough because this king demands more and more and more.\nI could go on, and I’m sure you could, too. \nOur individual kings demand more from us than we’d ever be willing to give. They lie and tell us that if we could have what the world has, we would have freedom. \nSecond Peter 2:19 warns against this:\n“They promise them freedom, but they themselves are slaves of corruption, since people are enslaved to whatever defeats them.”\nThis is what happens when we, like Israel, fall prey to the desire of being like everyone else. Instead of gaining freedom, we become slaves of corruption. When we turn from the wisdom of the Lord and His ways, we “will eat the fruit of [our] way” (Proverbs 1:29-33). In our efforts to be like the world, we miss out on what we truly need: freedom that can only come from submitting ourselves to the true King, Jesus Christ.\nBut God is rich in mercy. He pursues us and draws us to Himself until we long for Him again (1 Samuel 7:2,6). He even works through our rebellion, just as He did with Israel, providing what is truly best for us. God would later appoint David as king over Israel, and through his family, provide the true King in Jesus Christ. He is the One who ultimately goes before us and fights our battles (Revelation 19:11-16). He is all we need, and only in submitting to Him as King will we find freedom instead of slavery (Luke 4:18).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram4.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 9:1-27, 1 Samuel 10:1-27, Psalm 2:1-12, Ephesians 1:15-23",
        "devo_title": "Saul Anointed King",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Samuel 9:1-27, 1 Samuel 10:1-27, Psalm 2:1-12, Ephesians 1:15-23\nHave you ever asked for something you didn’t need? Ten years ago, my husband took a shine to cycling. Bicycling. He hadn’t engaged in the sport before, but he knew how to ride a bike. And since riding a bike is literally a metaphor for something you can never forget, how could I possibly find a flaw in his plan? \nAs he researched the sport, he decided he needed vintage cycling jerseys. (I understand his wanting to look like an Italian racecar driver from the ‘40s. It’s a great look.) During these years we were poor school teachers, eating pasta for every meal. Extra purchases hurt us right in the grocery budget, but nevertheless, vintage cycling jerseys were purchased.\nWhen these gorgeous, fabled items arrived in the mail, we admired their magisterial purples and heraldic sables. But what came next, gentle reader, is what pains me the very most: he never wore them. It turns out my husband loves neither cycling nor the wearing of spandex-y garments. But since we shelled out so much money for them, we’ve held on to them for three moves. To this day, they remain stashed away in our attic, still in their original packaging. \nWe just had to have them. But we didn’t need them!\nIsrael asked for something they didn’t need: a king. They started looking around at their neighbors—the Philistines, Moabites, and the Ammonites—for a model of how they wanted to live. They wanted a king like all the other nations, but their misplaced trust in an earthly king was a foolish rejection of God. Israel were His chosen people; He didn’t want them to live like the rest of the world. But they insisted on getting their own way, and He gave them exactly what they asked for.\nSaul was a flashy, handsome guy who was physically “impressive” (1 Samuel 9:2), but spiritually dull and cowardly (1 Samuel 10:22). Of course, our inclination in reading this passage is to focus on Saul, just like Israel did. But the impressive and miraculous signs, even his prophesying, ultimately do not point to Saul’s fitness, but God’s.\nWhen those wicked men asked, “How can this guy save us?” they were doubling down on their doubt of God’s provision (1 Samuel 10:27). They wanted a king, so God gave them Saul—a man literally head and shoulders above all the rest in Israel—to rule over them. When he shows up, they still doubt. Ironically, this doubting of God’s provision would later be Saul’s undoing as well.\nWherever the Spirit of the Lord is at work, we ought never doubt of God’s provision. But if God’s Spirit does not lead the way, we ought not go forth. The real importance of this passage is simply this: God works His mercies by His Spirit, even amongst a rebellious people.\nThis theme should be familiar, because the real story of God’s Anointed One is not about Saul. Saul’s kingship was an ironic foreshadowing of the true Anointed One, Christ. May our hearts seek first His kingdom. May we look to Him to provide us with what we truly need, rather than trying to build a kingdom of our own making.\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram5.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "Luke 1:50",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nHis mercy is from generation to generation\non those who fear him.\n– Luke 1:50\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram6.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 8:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through 1 & 2 Samuel together, we will memorize five important verses from these books. This week we are memorizing the key verse for 1 Samuel, a turning point in the story of God’s people: Israel asked for a king.\nBut the Lᴏʀᴅ told him, “Listen to the people and everything they say to you. They have not rejected you; they have rejected me as their king.”\n-1 Samuel 8:7\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/4-12Samuel-1-NEW.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 11:1-15, 1 Samuel 12:1-25, Isaiah 5:8-12, Micah 6:1-5",
        "devo_title": "Samuel’s Final Speech",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 11:1-15, 1 Samuel 12:1-25, Isaiah 5:8-12, Micah 6:1-5\nI still vividly recall my third year of law school, when graduation neared and I had no offer of employment. The plan had been to work at a Washington, D.C., law firm during the second summer and, by the end of my time there, secure a permanent offer to return upon graduation. But the firm suffered a financial downturn and could extend only two offers. (Another firm I’d turned down extended more than twenty.) Stressed out and covered in hives, I was sure I’d be forever unemployed.\nPlease, let me get this position. My heart uttered those words with every resume sent, every interview secured. Still, the rejections piled up. Then, one week before graduation, my resume found its way to the desk of a federal judge in Madison, Wisconsin. She conducted a phone interview, flew me out for a face-to-face, and offered a clerkship on the spot. It was one of the best jobs I could’ve gotten. And oh, how I celebrated, calling it as a blessing. \nA month later, my fiancé and I ventured to Madison to begin our careers. We rented an apartment and moved in together. I didn’t know the Lord at the time. I wanted His blessings, but I didn’t want Him as Lord and King over my life.\nSuch was the state of affairs in Israel during the latter part of Samuel’s time as judge. The people asked for a king to reign over them “like all the nations” (1 Samuel 8:5), thus rejecting God as King. They got what they asked for. God chose Saul to be their king, and, empowered by His Spirit, Saul led the people to a great victory against the Ammonites. And oh, how they celebrated. They had their king! They had victory over the enemy!\nWith such immense blessings, they surely felt all was well. Don’t we tend to think the same?  When we’re being blessed—especially if we’ve received the very thing we asked for—we don’t see “warning” flags. To the contrary, we feel good about ourselves and our situation, perhaps even about our relationship with God. After all, we must be doing something right in order for God to bless us, right?\nBut blessings have more to do with God than with us. They reflect His amazing grace and His long-suffering character. They flow from His lovingkindness and goodness. “For He causes His sun to rise on the evil and the good, and sends rain on the righteous and the unrighteous” (Matthew 5:45). \nIn the midst of great blessing, our hearts can still be far from God. And apart from Him, blessings are merely temporal and empty.\nGod was gracious in pointing this out to the people of Israel. Through the prophet Samuel, He interrupted their revelry to remind them that they had rejected Him and to point to where true prosperity lay. \n“If you fear the Lord, worship and obey him, and if you don’t rebel against the Lord’s command, then both you and the king who reigns over you will follow the Lord your God.”\n– 1 Samuel 12:14\nMadison ended up being the place where I met the Lord, where He drew me to Himself and saved me. That was the true blessing—the greatest blessing. Now, when I think of that time, I’m reminded that no matter what is happening outwardly in our lives, whether hardships or joy, the true measure of our well-being is in the posture of our hearts before God. The ultimate blessing is in following Him and allowing Him to reign as King over our lives.\n\nKim Cash Tate is the author of several books, including Though I Stumble (2016) and Cling: Choosing a Lifestyle of Intimacy with God (2017). A former practicing attorney, she has a passion for studying and teaching the Word of God. Kim lives in St. Louis with her husband and their two young adult children.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram8.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 13:1-22, 1 Samuel 14:1-52, Numbers 18:7, Acts 13:21-23",
        "devo_title": "Saul’s Kingship",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 13:1-22, 1 Samuel 14:1-52, Numbers 18:7, Acts 13:21-23\nIf I had my druthers, I would stick to what’s safe and comfortable. \nWhen God put it on my heart to homeschool, I gave a thousand reasons why it wouldn’t work. Mostly I doubted my ability to do the job well—and our kids were only in first grade and pre-K. But despite my initial doubts, those early years turned out to be fruitful in numerous ways, not only for them, but for our family as a whole. \nStill, imagine my angst when high school neared. Yes, God had been faithful, but this was the big leagues now. The stakes were higher, and my own inadequacies might hamper their options for the future. Yet, as I write, our youngest has graduated from our homeschool and will be joining her brother at a wonderful university. Once again, God showed Himself faithful throughout the high school journey.\nMy propensity to stick with safety and comfort has reached well beyond homeschooling. Whenever I’ve sensed God’s call to embrace a new challenge, I’m never short on reasons why it won’t work. Or why I can’t do it. Or why I might be hearing God wrong altogether. In truth, I can identify with the King Saul we see in 1 Samuel 13 and 14.\nThough Saul had been given the Spirit of God, and had once called men valiantly to battle, his courage was diminished. The Philistines were an ever-present threat, occupying territory in Israel, and Saul seemed content to lay low. Perhaps if the Israelites didn’t kick up any dust and cause trouble, the Philistines would leave them be. Despite the power God had made available to him, Saul took to playing it safe.\nIn stark contrast, his son Jonathan embraced the challenge. Though the Philistines were superior in number and in weaponry, Jonathan went after them with just one other man. He said, “Come on, let’s cross over to the garrison of these uncircumcised men. Perhaps the Lord will help us. Nothing can keep the Lord from saving, whether by many or by few” (1 Samuel 14:6).\nWho puts themselves in a position to see God fight for them? Whose trust is that deep? God rewarded Jonathan’s faith, causing several Philistine men to fall and sending an earthquake that caused trembling in the camp.\nWhat stops us from trusting like that? As believers in Christ, we are indwelled by the Spirit of God, His infinite power and might. We are armed with the promises of God, among them being His promise to be with us, His promise to establish His purposes in our lives, and His promise to be faithful, always. We are assured that we have nothing to fear—and indeed, no matter what we may endure, it can’t compare to the “eternal weight of glory” to come (2 Corinthians 4:17).\nBiblical accounts such as Jonathan’s serve to stir up our faith and courage in Christ. Like Jonathan, we can believe God. We can embrace the challenges to which we are called. And we can witness God’s powerful hand at work.\n\nKim Cash Tate is the author of several books, including Though I Stumble (2016) and Cling: Choosing a Lifestyle of Intimacy with God (2017). A former practicing attorney, she has a passion for studying and teaching the Word of God. Kim lives in St. Louis with her husband and their two young adult children.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram9.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 15:1-35, 1 Samuel 16:1-23, Ruth 4:18-22, Luke 6:45",
        "devo_title": "Samuel Anoints David",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 15:1-35, 1 Samuel 16:1-23, Ruth 4:18-22, Luke 6:45\nAbout the time my future groom and I started looking at rings, a story circulated through my college dorm that put many of us hopeful brides-to-be on high alert. Whether true or simply an urban legend, I can’t say. But long after my now-husband popped the question, the story has stuck with me. It goes like this…\nA handsome young man decided to propose to a beautiful girl. He told her that since they were poor college kids, he could not afford much of a ring. He proposed with a small cubic zirconia, a manufactured replacement for a real diamond. But secretly, he purchased a beautiful, expensive, whopper of a diamond and planned to have it put in the setting for their wedding day. But when the blushing bride-to-be discovered her ring was a fake, she demanded the real thing. The groom was so turned off by her shallow behavior that he broke off the engagement. Only then did the girl learn that he’d planned all along to take her breath away with a real diamond.\nIn 1 Samuel, we find a similar tale of fake worth and diamonds in the rough. Saul had been anointed as the first king of Israel. He seemed to have it all, but it didn’t take long for his façade to crack. Saul was deeply flawed. His dependence on the Lord turned out to be counterfeit, and in 1 Samuel 15, the Lord rejected Saul as king of Israel.\nIsrael’s prophet, Samuel, was grieved by Saul’s failings. I imagine he might have felt like that bride-to-be, who thought her boyfriend had bought her a diamond only to discover she’d been given a chunk of glass. But God was like the groom with something better tucked away. Despite Israel’s long history of doubting God, He planned to replace Saul with a king so good he’d become the measuring stick for all other kings to come.\nAt the Lord’s prompting, Samuel went to the house of Jesse looking for a new king. Jesse had  eight sons and he paraded all but the youngest in front of Samuel. Each time, the Lord said “no.” Samuel was baffled by God’s rejection of such strong, capable men. God’s explanation put a magnifying glass over Samuel’s heart.\n“But the Lᴏʀᴅ said to Samuel, ‘Do not look at his appearance or his stature, because I have rejected him. Humans do not see what the Lᴏʀᴅ sees, for humans see what is visible, but the Lᴏʀᴅ sees the heart.’”\n– 1 Samuel 16:7\nDavid didn’t look like a king. His father thought so little of him that he didn’t even bring him in from the field. But God chose him. Beneath an unimpressive exterior, God saw treasures in David’s heart. \nWe can’t polish ourselves pretty enough to create our own worth. But God mines for value in each of our hearts.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram10.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 17:1-58, Ephesians 6:12, Hebrews 2:14-18",
        "devo_title": "David and Goliath",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Samuel 17:1-58, Ephesians 6:12, Hebrews 2:14-18\nWe recently celebrated our 5th birthday here at She Reads Truth, and I’ve been feeling nostalgic about the early days. Thinking back over the years, I can remember a lot of mistakes I’ve made, not to mention the mistakes I made today. Seriously, I don’t seem to be able to make it though one day without putting my foot in my mouth just a little bit.\nBut I have learned so much, and there is one simple thing for which I am most grateful: I have learned about the Bible. The more I read, the more I’m able to make connections and see the echoes of one passage in another. More than the research and the commentaries, the focused act of reading my Bible has given me confident hope for the future.\nI have learned that my own resolutions to achieve and do better will absolutely come to nothing. I know that all good things come by the power of God’s grace, not the resolve of my earnest soul. I’ve learned that fear and worry serve no purpose in God’s economy. And another great perk of knowing your Bible is knowing what God has promised.\nThis is exactly where David was when he heard that Goliath the Philistine was threatening the troops of Israel. He was just totally outraged that no one had taken up the challenge because he knew that God had already promised to preserve and protect Israel. Not only that, but God had already delivered the giants into Israel’s hands before: when Abraham conquered Chedorlaomer (Genesis 14), and when Israel entered the land of promise (Numbers 13:17-33). \nDavid knew God’s covenant promises to Abraham, and Isaac, and Jacob. He’d heard the stories of God’s amazing protection over Noah and his family. And he’d read the heroic tales of Joshua’s obedience to God. He knew, most of all, that God is faithful, and that He cannot be mocked (Galatians 6:7).\nDavid knew his Bible. He knew God’s promises. So when he was confronted with a threatening Philistine giant, he said, “ Today, the LORD will hand you over to me” (1 Samuel 17:46). Those sound like brave words if you don’t know the end of the story. But the pattern of redemption is always the same: the nations rage and the peoples plot in vain… but the Lord is enthroned in heaven (Psalm 2). The Bible tells us we will always have troubles, but Jesus is the hero and He always slays the dragon in the end.\nKnow His Word. Know who God is. Remember the history of His providence. Lay hold of His unfailing promises. David wasn’t doing anything new, but he was a man who knew his Bible.\nI don’t know that I’m ready to face any giants, but knowing God’s Word and His promises were exactly the foundation for David’s confidence before Goliath. It wasn’t his sling and stones, or his history of bear-fighting. It was simply God’s Word.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram11.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 18:1-30, 1 Samuel 19:1-24, Psalm 59:1-17",
        "devo_title": "David and Saul",
        "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: 1 Samuel 18:1-30, 1 Samuel 19:1-24, Psalm 59:1-17\nIt all started with pride and a hankering for toast.\nWith a freshly ironed shirt and crisp college degree, I walked through the doors of my new job and stepped into a schedule full of meetings and a to-do list of fires to put out. Literally.\nSoon after becoming acquainted with the office kitchen and its various coffee creamers and water bottles, I found myself staring into a tiny toaster smelling very burnt toast. The piece of bread was mine, of course, but its transformation into unrecognizable burnt crumbles made me feel as if I had no business being near baked goods of any kind, ever. I looked around the empty room, wondering when the toast’s lunatic owner, ahem, would rescue it from the smoke-producing heat.\nI regularly find myself feeling neglectful like this in the kitchen, but I can also be careless with my thought life too. Envy starts a fire in my heart, causing my feelings to combust from the inside out. From seemingly nowhere, jealousy rears its ugly head, just in time for me to realize these terrible thoughts are unfortunately, actually mine (all mine!)—unlike my friend’s new engagement ring, vacation plans, promotion, or instagram attention, which caused my emotions to boil over in the first place. I truly want to celebrate these things for my friend (I do!), but turning away from my good intentions for even five seconds leaves these feelings to roast unattended over an open flame.\nEnvy might be the only sin that never feels good, not even for a moment. Other sins give us fleeting pleasure or empty promises, but envy hands us a box of matches and permission to light the fire. And before we know it, we’re in a room full of smoke.\nIn 1 Samuel 18, there’s a friendly celebration happening, the kind we intend to give the people we love as a way to congratulate them. Saul is great! David is great! We all have tambourines! But envy creeps into Saul’s heart when he hears, “Saul has killed his thousands, but David his tens of thousands” (v.7, emphasis mine).\nThe matches are lit, and Saul is off to kill David. That escalated quickly, didn’t it? I’m not sure Saul even knows how he got there, but then I remember my own failed attempts to rescue bread from the kitchen toaster. (I grabbed a paper towel to smother the flames, which of course, actually made them worse.) So, I can understand why Saul would want to get rid of any evidence pointing directly to his failures. \nI’ll bet Saul had one word ringing in his head that may sound familiar to you and me: mine. He wanted to claim it all as his—the glory, the credit, the recognition, the love. (Can anyone else relate?)\nAlthough David seemed to have it all together, he only had one quality worth envying: the presence of the One who actually does hold it all together. In these two chapters, we see the phrase “God with David” four times. This is what sets David apart. This is what Saul wants. This is what we all want. Our cries may say “Mine!,” but all we ever really want is for Someone to choose us, to adopt us as their own.\nThe glory, the credit, the recognition, the love—they’re all the Lord’s. And friends, so are we. He smothers the flames of envy by showing us we already belong. After all, it all started with love and a hankering for home.\n“You are my strength, I sing praise to you;\n you, God, are my fortress,\nmy God on whom I can rely.”\n– Psalm 59:17\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram12.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "Psalm 59:16-17",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut I will sing of your strength\nand will joyfully proclaim\nyour faithful love in the morning.\nFor you have been a stronghold for me,\na refuge in my day of trouble.\nTo you, my strength, I sing praises,\nbecause God is my stronghold—\nmy faithful God.\n—Psalm 59:16-17\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram13.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 2:2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This verse, from Hannah’s prayer of thanksgiving, celebrates the holiness and steadfastness of God.\nThere is no one holy like the LORD.\nThere is no one besides you!\nAnd there is no rock like our God.\n-1 Samuel 2:2\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/4-12Samuel-2.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 20:1-42, 1 Samuel 21:1-15, 1 Samuel 22:1-23, Psalm 34:1-3, Matthew 10:34-39",
        "devo_title": "David and Jonathan",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 20:1-42, 1 Samuel 21:1-15, 1 Samuel 22:1-23, Psalm 34:1-3, Matthew 10:34-39\nI don’t know if it’s because I’m the daughter of a Navy Captain, or because my heart beats to the rhythm of the tides, but I feel most settled at the ocean. Recently, on an early morning walk, I remembered a line from a poem I wrote in sixth grade: “the waves jump up and hit my face / in and out, like fancy lace…” Relentless and submissive, joyful and with full abandon, the waves come and serve themselves to the shore. They do not pause several hundred feet out to decide whether or not they should move forward.\nIf only making decisions came so easily for me.\nGranted, it’s their ontological design, so there’s that. But I still long for a simple, clear confidence of direction when making difficult decisions—especially relational ones that cause me to choose one loyalty over another. Or when things are simply inconvenient and I know the consequences will be costly. I confess I find it easier to hover out from the shore rather than risk crashing on the wrong one.\nI admire the clarity of mind Jonathan displays in 1 Samuel. Early on, he’s presented with a tangled, messy, relational situation, yet Jonathan honors his commitment to David without hesitation, promising, “Whatever you say, I will do for you” (1 Samuel 20:4). Boom. I can almost hear the splash and feel the spray on my face.\nIn that split second, Jonathan has committed to protect his friend David from his own father, King Saul. In doing so, he helps to preserve a kingship, which ultimately results in the Messiah’s arrival and our own salvation rescue. Jonathan couldn’t have known the long-range significance in the moment, or what the ultimate cost of such a commitment would be (1 Samuel 31). But he did know the next right thing to do, and he did it with moral clarity and a clear conscience.\nMy decisions aren’t usually life-and-death, and the accompanying narrative is not nearly as dramatic. But when it comes to decision-making in my own life,  I’ve experienced the tension between relational loyalties and moral clarity in more ways than I can count.\nTake the other night—a somewhat trivial, but practical example. We were sitting in our courtyard, as our neighbor’s two small dogs continued to bark… at 11 o’clock… pm.\nIt’s not a new issue for us; there have been conversations, requests, and reminders. We could’ve very easily called the police to come issue a citation. It would even be morally appropriate to do so. But I happen to know our neighbor is an older, divorced woman who lives alone, and those two dogs are her family. I also know she would nearly die if the police showed up at her door. So after hesitating for about 20 minutes, I texted her a kind but firm request that she bring her dogs inside since it was so late. She did, and the next day she sent me a heartfelt text of apology.\nLong-range significance? I’m not sure, except that she knows we pastor a church and pray for her regularly. But I do know it’s better to extend grace and compassion—overlooking my own temporary inconvenience—rather than risk whatever potential kingdom fruit may come from our relationship.\nMany decisions cost far more than this small disturbance in our neighborhood. But even in the small things, God is teaching me about His presence in all things. When my choices are guided by what will bring glory to God and grow fruit for His kingdom, the decisions come more easily, and with quicker clarity. As Jesus Himself tells His disciples in the last part of Matthew 10:39, whenever we lose our life for His sake, we will find it in Him.\nPerhaps there is a rhythm to be found here yet—like the waves.\n\nKim Thomas is a painter, author, and the Curate at The Village Chapel in Nashville, Tennessee, where she and husband Jim call home. Together they were called to start the church in February of 2001. Her undergrad studies were in art while her graduate degree is in theological studies. Kim has written 5 books and paints in the Japanese medium of Nihonga. The abstract work allows for a slow interaction between artist and materials. When asked how would you describe an ideal day… “Words and images without words—that’s a perfect day’s work.”\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram15.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 23:1-29, 1 Samuel 24:1-22, Psalm 54:1-7, John 19:10-11",
        "devo_title": "David Spares Saul",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 23:1-29, 1 Samuel 24:1-22, Psalm 54:1-7, John 19:10-11\nWhen righteous young David has the chance to take out paranoid, egotistical, narcissistic Saul twice and doesn’t do it, part of me wants to throw my hands up in frustration. That’s not how the story should go! The hero is supposed to seize his opportunity to conquer his enemy, then ride off into the sunset as the credits roll.\nInstead, David’s anti-climactic showdown with Saul reminds us who the real Hero is. In 1 Samuel 24, David and a small army of followers are on the run. Saul and an army of 3,000 soldiers are hunting David with the goal to kill him.  \nIn an ironic, almost comical twist, the paranoid king decides to relieve himself in the very cave where David and his men were hiding. If I’d been in David’s squad, I would’ve joined their rallying cry.\n“Look, this is the day the Lᴏʀᴅ told you about: ‘I will hand your enemy over to you so you can do to him whatever you desire’” (1 Samuel 24:4).\nTake your shot! He’s got it coming! Eliminate the threat! Instead, David sneaks up behind his archenemy and cuts off the corner of his robe.\nWait. What?\nDavid had already been anointed king, and clearly, Saul was no good for God’s people—his thirst for David’s blood was insatiable. So why then, does David opt to take a piece of Saul’s robe, as opposed to a piece of the man himself?\nHow could David be so bridled in the face of an enemy so bent on his destruction? It wasn’t that David didn’t crave relief from his enemy. He hadn’t assumed a position of defeat. He knew the battle ultimately belonged to the Lord.\nAt the mouth of the cave, David said these words to Saul:\n“May the Lᴏʀᴅ judge between me and you, and may the Lᴏʀᴅ take vengeance on you for me, but my hand will never be against you” (1 Samuel 24:12).\nWe don’t have to seek revenge or take out our enemies. David’s defender is our defender. When we find ourselves face to face with a threat, our Father’s advice is to respond with kindness and let Him do what He will (Proverbs 25:21-22). \nDavid’s restraint helps us grasp the big picture. If we widen the lens, we can see that the Lord has disarmed our ultimate enemy. God alone is the ultimate Authority and Judge in this world and the world to come (John 19:10-11). \nSo we don’t have to head into every fight with fists clenched. We don’t have to be the judge and jury in our search for justice. David’s defender is fighting for us. He is our helper, the sustainer of our lives, and our rescuer in every situation (Psalm 54:4,7). The battle belongs to the Lord!\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram16.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 25:1-44, 1 Samuel 26:1-25, 1 Samuel 27:1-12, Romans 12:19, 1 Peter 2:22-25",
        "devo_title": "David and Abigail",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 1 Samuel 25:1-44, 1 Samuel 26:1-25, 1 Samuel 27:1-12, Romans 12:19, 1 Peter 2:22-25\nI have a little girl, and I find her to be perfectly delightful in almost every way. So I’m in dangerous territory from the start when it comes to her. And this year at school she shared a class with the prettiest, pinkest little bully I’ve ever seen. Every time a report came home of another petty injustice, I wanted to rise up and bring my considerable adult authority to the situation. My heart longs to exact vengeance on my own terms. And while there is certainly a place to stand up for what is right, vengeance enacted by me shouting at little girls just can’t be the answer.\nWe are inclined to take matters into our own hands, to avenge ourselves on others. In David’s case, it seems like David had every right to avenge himself. Nabal was a total fool (I mean, his name literally means “fool”) who had actually profited by the protection of David’s men, but who thanklessly despised his own protector. Not only this, but then his contempt for David and his men was expressed by uncontrollably raging at them. Sure of his own self-worth, greedy of his own possessions, he failed to acknowledge God’s gracious provision in David, his protector.\nWho could blame David for wanting to take vengeance? He was, after all, the Lord’s anointed. Surely he deserved at least civil treatment from Nabal. He had the manpower with him to attack and destroy Nabal and his family for the slight. But regardless of whether others deserve vengeance, it is not ours to mete out. Remember this uncomfortable, yet comforting verse: “Vengeance is mine, I will repay, says the Lord” (Romans 12:19)?\nGod prevented David from sin through Abigail’s humility and discernment. She knew better than David her own husband’s perpetual folly, yet sought not her own ends, nor vengeance, nor the interests of any one person. Rather, she humbly defended a fool, courageously confronted a vengeful warrior, in order to keep all from evil. “May evil not be found in you,” she said to David (1 Samuel 25:28). Abigail’s words echo the righteous desire of God’s own heart, that His people walk in righteousness, seeking His glory above their own, and trusting all manners to His care.\nWhen David heard that Nabal was dead, he said, “Blessed be the LORD who championed my cause against Nabal’s insults and restrained his servant from doing evil. The LORD brought Nabal’s evil deeds back on his own head” (1 Samuel 25:39).\nDavid was stopped that day from a folly equal to Nabal’s: that of assuming that our own good is in our own hands. But ultimately, David understood that only God is his defender (1 Samuel 26:10-11; 2 Samuel 1:14-15; 4:12).\nBlessed be the Lord! He alone is our sure defense, not only against the offenses made against us, but also from the folly from within our own hearts. Rest in His provision.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram17.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 28:1-25, 1 Samuel 29:1-11, Deuteronomy 18:10-12, Proverbs 1:28",
        "devo_title": "Saul and the Medium at Endor",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 28:1-25, 1 Samuel 29:1-11, Deuteronomy 18:10-12, Proverbs 1:28\nOne frigid winter evening when my husband was still in grad school, I tried to call him. He had been out with friends after finishing finals, while I was already home for Christmas, several states away. When he didn’t answer his phone around 9pm, I wasn’t too worried. I called again an hour or so later, just before I went to bed, and he still didn’t answer. Then I sent off a few texts, each more worried than the last, hoping he would respond. \nI darted in and out of sleep, checking my phone, calling, and texting, until about 4am, when he finally texted me back to say he had fallen asleep well before 9:00—the hard, deep sleep of a post-finals student who had forgotten to charge his mobile phone, rendering it useless. And while we were quickly able to laugh about it, I can still feel my heart racing when I think about how I felt that night, several states away, not able to get in touch with him for hours. I would’ve done anything for an answer, for the assurance that he was okay.\nSaul is in a frantic panic in 1 Samuel 28. He knows the Philistines are ready to fight at Mount Gilboa. He knows God has rejected him as king (1 Samuel 15:23). He knows Samuel is dead—Samuel, who had been with him since his anointing, who’d walked with him and guided him in the ways of the Lord. Desperate for answers, Saul has sought the Lord about how he should face the Philistines. But the Lord is silent because He’s rejected Saul, leaving him to feel very, very alone.\nAnd so Saul, the warrior king who’d chosen his own pride over the Lord so many times before, again seeks his own comfort and control first. He consults a medium—after declaring all mediums illegal and sending them out of Israel—for the answer he so desperately needs. He asks her to bring forth Samuel, who appears and tells Saul that he and his sons will die in the next day’s battle. \nI can hardly breathe if I put myself in Saul’s shoes. The desperation he must’ve felt before visiting the medium would have been silenced by that cold truth. He would lose the battle. He would no longer be king, nor would his sons inherit the throne. The years of turning away from the Lord and seeking his own glory had left him there, alone. \nWhen I think about how often I obsess over the future—running worst-case scenarios through my head, working myself into a panic—I realize that I’m tempted in the same ways Saul was. It’s so much easier to take matters into my own hands, to live for my own glory, and to forget about the Lord’s steadfast faithfulness. Perhaps if Saul had reflected on how faithful the Lord had been to the people of Israel, he would’ve trusted the Lord for one more day. \nSo the cup I have to drink today is the cup of the Lord’s faithfulness. It is to choose trust and faith over fear and control. It is to recite to myself the promise Moses made to Joshua in Deuteronomy 31:8:\n“The Lord is the one who will go before you. He will be with you; he will not leave you or abandon you. Do not be afraid or discouraged.”\nThe Lord goes before me. He knows and numbers my days. And I have confidence through the life, death, and resurrection of Jesus that God always keeps His promises. I may not face Philistines in battle, but I will face temptation, fear, and death as surely as Saul did. And so I pray that an unshakable confidence in Christ will be my only and blessed assurance each day.\n\nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram18.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 30:1-31, 1 Samuel 31:1-13, Psalm 56:3-4, Luke 4:18-19",
        "devo_title": "The Death of Saul",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Samuel 30:1-31, 1 Samuel 31:1-13, Psalm 56:3-4, Luke 4:18-19\nYesterday we read about Saul’s moment of desperation. He knew he was facing a mighty battle against the Philistines, and he knew he was facing them alone. He was without Samuel, and he was without the Lord, who had turned away from him after his repeated disobedience. And Saul, who must have been near-crazed with fear, broke his own laws and the law of God by consulting a medium to try to find an answer. \nToday, we read about David in a similar situation. The Amalekites had raided the city of Ziklag, burned it, and captured all of the women and children. David and his army returned to Ziklag, but there was nothing left. In fact, they “wept loudly until they had no strength left to weep” (1 Samuel 30:4). That sentence strikes the deepest fear into my own heart, which is rather predisposed to fear and anxiety. I can’t imagine that kind of pain. \nAnd yet David responds with faith. Even though his wives have been captured, his city burned, and his army is threatening to rise up against him to stone him to death—David responds with faith. David is facing a loneliness and uncertainty perhaps even greater than Saul’s before the battle at Mount Gilboa. David has let his people down, the very people God has entrusted him to lead. But 1 Samuel 30:6 tells us, “David found strength in the Lord his God.” \nI am humbled by David in this passage. I am convicted by Saul’s impatience and need to control, but I am humbled and inspired by David’s faith and his generosity. His response to trial was to trust the Lord. And his response to great victory was to praise the Lord and share the spoils. David, who knew he would be king, claimed no victory outside of the Lord’s faithfulness. \nEven when I do choose the way of David—fragile yet desperately leaning on the Lord because I know only He can sustain me—I often forget His faithfulness when my moment of trial has passed. It is only when I intentionally take time to reflect on the Lord’s guiding, preserving hand that I remember to give thanks and to testify to His goodness. \nMy prayer today is not only to carry with me the confidence of faith, but to remember to testify to the Lord’s great faithfulness in my life. I can testify to His glory through my worship, His presence through my prayers, and His mercy through my actions toward others. I can testify to His grace in my quickness to forgive and His provision when I am generous. \nDavid’s actions remind me to not only rely on the Lord daily, but to also tell of His great deeds. When I live with gratitude in response to Christ’s love for me, I testify to the gift of His sacrifice on the cross and the unimaginable mercy of the gospel.\n\nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram19-Eva.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "Psalm 54:4",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod is my helper;\nthe Lord is the sustainer of my life.\n– Psalm 54:4\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram20.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "1 Samuel 12:24",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This verse from David’s song of deliverance extols both God’s goodness and His strength.\nAbove all, fear the LORD and worship him faithfully with all your heart;\n consider the great things he has done for you.\n—1 Samuel 12:24\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/4-12Samuel-3.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 1:1-27, 2 Samuel 2:1-32, Psalm 60, Romans 12:14",
        "devo_title": "David’s Lament",
        "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: 2 Samuel 1:1-27, 2 Samuel 2:1-32, Psalm 60, Romans 12:14\nHave you ever watched the 1950s movie, Sunset Boulevard? Norma, an aging Hollywood starlet, longs for a comeback. She’s deluded enough to think that by sheer force of will, she can break back into the business with a new movie. It goes horribly wrong for her, and the movie ends as she descends a staircase, guilty of murder, smiling and waving to the flashes of reporters’ cameras as she’s taken into police custody. Norma couldn’t loosen her vulture-grip on her own fame to see reality.\nNow, I’m not usually a wide-eyed crazy lady clawing at the scraps of my imagined life—or am I? Do I try to hold onto things that are gone and out of my control? Do I secretly attempt to force God to do my bidding? I suspect that because of our sin nature, we all try to control our own circumstances, instead of trusting God to go to bat for us.\nThe aging starlet reminds me of King Saul. While Saul was still in power, Samuel anointed David as God’s choice for king (1 Samuel 16:1). Instead of gracefully stepping down, Saul raged on, fighting for years against both David and the will of God.\nLook at the story from David’s perspective. He was the youngest and the least impressive of all his brothers. Although Samuel did have a small family ceremony after he anointed him, not much changed right away for David. He was still the little brother who had to tend the sheep. \nBut one very significant thing did change immediately: the Spirit of the Lord came upon David and departed from Saul, who was then plagued by an evil spirit (1 Samuel 16:14). Although David didn’t actually assume the throne for years after he was anointed, the Spirit of the Lord was with him. That was more valuable than 10,000 thrones. While Saul scraped and grasped to keep control of his kingdom, David waited on God’s timing and spent the years learning to listen to the Lord.\nDespite the Lord’s clear choice of David as king over Israel, Saul was unwilling to give up the kingdom. He knew David would be king, but he was unable to let go of his delusion of power before his death. \nDavid didn’t have to scramble and fight for the crown. The Lord chose him; He gave David the throne (2 Samuel 2). David didn’t have to take matters into his own hands. God had everything under control, and He still does. His faithfulness frees us to be joyful in hope, patient in affliction, and faithful in prayer. Like David, we are free to bless, and not curse, those who would seek to harm us (Romans 12:12,14). \nWe don’t have to claw, hustle, and scratch to make things happen in our lives. God is still sovereign. In spite of all Saul’s labors, his day was over as David’s was ready to begin. David waited patiently for the Lord, and we can, too, with confidence. God will defend and protect us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram22.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 3:1-39, 2 Samuel 4:1-12, Psalm 30:11-12, Jeremiah 16:5-9",
        "devo_title": "Civil War in Israel",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Samuel 3:1-39, 2 Samuel 4:1-12, Psalm 30:11-12, Jeremiah 16:5-9\nFor me, when studying Old Testament books like 1 and 2 Samuel, it’s best to do so with an understanding of context, time, and culture. Although the vitriol on display in the public square today—where we’ve lost the art of respectful discussion and disagreement—is not much more pleasant, the violence and carnage of the civil war stories found in 2 Samuel are indeed gruesome.\nWe begin with the end in mind: “During the long war between the house of Saul and the house of David, David was growing stronger and the house of Saul was becoming weaker” (2 Samuel 3:1). From there, the writer unfolds the machinations and details of kingdom intrigue for us. There are birth announcements, power moves, peace agreements made and broken, deceptions, murders, people wanting the right thing but going about it the wrong way. And in the middle of the bloodthirsty ambition surrounding him, David is becoming a leader.\nWhile he is not without shame, we do get to witness David’s growth as a man and king. Rather than the foolish mischief of those who would woo him towards calculated misdeeds to secure the throne, David is engaged with the ways of honor and justice, poetic lament and respect. These are things that honor his God and serve to build loyalty in his people: the right things, for the right reasons.\nAnd have you noticed David’s patience and trust in God’s promise? God spoke to Samuel, instructing that the young boy David was His choice, the one to be anointed (1 Samuel 16). But now, many years later, he is a grown man and still waiting. He waited through Saul’s manic ranting and reign, spending one minute in Saul’s good graces, and the next dodging Saul’s attempts to kill him.\nAt one opportune moment, when David could have ended Saul’s dangerous obsession with him, he submissively clips his garment rather than taking his life. Rather than seizing the opportunity to impose his own moment, he learns the patience that comes from belonging to a faithfully sovereign, promise-keeping God. David knew he was God’s anointed one, and he rested in that promise.\nNot once does he whine or complain. He doesn’t rehearse a martyr’s refrain or an entitled person’s manifesto. (I’d actually give him room to do any of those.) David has found an intimate place before the Lord where his soul rests and sings. Even in the midst of carnage and betrayal, David rests in knowing he was God’s anointed.\nThat’s my big takeaway from these verses, and it’s a big one. Though, I’m contextually without a monarchy and not bearing up under such gruesome circumstances as David’s. I’m just managing today and my own expectations—expectations of myself, people I love, opportunities I think should be mine (maybe a bit like Abner), and to be honest, my expectations of God. I’m afraid I’ve whined and complained out of a sense of entitlement. But I so want to live gracefully, daily trusting in the sovereignty of God’s faithfulness.\nThankfully, God’s promise-keeping did not end with David’s throne. The promised Messiah and Redeemer of the Davidic line has come (2 Samuel 3:18). When unrest shakes our souls, we can take refuge in our relationship with our Promise Keeper God. Abiding in His presence strengthens us so we can wait on Him, His perfect will, and His perfect timing.\n\nKim Thomas is a painter, author, and the Curate at The Village Chapel in Nashville, Tennessee, where she and husband Jim call home. Together they were called to start the church in February of 2001. Her undergrad studies were in art while her graduate degree is in theological studies. Kim has written 5 books and paints in the Japanese medium of Nihonga. The abstract work allows for a slow interaction between artist and materials. When asked how would you describe an ideal day… “Words and images without words—that’s a perfect day’s work.”\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram23.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 5:1-25, 2 Samuel 6:1-23, 2 Samuel 7:1-29, 1 Corinthians 12:12-20, Hebrews 10:19-22",
        "devo_title": "The Lord’s Covenant with David",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Samuel 5:1-25, 2 Samuel 6:1-23, 2 Samuel 7:1-29, 1 Corinthians 12:12-20, Hebrews 10:19-22\nI’ve always assumed that a covenant is an if/then agreement. If you do x, then I’ll do y. If you fail to do x, then I’m entitled to y. Since dissecting legal mumbo-jumbo isn’t really my thing, the idea of a covenant always felt a little sterile to me. \nMaybe that’s why I typically paid little attention to the Old Testament covenants. God’s covenant promises are mentioned in many places, so I did plenty of glossing over them. The biggies include the Noahic Covenant found in Genesis 9, the Abrahamic Covenant in Genesis 12, and the Mosaic Covenant in Exodus 19. \nBecause I only skimmed these passages, I thought the covenants were cut-and-dried versions of this: If God’s people obey the law, they get blessed; if they fail to obey the law, they get cursed. Certainly, there are blessings that come with obedience, and consequences that come with rebellion—but that isn’t the bottom line. It’s not how God does business. \nGod’s covenants are not equal partnerships. God gives infinitely more than He ever plans to receive.\nWe see this clearly in God’s covenant with David (2 Samuel 7). God had been blessing David since childhood, but here, He makes it official. God promises David these things: fame and prestige, deep roots, safety and security, legacy, and a bright future. \nGod promised big! This is the “then” portion of God’s covenant with David. But what was the “if”? What did David have to do to earn these lavish gifts? Well, for starters he had to….\n(Crickets.)\nNothing. There is no “if” to qualify God’s “then.” David doesn’t have do his part for this covenant agreement to stand. God promises David that His “faithful love will never leave him” (v.15). He gives generously out of His extravagant love, not legal obligation. And David’s response is awestruck worship.\n“This is why you are great, Lord God. There is no one like you, and there is no God besides you, as all we have heard confirms.”\n– 2 Samuel 7:22\nDavid enjoyed what I missed when I zoomed past the previous covenants: God doesn’t love us out of obligation. There is no way for the scales to be equal when man enters into a covenant with the God who created him. \nThe covenants of the Old Testament are like neon signs pointing to something bigger and better. They set the table for the fulfillment of God’s covenant of grace, perfected in the finished work of Christ on our behalf. \n“In the same way he also took the cup after the supper and said, ‘This cup is the new covenant in my blood; it is shed for you.”\n– Luke 22:20\nThe covenant Jesus offers us is this: we bring our nothing, and He gives us everything. The scales are forever tipped in our favor. May we learn to stop glossing over the goodness of our God. Instead, let us respond in worship to the God who gives extravagantly.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram24.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 8:1-18, 2 Samuel 9:1-13, 2 Samuel 10:1-19, Acts 4:24-28",
        "devo_title": "David’s Kindness",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Samuel 8:1-18, 2 Samuel 9:1-13, 2 Samuel 10:1-19, Acts 4:24-28\nWhen I was 20 years old, I spent a semester by myself in Chile. I was an intern there—not part of a full study abroad program with tons of other college students. I lived with a host family and worked with other Americans, but there was no one else there in the same position. I found myself pretty much alone. \nOne day, my Spanish teacher invited me to an “asado” at her house. A Chilean asado is a backyard barbecue on steroids: hours and hours of food, drink, laughter, stories, and family. It’s a feast for the stomach and the heart. I didn’t have much going on during the weekends, so I went. I’ll never forget the feeling of overwhelming acceptance washing over me that day. I felt known and welcomed there. For one afternoon, I was completely enveloped into their family.\nI’ve never been in David’s shoes—a newly-crowned king looking to gain and maintain power. But I have been in Mephibosheth’s, feeling like the lonely outcast. Mephibosheth was the crippled grandson of the fallen king; all tradition and expectation would have been for David to ignore him at best, and kill him at worst. \nBut the victorious and powerful King David, remembering his promise to Jonathan and Saul, instead seeks Mephibosheth out and honors him. He restores the family land to Mephibosheth, and invites him to feast at his table. Even Mephibosheth can’t believe it. “What is your servant that you take an interest in a dead dog like me?” (2 Samuel 9:8).\nDavid’s kindness is not spur of the moment, either. He seeks out Mephibosheth to offer him “hesed,” the Hebrew word for lovingkindness. This word is found all over the Old Testament, used to describe God’s steadfast love and faithfulness to His people. In Exodus 34, God Himself uses hesed to describe His own character: “The Lord passed in front of him and proclaimed: The Lord—the Lord is a compassionate and gracious God, slow to anger and abounding in faithful love and truth” (v.6).\nWhat we see David give to Mephibosheth is the same lovingkindness that God offers us through His Son. David invited Mephibosheth to be “like one of the king’s sons.” \nIt’s impossible to read this story and not see myself—crippled in spirit, with nothing to give, and yet completely welcomed into Christ’s family because of God’s lovingkindness to me. I am Mephibosheth, Joseph’s brothers, Job, and the prodigal son all rolled into one. And God seeks me out, the way David seeks out Mephibosheth. \nJesus invites us to a feast far greater than King David’s, saying, “If anyone is thirsty, let him come to me and drink” (John 7:37). May we answer His invitation with thankful hearts, filled with the unsurpassed joy that comes from knowing our Father loves us with perfect, steadfast love.  \n\nMelanie Rainer is the director of content for JellyTelly, where she writes and edits family spiritual formation resources. She is a graduate of Covenant Theological Seminary, a passionate home baker, and makes her always-messy home with her husband, Price, and their delightful daughter, Ellie, near historic downtown Franklin, Tennessee.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram25.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 11:1-27, 2 Samuel 12:1-25, Psalm 51:1-19, Isaiah 42:1-4",
        "devo_title": "David and Bathsheba",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Samuel 11:1-27, 2 Samuel 12:1-25, Psalm 51:1-19, Isaiah 42:1-4\nThe sins that tend to shock us most are the ones committed by those who know better. \nWhen we’ve walked with God a long time, learned from Him, depended on Him through dark valleys—when we’ve tasted and seen that the Lord is indeed good—and then choose sin instead, our fall feels twice as far and three times as hard.\nIf anyone were immune to moral failure, you’d think it would be the boy-turned-king who watched a giant fall at his feet. The one whom God miraculously spared from death and handed a kingdom. The one who wrote dozens of songs about his devotion to God, and God’s devotion to him. The one whom God specifically chose for his loyalty and obedience (1 Samuel 13:14; Psalm 89:20). But even great faith doesn’t inoculate us against temptation. \nWhen it comes to sin, we’re never more than a couple bad choices away from our worst moment. Humility must rule our hearts. Boundaries must guard our choices.\nDavid’s sin, much like many of ours, began as a slow slide. “In the Spring when kings march out to war,” David was home instead (2 Samuel 11:1). Apparently he felt his kingdom was secure enough that his right-hand military man, Joab, could take care of business on his own. Maybe he suffered from vocational boredom or spiritual apathy. Maybe he had a mid-life crisis, or he was just feeling lazy and lax. That’s when temptation came. Then justification. Then trespass.\nDavid’s sin left a wake of consequences that affected not only him, but Uriah, Bathsheba, an innocent baby boy, and an entire nation. But even with all that collateral damage, the real weight of David’s story wasn’t in his failure but in his restoration. God confronted, then offered forgiveness to, the man who undeniably “knew better.” \nThe implications are too beautiful to ignore: we may have to face natural or divine consequences for our sin, but God never refuses to forgive. \nBut there’s even more good news woven through this story. One sin—even a whole season of bad choices—doesn’t have to define our lives. Yes, David sinned. He sinned big. But long after David’s body turned to dust, God still measured other kings’ successes or failures by David’s heart (1 Kings 14:7-8; 2 Kings 14:3, 16:2), blessed generations for his sake (2 Kings 8:19, 19:34, 20:6), and made good on His promise to bring the Messiah through his descendents (Psalm 89:3-4; Ezekiel 37:25; Luke 1:69). \nDavid’s life was marked by faith and obedience—not just in spite of his biggest mess-ups, but also because of how he repented and walked through them.\nOnce again, God’s grace weaves through lives that seem beyond redemption: through David’s story, your story, and mine. But we can rest assured that He is bigger than our greatest failures.\nThanks be to God.\n\nJessie Minassian is an author, blogger, and speaker, who prefers to be known for her ability to laugh at herself, a weird obsession with nature-ish stuff, and a penchant for making up words. Learn more about Jessie and her ministry at LifeLoveandGod.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram26.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "Psalm 51:10",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nGod, create a clean heart for me\nand renew a steadfast spirit within me.\n– Psalm 51:10\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/SRT-SAMUELS-instagram27.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 7:11",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This week we will memorize the key verse from 2 Samuel, where God establishes a covenant with David and promises provision for His people. \nThe Lᴏʀᴅ declares to you: The Lᴏʀᴅ himself will make a house for you.\n-2 Samuel 7:11  \nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/07/4-12Samuel-4.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 12:26-31, 2 Samuel 13:1-39, 2 Samuel 14:1-33, Leviticus 18:9, Deuteronomy 22:28-29",
        "devo_title": "Absalom’s Restoration",
        "devo_summary": "\nBY Amanda Bible Williams\n\nEditor’s note: Some passages in 1 & 2 Samuel, namely those in Day 29, deal in subject matter which might be especially painful for some readers. Though many of the wounds we receive in this life are deeply personal and unimaginably painful, when they appear in God’s Word, we are reminded that He sees them. Whenever sin is addressed in Scripture—whether through teaching or story—it comes to us in the context of God’s unwavering commitment to bring an end to all evil in this world through the finished work of Christ (Revelation 21:3-4). We are praying for and with you as you read.\n________\nScripture Reading: 2 Samuel 12:26-31, 2 Samuel 13:1-39, 2 Samuel 14:1-33, Leviticus 18:9, Deuteronomy 22:28-29\n“I want to see it, Mom. I’m old enough.” This is what our daughter said to us recently as my husband and I watched the news. We flipped the channel as she walked into the room, and she objected, claiming she could handle it. She wanted, needed, to know what was happening. \nIt’s a hard line to toe—the line between protecting and equipping—and not just when it comes to children. Even as adults, it’s difficult to know the difference between necessary and gratuitous knowledge. The world is dark. The world is broken. We know this. But knowing in theory is not the same as knowing in fact. It takes coming face to face with the depth and darkness of sin to understand that these are not problems that can be solved with pen and paper and policy. These are problems of the heart. \nI know myself. And I know—at least I think I know—the sin I am capable of. I know the darkness I’ve indulged, both in thought and in action, and this knowledge chills me to the bone. But I also know the sin that has been committed against me, sins I have rarely uttered and would be thankful to forget—injustices I may not see a reckoning for this side of heaven. Songwriter Ellie Holcomb sings a line that resonates deep within me, especially when those scenes from the past come calling on my conscience: “I need a rescue, I need a reckoning for all the things I’ve done and have been done to me.” \nWe all need a rescue. We all yearn for a reckoning. \nToday’s passage contains, for me, one of the most difficult in all of Scripture. I have tears brimming in my eyes even as I type this. Tamar’s story makes my insides burn with anger and weep with sorrow at the manifestations of sin. Yet with the fire and the sorrow, I feel the tender voice of the Holy Spirit whisper to my aching heart, “I see this too. In the darkest of the dark—I am here, too.” \nThese passages from 2 Samuel show us the ugly truth of sin. Sin is deceitful. It is born and bred in lies. Jonadab designed a web of deceit, and Amnon was all too willing to step into it and make it his own. Sin creates desolation—utter emptiness. Amnon’s pleasure became hollow in an instant, and his sin dragged others into this misery. Sin leaves a wake of destruction. What is done cannot be undone. Yes, there is grace for the repentant, but there are still consequences.\nI want to gather Tamar into my arms and tell her she is seen. I want her to know that though disgraced, she is valued. I want her to know that though discarded, she is wanted. I want her to know that though dismissed—the sin committed against her gone year after year unacknowledged—that she has a God who fights for her. I want to tell her all the things I wish I could tell myself every time I’ve felt disgraced, discarded, dismissed. \nOur God receives us, rescues us, and restores us. This is the truth of the gospel of Jesus Christ.\nAs we stand here at the end of these tough chapters of 2 Samuel, that is all I have in my hands today. I stand, weeping for the reality and consequences of sin, holding the knowledge that we serve a God who sees. He sees us in our struggle against sin, and He offers us His righteousness and strength (Romans 5:17). He sees us when we are hurt and hollowed out, and He offers us His unending, unbreakable love (Exodus 15:13). He sees the wrongs that plague this dark, sin-stained world, and He offers us His promise to make all things new (Revelation 21:5). He vows to dry our tears, not just with His compassion but also with His justice (Revelation 21:4). \nYes, this world is ever so broken. But God is here. He is the Healer and Redeemer, and He is with us. \nThank you, Jesus, for coming to dwell with us, for giving your life for the sins of the world. Thank you, Jesus, that the gospel is true.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/SRT-SAMUELS-instagram29.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 15:1-37, 2 Samuel 16:1-23, 2 Samuel 17:1-29, Psalm 96:10, Isaiah 11:1-5",
        "devo_title": "Absalom’s Revolt",
        "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Samuel 15:1-37, 2 Samuel 16:1-23, 2 Samuel 17:1-29, Psalm 96:10, Isaiah 11:1-5\nWe think of God’s favor as an endless river of glittering gifts, but that’s not the whole story. \nDavid shows us that God’s favor isn’t always an easy pill to swallow. Sure, he received a kingdom from the Lord (2 Samuel 7:8). That gift came with plenty of perks, but being a man after God’s own heart also came with challenges. \nWhen Samuel anointed David as king, I’m sure it was a happy occasion, mostly because Samuel never mentioned the possibility of facing down a giant (1 Samuel 17), potential death threats from the existing king (1 Samuel 18-23), and the massive temptations that come with being the most powerful man in the land (2 Samuel 11). Samuel certainly didn’t mention that David would have to fight his own beloved son to keep his kingdom.\nWe find the story of Absalom’s rebellion in 2 Samuel 13-18. The wheels started to come off the train when David’s son Amnon raped his half-sister, Tamar. Tamar’s brother, Absalom (Amnon’s half-brother), was enraged by his brother’s sin and eventually had Amnon killed (2 Samuel 13).  \nThis was a low blow for David, but the hits had just started coming. Absalom fled to live with his grandparents. During that long season of waiting, a bitter root started to grow in Absalom’s heart. Though his father eventually welcomed him home with a kiss, Absalom began to plot a coup to take the throne. He launched a PR campaign, tricked 200 men into joining his cause, recruited David’s advisers, amassed an army, and prepared to march on to Jerusalem.\nThe same David who had been promised a kingdom that would last forever put on a disguise and ran for his life.\nThough the battle cost him mightily—20,000 casualties, including his own son—David kept his throne, and God kept His promises. Yes, David was highly favored by God, but that didn’t vaccinate him from hard work and heartbreak.\nThis story reminds me of another hero who knew the gut-wrenching reality of God’s favor.  \n“And the angel came to [Mary] and said, ‘Rejoice, favored woman! The Lord is with you.”\n– Luke 1:28\nYes, Mary was a “favored woman” with reason to rejoice. But serving God also meant suffering. The angel didn’t mention that Mary would watch her miracle boy die a horrible death on the cross.\nWhen we confuse God’s favor with a free ticket to Easy Street, we can find ourselves easily blindsided. As God’s child, you are highly favored, but that doesn’t mean life will never throw you a curveball. Absalom’s rebellion shows us that suffering is not a sure sign that God’s favor has left us. \nWill we praise God, even when His favor comes with both victories and challenges?\n\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/SRT-SAMUELS-instagram30.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 18:1-33, 2 Samuel 19:1-43, Romans 5:7-8, 1 Timothy 1:12-17",
        "devo_title": "David’s Kingdom Restored",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: 2 Samuel 18:1-33, 2 Samuel 19:1-43, Romans 5:7-8, 1 Timothy 1:12-17\nI have to admit I wanted justice to be done to Absalom. I remembered how he had treated David in prior chapters. He betrayed him. Tricked him. Risen up against him. It was wrong, and Absalom needed to be punished. Even though David had given his men strict orders not to hurt him, when Joab took advantage of Absalom’s vulnerable position and killed him, I thought to myself, Well, he deserved it. It gave me the same kind of satisfaction I have when watching a movie and the good guy finally finishes off the bad guy in the end. \nOf course, the Bible isn’t a movie. It’s real life. And a few verses later, I was reminded of this. When David hears of Absalom’s death, he cries out, “My son Absalom! My son, my son Absalom! If only I had died instead of you, Absalom, my son, my son!” (2 Samuel 18:33). With those words, my sense of justice deflated and tears came to my eyes. \nAbsalom was David’s child. David had held him as a baby. He’d watched him grow up. He’d probably taught him to be the strong warrior he was. And though their story took a turn for the worse and reconciliation was needed, there was once a time when father and son ate meals together. They were family. \nWith David’s grief-stricken response to the news of his son’s death, this story of civil war  becomes a story of a father losing his son—a story not unlike our own. \nThe hard truth is that both Absalom and I deserved the same ending. I betray God with each sin I commit. I try to manipulate His will. I go my own way, as if I am the king of my life and He is not. \nThis is true of all of us. But this is also true: “God demonstrates his own love for us in this: While we were still sinners, Christ died for us” (Romans 5:8). This is what changed the ending for us. We were headed toward a sure death due to our own sin, but God in His kindness sent His Son to die in our stead, so that we could be reconciled to our Father.  \nThe father-son story in 2 Samuel 18 is a tragedy. David never got to reconcile with Absalom. He did not get to give his life so Absalom could live. Though our story parallels Absalom’s, our ending turns in the opposite direction. Because of Christ, we are reconciled to our Father. Because of Christ, we have victory over death. Because of Christ, Paul’s words are ours too:\nChrist Jesus came into the world to save sinners—of whom I am the worst. But for that very reason I was shown mercy so that in me, the worst of sinners, Christ Jesus might display his immense patience as an example for those who would believe in him and receive eternal life.\n– 1 Timothy 1:15-16\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/SRT-SAMUELS-instagram31.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 20:1-26, 2 Samuel 21:1-22, 2 Samuel 22:1-51, Psalm 89:29-33, Revelation 20:11-15",
        "devo_title": "David’s Song of Thanksgiving",
        "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: 2 Samuel 20:1-26, 2 Samuel 21:1-22, 2 Samuel 22:1-51, Psalm 89:29-33, Revelation 20:11-15\nChronologically speaking, David’s Song of Thanksgiving recorded in 2 Samuel 22 belongs earlier in David’s story, closer to the beginning of the book. David probably wrote this before he was king, around the time he had been saved from Saul and realized his place on the throne was eminent. \nDavid was in for an eventful forty-year kingship, filled with many highs and many lows. To name a few—\nHigh: David is crowned king of Israel.\nHigh: He moves the capital of Israel to Jerusalem.\nLow: He commits adultery with Bathsheba and has Bathsheba’s husband killed.\nLow: David and Bathsheba’s son dies as a consequence of David’s sin.\nHigh: God forgives David for his adultery and blesses him with his son Solomon.\nLow: His son Absalom kills his other son Amnon to avenge the rape of Absalom’s sister Tamar.\nLow: Absalom tries to take the kingdom of Israel from him.\nHigh: David’s men defeat Absalom’s men and the kingdom is restored to him.\nLow: Absalom is killed in battle.\nDavid’s problems did not end with Saul. A rollercoaster of war, death, family rivalry, and suffering would mark his days. And as his circumstances changed, so did his character. Faithful one minute, unfaithful the next. God’s character, however, did not change. He was David’s rock during a lifetime of shifting sand.\nThroughout the Song of Thanksgiving, David describes God with adjectives and metaphors of strength and consistency:\n“The Lord is my rock, my fortress, my deliverer” (v.2).\n“My shield, the horn of my salvation, my stronghold, my refuge” (v.3).\n“… the Lord was my support” (v.19).\n“And who is a rock? Only our God” (v. 32).\n“The Lord lives—blessed be my rock!” (v. 47).\nIf you were to write down your life’s list of highs and lows, it may not be as dramatic as David’s, but I’ll bet it’s just as inconsistent. Suffering, hope, despair, joy—our circumstances are constantly changing and with them, our hearts. Faithful today, unfaithful tomorrow. But just as God intervened in David’s life and pulled him out of deep waters (2 Samuel 22:17), so did He intervene in our lives by sending Jesus Christ, who entered this world to save us from the dark waters of sin. Christ is now the rock on which we stand. The winds will change and they will change us, but His faithfulness to us will not. \nI like that the writer of 2 Samuel placed David’s Song of Thanksgiving at the end of the book. The words were true before David’s forty-year reign, and they were true after it. David’s change in circumstances did not signify a change in God’s character. I wonder how often he went back to the words he wrote on that day of thanksgiving. I wonder if, in his darkest nights, he clung to what he knew to be true of God then, even if it didn’t feel true in the present moment. \nWhat aspects of God’s character did you sing yesterday that you need to remember today? In the midst of life’s changing waters, we can be sure that we have been pulled out of the depths. That is a consistent truth. \nLet’s be thankful today that our character and circumstances do not change who God is or what Jesus did. As we move through life’s highs and lows, we worship a God who is the same, all the time, even when we are not. He will not take His love from us, and He will never betray His faithfulness. Thanks be to God.  \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/SRT-SAMUELS-instagram32.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 23:1-39, 2 Samuel 24:1-25, Micah 1:2-3, John 2:19-22",
        "devo_title": "David’s Last Words",
        "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: 2 Samuel 23:1-39, 2 Samuel 24:1-25, Micah 1:2-3, John 2:19-22\nThey say that at the end of life, things will become clearer. Our priorities will crystallize and our discernment will sharpen. They say no one ever lies on their deathbed and says, “I should have spent more time at the office.” No one wishes they’d been less generous, less loving, less devoted to forgiveness and reconciliation. The secret, then, is to live now with the end in mind—to live now like we’ll wish we had then. \nThis is what they say. But what does the Bible say?\nScripture is filled with flawed humans who could have lived life better. Aside from Jesus, you’ll be hard pressed to find a person whose deathbed retrospective is free of wishes or regrets. Come to think of it, the idea of finding a “secret” to outsmarting our humanity is wholly absent in the 66 books of the Bible. \nInstead of giving us life hacks, God’s Word gives us a promise: our life here on earth exists within our truer, eternal life with God through His Son.\nWhen we reach the final chapters of 2 Samuel, at the end of David’s life, we don’t find him urging us to be our best selves. We find him composing a final poem—one last expression of what he knows to be true of God and his life with God. In it, David declares:\nIs it not true my house is with God?\nFor he has established a permanent covenant with me,\nordered and secured in every detail.\nWill he not bring about\nMy whole salvation and my every desire?\n– 2 Samuel 23:5\nDavid’s dying thoughts don’t hinge on what he has or has not done, but rather on what God has done and continues to do. \nGod made a covenant with David and He ordered every detail, in David’s life and beyond, to uphold that covenant. The second half of chapter 23 gives us a glimpse into those details—a brief and profound look into God’s provision, for David and for all people of the covenant, through the exploits of David’s “Mighty Men.” \nThis group of more than thirty men were named and known, both by the Lord and by David. Their devotion to God’s anointed king was no accident, and neither was the bravery and might they displayed on David’s behalf. One, named Eleazar, fought until he quite literally could not go on. Verse 10 says he “stood his ground and attacked the Philistines until his hand was tired and stuck to his sword.” Even so, Scripture makes it clear that God brought about the victory that day (1 Samuel 23:10). Another, called Benaiah, “went down into a pit on a snowy day and killed a lion” (v.20). A trio of men known as “the Three” risked their lives just to bring a thirsty, homesick King David a drink of water from his hometown well (vv.15-16). \nI circled their names in my study book—these warriors of the covenant who are known by name to the Lord and now to us so many generations later. It was the name at the end of the list that made my stomach lurch: Uriah the Hethite (v.39). The same Uriah who was married to Bathsheba. The same Uriah who was killed to cover up the king’s own sin. A mighty man snuffed out by a powerful one. \nOur stories, like David’s, are complicated. They are filled with things we did and didn’t do, things other people did and didn’t do, and the consequences that followed. We have days when we look like heroes and days when our hearts look as murderous and unfaithful as David’s did with Uriah and Bathsheba. The story told in 1 and 2 Samuel offers us only one faithful Hero—the Lord. \nGod’s faithfulness is the context of David’s story and ours. His sovereignty reigns over every plot point; His mercy is mightier than our regrets. By faith in God’s Son, Jesus, we can stand at the end of our days and say with David, “My house is with God. He has established a permanent covenant with me, ordered and secured in every detail. He will bring about my whole salvation.” \nAll glory be to Him.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/SRT-SAMUELS-instagram33.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "Romans 5:8",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut God proves his own love for us in that while we were still sinners, Christ died for us.\n– Romans 5:8\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/SRT-SAMUELS-instagram34.jpg"
    },
    {
        "book_title": "1 & 2 Samuel",
        "devo_passages": "2 Samuel 22:36",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we read through 1 & 2 Samuel together, we are memorizing five pivotal verses from these books. This week’s verse rejoices in God’s sure protection and help.\nYou have given me the shield of your salvation;\nyour help exalts me.\n-2 Samuel 22:36\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/4-12Samuel-5.jpg"
    }
]