[
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 1:1-21, Zechariah 2:1-13, Psalm 35:27-28, Revelation 21:22-27",
        "devo_title": "A Plea for Repentance",
        "devo_summary": "\nBY Rebecca Faires\n\nFrom beginning to end, the Bible tells the story of God’s redemptive plan. Zechariah’s prophecies anticipate the grand culmination of history, describing a coming glorious king and a world where everything is set right. While Zechariah prophesies judgment for the wicked, his message is filled with hope and glorious promises for God’s people.\nZechariah’s eight visions portend restoration for the righteous and punishment for the unrepentant. At the heart of these prophecies is the promise that the Lord is the one who enables repentance. The message of Zechariah’s first three night visions amounts to one urgent directive: repent.\nFirst, we see an angel (some scholars suggest this is a figure of Christ) standing among the myrtle trees, sending out messengers to do His will, speaking words of comfort and love for God’s people. He promises restoration and mercy, offering an invitation to come back to Him: “Return to me… and I will return to you” (Zechariah 1:3). \nSome people hold up an image of the God of the Old Testament as being angry all the time, but that’s a false image—one that’s quite inconsistent with Scripture as a whole. No matter where we turn in the pages of the Bible, we will find a God who is holy and who hates evil, but simultaneously loves His creation and offers abundant mercy to all who will heed His tender offer. And that’s what we see in Zechariah.\nThe second vision is of the might of Judah’s oppressors, which appear as horns. But their oppression is short-lived, as craftsmen approach and quickly dismantle their power. The third vision is of a surveyor, measuring the city of Jerusalem, the city of God’s people. Here, we again see God’s abundant mercy and blessing, as God’s people, set free from their captivity, have their dwelling place with God.\nIf we’d lived in Zechariah’s day, we, too, would have a long list of grievances to call our courage into question. The temple, whose foundations had been laid by the returning Jewish exiles, remained incomplete—a seemingly hopeless, abandoned project. Prophets had come and gone, but their words had made little effect. The people of Judah still did not seem to have a vision for a restored kingdom, and instead intermingled with the world around them. \nHave you also looked about and found discouragement in your world? Have you seen a lackluster church or half-hearted believers? Perhaps you have found these same roots of a sluggish faith in your own heart and are discouraged. Here is the good news: Christ, the Lord of Armies, comes to us, riding on a white horse. He has come to unseat the power of the oppressor and to set free the captives. He beckons to the sluggish, Come out of Babylon! (Zechariah 2:7). Christ the Lord of hosts has come to dwell with His people, bringing joy and gladness! (v.10).\nOften our great discouragement comes from fixing our eyes on the woes of the world and the trepidations of our heart, rather than fixing our eyes upon Christ. The anger of the Lord of armies is a call to bring us back home. Zechariah reminds us that our vision is to be fixed upon Him alone.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day1-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 3:1-10, Zechariah 4:1-14, Romans 3:21-26, 1 Corinthians 1:28-29",
        "devo_title": "Zechariah’s Visions",
        "devo_summary": "\nBY Rebecca Faires\n\nWe adopted two of our sons from Ethiopia nine years ago today. It has been a long journey for all of us, and I am so glad that I’m nine years down this road and not back at the starting line. As soon as we leapt over that starting line and landed on the ground in Africa, I thought I was probably going to die. We later realized I was just pregnant with baby number four. When the nannies thrust two sweet, sad, screaming boys at us we realized we were massively unprepared. \nThe early part of our adoption story is filled with diapers, fungi, and giardia. I remember how I longed to have all of the filth removed from my children and my home, but it seemed an unending struggle. And our boys couldn’t fix it themselves. Those sweet babies needed love, and sometimes latex-gloved hands, to help them out.\nJust like helpless, sick toddlers from an orphanage with no running water, we, too, came to Christ dressed in filthy clothes. And we couldn’t get free of it on our own. Notice that in the fourth vision from today’s reading, the Lord doesn’t say to Joshua, “Get yourself cleaned up!” but instead “Take off his filthy clothes!” (Zechariah 3:4). He needed someone to do it for him, and so do we.\nChrist removes our iniquity, and then He clothes us in festive robes (v.4). I love how the gospel gives us a total turn-around. He could have replaced filthy garments with a reasonable and sensible second-hand T-shirt. That’s certainly better than where we were. But Christ loves us and dresses us in the best He has to offer. He washes us clean and elevates us from the gutter to His right hand, like true sons and daughters.\nNot only are our filthy rags removed, but we are made to dwell in the shadow of His covering, where we, now filled with the joy of the good news of the gospel, may invite our neighbors to also find rest (v.10). And as sons and daughters, we are invited to walk in His way and keep His mandates (v.7). \nJust as we are unable to make ourselves clean by our own scrubbing, we are also dependent upon Him and His constant character. Our newness of life is achieved “not by strength or by might, but by my Spirit” (Zechariah 4:6). God is the one who makes the mountains a plain (v.7) and removes all obstacles. In this case, Zechariah prophesied the seemingly impossible completion of the temple. But in its true fulfillment, Christ establishes His temple and makes the mountains into plains (Isaiah 40:4). He alone breaks down the barriers of sin, and declares us righteous, a fit dwelling place for His Spirit. \nAnd, newly cleansed, we will see that just as the temple completion in restored Jerusalem was the work of God alone, so also the conversion of our hearts and the cleansing of our guilt is achieved through grace (Zechariah 4:7).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day2-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 5:1-11, Zechariah 6:1-15, Matthew 16:18, Galatians 3:13-14 ",
        "devo_title": "Crowning of the Branch",
        "devo_summary": "\nBY Rebecca Faires\n\nI definitely do not want my living room to be visited by a giant flying scroll. I do not want to see a shrine built to the basket o’ wickedness. And I feel quite uneasy about dappled horses patrolling north, west, east, and south. The visions God gave to Zechariah can be both creative and terrifying. They reveal how God shows kindness to His people while bringing judgment to the wicked. Puritan commentator Matthew Henry reminds us that while the pillar of fire in Egypt was a beacon of promise to Israel, it was a swirling black portent to the Egyptians.\nWe tend to think of judgment as only that which follows sin, but whenever God allows people to devote themselves to wickedness, that also is a judgment. God sends the basket of wickedness to Shinar—the land of Babylon—and it is placed upon a shrine to be worshiped. In other words, He is telling His people that if it’s evil and wickedness they want, they can return to Babylon. But make no mistake: there is no good thing in that basket, only wickedness. Or they can choose to stay in Judah and return to the Lord. He is coming, and He will keep His promises.\nVisions and prophecies are difficult to interpret—that is one thing commentators and biblical scholars can agree on. However, one thing is clear: The Lord is the Lord of the whole earth. All the lands are His, and His ministers roam to and fro, doing His bidding. He alone is Lord and God. And that is truly comforting to His people, because He is a good God.\nZechariah looked to see what was approaching, and though the images are striking, the substance of His visions fits with what we already know of the gospel. The final image here is of the crowned priest-king who “will build the LORD’s temple; he will be clothed in splendor and will sit on his throne and rule… People who are far off will come and build the LORD’s temple, and you will know that the LORD of Armies has sent me to you (Zechariah 6:13,15). The reign of righteousness established by the Branch is a foreshadowing of Christ, the true Priest-King, who alone “fully obeys the Lord” (vv.9–15). No matter what our circumstances might look like, no matter what disappointments surround us, no matter how we’ve failed, our only hope is Christ.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day3-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 7:1-14, Zechariah 8:1-23, Jeremiah 31:33, Micah 6:7-8",
        "devo_title": "Fasting and Feasting",
        "devo_summary": "\nBY Rebecca Faires\n\nThis passage in Zechariah is beautiful. The people of Israel, just like all of us, keep missing the heart of the matter. For example, when I apologize to my husband for, say, driving the wheels of our bus into the tiny wall that separates the road from a 400-foot cliff drop in Glacier National Park, I’m tempted to just make a legalistic show of it. Once I’ve said the words, “I’m sorry,” I expect him to snap out of it, get back on the bus, and forgive me for my adventurous driving maneuvers. (The road was very narrow, you see.) We teach children this same formula of repentance: \n“Say you’re sorry.” \n“I’m sorry.” \n“Okay, I forgive you.”\n(Transaction complete.)\nBut just going through the motions of repentance does not true repentance make. In today’s passage, the residents of Bethel come to Jerusalem to ask about an upcoming fast. They’re prepared to go through the tired motions of keeping it, but they don’t mean it. Have you ever fasted “unto the Lord” but really just with an eye on your swimsuit-season prospects? Have you ever, like me, apologized with the goal of just getting on with it, instead of engaging in true sorrow and repentance over hurting someone?\nWe’ve all been on the receiving end of bad repentance and know what a mockery it is. Yet are we foolish enough to think that, somehow, by going through the motions, we can appease a holy and almighty God. God sees right through all of this, of course (Zechariah 7:5). He’s obviously not fooled by the sorry recitations of His people. But here’s the unexpected gorgeousness of His goodness: He doesn’t want to keep us fasting and dredging and reciting forever—these are just training tools. He wants to bring us into feasting and celebration. He wants us to reap goodness and abundance (8:12).\nThis is precisely why He calls His people to repent. Genuine repentance is never mere lip service. It is a transformation. It is a turning of heart, soul, mind, and strength from the folly and filth of sin to the hope and goodness of God. When the Lord of Armies declares His zeal and His jealousy for Jerusalem, it is a zeal and jealousy not only for His glory, but also for our good! The justice and mercy of God are not a contradiction, but a harmonious accord. Because of His faithful love, He would have us also “show faithful love and compassion to one another” (Zechariah 7:9). He comes to transform us, that we may be like Him, that we also may “love truth and peace” (8:19).\nHe is calling us away from fighting over the cereal on the floor under the kids’ table to join Him for the real meat and drink at the feast. He transforms us from petty and insincere beggars to dear children who dance and play in the congregation of His people (Zechariah 8:3–5). The fasting of genuine repentance, in God’s economy, always produces the joyful feast of salvation.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day4-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 9:1-17, Psalm 100:1-5, Isaiah 62:3",
        "devo_title": "The Coming of Zion’s King",
        "devo_summary": "\nBY Rebecca Faires\n\nI like to be right. But it’s not always enough to be right. \nAs a child, I would pertly correct my little sister with bits of wisdom such as, “Frankenstein is actually the name of the doctor, so the monster could more accurately be called ‘Frankenstein’s monster.’” After that, my mom patiently explained to me that there is a difference between being right and being obnoxiously right. It’s important to know the difference, because even if the proper pluralization of “cul de sac” is actually “culs de sac,” you still kinda want to roll your eyes at someone for pointing it out. We’ve probably all been on the receiving end of someone else’s unsolicited commentary that is so obnoxiously right that they’re just wrong.\nChrist, on the other hand, is always right. He is the definition of right. But—and this is the amazing part—He is graciously right. The Lord conquers graciously. He does not conquer us and then commence with trash talk or years of making us feel inadequate. To be conquered by Him is to win the greatest victory of all time. Remember Jacob, wrestling the angel of the Lord at Peniel—he was injured but that was the only way to win the victory (Genesis 32:22–31).\nIn Zechariah 9, we see how the word of the Lord promises to come against the lands that surround His people, places renowned for their wickedness, like Tyre and Sidon. Though these nations and peoples have gathered temporal wealth, God will strip it all away. Though they have amassed the might of violent arms, their pride will be destroyed. Their wealth will be cast into the sea, and they will be “consumed by fire” (v.4). This is the language of God’s judgment against the wicked. \nBut a striking thing happens: when their kings have been removed, their strength has been destroyed, and their hope has failed, then God will turn and be gracious. He will even make of them a remnant, as He had with the clan of Judah.\nThe image of the great King of Zion, riding on the colt of a donkey is the perfect depiction of Christ, who wages war with an offer of peace, and destroys His enemies with His own death. He confounds the wisdom of the world, and undoes the reasoning of our own hearts. \n“Rejoice greatly, Daughter Zion!  Shout in triumph, Daughter Jerusalem!  Look, your King is coming to you;  he is righteous and victorious.”  –Zechariah 9:9\nAll too often, the Old Testament judgments of God are misunderstood and characterized as vindictive and punitive. But Zechariah 9 is a reminder of the true nature of His judgment. While He does indeed detest idolatry and wickedness, His judgments cannot be separated from His love. \nI am reminded of C.S. Lewis’s statement in The Problem of Pain: “If God were proud He would hardly have us on such terms: but He is not proud, He stoops to conquer, He will have us even though we have shown that we prefer everything else to Him, and come to Him because there is ‘nothing better’ now to be had.” \nThe Creator of the universe has donned the garb of a servant to humbly wash the filth from our feet. As He did with Saul on the road to Damascus, our God comes to convert enemies into beloved children.\nHe stoops to conquer our hearts. Amen.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day5-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Micah 6:8",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nMankind, he has told each of you what is good and what it is the LORD requires of you: to act justly, to love faithfulness, and to walk humbly with your God. —Micah 6:8\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day6-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 2:10",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThroughout the book of Zechariah, there is an emphasis on both the people returning to God and God returning to His people. This week, we will memorize a verse celebrating God’s presence among His people. \n“Daughter Zion, shout for joy and be glad, for I am coming to dwell among you”—this is the LORD’s declaration.  —Zechariah 2:10 Zechariah 2:10\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/4-MinorProphets2019-1-576x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 10:1-12, Isaiah 14:1, John 6:22-35",
        "devo_title": "The Lord Restores His People",
        "devo_summary": "\nBY Guest Writer\n\nReading well is all about understanding contexts. That’s what I tell my students. Otherwise, how are we to unpack images asking for spring rain, when we really think April showers have been a little too abundant this year? Why be concerned about not having a shepherd? You could just hire one from the local Christmas pageant. Even more puzzling: How do we muster up the imagination to envision a docile, aimless little flock of sheep turning into a mighty steed? And what about cornerstones and tent pegs? Needless to say, these aren’t typical, daily ponderings for most of us. \nBut before we get sidetracked by these images themselves, let’s remind ourselves of the main message behind them: No matter what, God’s people are to trust Him—specifically, to trust that He will bring us home. And that is what we’re longing for: home. We’re longing for stability—maybe that’s what the cornerstones and tent pegs are all about. We’re longing for families reconciled. (Did you notice the “houses” of Judah and Joseph coming together after long centuries of hostility?) We’re longing to be brought safely through troubled waters to arrive at home. \nThe first image drawn directly from Zechariah’s geographical context is embedded in numerous prophetic messages. In a part of the world where it generally rains only between October and March, those extra showers in April were (and are) a gift. In response to Israel’s obedience, God promised rain in its season, even mentioning the autumn and spring rains (Deuteronomy 11:13–15). Drought and famine, however, were always lurking around the seasonal corner if God’s people were disobedient (vv.16–17). \nThe invitation to ask God for the blessing of rain is followed by warnings against sliding into the deceitful orbit of household gods (teraphim) and diviners. We should not be tempted into thinking this warning was just for Israel—that is was their problem and not ours today. But not so fast. Sure, teraphim and diviners don’t show up much in our social media feeds these days, but the misplaced hope the people wholeheartedly placed in those practices is a little too familiar. \nDivination had everything to do with determining if the gods were going to show favor to them. Magic meant manipulating those presumed deities to get them to be favorable, to meet the people’s desires. The household gods were part of this network, too. Zechariah called them out on their behavior, telling them their self-serving “trust” lay in the wrong places. \nThen and now, it is God who gives blessing and assurance, with the ultimate purpose that we be a blessing to others. Diviners, whether ancient or modern-day, produce only emptiness and deceit. How about us? Where do we focus our attention as we seek a good and secure life? What are our cornerstones and tent pegs as we try to hold our fragile life structures together? Can we truly say that God indeed is our Cornerstone? That is essential to coming home and walking securely in the name of the Lord (Zechariah 10:12).\n\nElaine A. Phillips received a BA in social psychology from Cornell University, an MDiv from Biblical Theological Seminary, and an MA in Hebrew from the Institute of Holy Land Studies in Jerusalem, where she and her husband, Perry, studied and taught from 1976–79. She holds a PhD in rabbinic literature, and teaches Biblical Studies at Gordon College. She also serves as a historical geography field instructor for Jerusalem University College. She has published a commentary on Esther in The Expositor’s Bible Commentary; a devotional book, With God, Nothing Is Impossible; and, most recently, An Introduction to Reading Biblical Wisdom Texts. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day8-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 11:1-17, John 10:25-30, Acts 1:15-20",
        "devo_title": "Israel’s Shepherds",
        "devo_summary": "\nBY Guest Writer\n\nWe have a tough lesson coming up, no matter how we try to soften the blow. When leaders neglect their responsibilities, the consequences are grave—for everyone, in every time and every place. The opening imagery of this chapter sweeps through mighty cedars, majestic cypresses, sturdy oaks of Bashan, and the thickets of the Jordan. All have come crashing to ruin, and how great is their fall! \nAgainst that devastating backdrop, the images shift to shepherds, a common figure for leaders in the Old Testament. It is important to make that connection because our “church-shaped” lens has relegated shepherds to the margins of society, which is where they had landed by the time of Jesus. Centuries before, however, shepherds in the ancient Near East had significant power and status because they controlled extensive sources of income: their flocks. \nZechariah’s bad shepherds—there were more than one—were missing some critical character traits. Good shepherds invested days and months of arduous labor as they migrated great lengths with their flocks to find food and water. In order to protect their sheep from threats of all kinds, they watched over them for long stretches of hours at a time. They cared for those that were diseased, and knew each sheep by name and touch. The shepherd’s staff was a symbol of care, giving assistance and direction, and of leadership and rescue. As Timothy Laniak states in his book While Shepherds Watch Their Flocks, good shepherds were skilled and trustworthy, “willing to take responsibility for the work,” whatever it may entail. \nThis description is a stark contrast to Zechariah’s harsh indictment of the shepherd God would appoint to bring judgment on the wayward people. He “does not care for those being destroyed, or seek the young or heal the maimed or nourish the healthy, but devours the flesh of the fat ones, tearing off even their hooves” (Zechariah 11:16, ESV). No wonder the chapter ends with a pronouncement of woe over that shepherd who deserted the flock and gave up on them, in essence, saying, “let them all die or destroy each other” (v.9, my paraphrase). He broke his staff called Favor (symbolizing the end of covenant compassion and rescue), and then demanded his payment: thirty pieces of silver. Judas betrayed the ultimate Good Shepherd for the same price (Matthew 26:14–15; 27:3–10).\nThis is heart-wrenching for what it says about the human condition behind the imagery. Those who bought and sold were only concerned with the profit. It’s hard not to think of the modern-day scourge of global human trafficking. Which begs the question: How can thoughtful and compassionate leaders intervene to stop the utter dissolution of social structures originally designed for our protection? \nWhile this is a gloomy picture, to be sure, it would be incomplete without returning to the words of the Good Shepherd: “My sheep hear my voice, I know them, and they follow me” (John 10:27). Jesus assures that no one is able to snatch those sheep out of the Father’s hand (vv.28–30).\n\nElaine A. Phillips received a BA in social psychology from Cornell University, an MDiv from Biblical Theological Seminary, and an MA in Hebrew from the Institute of Holy Land Studies in Jerusalem, where she and her husband, Perry, studied and taught from 1976–79. She holds a PhD in rabbinic literature, and teaches Biblical Studies at Gordon College. She also serves as a historical geography field instructor for Jerusalem University College. She has published a commentary on Esther in The Expositor’s Bible Commentary; a devotional book, With God, Nothing Is Impossible; and, most recently, An Introduction to Reading Biblical Wisdom Texts. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day9-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 12:1-14, Genesis 12:1-3, John 3:14-17",
        "devo_title": "Judah’s Security",
        "devo_summary": "\nBY Guest Writer\n\nWhen we are being swept away by uncontrollable and terrifying circumstances, we search for an anchor, a declaration of truth, something we can cling to. This is true even when frightening events are relatively brief; their impact is felt long after that initial experience. The full force of this reality wallops us in this chapter of Zechariah. Jerusalem’s agony is palpable—a city in the path of violence, under siege, and attacked by all the nations. It’s hard to imagine the abject horror of their situation, especially for those of us who are blessed to live in peaceful, secure environments. \nIt’s no wonder then that the identity of the mighty Master of the Universe is pre-eminent. It is the Lord who stretched out the heavens, gave the earth its foundation, and shaped the spirits of humans, unpredictable though we may be. The clans of Judah, acting as a protective envelope around Jerusalem, emphatically restated this truth: “‘The people of Jerusalem are strong, because the Lord Almighty is their God’” (Zechariah 12:5). This is a perspective worth seizing, worth holding onto with all our might, especially when we feel beaten up. Our strength lies only in the Lord our God. \nThe people of Zechariah’s day knew their own recent history. Jerusalem had been under siege and the people had been taken captive to Babylon. This was the broken Jerusalem over which Jeremiah lamented (Lamentations 1:1–17). Some seventy years later, life in Jerusalem was still precarious. Even so, the prophet’s vision ranged far forward to a day of salvation and glory for Judah, for the house of David, and for Jerusalem. In the meantime, while Jerusalem would indeed be severely attacked, the people of the city would also be “a cup that causes staggering” and “a heavy stone” to all the surrounding nations (Zechariah 12:2–3). It’s a not-so-subtle warning to consider the consequences before attacking Jerusalem. \nBut now the picture takes an odd turn. The house of David and those who lived in Jerusalem would be compelled to plead for mercy as they look upon the Lord, the one they had pierced. That piercing reverberates into the crucifixion of Jesus (John 19:36–37). This sense of calamitous loss and deep need for repentance overwhelms any triumph that might have surfaced in the immediately prior events—and that is as it should be. \nJerusalem and the whole land would mourn, but the greater emphasis is on each “house” by itself—the house of David and his son, Nathan; the house of Levi and his descendant, Shimei. Echoes of kings and priests. Women, traditionally the mourners (Lamentations 2:5; Jeremiah 9:17–22), were intentionally separate and profoundly engaged in the repentance necessary for the forthcoming cleansing fountain (Zechariah 13:1). And clearly, there is more to come.\n\nElaine A. Phillips received a BA in social psychology from Cornell University, an MDiv from Biblical Theological Seminary, and an MA in Hebrew from the Institute of Holy Land Studies in Jerusalem, where she and her husband, Perry, studied and taught from 1976–79. She holds a PhD in rabbinic literature, and teaches Biblical Studies at Gordon College. She also serves as a historical geography field instructor for Jerusalem University College. She has published a commentary on Esther in The Expositor’s Bible Commentary; a devotional book, With God, Nothing Is Impossible; and, most recently, An Introduction to Reading Biblical Wisdom Texts. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day10-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 13:1-9, Matthew 26:26-35, 1 John 2:1-2",
        "devo_title": "God’s People Cleansed",
        "devo_summary": "\nBY Guest Writer\n\nAs you read this chapter, do you notice a radical shift part way through? First, the esteemed person of the prophet comes under fire. Then the focus swivels back to the enigmatic figure of the shepherd. Zechariah pronounced judgment on the prophets with just about the same contemptuous tone as he treated idols. Why take prophets to task in the first place? These, after all, were the men and women who were called to preach God’s revealed Word to the people, both to warn and to encourage them. It seems, however, something had gone awry. \nTo help us process this, we can easily look to our own contemporary churches. No, it’s not my intention to pummel the church with criticism. Instead, I’m just curious to discover good aspects of ministry that can go off track for one reason or another. Taking a closer look might just help us to be on guard in our home churches.\nTwo things come to mind. First, is music ministry, which has a long tradition of well-trained practitioners that can be traced back all the way to the excellent preparation of the Levites in ministry (1 Chronicles 25:1–7). The second is preaching, which carries on the same prophetic tradition mentioned above.\nSadly, lots of “stuff” often gets in the way of accomplishing good and noble goals—stuff that tends to revolve around egos and crowd-pleasing. Of course, we all suffer from these same kinds of human pitfalls in one way or another, so please know that I’m not trying to hunt down specks in the eyes of sisters and brothers in ministry while remaining blind to my own sin.\nBut back to the point: Do you see the connection, how these same nagging traits contributed to the rejection of the prophetic ministry we encounter in Zechariah? The prophets’ bad reputation was a carry-over from the steady stream of deceit uttered by false prophets in Jeremiah’s day, lulling the people to sleep instead of issuing wake-up calls. These false prophets told the people what they wanted to hear, which undermined Jeremiah’s warnings and pleas for repentance. At this point, you could say that parts of Jeremiah 23 sound a lot like Zechariah. Seventy years later, following a brutal exile, God’s people were still trying to put their lives back together. (May God spare us all from the sober consequences of crowd-pleasing preaching!) \nWith the dismissal of the prophets, the shepherd surfaces again. No longer called “worthless,” he is now close to the Lord Almighty. The next words from the Lord are the command to strike the shepherd, followed by the observation that the sheep would scatter, and the warning that God’s hand would be turned against those little ones (see Matthew 26:31). \nThis is difficult to read. Nevertheless, two allusions restore our hope. First, from our New Testament perspective, we know that the Good Shepherd promised to lay down His life for His sheep (John 10:11–18); Jesus said it four times. Second, even though the final image of the refining fire is terrifying, the end products are purified silver and gold. And through it all, we are God’s people, and He is our God (Zechariah 13:9). \n\nElaine A. Phillips received a BA in social psychology from Cornell University, an MDiv from Biblical Theological Seminary, and an MA in Hebrew from the Institute of Holy Land Studies in Jerusalem, where she and her husband, Perry, studied and taught from 1976–79. She holds a PhD in rabbinic literature, and teaches Biblical Studies at Gordon College. She also serves as a historical geography field instructor for Jerusalem University College. She has published a commentary on Esther in The Expositor’s Bible Commentary; a devotional book, With God, Nothing Is Impossible; and, most recently, An Introduction to Reading Biblical Wisdom Texts. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day11-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 14:1-21, John 1:5, Revelation 22:1-5 ",
        "devo_title": "The Lord’s Triumph and Reign",
        "devo_summary": "\nBY Guest Writer\n\nHonestly? I don’t know what to do with this chapter. From pillage to plague to panic—turns out the challenges for Jerusalem were not finally resolved in chapter 12. Attacks against it continue to ratchet up, but not for long. There is hope ahead: The Lord stands victorious on the Mount of Olives; a major seismic event shifts the mountain; there is strange, indescribable daylight; and water flows from Jerusalem east and west in all seasons. Echoing Ezekiel, pointing back to Eden, and looking forward to Revelation, this is the river of the water of life, nurturing fruitfulness and healing, and ending the curse (Ezekiel 47:1–12; Revelation 22:1–5).\nSomewhere along the way, Jerusalem will be secured—for good—and survivors from the nations that were attacking the city will experience an about-face and will come to Jerusalem every year to worship! It’s no wonder their minds were changed; the plague unleashed against them is hideous to behold. Their journey to Jerusalem will be a pilgrimage, coinciding with the Feast of Tabernacles, and former enemies will now be part of that annual celebration! (See Deuteronomy 16:13–15.) \nThink of a possible connection to the Gospels. This final appearance of the Lord on the Mount of Olives, linked with the Feast of Tabernacles, may underlie one of Peter’s irrepressible outbursts. Upon seeing Jesus transfigured before his very eyes as they were on a high mountain, he offered to make three tents (tabernacles) for Moses, Elijah, and Jesus (Matthew 17:1–4). The former two make their final Old Testament appearance at the end of Malachi, anticipating the coming Day of the Lord. Peter expressed his Messianic expectations, lodged in a fabric of biblical allusions.\nIt seems that what I initially dismissed as a hodgepodge of imagery in Zechariah 14, is actually spot-on. The Lord will appear! How will we possibly wrap our minds around everything that will be part of that marvelous spectacle?\nOne thing is certain: The Lord will be the one and only King over all the earth—even cooking pots and horse bells will testify to that truth as they will be inscribed with “holy to the Lord.” Everyone and everything will bow in allegiance. This will be a radical shift away from the culture of today. It makes me wonder how we will even handle what’s to come. \nIndeed, we are left with questions. That’s the way it should be when we are privy to even the smallest hints regarding the unknown future. How could we possibly tie it all up in a tidy package? Nevertheless, here’s a safe and familiar resting place: we trust in the Lord who was, and is, and is to come. He sits on the throne alongside the Lamb, and we will see His face in the new Jerusalem (Revelation 22:1–5). Amen.\n\nElaine A. Phillips received a BA in social psychology from Cornell University, an MDiv from Biblical Theological Seminary, and an MA in Hebrew from the Institute of Holy Land Studies in Jerusalem, where she and her husband, Perry, studied and taught from 1976–79. She holds a PhD in rabbinic literature, and teaches Biblical Studies at Gordon College. She also serves as a historical geography field instructor for Jerusalem University College. She has published a commentary on Esther in The Expositor’s Bible Commentary; a devotional book, With God, Nothing Is Impossible; and, most recently, An Introduction to Reading Biblical Wisdom Texts. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day12-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "John 10:27-28",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n“My sheep hear my voice, I know them, and they follow me. I give them eternal life, and they will never perish. No one will snatch them out of my hand.” —John 10:27-28\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day13-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Zechariah 13:9",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Zechariah.\n“I will put this third through the fire; I will refine them as silver is refined and test them as gold is tested. They will call on my name, and I will answer them. I will say: They are my people, and they will say: The Lᴏʀᴅ is our God.” —Zechariah 13:9\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/4-MinorProphets2019-2-576x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Malachi 1:1-5, Acts 20:32-35, Romans 9:6-21",
        "devo_title": "The Lord’s Love for Israel",
        "devo_summary": "\nBY Melanie Rainer\n\nI am indescribably lucky to have the friends that I do. Describing us as “friends” seems too weak, in fact. We’ve been friends since college, and some of us since middle school and even earlier. We are in each other’s lives daily: in the good and bad, the clear and the messy, and everything in between. There are almost twenty of us, married couples and singles, brothers and sisters, roommates and travel buddies. We float in between one other’s homes, dropping our kids and our stuff here and there. We’ve swapped house keys and life stories, and we hold them both with the fiercest grip we can. \nI think what makes this particularly strong group of friends so secure is not that we all think the same way or like the same things. We don’t. And it’s not that we root for the same teams or go to the same churches, or laugh at the same jokes. What makes us us is our history, the steadfast faithfulness of friends that have linked arms and stood down the hardest—and celebrated the best—of what this world has to offer. \nWhen I read the first verses of the book of Malachi, I think about my friends and our history. (Malachi is a book of prophetic satire, written in the form of questions-and-answers between the Lord and His people.) When the Lord says, “I have loved you,” and the people scoff back, the Lord reminds them what it means to be loved by Him.\nBeing loved by God didn’t mean that the people always followed Him. It didn’t mean that He didn’t follow through with His promise to exile them when they turned away (see Deuteronomy 30:4–6). Being loved by God didn’t mean everything would always go right, but it did mean that He would bless them because of the promises He made to Abraham and Jacob (Romans 9:6–13). \nMalachi contrasts their fate with Edom’s, the group descended from Esau, who was not chosen by the Lord in the same way Israel was. Edom would be destroyed completely. Israel had felt destruction during the exile, but had been restored. \nThe opening disputation of Malachi (there are six that we will read this week) is a reminder, a wake up call to a lackadaisical people. They are loved, have been loved, and will be loved by the Lord. Forever.\nWhen we look to the grand narrative of the Bible, we see the continued faithfulness of the Lord to His people. In the Old Testament, it is to His chosen people in Israel, the sons and daughters of Jacob. In the New Testament, Jesus brings the message of hope and restoration to all people, Israelite or not. My faith finds its footing in these stories, in the reminders of the book of Malachi and in the testimonies of God’s steadfast faithfulness throughout Scripture and history. I am loved, I have been loved, and I will be loved—forever. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day15-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Malachi 1:6-14, Psalm 87:1-7, Ezekiel 36:16-23",
        "devo_title": "Disobedience of the Priests",
        "devo_summary": "\nBY Melanie Rainer\n\nWhen my daughter was first learning about sharing with other people, she used to say the funniest things. She would say, “I AM sharing. Sharing with ME.”\nWe’d laugh it off, and thankfully as she’s grown she has become an incredibly kind, encouraging, and giving person, willing to share with whomever is around. But when she was little, those feeble attempts at “sharing” were empty gestures. She wasn’t really sharing; she was just saying the words. \nIn the second disputation in Malachi, we see the Lord call out the Israelite priests for the same type of behavior. They were sacrificing, yes, but they were sacrificing blind and lame animals. Some animals were stolen, and some were sick. Not only were the priests violating the Mosaic covenant (Leviticus 22:18–25), but they dismissed the Lord’s accusations. \nThe Lord is righteously angry with the priests. The system of sacrifice He had established to make a way for unclean people to be clean was breaking down. The priests disregarded the law, made nonchalant offerings, and then claimed, “What a nuisance!”\nThe priests weren’t really sacrificing. They were going through the motions, but not experiencing the fullness of what the Lord had intended for them. They took His name and presence for granted. Contextually, it’s hard to imagine. The people of Israel had already been exiled for this exact behavior: ignoring the Lord, following other gods, not taking His name seriously. But the Lord had restored them. They were home. And yet, again, they were falling back into the same sinful patterns.\nThe book of Malachi is unique, a set of prophecies written after the return to Israel. But its warnings feel deeply personal to me. Am I really living in the fullness of what the Lord intended? Do I go through the motions without feeling the cost of following Him? Am I taking His goodness, presence, and mercy for granted? \nI love how the sharply-wielded critique of a thousands-year-old prophet can cut me down to my knees. It’s the power of Scripture, the words of the holy Lord of Armies, reminding me that He alone is God, and His name will be feared among the nations. I’m thankful for that promise, and the reminder that the center of my universe is not me and my sad attempts at sacrifice, but rather the God who made it all.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day16-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Malachi 2:1-16, Psalm 132:8-10, Hebrews 8:8-13",
        "devo_title": "Warning to the Priests",
        "devo_summary": "\nBY Melanie Rainer\n\nOh, Israel. \nWith the book of Malachi, we’ve reached the end of the Old Testament. For 38 books prior, we’ve seen the Israelites flounder. Malachi’s sharp wit pierces the stale narrative in new ways, but it’s the same old song. The Israelites turn away from God, marry foreign women, defile the sacrifices, and get called out for it. In today’s reading, the table is turned to the Levitical priests. \nThere is no loyalty in the heart of Israel, no fidelity to the God who made and called His people into relationship with Him. Malachi reminds them of the covenant God made with the line of Aaron, the first high priest sons of Aaron (the first high priest), were promised in Jeremiah 33 (a reminder of God’s covenant with David) that the “Levitical priests will never fail to have a man always before me” (v.18). \nThat reminder came before the exile, and God restored the Levitical priests to their stations after the Israelites returned home. But, as we read yesterday, they treated their role flippantly. “You have caused many to stumble by your instruction,” the Lord said in Malachi 2:8. This contrasts with how the Lord describes the role of the priest in the verse before: “For the lips of a priest should guard knowledge, and people should desire instruction from his mouth, because he is the messenger of the Lord of Armies.” \nIn the whole of Israel, the Levites were ordained as a special class: the priests. Their responsibility was great, but they failed over and over again. God needed a new covenant with His people, one dependent solely on Him. A covenant that would seal His people to Him forever, no matter their fickle hearts and minds. \nHebrews 8:7 reminds us, “For if that first covenant had been faultless, there would have been no occasion for a second one.” It wasn’t faultess, because it depended on us. \nIn Matthew, the next book of the Bible and also the first of the New Testament, God sends His Son to be our Great High Priest, our Savior (Matthew 3:16–17; Hebrews 9:11–15). The new covenant through Christ would secure God’s promise to His people: “I will be their God, and they will be my people” (Hebrews 8:10). \nReading Malachi, like reading so many other books of the Old Testament, is not meant to be a discouragement, but rather, one of deep encouragement. God’s chosen people failed and still do. His special priests failed. But God Himself will never fail, and for that we give thanks.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day17-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Malachi 2:17, Malachi 3:1-18, Matthew 11:7-15, Hebrews 12:7-11",
        "devo_title": "Judgment at the Lord’s Coming",
        "devo_summary": "\nBY Melanie Rainer\n\nI love to barbecue. Two or three times a year, I make pulled pork. It takes me three days, give or take: a wet brine, a dry rub, slow smoked on the grill, and then finished in the oven. The first bites of sweet-spicy bark are heavenly, a combination of loving preparation and long-suffering. \nWhen pork shoulder reaches approximately 160 degrees, it enters what is known as “the stall.” The stall can last hours and can be paralyzing for the barbecuer: the temperature gauge does not change. It sits at 160-ish degrees for hours and hours. The stall is a scientifically-studied phenomenon during which the melting fat in the meat leads the moisture in the meat to evaporate, which cools the meat. Basically, the fat is rendering and the meat is slowly, steadily becoming pure, tender deliciousness. The meat is being refined and purified by the heat. \nThe three disputations in today’s chapter in Malachi are about this very thing: the cost of refining. The Lord promises to send a messenger who will “be like a refiner’s fire and like launderer’s bleach” (Malachi 3:2). The messenger will “purify the sons of Levi and refine them like gold and silver. Then they will present offerings to the Lord in righteousness” (v.3). The messenger is dual: it refers to John the Baptist, who will prepare the way for Jesus, the messenger of the new covenant—the one who will go through the refining fire and be the refining fire for all of us.\nIn Malachi, we see the calling-out of the people and priests who tried to shortcut their way through the fire, or who claimed what they had already done and been through was enough. But the sacrifices were not about the animals, and the behavior modifications were not about performing just right, and the exile wasn’t a punishment that would wipe their sin away for good.\nProverbs 17:3 says, “A crucible for silver, and a smelter for gold, and the Lord is the tester of hearts.” Our hearts are just as in need of refining as the hearts of the wayward priests in the book of Malachi. Sanctification, the lifelong process of being made more like Christ through the work of the Holy Spirit, is often painful like fire as it burns away our sin. \n“No discipline seems enjoyable at the time, but painful. Later on, however, it yields the peaceful fruit of righteousness to those who have been trained by it” (Hebrews 12:11). This training is hard. I can count a thousand ways the Lord is burning away the dross in my life today, and there will still be a lifetime of work to do. Asking for His refining love is the most daring and terrifying thing I can pray, but it is also the safest because of His sweet and abiding love for me.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day18-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Malachi 4:1-6, Isaiah 60:19-22, Revelation 21:9-27",
        "devo_title": "The Day of the Lord",
        "devo_summary": "\nBY Melanie Rainer\n\nI don’t know about you, but I’ve really enjoyed the deep dive into the book of Malachi this week. I’ve not ever read Malachi before (don’t tell my Old Testament professor!), or at least not in this sort of detail, and it’s quite the surprising and enjoyable little book tucked at the very end of the minor prophets. \nMalachi is a series of warnings and disputations between the Lord and His people, but there is a sharpness of wit and sarcasm that makes it stand apart from the other minor prophets. It’s a fitting end to the Old Testament, an exclamation point on the prophets that have scolded the Israelites and cried out for the Messiah. Malachi does both, though with less drama and weeping than some of the others. There are surprisingly irreverent moments, about wiping the faces of the priests with animal waste (Malachi 2:3), and others more lyrically poignant, like when Malachi describes the priests covering the Lord’s altar with tears (2:13). \nMalachi reminds us that the world is broken, and we are broken. Even God’s chosen people, armed with God’s precious covenants and blessings, led by the chosen Levites, have failed to sow seeds of goodness, justice, righteousness, and love. As go the Israelites, so go the rest of us: bought with the blood of Christ, but still tilling in rows of brokenness and waiting for the harvest. \nMalachi ends with a promise, a promise whose roots stretch all the way back to Genesis and all the way forward to Revelation. Wickedness and injustice will be no more, and those who fear the Lord will go out with joy. Goodness will be restored, and reinvented in a way that we cannot imagine how good it will be. \nRevelation 21 is true and beautiful, and it is such a gift to read it today alongside Malachi 4. “Nothing unclean will ever enter it,” John wrote about the new Jerusalem (Revelation 21:27). \nThe people to whom Malachi wrote thought that maybe they were living in the new Jerusalem, the rebuilt city after the long exile. But they weren’t, and their hearts were still shaped more by themselves than by God. \nThe day is coming when wickedness will burn like stubble. We still cling to the same promise the Israelites did, but our hope is anchored in the body and blood of Christ. The day is coming when the sun of righteousness will rise. Until then, may we live in joyful anticipation of the assured and blessed morning. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day19-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Psalm 132:8-9",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nRise up, LORD, come to your resting place, you and your powerful ark. May your priests be clothed with righteousness, and may your faithful people shout for joy. —Psalm 132:8–9\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-MinorProphets2019-Instagram-Day20-1024x1024.jpg"
    },
    {
        "book_title": "Zechariah and Malachi",
        "devo_passages": "Malachi 4:2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for Malachi.\nBut for you who fear my name, the sun of righteousness will rise with healing in its wings, and you will go out and playfully jump like calves from the stall.  —Malachi 4:2\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/4-MinorProphets2019-3-576x1024.jpg"
    }
]