[{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Genesis 3:1-19, Romans 3:9-26, Job 42:1-6",
    "devo_title": "Suppressing Alleluia",
    "devo_summary": "\nBY Raechel Myers\n\nI stood on the street corner this time last year, at the intersection of 5th and Main—head bowed, backpack on, tears streaming down my face.\nMinutes earlier I was walking from my car to my favorite coffee shop with plans for a productive Wednesday morning, when I noticed two priests up ahead of me (a site which would have been normal in my Chicago days, but was a first for me in little Franklin, Tennessee). The priests were from the Episcopal church about a block away. One was holding a small bowl of ashes from the burnt palms of the previous year’s Palm Sunday service, and the other held a small stack of papers in his hands. I greeted them and they greeted me, and they explained why they were there:\n“We know not everyone can make it to an early morning Ash Wednesday service, so we’re meeting them here, in the middle of their lives, because we believe that’s exactly where Jesus meets us.”\nThey asked me if they could pray for me. Yes, please do.\nOne priest gave me one of his papers and I followed along with an Ash Wednesday prayer on the page as he prayed it over me:\nAlmighty and everlasting God, you hate nothing you have made and forgive the sins of all who are penitent: Create and make in us new and contrite hearts, that we, worthily lamenting our sins and acknowledging our wickedness, may obtain of you, the God of all mercy, perfect remission and forgiveness; through Jesus Christ our Lord, who lives and reigns with you and the Holy Spirit, one God, for ever and ever. Amen.\nWe exchanged a few quiet words, then with his thumb he solemnly smudged an ashen cross on my forehead, saying, “Remember that you are dust, and to dust you shall return.”\nI was stopped in my tracks. Tears flowed while traffic carried on in the background, and I stood in stillness with my God and wept for the sins that separated me from Christ.\nAt the age of 31, it was the first time I’d observed Ash Wednesday in this traditionally Roman Catholic way. What had once seemed ritualistic to this protestant girl became a vehicle the Holy Spirit used to bring me to repent and believe anew.\nThis is Lent. It’s a time to stop—wherever we’re going and whatever we’re coming from. Whether we’ve been anticipating this season since Christmas, or it’s stopping us cold on our way to where we think we need to be—here we are.\nLent is a pause button. It is a quiet unlike any other time of year. Lent is a season to close our eyes as the busy world buzzes around us, to consider those things we’d much rather forget: our sin and our humanity. We came from dust, and to dust we will return.\nHave you ever heard the phrase “suppressing alleluia”? I hadn’t until just this year. (See? We get to learn new things, even as adults!) It was a practice introduced somewhere around the 7th or 8th century where congregants would sing the liturgical “Alleluia” loudly on the day before Ash Wednesday, then put the joyful word aside until Easter. The suppression of “Alleluia” was thought to increase the anticipation of Easter Sunday and the excitement of proclaiming Christ’s resurrection from the dead. It’s another one of those rituals, like ashen crosses on our foreheads, that feels like a tangible act of an inward posture.\nLet’s be honest: rituals are attractive. We are people who love visuals and search for tangible acts that allow us to experience God. But what these rituals are not is measurable. Bearing ashes or avoiding words will not purge us of our sins. These acts alone will not draw us nearer to God. But oftentimes Church traditions—when we understand their origin and the intent behind them—can serve as tools to remind us of the very real reality of the Gospel in our lives.\nWhether you carry the ashen cross on your forehead or not, know that Ash Wednesday is for remembering our sin and humanity—for reflecting on our fallen state and our gaping need for a Savior. Let today stop you in your tracks to “lament and acknowledge your wickedness”, knowing that the King of Alleluias has already done all that needs to be done to grant you “perfect remission and forgiveness.”\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram1.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Joel 2:12-27, Jeremiah 24:4-7",
    "devo_title": "Returning",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Joel 2:12-27, Jeremiah 24:4-7\n“Lord, even my repentance is broken. Help me.”\nThose are the words I scrawled in my notebook this morning as I tried desperately to lay my heart bare before God, frustrated that the process did not make me “feel” better. I am a sinner, and I know this. He is the one true God, and I know that, too. The lines of communication were open and I was trying to get there emotionally—wherever “there” is—but the warm fuzzies just weren’t coming.\nDo you ever have these moments where you fear you’ve forgotten how to pray—where you worry you’re not doing this whole “repent and believe” thing the right way?\nI went back to Scripture—to the passages we’re reading together today—and looked for the words “turn” and “return.” Maybe the answer was there—maybe I could learn how to come to Jesus all over again.\nI found the first “return” in Jeremiah 24:7, when God says of His people, “I will give them a heart to know Me, that I am Yahweh. They will be My people, and I will be their God because they will return to Me with all their heart.” Then in Joel 2:12, God says through the prophet, “turn to me with all your heart” and again just one verse later—“return to the Lord your God” (HCSB).\nAnd that was all.\nMuch to my dismay, the call to return to God is not written alongside a long list of to-do’s, an attainable checklist so I can feel sure I’m returning correctly. No, there is just one qualification—to return with all my heart. Evidently the cleaned up, feel-good part of my heart is not all God is looking for. He doesn’t want only the parts of my heart I’m willing to let others see—He wants the whole messy, confused, narcissistic, achy thing.\nSo, to recap: You and I and our whole unholy selves are called to turn fully, openly, and sans-covering to the holy, almighty God of all the universe.\n[Insert deep breath here.]\nIt’s no wonder we try to come to Him with layers of lies and pride and every other self-preservation instinct intact. It makes sense, right? Except it doesn’t… because Jesus.\nThe cross of Jesus is the path by which we return to our holy, gracious God. We need not fashion our own defense or disguise to shield our brokenness from His eyes—the blood of Jesus is our covering.\nOur actions do not give us the right to return. Our emotions do not grant us access to God. We return because—and only because—Jesus Christ goes before us, His cross as our banner and His grace as our plea.\nSisters, when you doubt that your whole, achy self is welcome in the presence of our God, look to the Cross.\nWhen you fear your return is lacking, that your repentance itself falls short, look to the Cross.\nThe Cross of Jesus is our only way to the Father—not just the first time, but every time.\nHis cross dispels each doubt;\nI bury in His tomb\nEach thought of unbelief and fear,\nEach lingering shade of gloom.\nI praise the God of grace;\nI trust His truth and might;\nHe calls me His, I call Him mine.\nMy God, my joy and light.\nfrom “Not What My Hands Have Done”\nHoratius Bonar, 1861\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram2.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Isaiah 43:16-21, 2 Corinthians 5 ",
    "devo_title": "Springtime",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Isaiah 43:16-21, 2 Corinthians 5:1-21\nI keep seeing everyone else’s adorable pictures on Instagram of their kids and their friends playing in the snow. And even though I really have no business hauling my pregnant self out to walk on ice, I took my kids sledding this morning. And it was the worst! How do you guys do it? We were crying and falling down and fighting—by the time we left, I was done with winter. (But seriously, how do you guys do it?)\nI know why my kids fight and cry, and why I curse the seasons. We are sinners. On our own, we are diametrically opposed to the way of Christ and when given the chance to be selfish or selfless, we choose selfish every time.\nHonestly, it would be nice to skip over the hard parts of life: these cold, wintry seasons of hurt, anger, or loss. I just want to hide under my blankets and shut out the ugly and difficult parts of life. I don’t want to fight with the people I’m supposed to love!\nBut I’m so afraid that God uses bitter, icy times to reconcile us to Him. I’m scared that I have to go through the winter of the soul so I can enjoy the springtime of the soul.\nWhen I peek out from under the covers, I know the truth. I know I have to give up my own will, repent, and be reconciled to God, or I’ll never see springtime. I have to do more than hide and wait for winter to end; I have to allow God to change my heart.\nDuring the season of Lent, we try to give things up to train our raw fingers to let go of old ways. But to reconcile with God and to breathe in the springtime, we have to do more than just let go. We have to replace our icy vices with the good, warm things of God.\nI’m forever stuck in the winter of sin until I let go of myself and receive the good things of God. Christ is the best gift of God—He is worth more than anything we could ever give up.\nWe don’t make this happen. We just cry out for help, and our Savior thaws our bitter hearts. I don’t understand how it happens. But I believe that He is our only hope to free us from our sin.\nSpringtime is coming! Christ Himself is a real answer to the cold ache of our souls. It’s not an easy answer, but He is the answer that actually addresses the heart of my need. He is the relieving thaw of spring.\nThis lenten season, let’s do more than suspend our vices—let’s run to Christ. Let’s be brave, come out of hiding, and be reconciled to Him.\n“Yet whatever else it may be, Lent should never be morose – an annual ordeal during which we begrudgingly forgo a handful of pleasures. Instead, we ought to approach Lent as an opportunity, not a requirement. After all, it is meant to be the church’s springtime, a time when, out of the darkness of sin’s winter, a repentant, empowered people emerges.”\n– from Bread and Wine: Readings for Lent and Easter\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram3.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "1 John 1:5-10",
    "devo_title": "God of All Mercy",
    "devo_summary": "\nBY She Reads Truth\n\nText: 1 John 1:5-10\nA beautiful Saturday to you, dear friends!\nAs we walk through this season of reflection and repentance together, we want to provide time and space for us as individuals and a community to meditate on God’s Word and bow at His feet in prayer.\nEach Saturday during Lent we will read a brief passage of Scripture and a corporate prayer, both carefully chosen for this specific place in our Lenten journey. Sundays will be dedicated to scripture memorization, one of our favorite habits here at She Reads Truth.\nWe pray you will not only meet with the Savior on these quieter weekend days, but linger there with Him, in prayer and in His Word.\n________\nAlmighty and everlasting God, you hate nothing you have made and forgive the sins of all who are penitent: Create and make in us new and contrite hearts, that we, worthily lamenting our sins and acknowledging our wretchedness, may obtain of you, the God of all mercy, perfect remission and forgiveness; through Jesus Christ our Lord, who lives and reigns with you and the Holy Spirit, one God, for ever and ever.  Amen.\n– from The Book of Common Prayer\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram4.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Joel 2:13",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a call to cling to this Lenten season.\n“Return to the LORD your God, for he is gracious and merciful, slow to anger, and abounding in steadfast love”\n– Joel 2:13, ESV\nWrite this verse down—copy it twenty time if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/4-Joel-2-13.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Mark 2:13-17, Matthew 4:1-11",
    "devo_title": "Come Close",
    "devo_summary": "\nBY Debbie Eaton\n\nText: Mark 2:13-17, Matthew 4:1-11\nRecently, I was on my way to Palm Desert to speak. I struggle with anxiety when driving alone, and I was not looking forward to the drive. The abyss of grey asphalt, cement walls, and red taillights of stop-and-go traffic unsettle me, and I knew once I made it through that traffic the desolate, dry, and brown desert would surround me for miles.\nI get nervous to be alone. The stillness tempts me with voices that say I am not a good enough wife, mother, friend, leader.  I am haunted by the “what ifs” and  “should haves” and silence.\nI was driving through that desert, sensing the welling of anxious thoughts, when God came close and met me. As He gently shifted my focus off my self-imposed discouragement and onto His promises of acceptance, forgiveness, and love, the desert transformed before my eyes. The brown became a brilliant bronze, the blue sky glistening against the horizon. The cactus and Joshua trees reminded me that life emerges out of barren land, and the wind whipping up dust prompted me to know the Holy Spirit comforts and transforms our thoughts. The desolate desert came alive when God came close.\nThe Lord is near to all who call on him, to all who call on him in truth.\n– Psalm 145:18\nLevi’s anxious view of the world changed the day Jesus called him to follow. Sinner, come as you are—broken, weary, shamed, and rejected. I see you, accept you, and will call you my friend. Come dine with me. What a beautiful invitation. I wonder if Levi’s world went from black and white to vibrant color that day.\nJesus extends an invitation to come close at any time and to follow Him, no matter our condition. He calls us to come close minute by minute, every day. He heals, He redeems, He saves, He invites, He accepts – He changes us and our perspective, which draws us into greater understanding that He cares about every detail of our life.\nThere will be desert days. Even Jesus endured seasons in the wilderness. In those seasons, He fasted and drew close to His heavenly Father. His physical weakness did not succumb to the Tempter’s plan because His Father nourished Him. The enemy has nothing of worth to offer a soul filled with the truth of God’s Word. Amen!\nFriend, the Word of God has the same power in your wilderness. Come close and fast with Jesus, cling to Him and His cross when the Tempter tries to steal your true identity. Like Levi who found his true identity in Christ, you are also invited, chosen, known, and loved—just as you are. As you come close to Jesus, the world around you will transform and become more beautiful and radiant because you are changed.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram6.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Hebrews 12:3-13, Psalm 6:1-10",
    "devo_title": "Come Empty",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Hebrews 12:3-13, Psalm 6:1-10\n“Self-denial is saying only: He goes ahead of us; hold fast to him.”\n– Dietrich Bonhoeffer\nWe, your She Reads Truth writers and friends, are learning as we go. I hope that’s okay to say out loud, because it’s true. We are learning about this beautiful book—the living Word of God—alongside you, opening it up each day and praying to the God who made us. We come to the Bible knowing and believing that the Holy Spirit has been given to us as our Helper, that He has been promised to us by the Son of God, Jesus Christ our Savior. This is who we are—like you, we are daughters of the King. We come empty-handed, expecting Him to give us all we need.\nIn preparing for this reading plan that spans the season of Lent (we like to call it “lententide” because it’s such a pretty word), we went to folks who know more than us for help. We called on pastors and friends, we read books and researched themes. It is part of our “job” and we LOVE it. So much. One resource we consulted was a book on the liturgical calendar called Eternity Today, and the author said this about Lent:\n“What can be lost in this season is that, though believers indeed ‘fast and pray,’ they often do this not more aware of the love of God, but assuming that they need to win God’s favor…\n“Lent is unique in the liturgical year because the members of the church conscientiously turn from excesses not to remind God of humanity, but to remind themselves of the constancy of God’s love.”\nI’m a sucker for all things old and liturgical. I love corporate readings in church services, sacraments and hymnals. I love studying Lent and just about anything else that reminds me I’m part of a body of believers who have been worshipping our God for hundreds and hundreds of years. But do I “do” Lent as obligation or to be a part of a centuries-old ritual? Do I do Lent to win God’s favor? I would never say so… but turning this quote and these Scriptures over in my heart and mind, I’m not so sure.\nIf I’m completely honest, I have to admit that I hope—or maybe even believe—my small sacrifices make God love me a little bit more. I hope they’ll erase some of those selfish things I did that I wish I could take back. I hope they’ll cover over my neglect of those in need, my lack of compassion for the hardships of others. If I’m honest, I think Lent buys me an ounce of forgiveness and favor in the eyes of God.\nHere’s the rub: this belief is not just a simple misunderstanding. It is itself a sinful pride that devalues the very blood of Christ. He has purchased my pardon! He is the righteousness that covers my sin! He is the One who has earned God’s favor, and He is the reason that favor is lavished on me.\nOur need for Jesus is deep, but His love for us is deeper. His love for us is constant, whatever season and state we’re in. He redeems us and refines us because of this great love, not because of what we do.\nWe come to Christ with empty buckets — whether we admit it or not. So let’s not bring our self improvements and call them sacrifices. Let’s don’t use our efforts as currency to buy the free grace we’ve been given.\nLet’s simply come to the cross of Christ — again, today.\nLet’s come empty. He will fill us.\n\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram7.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Matthew 6:5-34, Psalm 139",
    "devo_title": "Come Quietly",
    "devo_summary": "\nBY Kaitlin Wernet\n\nText: Matthew 6:5-34, Psalm 139:1-12\nI want to hug the person who invented name tags. Really, I think we’d be great friends.\nMeeting new people is such fanfare to some. There are mnemonic devices for remembering names, online guides to small talk, and the worst—the “get to know you” games.\nIcebreakers, often in the form of “the name game” or “two truths and a lie,” are usually well-intentioned attempts to make a group of strangers more comfortable with one another. They’re also my cue to run to the nearest exit.\nIt’s not because I’m shy—oh, goodness, no!-—it’s just that having 10 seconds to determine my forever impression on a bunch of people I’ve never met isn’t my definition of fun.\nMaybe it’s because the nicknames I’ve walked away with from these games have stayed with me longer than I’d hoped, or just because I’ve spent years talking myself out of the things I said in a moment of sheer panic (“Yes, I know I said I love to kayak, but in reality I’ve never been in one and I just couldn’t think of another word that began with the letter K”).\nMore likely, it’s because I want to control how the world sees me. I spend time bartering for my worth through the lens of another, and usually walk away counting my losses.\nWhile reading about the hypocrites in Matthew 6, I begin doing the same thing.\nNo, Lord. I’m not like that.\nAnd He gently pushes me to the end of the chapter, where Jesus teaches about worry, something that initially seems unrelated.\nBut when I can’t write others’ opinions of me, I get sweaty.\nWhen I try to manipulate approval, I become restless.\nAnd when I hustle to cover up my wrongs, I’m the most anxious girl in the room.\nIn that familiar, worried place kept secret by my shame, I find myself standing with the hypocrites as Jesus questions us—Why are you anxious, O you of little faith?\nI want to point to the part of my name tag that says “Christian” in bold letters. Of course I have faith!\nHe reminds me to soften my strife and silence my sales pitch. Am I afraid the Christian life will go unnoticed, or am I worried I won’t get credit for being a part of it?\nIf we really looked to see what’s behind and before our random acts of kindness, behind and before our words formed in prayer, behind and before our songs sung in worship—would there be a void?\nThose actions have a name and it’s not ours.\nMay I be willing to trade a whisper of my name for a shout of His.\nMay I stop trying to be the “bigger person” and start seeking the All Sufficient.\nMay I replace my performance with His presence.\nMay we come quietly for the Almighty to sound.\n“Father, you know us in secret, and you know all our secret places.\nWhat we do to benefit your kingdom will not be lost if it is not seen by others,\nfor you see and you reward according to your grace and mercy.\nStrengthen us to do good works, visibly or invisibly, always in your name.”\n– GK Chesterton\nKaitlin Wernet is a Carolina girl who now plants her feet in Tennessee as the Community Coordinator for She Reads Truth. Each day, she excitedly celebrates grace with her SRT sisters while attempting to tame her curly hair and avoid parallel parking.\n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram8.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Isaiah 58",
    "devo_title": "Come in Mercy",
    "devo_summary": "\nBY Diana Stone\n\nText: Isaiah 58:1-14\nLast year was my first time observing Lent, a season I’d known next to nothing about prior to that. I was caught up in the whirlwind of its beauty, especially online. It seemed everyone was giving up something they leaned on in day to day life. Coffee and chocolate were especially mourned, but I decided that without coffee I may not make it through Lent at all.\nBeautiful journals, study guides, books, and prints filled my social media. I was blown away by the fervor for this time in the life of the Church, yet in each purchase and choice that I made, something felt wrong.\nWhy did Lent seem like it was all about me?\nMaybe you’re feeling the same things this year. Maybe you decided not to do anything because your ideas felt shallow compared to the Easter story we’re preparing for. Maybe, like me, your heart needs to be reminded that this season is not about our holy acts or intentions, but the love and mercy of our Holy God.\nPart of walking deeper in our journey with Christ is learning to turn our inward focus outward—taking our gaze off ourselves and onto Christ, and onto others for the sake of Christ. Let’s take a moment today to explore what “giving up something for Lent” might look like in light of God’s Word and the “chosen fast” He calls us to in Isaiah 58.\nWhat if we thought about:\nGiving up evil practices (Judges 2:19).\nGiving up violence and oppression (Ezekiel 45:9).\nGiving up religious compromise (Daniel 3:28).\nGiving up possessions (Luke 14:33).\nGiving up words that tear others down (Ephesians 4:29).\nI want to encourage you to read these Scriptures—and others!— and listen to the Holy Spirit. Where is He nudging your heart this Lent season and beyond—to shift your gaze outward onto Christ and His Church?\nWould you give up your Instagram feed being solely dedicated to your life to include causes that burden your heart? Would you give up a grudge or ill-thoughts toward a friend and devote time to praying for her each day? Would you be willing to give up complacency and take a stand for your faith in a place you may not be comfortable, whether online or off, for the sake of the lost and the glory of God? Where can you extend God’s mercy to others right here where He has placed you?\nWhatever this Lent season looks like for you—from devoting time to writing in a journal, to reading your children a Bible story each night—let’s allow the season to reflect the heart of the Father, the reason we prepare our souls for the sacrifice and celebration to come. We can never come close to what Jesus gave up for us, but we can draw ourselves close to Him.\nIsn’t the fast I choose:\nTo break the chains of wickedness,\nto untie the ropes of the yoke,\nto set the oppressed free,\nand to tear off every yoke?\nIs it not to share your bread with the hungry,\nto bring the poor and homeless into your house,\nto clothe the naked when you see him,\nand not to ignore your own flesh and blood?\nThen your light will appear like the dawn,\nand your recovery will come quickly.\nYour righteousness will go before you,\nand the Lord’s glory will be your rear guard.\nAt that time, when you call, the Lord will answer;\nwhen you cry out, He will say, ‘Here I am.’\n– Isaiah 58:6-9a, HCSB\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram9.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Romans 12:1-2, John 4:24, Psalm 95:1-11",
    "devo_title": "Come and Worship",
    "devo_summary": "\nBY Raechel Myers\n\nText: Romans 12:1-2, John 4:24, Psalm 95:1-11\nAs I sit down to write to you girls today, I have a confession. As I crack my knuckles, take a swig of coffee, and strap on my noise cancelling headphones, I have to tell you: this is attempt #14 at focusing long enough to appropriately meditate on and respond to these rich and right scriptures for today’s devotional. Talk about last minute: I am literally writing this 10 hours before it is intended to go live on the site.\nMy focus is off and my distractions number in the hundreds right now, it seems. And I need to repent.\nOur family is preparing for a cross-town move at the end of next week and every utility company in the phone book requires applications and signatures and fees and phone calls. I’m getting texts from our builder asking “have you selected hooks for the mudroom yet?” and “it looks like you accidentally had some things delivered to a house that doesn’t belong to you yet.” I woke up no less than 4 times last night, working through details and decisions and checklists. (True story: two nights ago I actually dreamed I was taking a nap! That’s how exhausting these weeks have been—even in my sleep, I need more sleep.)\nWhen I woke this morning, my thoughts immediately went to troubleshooting furniture arrangements. My waking (and sleeping) hours have been heavily focused on a to-do list that is all-consuming.\nNow, there’s nothing innately wrong with a good to-do list—I’m not sure how I’d get anything done without them. But, I know the difference in my heart between managing tasks and throwing my mind, body, and spirit into something—and I know I’ve been fixing my whole heart on something that won’t last.\nHave you read today’s scriptures yet? I have to tell you, Romans 12:1-2 is sure proof in my life that God’s Word is “sharper than any two-edged sword… discerning the thoughts and intentions of the heart” (Hebrews 4:12). Once I finally sat my bottom in my desk chair to study and pray today, I found myself reading it over and over again, checking it in various translations. And I repented for my heart that is too often “conformed” and not nearly enough “transformed.”\nI loved what I found in the Message translation:\n“So here’s what I want you to do, God helping you: Take your everyday, ordinary life—your sleeping, eating, going-to-work, and walking-around life—and place it before God as an offering. Embracing what God does for you is the best thing you can do for him. Don’t become so well-adjusted to your culture that you fit into it without even thinking. Instead, fix your attention on God. You’ll be changed from the inside out. Readily recognize what he wants from you, and quickly respond to it. Unlike the culture around you, always dragging you down to its level of immaturity, God brings the best out of you, develops well-formed maturity in you.”\nI confess my attention has been fixed elsewhere, and I think I’ve been missing a lot of God-cues and opportunities to love His people well. Not because graceless guilt tells me so, but because the Holy Spirit has been faithfully convicting me of this for days. It’s between Him and me. I only share this with you today because I think I’m not alone, and I want you to know that you’re not alone either.\nIf you find yourself so wrapped up in a project or life event that things of eternal significance are cast by the wayside, sit still a moment. Fix your attention on the eternal Savior. If you are having a hard time “readily recognizing what He wants from you”, return to Him in prayer. Let Him change you from the inside out. Our heavenly Father is full of grace and mercy, faithful to forgive and redeem—faithful to transform our too-easily-conformed hearts.\nAnd then comes my favorite part. We worship! We respond to the Creator and Redeemer with thanksgiving and adoration!\nWe confess and repent.\nHe forgives and transforms us.\nAnd we worship!\nWhether my eyes were fixed on Jesus this week or on boxes that need to be packed, whether my attention is on His unending grace or my need for uninterrupted internet service, He is faithfully transforming me from an earth-bolted girl to a woman with a renewed mind and spirit. And whatever your life looks like this week, He is doing the same in you. For that, let us say with the Psalmist, “Come, let us worship and bow down!”\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram10.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Mark 1:14-15",
    "devo_title": "Continual Repentance",
    "devo_summary": "\nBY She Reads Truth\n\nText: Mark 1:14-15\nAs we walk through this season of reflection and repentance together, we want to provide time and space for us as individuals and a community to meditate on God’s Word and bow at His feet in prayer.\nEach Saturday during Lent we will read a brief passage of Scripture and a corporate prayer, both carefully chosen for this specific place in our Lenten journey. Sundays will be dedicated to scripture memorization, one of our favorite habits here at She Reads Truth.\nWe pray you will not only meet with the Savior on these quieter weekend days, but linger there with Him, in prayer and in His Word.\n\nO God of Grace,\n\nThou hast imputed my sin to my substitute,\n  and has imputed his righteousness to my soul,\n    clothing me with a bridegroom’s robe,\n    deking me with jewels of holiness.\nBut in my Christian walk I am still in rags;\nmy best prayers are stained with sin;\n    my penitential tears are so much impurity;\n    my confessions of wrong are so many aggravations of sin;\n    my receiving the Spirit is tinctured with selfishness.\n\nI need to repent of my repentance;\nI need my tears to be washed;\nI have no robe to bring to cover my sins,\n    no loom to weave my own righteousness;\nI am always standing clothed in filthy garments,\n    and by grace am always receiving change of raiment,\n    for thou dost always justify the ungodly;\nI am always going into the far country,\n    and always returning home as a prodigal,\n    always saying, Father, forgive me,\n    and thou art always bringing forth the best robe.\nEvery morning let me wear it,\n    every evening return in it,\n    go out to the day’s work in it,\n    be married in it,\n    be wound in death in it,\n    stand before the great white throne in it,\n    enter heaven in it shining as the sun.\nGrant me never to lose sight of\n    the exceeding sinfulness of sin,\n    the exceeding righteousness of salvation,\n    the exceeding glory of Christ,\n    the exceeding beauty of holiness,\n   the exceeding wonder of grace\n– “Continual Repentance” from The Valley of Vision\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/SRT-Lent2015_instagram11.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Psalm 51:10",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 51:10\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a prayer to keep close this Lenten season.\n“Create in me a clean heart, O God, And renew a steadfast spirit within me.”\n– Psalm 51:10, NASB\nWrite this verse down—copy it twenty time if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/02/4-Psalm-51-10.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Acts 3:19-21, Romans 2:3-4, Lamentations 1:16, 2 Corinthians 7:5-12",
    "devo_title": "Godly Grief",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Acts 3:19-21, Romans 2:3-4, Lamentations 1:16, 2 Corinthians 7:5-12\nRepent therefore, and turn back, that your sins may be blotted out,\nthat times of refreshing may come from the presence of the Lord…\n– Acts 3:19-20a, ESV\n“It is not repentance that saves me; \nrepentance is the sign that I realize what God has done in Christ Jesus.”  \n– Oswald Chambers\nI’m an avoider. I avoid uncomfortable topics and decisions. I avoid unfortunate feelings and situations. I avoid watching the news when I can get away with it, and I’ve been known to avoid eye contact with the homeless vendor selling newspapers on the corner.\nI avoid grief and suffering because I don’t want to experience grief and I don’t want to experience suffering. I can’t solve them, can’t explain them away—I can only enter in, and most times I’d rather not. The only way to get to the other side of these unavoidable mountains is to walk through them—over, under, and around are not options.\nI avoid acknowledging my sin for the same reason. It’s uncomfortable, it’s painful, it’s something I can’t solve or explain away. I fall deathly short, just like we all do (Romans 3:23, 6:23). The darkness I am capable of is shocking to the senses. Who wants to admit such a thing? Like it’s the nightly news, I look away and wait for it to disappear. If I don’t see it, it must not exist.\nYou and I might be tempted to skip over this next book of the Bible we’ll read together for these same reasons. Some of the language in Lamentations is uncomfortable, the images are upsetting—it puts a magnifying glass up to a reality we’d rather ignore. Written in response to the capture and destruction of Jerusalem, the book of Lamentations is exactly what its name implies—it is a book of 5 poems, or songs, of lament. It is a book dedicated to mourning, weeping, and crying out to God. Some historians believe it may have even been used for worship within the actual ruins of the destroyed temple.\nOriginally named for the Hebrew word for “Alas!” or “How?”, Lamentations reads like an unedited exercise in how many ways a person can describe destruction, devastation, and despair. But the writer’s words don’t just apply to Jerusalem—they are a picture of our life without Christ. No comforter, no hope, no life—only death. Lamentations provides a revolting visual of the destruction our sin brings.  \nAcknowledging sin and its consequences is a difficult, achy, and emotionally invasive procedure. But a beautiful thing happens when we take that hard road through the mountain: we do not travel alone. Jesus is with us as God’s Word convicts our hearts. Jesus is with us as the Holy Spirit reveals our desperate need. Jesus is with us as our knees buckle at the devastation around us and the devastation within us. He is by our side to administer the salve of grace the moment each sin-wound is revealed.\nSomewhere in the thick of this ongoing heart surgery we begin to understand: only in seeing the depth of our sin can we see the unmatched grace and glory of the Cross.\nThink back to that image of God’s people standing among the temple ruins, singing out painful poems of lament. The holy city—their lives, their families, their futures—destroyed. Imagine them there in the wreckage, crying out to God asking all the appropriate questions. Why, Lord? Where are you, Lord? How long, O Lord? The first two chapters build like a musical crescendo, leading up to the climax placed purposefully, meaningfully in the center chapter of the book:\nBut this I call to mind,\nand therefore I have hope:\nThe steadfast love of the Lord never ceases;\nhis mercies never come to an end;\nthey are new every morning;\ngreat is your faithfulness.\n“The Lord is my portion,” says my soul,\n“therefore I will hope in him.”\n– Lamentations 3:21-24, ESV\nStanding there in the rubble, they worshiped. They repented. They claimed what they knew to be true — God is faithful, even here and even now.\nYou and I stand in the midst of wreckage today—broken churches, broken families, broken bodies, broken hopes. The consequences of sin are ugly and painful, and it hurts to look full at the darkness. We grieve our sinful state with honest questions and hot tears and loud lamenting—but this is the kind of godly grief that causes the apostle Paul to rejoice! Not because grief is painless or petty—it is anything but—but because godly grief leads to repentance (2 Cor. 7:9-10).\nFriends, we venture into the coming two weeks ready but not ready to face the sin in and among us. We take a somber step forward knowing only a bit of what is to come. But we walk ahead nonetheless because our Savior goes with us. Let us look on our sin, and let us look long at the Cross of Christ. Look to the One who does not avoid our suffering but enters in, who does not despise our brokenness but redeems it.\nMay our tears of grief lead us to repentance, and may we receive refreshment for our souls. Amen.\n \n\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram13.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 1:1-11, Psalm 51:1-6, Psalm 32",
    "devo_title": "Wash Me, Lord",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Lamentations 1:1-11, Psalm 51:1-6, Psalm 32:1-11\nLast week I saw my husband and my sister give me the same exasperated look. I knew I was driving both of them crazy. I don’t listen and I push for my own way. I know it. But instead of sticking around to hear it in so many words, I hid in my office seeking the comfort of Samoas and Miles Davis.\nI’m definitely spending my days looking for comfort: warm coffee, me time, a massage, a pedicure, even a hot bath. Our modern response to hard times is to look for physical comfort. If my soul is restless, I’m looking for my down comforter and Girl Scout cookies and sparkling grape juice.\nI know that a bubble bath isn’t going to wash my soul, but aren’t you tempted to do the same thing? I want to dip my chin in lavender bubbles and forget that the only way to be truly clean is through repentance. Psalm 32 says that blessedness is in repentance: “I acknowledged my sin to you, and I did not cover my iniquity” (v.5). “Blessed is the one whose transgression is forgiven, whose sin is covered” (v.1).\nWe also scurry around trying to create life for ourselves through our super-fabulous accomplishments. I feel so much better when I’m a genius at work, a lovely wife, or the coolest mom. But does my life in the Kingdom actually have anything to do with my adorable talents? Our participation in the Kingdom of God is rooted in repentance, and all my busy actions and sacrifices are just that—business—unless my heart is willing to repent.\nI need to repent even of my righteousness. My actions do not earn my salvation. (Psalm 51)\nFinally, I seek life and comfort by defending, hiding and protecting myself. Is it your instinct to defend instead of repent when you encounter judgement? Years ago, when I was fresh out of college, I was accused of lying to my employer. Whether or not I’m a big liar is neither here nor there, but when I was brought before the big boss I sobbingly started to try to defend myself. He stopped me and told me I didn’t need to say a word in my own defense. He vouched for me, while I stood still and blew my nose on those rough brown paper napkins. That experience will stay with me forever—I don’t have to run to defend myself. Christ calls us to repentance, and He is our defender!\nAnd what freedom could possibly come from offering my own defense? True freedom is in forgiveness. Repentance gives true life even in the midst of judgment. We really have only two choices when we encounter judgment: harden our hearts, or repent. The author of Lamentations always runs to repentance.\nThis is why there is hope, even in the book of Lamentations. Sin has brought wreckage upon Jerusalem, though she was once great. Her people are hungry, and in their famine and their sorrow they call out to the Lord. Matthew Henry writes, “In this sad condition Jerusalem acknowledged her sin, and entreated the Lord to look upon her case. This is the only way to make ourselves easy under our burdens; for it is the just anger of the Lord for man’s transgressions, that has filled the earth with sorrows, lamentations, sickness, and death.”\nWe need to be washed from our sin, and only God can do that. It is in our calling out to Him, in acknowledging our sin, that we can enjoy the freedom in being washed clean from our transgressions. Hard-heartedness just leads to more judgement, but repentance leads to life.\nSo when I long for peace and spiritual cleansing, instead of reaching for my comfort in a latte and a good sugar scrub, I have to cry out, “Wash me, Lord!” (Psalm 51:2)\nRun to Him in repentance. Run to Him for peace. Because repentance gives life, and it’s a blessed sign of God’s grace and goodness.\n\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram14.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 1:12-22, Psalm 51:7-10",
    "devo_title": "Renew A Right Spirit",
    "devo_summary": "\nBY Debbie Eaton\n\nText: Lamentations 1:12-22, Psalm 51:7-10\n“He that is jealous is not in love” \n– Saint Augustine\nWhat I am about to share is not something I am not proud of. As a matter of fact, it takes courage for me to even admit that a superficial struggle consumed me for years, challenging and endangering my relationship with my sister. It was only through my tears of repentance that God’s grace and forgiveness set me free… and set my sister free.\nI was so jealous of my sister. She is smart, tiny in stature, has an amazing husband and beautiful children. What I was most jealous of was her outward appearance. In my eyes she radiated outward beauty, the beauty seen on runways, in movies and magazines. Thin is in, and I despised going shopping with my sister as she picked out her size one while I sheepishly pulled double digits off the rack. It was so superficial, and yet the grip jealousy had on me was suffocating. It seeped into my envy of her two homes and her ability to have children. My sin was really ugly and blocked my ability to love her.\nThe jealousy seed took root when we were teenagers. Years later, the right conditions sprouted the destructive weeds of bitterness, distance, and a mean spirit. Like the writer of Lamentations, my sin had formed a yoke around my neck (Lam. 1:14) — my outward actions hurt my sister and my inward battle was torturous.\nGod was at work cleaning my prideful heart, exposing the raw places that were keeping me entangled in my own mess. He was renewing my spirit.\nCreate in me a clean heart, O God,\nAnd renew a right spirit within me.\n– Psalm 51:10, ESV\nEverything changed when my sister and her daughter visited for a week to help in the care of my newborn son. Each day she would disappear for hours on a run. I was left caring for my newborn and my six year old niece. This was not my idea of help. She felt distant, both physically and emotionally.\nWe went to lunch at one of my favorite cafés and I watched her push food around her plate, barely eating. I saw for the first time that my sister was weak, broken, unhealthy, and struggling with control because her life was out of control. Anorexia had gripped her.\n“Do you love yourself?” I asked.\nShe sat silently. “I’m not sure.”\n“Do you know God loves you?”\nSilence.\nOutwardly my sister was withering away and inwardly was frail. She was just like me.\nThe grip of jealously loosened and was replaced with an overwhelming sense of God’s compassion and love. God had to convict me of my sin before I could come alongside my sister and help point her to God’s unfailing love. She desperately needed Jesus and I shared.\nLeft alone, sin will strangle the life out of our heart and soul. It debilitates, destroys, and divides. The tighter the grip, the less we can breathe to sustain the inward and outward life.\nRepent and God will renew a right spirit within you. He will wash you whiter than snow. The triune God breathes life into our sin-gripped hearts, freeing us from sin’s bondage with His forgiveness that transforms us from the inside out.\n“But we cannot escape the embarrassment of standing stark naked before God. It is no use our trying to cover up like Adam and Eve in the garden. Our attempts at self-justification are as ineffectual as their fig-leaves. We have to acknowledge our nakedness, see the divine substitute wearing our filthy rags instead of us, and allow him to clothe us with his own righteousness.”\n– John Stott\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram15.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 2:1-11, Psalm 51:11-14",
    "devo_title": "Cast Me Not Away",
    "devo_summary": "\nBY Diana Stone\n\nText: Lamentations 2:1-11, Psalm 51:11-14\nThere’s a beautiful hymn by Keith Green based on Psalm 51:10-12 that I learned growing up. I liked the rhythm of it more than the words, and remember my mom—a song leader and pastor’s wife—humming it around the house when we were little.\nI’m an adult now, with a stronger faith than that little girl who sang “Create in Me a Clean Heart” in the hall. Still, the verse “Take not thy Holy Spirit from me” makes me stop short. Would He??\nThese passages we read today are Old Testament writings, a time when God directly interacted with His people through prophets and dreams and a burning bush. For one of them, whom our Lord inspired to write this Psalm, pleading to not be cast away from the Lord’s presence is a real and impactful prayer. Possession of the gift of the Holy Spirit was not a given—not a thing to be taken for granted.\nLike the Israelites, we are creatures of habit. We give our lives to Christ only to try to take them back again. We experience the true love of God, the redemption of our sins, but we are determined to come back in wallow in the mess of our own making—as if we don’t have a Savior. In the second chapter of Lamentations, we find the author continuing to grieve for Jerusalem, describing God’s wrath and sin’s effects on a people who have time and again disobeyed Him. Our Lord is Holy (Psalm 99)! He cannot be near sin; by His very nature He will not tolerate its presence. We cannot be reconciled to God apart from Jesus’ saving work on the Cross. Without Him, we are like the ruins of a destroyed city.\nWhat does this mean for us today—a broken humanity of hurting souls? It means we must return. Time and time again, amid the devastation and chaos of our wayward lives and deceitful hearts, we give ourselves back to the One who gives us life. We hand Him our ruins and receive His grace. We repent of our sins and ask again for His forgiveness—and Scripture promises He is faithful to give it (1 John 1:9).\nTake not your presence from me!, we cry. And because of Christ’s righteousness has been credited to us, He grants our request! The God of all mercy and all holiness draws His repentant children near and does not cast them away—this is the good news of the Gospel.\nI’m drawn to the words “reconciliation” and “forgiveness” time and time again in Scripture. God never stops offering them! Even in Lamentations, standing in the ruins, the writer’s words of hope seem to call out on our behalf (Lam. 3:55-57). God will rescue us from the depths of our pit if we only ask.\nBut we must ask. We must repent and receive the forgiveness our Savior has already secured. He won’t chase us down and chain us to his holy chariot — but He does extend His hand. He does pursue our hearts and offer us the sacred opportunity to follow Him.\nFollow or flee. Turn toward Him or turn away. Return or reject.\nMay we return today and receive His love anew. Thank God He is faithful to give it.\n“…if my people who are called by my name humble themselves, and pray and seek my face and turn from their wicked ways, then I will hear from heaven and will forgive their sin and heal their land.”\n– 2 Chronicles 7:14\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram16.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 2:12-22, Psalm 51:15-19",
    "devo_title": "The Sacrifices of God",
    "devo_summary": "\nBY Guest Writer\n\n\n Text: Lamentations 2:12-22, Psalm 51:15-19\nAmong the many traits the girls in my family have acquired from their mama (enormously wild hair and enthusiastic thesaurus-reading not to be forgotten), is that fact that we possess some pretty sensitive souls. I mean, we feel all the feels. My mom likes to tell the story of how, at age four, I completely lost it because my dad gave me a goodnight kiss and did not equally place both his lips on top of both of my lips. I’m still reeling from the rejection. What that means in my current household, though, is that during any watching of children’s movies, insurance advertisements or yes, even game shows, my finger must be constantly poised on the remote control so I can power “off” when the offending purple minion, car accident dramatization or embarrassingly wrong Final Jeopardy response comes on screen.\nAdmittedly, when I read through these very dark, very sorrowful passages in Lamentations, I wish I had my finger on the remote control and could power “off.” The destruction, the groans, the torment—it is unbearable. And the author, once a matter-of-fact eyewitness, is tortured, his heart pouring out on the ground because of the devastation God has inflicted against a sinful people (Lamentations 2:11). In other words, he gives new meaning to “feeling all the feels.”\nBut isn’t that the point? How can we truly experience real repentance without sorrow?\nGod wants nothing less than broken spirits and contrite hearts when we come before Him for His forgiveness. Any ritualistic sacrifices, any well-crafted prayers, any flowery pleas for mercy—without being genuinely crushed by the true tragedy of our sins—are utterly and totally meaningless. God wants only your authentic expressions of repentance, no thesauruses required.\nGod doesn’t want us to just be “bummed out” by the consequences of sin in our lives and our world, He wants us to know what true, godly sorrow looks and feels like. He wants our hearts to break like His, and for us to gather up those messy hearts and bring them before Him laid bare, without pretentiously tying them up in a neat little package.\n“The sacrifices of God are a broken spirit; a broken and contrite heart…” (Psalm 51:17).  Nothing more. Nothing less.\nMy remote-control strategy of parenting has backfired into sleepless nights a time or two, with those last-seen images burning into little minds and re-entering them, unfortunately, right at bedtime. I quickly learned that I had to, somehow, help my children get through the hard parts of the narrative if they were ever going to see and appreciate how the story ends. I don’t want them to miss it.\nWe have a Father who loves each and every one of His children enough to break our hearts, so that our own story never actually ends at all, but lives on with Him for Eternity. Even though it costs us the anguish of standing in the midst of the ugly destruction of our own sin, it cost our God far more—the sacrifice of His own precious Son. He will bring beauty from the ashes—and more than anything, He doesn’t want you to miss it.\nSarah Matheny is an ever-growing, ever-changing gal, laughing and living in the Pacific Northwest. One-time attorney, food blogger, and author, all-the-time wife and mom to three wild-eyed, spunky girly girls, she’s passionate about her family, her friends and growing in her walk with Christ as He dishes up an always unpredictable, but totally delicious life.\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram17.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Psalm 18:1-6, Hebrews 4:14-16, Hebrews 9:11-14",
    "devo_title": "Take From Us Now",
    "devo_summary": "\nBY She Reads Truth\n\nText: Psalm 18:1-6, Hebrews 4:14-16, 9:11-14\nAs we walk through this season of reflection and repentance together, we want to provide time and space for us as individuals and a community to meditate on God’s Word and bow at His feet in prayer.\nEach Saturday during Lent we will read a brief passage of Scripture and a corporate prayer, both carefully chosen for this specific place in our Lenten journey. Sundays will be dedicated to scripture memorization, one of our favorite habits here at She Reads Truth.\nWe pray you will not only meet with the Savior on these quieter weekend days, but linger there with Him, in prayer and in His Word.\n\nLord Jesus, take from us now everything that would hinder the closest communion with God. Any wish or desire that might hamper us in prayer remove, we pray you. Any memory of either sorrow or care that might hinder the fixing of our affection wholly on our God, take it away now. What have we to do with idols anymore? You have seen and observed us. You know where the difficulty lies. Help us against it, and may we now come boldly, not in the holy place alone, but in the holiest of all, where we should not dare to come if our great Lord had not torn the veil, sprinkled the mercy seat with his own blood, and asked us to enter.\n– C.H. Spurgeon\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/IMG_5321.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 3:22-23",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nText: Lamentations 3:22-23\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a promise to keep close this Lenten season.\n“The steadfast love of the Lord never ceases; \nhis mercies never come to an end;\nthey are new every morning;\ngreat is your faithfulness.”\n-Lamentations 3:22-23, ESV\nWrite this verse down—copy it twenty time if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/IMG_5339.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 3:1-33, Psalm 32:1-2",
    "devo_title": "But This I Call To Mind",
    "devo_summary": "\nBY Raechel Myers\n\nText: Lamentations 3:1-33, Psalm 32:1-2\n“My soul is bereft of peace.\nI have forgotten what happiness is;\nso I say, ‘My endurance has perished;\nso has my hope from the Lord.’”\n– Lamentations 3:17-18, ESV\n“I have forgotten what happiness is…” It sounds so dramatic, but I’ve had those moments and I bet you have, too. Moments get honestly low. Times get impossibly tough. Not one of us is exempt from the reality of grief, and I don’t doubt that every one of us sitting down together today can call to mind a moment when our endurance has threatened to perish.\nAs we read the words in Lamentations 3, different moments in my life flash into memory. I’ve never been attacked by a bear or shot at with an arrow, but I can certainly recall seasons of “grinding my teeth on gravel”, as the Lamentor so vividly puts it.\nJust the other day I sat down with my sister to talk about this passage and read it aloud with her, and after the second time through, something minor yet monumental stuck out to me. Do you see in verse 21—the moment the entire book of Lamentations climaxes—when the author’s sense of rejection by God shifts to confidence in Him? Pay attention to his words here:\n“But this I call to mind.”\nI missed it the first time and almost missed it the second, but it feels huge. The author of Lamentations (believed to be Jeremiah but no one knows for sure) doesn’t say, “But this is what I think is going to happen,” or even, “But this is what I wish would happen.” The turning point of Lamentations is not a moment of speculation.\nNo! He’s remembering something! Something he knows is true.\nThe Lamentor is calling to mind a truth he already knows, and it’s something that—in spite of the bears and arrows and rocks in his teeth—gives him a sure hope at the very moment his endurance is perishing:\n“The steadfast love of the Lord never ceases;\nhis mercies never come to an end;\nthey are new every morning;\ngreat is your faithfulness.”\n– Lamentations 3:22-23, ESV\nHow does he know? What is this memory? Is it from his own personal life experience, or is he drawing from beyond his own life to his forefathers’ history with the Lord of Mercy?\nConsider how David drew from the testimony of his people in Psalm 22:4:\n“In you our fathers trusted;\nthey trusted, and you delivered them.\nTo you they cried and were rescued;\nin you they trusted and were not put to shame.”\nI think sometimes we forget God is bigger than what we know of Him from personal experience. That’s why it’s so important to learn about God in history and keep our own relationships with God personal, but not private!\nWhat if I found myself in a hopeless situation, but my only personal experience with God’s deliverance was that one time He helped me find my retainer in high school (yes, I wore a retainer in high school. ahem.), and the time our team miraculously won the volleyball state finals when we were down our best player? When I need to call to mind a steadfast love, I get to reach way farther back than 32 years!\nThe God and Creator of the universe has scripted an enormous and lovingly elaborate story of love and provision and salvation for His people. So, we, just like the Lamentor, get to “call to mind” the great deeds and marvelous rescues of our God over generations.\nYour God who sits with you today, while you are afraid and dying and bitter with heavy chains and a crooked path? He’s the God who slayed a giant with a stone in a slingshot, rebuilt Jerusalem’s wall and delivered an entire nation from slavery. Same God—then and now.\nSo THIS we call to mind: God has a track record of faithfulness and mercy that reaches back millennia, far before and beyond us! It is a record that, time and again, points to this truth which turns the book of Lamentations on its head and allows us to return from the darkest night to a light of hope:\n“Great is your faithfulness.”\n\n\n\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram20.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 3:34-66, Psalm 32:3-5",
    "devo_title": "You Heard My Plea",
    "devo_summary": "\nBY Diana Stone\n\nText: Lamentations 3:34-66, Psalm 32:3-5\nSustaining grace does not promise the absence of struggle but the presence of God.\n– Max Lucado\nLately I’ve filtered my conversations with God. Many of my moments with Him begin, “If You allow…, then I will…”  My vague threats quickly turn to silence for fear of what else my flawed heart might say.\nI recently learned that I’m pregnant. It’s my fourth pregnancy, our fifth child, and yet only one of our children lives on earth. This pregnancy was a surprise, but even more surprising have been the emotions I feel toward God right now. I’m a believer, but I find myself doubting. I know He loves me, but I find myself wondering. Like the writer of Lamentations, I’m standing in the wreckage of what could have been, but isn’t—and I’m questioning aloud if God is here.\n“If you let this child die, I will never forgive you. Never believe in you again. How can you claim you are sovereign if you continually let this happen to us?”\nSo my prayers are weak and unbelieving. Distant. Filtered. I avoid confessing my anger and my hurt. Will God punish me? Will He even care? I’ve always struggled with prayer, but now more than ever before. My own sinfulness delights in this withdrawal from God to near silence. Filtering my prayers and pleas, my hopes and fears, means allowing my human nature to take back over. Not bringing my true emotions into the light is just another way of delaying what I know I need to do.\nI need to repent. Even here in this moment— especially here. I am angry for the loss of my children, I am distraught at these blows to my faith, I am hurt that God did not rescue us from the storm that caused this wreckage. I am tempted to draw a line in the sand and say, “No. My faith in You can not go any further.” And though it is painful to say it all aloud, I know His love for me and my children is not threatened by any of these emotions. I know He hears me. And I know He is here.\nSo like the poet, I turn back to God with all of me—even the angry, confused and weary parts.\n“Let us search out and examine our ways,\nand turn back to the Lord.\nLet us lift up our hearts and our hands\nto God in heaven”\n– Lamentations 3:40-41\nSometimes, it’s just all we have left to wearily “lift our hearts and our hands to God in heaven.” We all are sinners, regardless of the circumstances we’re walking through. We live in a broken world where awful things happen, and we don’t get to choose what happens to us. But the choice we have is this: what we will do when we realize how much God loves us? Is faith truly faith if we set limits and issue demands? Do we love someone simply because they save me from the uncomfortable?\nDoes our Lord love us this way?\nPaul reminds us how to strengthen our faith and turn to God in times of trial:\n“…a thorn was given me in the flesh, a messenger of Satan to harass me, to keep me from becoming conceited. Three times I pleaded with the Lord about this, that it should leave me. But he said to me, ‘My grace is sufficient for you, for my power is made perfect in weakness.’”\n– 2 Corinthians 12: 7-9\nPaul pleads with the Lord. He keeps bringing his pain back to God—not hiding it from Him—so that God can administer grace once more.\nOur God sovereignly waits for me to return to Him with my brokenness, just like He waits for you. I don’t have to waste away in silence. I don’t need to draw lines, set boundaries, or attempt to control any outcome. I need to repent of these things, allowing the Holy Spirit to bend my will to the Lord’s. Knowing my Savior also suffered, I accept His perfect “grace upon grace” in the midst of the chaos and confusion we will all experience.\nOur pain and our emotions are real, but so is our God. His grace is enough.\n“Prayer is the breath of the new man, drawing in the air of mercy in petitions, and returning it in praises; it proves and maintains the spiritual life.”\n– Matthew Henry\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram21.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 4:1-11, Psalm 32:6-7",
    "devo_title": "When You May Be Found",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Lamentations 4:1-11, Psalm 32:6-7\nI confess I’m easily, daily, hourly tricked by the exterior of a person — what they look like, where they live, what they do with their days, even how the world classifies them in terms of wealth and status and ethnicity and name. I confess I believe the lie that those things matter; I confess I have to remind myself of the person inside the person—the story and soul that make them who they are.\nI remember reading CS Lewis’s essay “The Weight of Glory” for the first time, how it gripped my heart and imagination with the truth that people are just souls with bodies. I say “just” like it’s no big deal, but the truth is, it’s a very big deal. The biggest, actually. The folks I drove past on the interstate today, them in their car and I in mine; the nice young man who handed me our dinner at the drive-thru window on the way home from a late day; the woman who listened as my son breathed deeply in and out as he sat on the table in the doctor’s office; the mom who walked out of that room with her own sick boy just before we walked in—they are each the creation of a loving God. They are each the soul Jesus died to save.\n“There are no ordinary people. You have never talked to a mere mortal. Nations, cultures, arts, civilizations—these are mortal, and their life is to ours as the life of a gnat. But it is immortals whom we joke with, work with, marry, snub and exploit—immortal horrors or everlasting splendors.”\n– CS Lewis, “The Weight of Glory”\nWhew. It’s heavy, right?\nBut Lewis is right. These false classifications and temporary circumstances I confess to idolizing can change in an instant—but I hold them up nonetheless. I tend to judge myself just as harshly—What right do I have to my health and my home, my family and my job? And there I go, carrying false guilt around with my true guilt and wondering why it’s so hard to stand.\nLike the gold and the stones in this passage from Lamentations, all the shiny things eventually tarnish and all the strong things soon scatter—and if my hope for myself and others is found in anything but God, I am tossed around like a dry leaf in the wind. Like the lady Jerusalem, I stand in ruins, longing just for a place to hide.\nTherefore let everyone who is godly\noffer prayer to you at a time when you may be found;\nsurely in the rush of great waters,\nthey shall not reach him.\nYou are a hiding place for me;\nyou preserve me from trouble;\nyou surround me with shouts of deliverance. Selah\n– Psalm 32:6-7 ESV\nThe consequences of my sin are devastating, but more devastating still is my lack of repentance. Lack of repentance breeds shame, and shame whispers lies in my ear. Shame tells me I can’t be forgiven. Shame tells me I’m not worth forgiving. But the Cross tells a different story—the true story.\nJesus knew shame. The beloved hymn says it well:\nOn a hill far away stood an old rugged cross,\nThe emblem of suffering and shame;\nAnd I love that old cross where the dearest and best\nFor a world of lost sinners was slain.\nJesus endured my shame on the Cross, every last ounce. He endured yours, too. When I’m guilty of shaming others… when I’m guilty of shaming myself… when I am guilty of forgetting who He is, who I am in Him, and who YOU are in Him — His sacrifice covers it all.\nWill you seek Christ with me today just as you are, sin and all? Will you believe with me that He can be found? He is there on the Cross, with mercy enough for you and for me.\nMatthew Henry writes, “In a time of finding, when the heart is softened with grief, and burdened with guilt; when all human refuge fails; when no rest can be found to the troubled mind, then it is that God applies the healing balm by his Spirit.”\nMay our hearts be softened by grief and burdened with a godly guilt that leads to repentance. When all human refuge fails—and, by God’s grace, even before!—may we repent and look to the Cross.\n \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram22.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Lamentations 4:12-22, Psalm 32:8-11",
    "devo_title": "With My Eye Upon You",
    "devo_summary": "\nBY Kaitlin Wernet\n\nText: Lamentations 4:12-22, Psalm 32:8-11\nI’m the worst athlete. But just to make sure, my parents made me try all of the sports when I was growing up. I was so excited to receive a basketball trophy in the 5th grade for being “the only player to not score any points.”\n\nIf I had to pick a sport I was the least terrible at, it would be competitive swimming. For a short season, I inhaled glorious chlorine fumes and flaunted a one-piece like a true athlete. I preferred long distance events because they require more endurance than technique and, unlike basketball, a majority of the swimmers were short, meaning I had a leg up on the competition. Literally.\nBut my favorite part about swimming was that I didn’t feel much pressure. Coaching takes place before the actual event and spectators lose interest after the first few laps, so my victories were small and my losses unnoticed.\nThe only person to see my every move was the lifeguard who sat in a tall plastic chair, overseeing the safety of the swimmers. His only job was to keep me from drowning or to blow his red whistle if I were to cross into someone else’s lane or, say, hit my head on a diving block. He was pretty quiet for the most part and I liked it that way. Between my flailing freestyle strokes and gasps for air, I never really noticed him.\nSomehow, and for a time much longer than my swimming career, I allowed this lifeguard mentality to frame my relationship with God.\nI’ll just keep doing my thing and you let me know if I’m out of line.\nSave me from tragedy and I’ll call on you when I need help.\nMeanwhile, my execution might be mediocre, but I’ve got this.\nWhen I read that God “sees” me, my rule-following tendency assumes it’s a warning, as if God’s blowing the same red whistle and saying, “I’m watching you. Behave.”\nI wish I could write a really endearing story about repentance, but the truth is, I’m still aiming for endurance, hoping to finish the race unnoticed. When I do ask God for forgiveness, it’s more a quick gasp of air to sustain me until the next time I feel guilty enough to swallow the reality of my sin.\nI become overwhelmed by the inadequacy of my sorriness, leading only to repentance for my lack of repentance. But then I’m stuck, drowning in weight of whispered words to God, face down in my transgressions, and that’s where I stay.\nI begin to believe repentance is more about my guilt than being freed from it.\nWhile I know God sees me, I don’t look for Him because I’d rather live in ignorance.\nI’d rather perceive God as an obligatory watch guard or stoic spectator than see Him grow and refine me. I choose surface apology and manufacture makeshift grace for myself.\nAnd Lord, I don’t want to any longer.\nYou are well-versed in the depth of my fears.\nYou are mindful of my faintest joys.\nYou don’t just see me; you see me through.\nMay the comfort of your gaze push me to bold, unashamed expression of my need for you.\nAmen.\nKaitlin Wernet is a Carolina girl who now plants her feet in Tennessee as the Community Coordinator for She Reads Truth. Each day, she excitedly celebrates grace with her SRT sisters while attempting to tame her curly hair and avoid parallel parking.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram23.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": " Lamentations 5:1-22, Isaiah 55:1-13",
    "devo_title": "Restore Us",
    "devo_summary": "\nBY Guest Writer\n\nText:  Lamentations 5:1-22, Isaiah 55:1-13\nBack in the day, in the glory of middle school, I was a cheerleader. It was a short-lived phase, really, but little 13-year old Kels was all about the poms. There’s a chance I have since burned the pictures to prove it, but even nine years later, ask me to cheer on the Chantilly Chargers and I’ve got it on lock.\nThe name of the sport speaks for itself. Cheerleaders are to be the leaders of cheer—the ones who pump up both the players and the crowd, faithfully standing on the sidelines as a symbol of support for those in the trenches of the game.\nThis is the thing: though I still have the flippy skirt from my days of cheerleading yore, I’m not always a cheerleader— of my people, of their successes, of their joys, or of their victories. Sometimes, and perhaps even often, I am cynical and critical. I mask it as being “realistic,” but that is really just a shoddy attempt to loosen myself from the call to encourage and build up.\nIf I’m being honest, and this seems like both a safe and terrifying place to do so, my lack of cheering on my people can be linked back to some level of jealousy, insecurity, or fear of not measuring up. Often a combination of all three. Instead of rejoicing alongside my brothers and sisters, my train of thought can sometimes read like this:\nI should have gotten that job.\nI could have written that piece just as well.\nThat boy could have liked me too.\nI’m just as good a friend as she is.\nWhat I accomplished is more important.\nWhen I trace back these insecurities, I make a startling discovery: I’m afraid God’s economy is one of scarcity, and I believe there might not be enough of Him to go around. But Sisters, His economy is one of abundance! He pleads with us, “Come, everyone who thirsts!” (Isaiah 55:1, emphasis mine). Everyone. God is not stingy with His blessing—there is enough of His infinite goodness for all of us. Talent and creativity and joy and peace are wonderful—and truly they are gifts from God! But true restoration is not found in our success or another’s failure, but in reconciliation to the one true God.\nI might have traded in the sidelines for the stands when it comes to football, but God help me, I want to be marked by a posture of leading the cheers for my brothers and sisters in Christ as they run the race of faith. Instead of feigned excitement for their earthly accomplishments, I want a heart that sincerely roots for their eternal redemption. Rather than foster feelings of jealousy or competition, I want see my co-laborers in the Kingdom “go out in joy and be led forth in peace” (Isaiah 55:12).\nLord, like the writer of Lamentations, give me a heart that longs not just for my own renewal but the renewal of the people of God.\n“Restore us to yourself, O Lord, that we may be restored!” Amen.\n \nKelsey King lives in Nashville, Tennessee, and is loving her life as the She Reads Truth research assistant. Give her a donut with rainbow sprinkles and a good book and she just might love you forever.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram241.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "2 Timothy 2:11-13, Galatians 6:14",
    "devo_title": "The Grace of the Cross",
    "devo_summary": "\nBY She Reads Truth\n\nText: 2 Timothy 2:11-13, Galatians 6:14\nAs we walk through this season of reflection and repentance together, we want to provide time and space for us as individuals and a community to meditate on God’s Word and bow at His feet in prayer.\nEach Saturday during Lent we will read a brief passage of Scripture and a corporate prayer, both carefully chosen for this specific place in our Lenten journey. Sundays will be dedicated to scripture memorization, one of our favorite habits here at She Reads Truth.\nWe pray you will not only meet with the Savior on these quieter weekend days, but linger there with Him, in prayer and in His Word.\nO MY SAVIOUR,\nI thank thee from the depths of my being\n   for thy wondrous grace and love\n in bearing my sin in thine own body on the tree.\nMay thy cross be to me\n as the tree that sweetens my bitter Marahs,\n as the rod that blossoms with life and beauty,\n as the brazen serpent that calls forth\n   the look of faith.\nBy thy cross crucify my every sin;\nUse it to increase my intimacy with thyself;\nMake it the ground of all my comfort,\n the liveliness of all my duties,\n the sum of all thy gospel promises,\n the comfort of all my afflictions,\n the vigour of my love, thankfulness, graces,\n the very essence of my religion;\nAnd by it give me that rest without rest,\n   the rest of ceaseless praise.\nO MY LORD AND SAVIOUR,\nThou hast also appointed a cross for me\n   to take up and carry,\n a cross before thou givest me a crown.\nThou hast appointed it to be my portion,\n but self-love hates it,\n   carnal reason is unreconciled to it;\n without the grace of patience I cannot bear it,\n   walk with it, profit by it.\nO blessed cross, what mercies dost thou bring\n   with thee!\nThou art only esteemed hateful by my rebel will,\n heavy because I shirk thy load.\nTeach me, gracious Lord and Saviour,\n that with my cross thou sendest promised grace\n   so that I may bear it patiently,\n that my cross is thy yoke which is easy,\nand thy burden which is light.\n– “The Grace of the Cross” from The Valley of Vision\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Messages-Image310768284.png"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "1 John 1:9",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nText: 1 John 1:9\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a verse to keep close to our hearts during repentance.\n“If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.”\n – 1 John 1:9, ESV\nWrite this verse down—copy it twenty time if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/4-1-john-1-9.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 9:43-45, Luke 9:51-52, John 10:14-18",
    "devo_title": "To Jerusalem",
    "devo_summary": "\nBY Raechel Myers\n\nText: Luke 9:43-45, 51-52, John 10:14-18\nWhen the days drew near for him to be taken up, he set his face to go to Jerusalem.\nLuke 9:51, ESV\nMy in-laws live in Michigan. It’s a solid 9-hour drive from our house in Tennessee to enjoy their mild, midwestern summers and wonderland northern winters, but it is absolutely always worth it.\nWell, almost always. There is usually a moment—at about hour 7.5—where we’re past Cincinnati but still super far from Toledo and the kids have both used up all their charming travel puzzles and games, they’ve gotten whiney from too much screen time, and we’ve cut them off from snacks because snacks make them thirsty and drinks make them potty and we have made enough stops already forgoodnesssake.\nThat’s the moment when we front-seaters exchange exasperated-slash-desperate looks of “why did we think driving was a good idea?” and “couldn’t we have left the kids in Tennessee with friends and enjoyed a quiet drive just the two of us?” I’m pretty sure that wouldn’t go over very well with the grandparents.\nBut once we finally get there, we’re always so glad we came. We know it the moment we make that right turn onto their street to see Granddad and Groovy waving and grinning, with the pool all clean and heated and good things cooking in the oven. The being there always makes it worth it, but the getting there just about kills us.\nEnter my brilliant and blessed son, Oliver. I guess he was probably five at the time he invented the “Rocket Boost”, and it is now everyone’s favorite way to travel. The Rocket Boost is simple: close your eyes, force yourself to sleep, and next thing you know, you’ve completely slept through Kentucky! (Or Connecticut, or wherever it is you’re passing through.) Rocket Boosting is the best basic travel trick we know; even I have been known to sneak a Rocket Boost in the passenger seat from time to time!\nFriends, today we are doing a little Rocket Boost of our own. You may remember our Lent study is divided into three parts: Return, Repent, and Remember. We left you on Friday repenting and lamenting in 586 BC with the Israelites, worshiping and crying out amid the rubble of the destroyed Temple. Today we Rocket Boost about 600 years forward—past the Babylonian Exile, the rebuilding of Jerusalem’s walls under the leadership of Nehemiah, and 400 years of silence between the Old and New Testament—and when we open our eyes, we will see the in-the-flesh Promised Messiah prophesying of Himself, “Destroy this temple, and in three days I will raise it up” (John 2:19).\nSo, let’s stretch our arms, sit up straight, and renew our focus on the road—it’s time to “Remember” the narrative of our Savior’s last days. Over the next 3 weeks we will follow the Son of God from the moment He sets His face to Jerusalem, to the time the New Holy Temple—the One the Israelites cried out for in Lamentations and the One who forever eliminated the need for a curtain of separation between us and God—is indeed raised again in three days, just as He said.\nAs we begin this time of remembrance with Jesus “setting His face to Jerusalem”, let’s acknowledge the gravity of this moment. Jesus was setting His sights on the place where He would die for sinners in accordance with the will of God. He knew what awaited Him. As John Piper put it, “Jerusalem meant one thing for Jesus: certain death.” Jesus set His face toward Jerusalem out of obedience to the Father and love for sinners—you and me.\nThe world was under a curse of death, and our only possible rescue required a Man who was both Offerer and Offering. He couldn’t come as an Offering only, served up by an angry crowd as He fought tooth and nail to escape, or doing everything in His power to avoid Jerusalem altogether. No—He had to be the Offerer as well. Jesus’ life was His to give, and in turning His face toward Jerusalem, He was setting into motion the final days of our Great Rescue.\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram27.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Matthew 6:9-13, Isaiah 53:10-11",
    "devo_title": "Thy Kingdom Come",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText:  Matthew 6:9-13,  Isaiah 53:10-11,\nI have a notion that what seem our worst prayers may really be, in God’s eyes, our best…\nFor these, perhaps, being nearly all will, come from a deeper level than feeling.\n– CS Lewis, from Letters to Malcolm: Chiefly on Prayer\nI can’t pray out loud without crying. I have no idea why this is or exactly when it started, but ask me to pray aloud – in front of one person or 100 – and there will be puddles in my eyes by the time we reach Amen.\nIf you’re thinking this makes me super holy, you’re totally right. [If we were texting, this is where I would insert one of those cry-laughing emoji guys. In other words, sarcasm alert.]\nBut I know me, and I know my auto-tears don’t mean what you might think they mean. I know how hard I struggle with prayer, how the concept of talking to God has always made me feel intimidated, disoriented, strange. I know how my tears are less often tears of belief and more often tears of “I believe, help my unbelief” (Mark 9:24). And while some days prayer flows like breath from my lips — Thank you and Please Lord and Help me — most days my prayers start more like a grocery list than a love letter. Here are the things I know I need. Here are the things I need to remember.  Here are the people I ought to pray for.\nIt’s no wonder I was relieved to read CS Lewis’ comment that “prayer is irksome.” Or, as my handy thesaurus might say, it’s frustrating. Exasperating. Disagreeable. Prayer doesn’t always come naturally. We were made for communion with our Heavenly Father—but so long as we are being sanctified here on earth, we’ll struggle with this tension of praying for a Kingdom that has come and is yet to come.\nJesus knows we’ll need help in prayer department when teaches His disciples how to pray, saying clearly, “Pray like this.” What follows, now known as The Lord’s Prayer, is not flowery or overly emotional. It is bold. Intentional. Concise.\nFather, Your name is holy.\nBring Your Kingdom, Lord.\nYour will be done, not mine.\nWe depend on You for our life, our everything.\nForgive us and help us to forgive.\nAll glory is Yours, forever. Amen.\n“Thy kingdom come.” Only Jesus could truly understand the weight of this simple prayer. Only He knows how difficult the act of prayer can truly be or what this Kingdom-to-come really looks like.\nYet it was the Lord’s will to crush him and cause him to suffer…\n– Isaiah 53:10a, NIV\nJust as we saw in yesterday’s reading when Jesus “set His face to Jerusalem” knowing full well what it would mean, He also knew exactly what He was praying when He petitioned for God’s Kingdom to be ushered in. The coming of the Kingdom of God required the current, real-life sacrifice of God’s only Son.\nI want to pray those words like Jesus prayed — not because I feel like praying but because I know and believe in the goodness and holiness of the One to whom I pray.\nI want to give God glory in each and every thing, even when it hurts.\nI want to desperately depend on God for my provision on the great days and the awful days.\nI want to seek God’s will above my own, even when I don’t understand it.\nI want to pray for God’s Kingdom to come — both in the Now and in the Not Yet.\n“The petition, then,” says Lewis, “is not merely that I may patiently suffer God’s will but also that I may vigorously do it. I must be an agent as well as a patient. I am asking that I may be enabled to do it. In the long run I am asking to be given ‘the same mind which was also in Christ’” (emphasis mine).\nOh, how I want the mind of Christ! Oh, how I long for my prayers to be worshipful breaths of obedience and my tears always sincere. I want to not just pray “Your kingdom come” but to seek to vigorously do it!\nI want to daily lay down the banner of my kingdom and pick up the banner of the Kingdom of God.\nFriends, in the spirit of praying for the coming of God’s Kingdom and the nearness of the Son (and because it’s Saint Patrick’s Day!), let’s close our time today praying these beautiful words from St. Patrick’s Breastplate:\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist to comfort and restore me.\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\nMay it be so, Lord.\nAmen.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram28.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 22:1-2, Luke 22:7-30",
    "devo_title": "The Last Supper",
    "devo_summary": "\nBY Kaitlin Wernet\n\nText: Luke 22:1-2, 7-30\nIt’s become a running joke in my family that my mother always gets skipped at communion. In our church we stand up, pew by pew, and file to the front to kneel at the communion rail. I don’t know how or why it happens, but almost always, the bread and cup are distributed to the person on my mom’s left, then almost immediately, to the person on her right. She’s left with the choice to either leave empty-handed or disruptively wave her arms, demanding the bread and cup.\nMost of the time, she sits quietly, questioning what she did wrong. Is it the way I held my hands? Was I supposed to say a certain prayer? Did I not make enough eye contact?\nIt’s just a fluke, of course, that the service plates somehow pass her by, but it makes for some pretty amazing lunch conversation.\nIsn’t it interesting how Jesus chose our faulty human hands to distribute a reminder of the perfection found in Him? And yet, the coordination of the Last Supper was anything but flawed.\nI love it when Jesus sends Peter and John to arrange the meal and they ask, “Where do you want us to prepare it?” I wonder if they expect to help Jesus brainstorm a place to hold the supper, or even anticipate offering to open their own homes. Little do they understand that this night has been set into motion from the beginning of time. The disciples think they’re the hosts, when they’re really the guests.\nFrom the man carrying the pitcher of water, to the guest room already set aside for the event—every detail was perfectly planned. But my favorite phrase in the whole passage is, “and they left and found everything just as He had told them.” Just yesterday, I opened my pantry to an entire bag of rotten avocados, so the concept of finding everything just as I expected is rather foreign to me.\nThe flawless coming together of the Last Supper isn’t a coincidence or even just a final miracle on Jesus’ last day. Look closely and you’ll see Jesus building the framework for countless times in the days ahead when the disciples would find things just as He had told them. Like the disciples, we hold this track record of our Lord’s faithful fulfillment of His promises close to our hearts, so when the time comes, like the hymn writer says, we’ll remember — although  “The Father turns His face away,” “The wounds which mar the chosen one bring many sons to glory.”\nJesus knew we would struggle to grasp the weight of His sacrifice and the fullness of His forgiveness.\nHe knew we’d be tempted to load that weight on our backs in an effort to re-do the work He’s already completed.\nHe knew, even then, we’d forget the depth of our need for Him and trick ourselves into believing our faulty hands are clean.\nSo, He spent the final hours before His arrest reminding us to remember by instituting a meal of remembrance—by instructing us to use the simple elements of bread and wine to remind us of His body and blood.\nAnother name for communion is the Holy Eucharist, which I love, because it comes from a Greek word meaning “thanksgiving.”\nAnd so, we remember His body broken. And we beg not to forget His blood spilled. And we give thanks, because “He who has promised us is faithful.” (Hebrews 10:23)\nFriends, we’ve been through some tough passages during the Lenten season, and revisiting the Crucifixion will be no different. Let’s fix our eyes on the framework of faithfulness Christ has laid before us. Approach in your hearts the table of thanksgiving established by our Savior, and find everything  just as He told us.\n“Bread of the world, in mercy broken,\nWine of the soul, in mercy shed,\nBy whom the words of life were spoken,\nAnd in whose death our sins are dead:\nLook on the heart by sorrow broken,\nLook on the tears by sinners shed;\nAnd by Thy feast to us the token\nThat by Thy grace our souls are fed.”\n—Reginald Heber\nKaitlin Wernet is a Carolina girl who now plants her feet in Tennessee as the Community Coordinator for She Reads Truth. Each day, she excitedly celebrates grace with her SRT sisters while attempting to tame her curly hair and avoid parallel parking.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram29.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Isaiah 51:17, Luke 22:39-46",
    "devo_title": "The Cup",
    "devo_summary": "\nBY Guest Writer\n\nText: Isaiah 51:17, Luke 22:39-46\nWhile the image of Jesus hanging on the cross is truly agonizing, it is somehow the account of the Garden of Gethsemane that grieves me deepest. It is here, with Jesus on His hands and knees, weeping and pleading with God, that I feel the fullness of His humanity and the depth of His sacrifice. It is in this garden that I feel the weight of His suffering at my hands.\nHe made His way into the garden, away from the disciples, and He prayed, “Father, if you are willing, take this cup from me; yet not my will, but yours be done.” (Luke 22:42, NIV)\nIt’s hard for us to wrap our believing hearts around Jesus asking to be spared the Cross – the very purpose of His incarnation. But He puts an asterisk on His very human request by declaring His obedience at any cost.\nThroughout the Old Testament, “the cup” is used as a metaphor for God’s judgment and His wrath, as in Isaiah 51:17: “You have drunk the cup of the Lord’s fury. You have drunk the cup of terror, tipping out its last drops” (NIV). So when Jesus prays about avoiding the cup, He’s fully aware of what He is about to do by going to the cross: He is drinking the cup of God’s wrath. Yes, He’s taking on the physical agony of the cross, but He is also taking on the spiritual agony of separation from His loving father. And that separation is the pain that is breaking Him down in the garden.\nBut without missing a beat, He prays on.\n“Yet not my will, but yours be done.”\nAnd this is where I am convicted for all the times I complain about my own “suffering” in this life.\n“Yet not my will, but yours be done.”\nAnd this is where I am made keenly aware of my foolish attempts to build my own plans for my life.\n“Yet not my will, but yours be done.”\nAnd this is where I stop rushing through the Lenten season to get to the glorious celebration on Easter morning. The garden is where I pause to hear His sobs and His prayers. It’s where I see that cup we poured so violently spilling over. And it’s where I thank Him for His willingness to drink every last drop of it. For me.\nSarah Matheny is an ever-growing, ever-changing gal, laughing and living in the Pacific Northwest. One-time attorney, food blogger, and author, all-the-time wife and mom to three wild-eyed, spunky girly girls, she’s passionate about her family, her friends and growing in her walk with Christ as He dishes up an always unpredictable, but totally delicious life.\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram30.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Mark 14:41-50",
    "devo_title": "Betrayed and Arrested",
    "devo_summary": "\nBY Ellie Holcomb\n\nBetrayed. My stomach turns at the word. I remember vividly when someone I loved dearly and deeply turned into an enemy. There was a proverbial knife in my back and I was hurt, angry, and aching. I wonder how many of you have walked through betrayal. It is awful. You’re powerless to stop the pain and you keep wishing in vain that it could somehow be a different story.\nJesus wished it could be a different story, too. Just before this scene in Mark where He is betrayed by Judas and arrested, He was in a garden on his knees in deep distress, begging His Father to take the cup (Mark 14:35). Jesus knew what was coming and that it would feel unbearable. He’d asked His three dearest friends on earth to pray for Him, too—but three times, He comes to find them asleep. In His deepest hour of need, dreading what lies before Him, His friends can’t even keep their eyes open.\nI can’t imagine how lonely this must have felt. And yet, Jesus is not a victim, but a volunteer.\nIn the middle of a crowd armed with swords and clubs, in response to the excruciating task set before Him, Jesus says, “…the Scriptures must be fulfilled” (v.49).\nAnd even as He utters these words, “…everyone deserted him and fled” (v.50). Jesus will face this dreaded mission alone, and eventually even His own Father will have to turn His back as Jesus takes upon Himself all of our shame and iniquity—all our brokenness upon His broken body and into His breaking heart (Mark 15:34).\nSon of Man, Son of God, Living Word—betrayed for our sake.  He drinks the cup of death that we deserve, so that our cups might overflow.\nSisters, have you been betrayed, wounded, discarded, deserted, abused, unfairly treated?\nYou are not alone.\nOur Savior suffered, too. He suffered for us, so we could know that we never face betrayal or any sort of suffering alone. Emmanuel, God with us. Let’s take our pain, our breaking hearts, our anger, our questions, and all the things in life that make us feel powerless and helpless to Him today.\nHe was arrested so we could be set free.\nHe was deserted so we could know we’re never alone.\nHe was betrayed so we could be held in the arms of Love.\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram31b.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Ephesians 1:7-8, Ephesians 2:13",
    "devo_title": "Calvary’s Anthem",
    "devo_summary": "\nBY She Reads Truth\n\nText: Ephesians 1:7-8, 2:13\nAs we walk through this season of reflection and repentance together, we want to provide time and space for us as individuals and a community to meditate on God’s Word and bow at His feet in prayer.\nEach Saturday during Lent we will read a brief passage of Scripture and a corporate prayer, both carefully chosen for this specific place in our Lenten journey. Sundays will be dedicated to scripture memorization, one of our favorite habits here at She Reads Truth.\nWe pray you will not only meet with the Savior on these quieter weekend days, but linger there with Him, in prayer and in His Word.\nHEAVENLY FATHER,\n\nThou hast led me singing to the cross\n     where I fling down all my burdens\n       and see them vanish,\n where my mountains of guilt are levelled\n   to a plain,\n where my sins disappear, though they are\n   the greatest that exist,\n and are more in number than the grains\n   of fine sand;\nFor there is power in the blood of Calvary\n to destroy sins more than can be counted\n   even by one from the choir of heaven.\nThou hast given me a hill-side spring\n that washes clear and white,\n   and I go as a sinner to its waters,\n     bathing without hindrance\n       in its crystal streams.\nAt the cross there is free forgiveness\n   for poor and meek ones,\n and ample blessings that last for ever;\nThe blood of the Lamb is like a great river\n   of infinite grace\n with never any diminishing of its fullness\n as thirsty ones without number drink of it.\nO Lord, for ever will thy free forgiveness live\n that was gained on the mount of blood;\nIn the midst of a world of pain\n it is a subject for praise in every place,\n   a song on earth, an anthem in heaven,\n     its love and virtue knowing no end.\nI have a longing for the world above\n where multitudes sing the great song,\n for my soul was never created to love\n   the dust of earth.\nThough here my spiritual state is frail and poor,\n I shall go on singing Calvary’s anthem.\nMay I always know\n that a clean heart full of goodness\n   is more beautiful than the lily,\n that only a clean heart can sing by night\n   and by day,\n that such a heart is mine when I abide\n   at Calvary.\n– “Calvary’s Anthem”, from The Valley of Vision\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram32.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Isaiah 53:5",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nText: Isaiah 53:5\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen a powerful verse to remind us of Christ’s sacrifice.\n“But he was pierced for our transgressions; he was crushed for our iniquities; upon him was the chastisement that brought us peace, and with his wounds we are healed.”\n– Isaiah 53:5, ESV\nWrite this verse down—copy it twenty time if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/4-isaiah-53-5.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Mark 14:26-31, Mark 14:66-72",
    "devo_title": "Peter Denies Jesus",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Mark 14:26-31, 66-72\nBefore I was married, I told myself I would never be unkind to my husband. Occasionally failing at that, I promised myself I would never holler at my children. When the children and the hollering came along, I vowed that I would try to eat fiber for breakfast.\nI was such a great wife, mom, and eater of fiber before I actually had to do those things. It’s like the way I felt about parenting before I was a parent — the judgy way I looked at a tantrum-throwing child sporting snow boots, a runny nose, and hair that was last brushed three days ago. I always thought, “I will NEVER parent like that!” Baby, was I surprised to have a husband, children, and unlimited breakfast cereal choices as an adult.\nWhen I read this story of Peter denying Christ, I see myself. I’m that loudmouth who would stand up and promise, “Lord, I would NEVER deny you!” Jesus was addressing them all, but Peter is the guy who is so sure he’s going to get it right that he argues with Jesus.\nAll the disciples hid and denied Christ in their own way that night. It felt like the world was ending. I’m sure they found all kinds of ways to justify their actions, just like I would have. Reading this story, it’s easy for me to say, “I, at least, would have stood with Jesus, unlike those cowardly disciples.” But, based on my track record of vow-keeping, I would probably have hid like greasy rat.\nFor crying out loud, what is wrong with me? In all my best intentions to do right, I fall away, again and again, and stinking again. Just like Peter, I psych myself up, “I won’t do it wrong this time. This time for sure!” But, in the end, I’m right there with Peter, listening to the rooster crow and holding my head in my hands.\nJesus knew this would happen. He knew His disciples we going to fail Him. He knew I would get parenting and marriage wrong, day after day. But this is why He came. This is exactly why He came.\nDon’t miss this moment to see your need for Him. It’s the first step of the gospel: just to see that you need Him. See it.\nWhen Jesus tells Peter he will deny Him three times, He’s not clanging the final bell of doom for Peter. He’s confronting Peter’s sin, but He’s not rejecting Peter’s salvation. We, like Peter,  must see the true nature of our sin, to see the truth of our salvation.\nWhen we see our sin and our need of Christ, our response must be like Peter’s—to weep bitterly for our betrayals, and to repent. Take your head in your hands and weep when you need to, then rise in repentance and walk in a new direction.\nJesus knows you, like He knew Peter. Despite all your adamant protestations that you’ll never deny Him again, Jesus knows your sin and He loves you still.\n \n\n \n\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram33.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Psalm 22:1-26, Isaiah 53:1-3, Luke 22:63-65, John 19:1-5",
    "devo_title": "“Hail, King of the Jews!”",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Psalm 22:1-26, Isaiah 53:1-3, Luke 22:63-65, John 19:1-5\nAny day now, I’m going to have a baby.\nBirth is one of those elemental moments in life: I’ll get to really yell and really cry. I love birth because I just can’t control it; I’ll go into labor when the time is right. One day soon I’ll be folding laundry, or lounging in a co-worker’s nice leather chair, and SOMETHING will HAPPEN—I’ll go into labor. Don’t you just love it with something happens?\nSo many days follow suit, one after another—but when something really happens we all stop and stare, or yell, or get out our phones to make videos. We really pay attention in these elemental moments of pain. Folks are always asking me to prophesy WHEN the baby will be born, and I keep dodging with, “I’m not going to miss it.” That’s just it. Some things in life are so big, and so intense, it’s not possible to miss them. When the baby comes, I won’t just sleep through it.\nIntense moments grab our face on both sides and force us to pay attention. In my moment of need, I will be center stage. My husband will rub my back, my facebook friends will pray for me, my church is already preparing casseroles for me, my doula will speak encouraging words, and my midwife will attend me like a queen. It’s true. These people who love me will drop everything and turn their faces to me.\nBut for Christ, in His moment of greatest intensity, when SOMETHING is really HAPPENING, we see that people are turning their faces away from Him.\nWe are painfully aware of the human side of Christ in these passages. He is in agony (Psalm 22), He is alone and isolated (Isaiah 53), He is mocked (Luke 22), and He is rejected (John 19).\nIn Jesus’ darkest moment, His best friends—those disciples who are like brothers to Him— deny and abandon Him. They look around for places to hide.\nThe law turns its back on Him. Pilate finds no reason to punish Him, but allows Him to be taken away in spite of justice.\nAnd finally, most painful of all, His Father turns away from Him.\nWhen Jesus feels the sharp crown of thorns pressed into His head, He is alone. At a time when we all should be there, lovingly attending Him, we turn our faces away. Although Jesus was 100% God, He was also 100% man, and this isolation was real for Him. Everyone He loved left Him to suffer the hardest moment of His earthly life alone.\nLet this moment grab you by the face. Yell if you have to. Turn your face towards our Lord and see the cost of our sin piled on His sacred head.\nO sacred Head, now wounded, with grief and shame weighed down,\nNow scornfully surrounded with thorns, Thine only crown;\nO sacred Head, what glory, what bliss till now was Thine!\nYet, though despised and gory, I joy to call Thee mine.\nWhat Thou, my Lord, hast suffered, was all for sinners’ gain;\nMine, mine was the transgression, but Thine the deadly pain.\nLo, here I fall, my Savior! ’Tis I deserve Thy place;\nLook on me with Thy favor, vouchsafe to me Thy grace.\nWhat language shall I borrow to thank Thee, dearest friend,\nFor this Thy dying sorrow, Thy pity without end?\nO make me Thine forever, and should I fainting be,\nLord, let me never, never outlive my love to Thee.\n“O Sacred Head Now Wounded”\nattributed to Ber­nard of Clair­vaux, 1153\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram34.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 22:66-23:12, John 18:28-38, Isaiah 53:7-8",
    "devo_title": "The Messiah on Trial",
    "devo_summary": "\nBY Guest Writer\n\nText: Luke 22:66-23:12, John 18:28-38, Isaiah 53:7-8\nHe was oppressed and He was afflicted,\nYet He did not open His mouth;\nLike a lamb that is led to slaughter,\nAnd like a sheep that is silent before its shearers,\nSo He did not open His mouth.\n– Isaiah 53:7, NASB\nIt’s a little known fact to anyone who steps into my homeschool classroom (in actuality, a small breakfast nook crowded with a well-loved child’s play kitchen, sticky high chair and watercolor-stained dinner table) that I used to be an attorney. Don’t judge.\nAs someone who has read textbook after textbook of case law and learned the rights guaranteed by the Constitution backwards and forwards, the trial of Jesus has me shaking my head at how such a tragedy of justice could take place. Due process? Hardly.\nThe list of injustices is lengthy:\nThe trial was illegally held in a private home.\nWitnesses were illegally called at night.\nJesus’ accusers “tried on” various charges until they found something, anything, on which Pilate had jurisdiction to rule.\nWhen Pilate didn’t want to rule, he shipped Jesus off to another judge, Herod. Herod mishandled the defendant and let his jailers mistreat Him—dressing Him mockingly in an elegant robe—after which Herod returned Jesus back to the first judge.\nJesus had every right, every opportunity and, obviously, full capability to protest. When you are the Son of God, I would assume you are more than equipped to argue your case pro se—that is, on your own. And yet, He didn’t.\n\nThere’s a phrase that makes any attorney cringe when they hear their client say it. It’s like nails on a chalkboard, whether the client is technically on the right or wrong side of the law. That phrase is, “I don’t care what it costs; it’s a matter of principle.” When you hear those words you then know this case is out of your hands, because your client’s ego, pride and need to prove him or herself right is on the line. Nothing is going to stop them.\n\nI’d argue that no one is any more “in the right” than Jesus. Yet He endured every injustice, every step of the way, without ego, pride or the need to prove Himself. He let go of standing up for the principle of the matter by standing up for those that principally matter to Him. You. Me.\n\nAs pastor and writer Adrian Rogers explains, “If Jesus had taken up His own defense with the intention of refuting his accusers and proving his innocence, he would have won. But we would have lost, and we would be lost for all eternity.”\n\nJesus had a totally different case strategy—to take His case, and ours, to a higher Judge. He is the ultimate example of turning the other cheek. In those instances when we want to stomp our feet and cry, “No fair!”—or “But I’m the one who’s right here!”—we have the freedom to say nothing at all. Christ is our perfect defense. We can take our satisfaction not in proving ourselves right, but in the knowledge that our ultimate fate has already been sealed by a higher Judge—One who sits not on a bench with a gavel, but on a throne of clouds, wielding mercy and unending compassion. Case dismissed.\nSarah Matheny is an ever-growing, ever-changing gal, laughing and living in the Pacific Northwest. One-time attorney, food blogger, and author, all-the-time wife and mom to three wild-eyed, spunky girly girls, she’s passionate about her family, her friends and growing in her walk with Christ as He dishes up an always unpredictable, but totally delicious life.\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram35.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 23:13-25, Isaiah 53:10-11",
    "devo_title": "“Crucify Him!”",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Luke 23:13-25, Isaiah 53:10-11\nSo when the crowd had gathered, Pilate asked them, “Which one do you want me to release to you: Jesus Barabbas, or Jesus who is called the Messiah?”\n– Matthew 27:17, NIV\nSunday mornings are the living worst at my house. There is no other day of the week that breeds more fighting, resentment, and tears for us. And I don’t mean the children. I am convinced my husband is a tyrant, rushing us all out of the house. I paused my writing just now to ask him to describe me on Sunday mornings. His whiskers bristled and he smiled, “Recalcitrant.” Then I had to get a dictionary, and I found this: “a person with an obstinately uncooperative attitude.” Fine, then, that’s me. We disagree about how to get our family of sixteen (might be just 6) out the door.\nThe thing is, Christ is the Lord of the Sabbath (Mark 2:23-28). It’s His rightful place. Caleb and I are both hugely inconvenienced that we are not lords of the Sabbath. It’s so much easier to make the wrong choices than actually submit my time and my life to Christ. I just like to choose me instead. But who in her right mind would choose someone—anyone—over Jesus?\nWhen Pilate proposes to release Jesus, the people cry out, “Away with this man, and release to us Barabbas!” Who is dirty Barabbas, and why is he even in this narrative?\nOk, so this blows my mind. First, his full name was “Jesus Barabbas.” Pilate is essentially asking the crowd, “Do you want Jesus Barabbas or Jesus, the Son of God?” There is an obvious parallel in the names.\nBut even more interestingly, the name “Barabbas” in Hebrew is “bar -abba”, or “son of the father.” So the full name of the murderer would have been “Jesus son of the father” (Matthew 27:17 NIV). When juxtaposed with the name of Christ “Jesus Son of the Father”, we can see that Barabbas’ appearance in this story is no accident.\nThe criminal’s name is an exact mirror of Christ’s name. The people get to make a choice between two “Jesus son of the fathers”—they could chose an innocent man accused of crimes, or a criminal to be released as an innocent man.\nIt was a clear-cut choice: choose the false man or the true man. Choose the innocent man or the murderer. But the crowd that day chose the wrong Jesus. They chose to call evil good and good evil. They chose Barabbas. It was the ultimate inversion of justice.\nWhy on earth did they choose Barabbas? It was tradition to let one prisoner go in honor of  Passover, and I reckon it felt pretty generous and righteous to set that prisoner free. And in this case, it seems so forgiving and merciful to let this obvious sinner go. Wildly, this was actually the more comfortable choice. Nevermind that they would all need to hide their wives and kids—they wouldn’t have to change their worldview.\nChoosing Barabbas didn’t force the crowd to face their own sin. They could go on living their comfortable lives if they got rid of Jesus. Admitting that Christ is the true Son of God changes everything. It changes how we spend every moment of every day. It feels so much easier to just pat myself on the back and choose Barabbas—”look, I set the prisoner free!”\nI’ve got to stop choosing Barabbas! I don’t want to live the false life; I want to stand in the truth! I don’t need to be lord of the sabbath; I acknowledge that Christ is Lord. I choose Him instead of me.\nWhere in your life do you say, “Give me Barabbas?” Where do we resent Christ’s rightful intrusion into the comfortable areas of our lives?\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Messages-Image1750399424.png"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 23:26, Mark 15:21, Matthew 16:24-25",
    "devo_title": "Simon of Cyrene",
    "devo_summary": "\nBY Debbie Eaton\n\nText: Luke 23:26, Mark 15:21, Matthew 16:24-25\nI can’t begin to count how many times I’ve taken what feels like the weight of the world on my shoulders. I do this in every area of life, from trying to control a situation or set of circumstances—like the stress of household finances or my child’s grades and school performance—to taking on friends’ hardships, ministry burdens, work projects, even justice issues as problems for me to solve. But life doesn’t work that way, does it?\nWe were never meant to carry the weight of the world on our shoulders. It cripples and disappoints, creating discouragement, sleepless nights, and emotional turmoil. Heaping this weight on ourselves bears anger, resentment, fear, anxiety, stress, comparison, and jealousy—and that awful feeling that we can’t be everything to everyone, even though we try and try and try. I am tired and worn out just writing this!\nThis kind of heavy living is not the way of our Lord. Jesus said this:\n“Come to Me, all who are weary and heavy-laden, and I will give you rest. Take My yoke upon you and learn from Me, for I am gentle and humble in heart, and you will find rest for your souls. For My yoke is easy and My burden is light.”\n– Matthew 11:28-30, NASB\nJesus knew we would live under the daily weight of our idols of self-entitlement and our illusions of control, trying to play savior to ourselves and others. He knew the burdens of life would have crushing effects, so He taught and challenged His disciples to follow His lead, practicing the disciplines that keep us in relationship with God.\nOn that Friday after being beaten, judged, and sentenced to death, Jesus walked the dusty road to His crucifixion. Simon of Cyrene experienced a divine interruption when he was pulled from the crowd to carry the cross. Jesus walked in front of him, and Simon kept his eyes on Jesus. He was not taking Jesus’ place; he was simply following Him.\nTo follow Jesus is to relinquish our attempts to be god and savior to others. It is trusting that God is in control and we are not. It is believing that Christ alone saves, and we, despite our best efforts, do not. It is accepting—and expecting—Jesus to interrupt your day to bring your focus back to Him. Friend, this is far easier to write than to live because it requires complete dependence, humility, trust in God and His Word. To be a disciple means having a heart to follow, learn from, and love Jesus as He teaches, directs, and shapes our character and response to life circumstances.\nWhen we fix our eyes on Jesus ….\nThe Bible becomes the sustaining nourishment for living life. (Psalm 1:1-2)\nInterruptions become divine appointments. (John 4:1-26)\nConfession turns to freedom. (Isaiah 1:18)\nQuiet time restores the unsettled soul. (Psalm 46:10)\nLoving one another is not fixing each other, but pointing to the Savior who heals, redeems, and forgives. (1 John 4:7-12, Hebrews 12:1-17)\nThe weight of life is transferred back to the only One who can bear the weight.\nAs we fix our eyes on Jesus, He will take on our heaviest burdens and use them to transform us to be more like Him, and others will see and witness His redemptive glory.\n“For it is the grace of Christ, and not our own virtue, that gives us the power to overcome the flesh and the world.”\n– Thomas a Kempis\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram38.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": " John 11:25-26",
    "devo_title": "Crucifixion and Resurrection",
    "devo_summary": "\nBY She Reads Truth\n\nText: John 11:25-26\nAs we walk through this season of reflection and repentance together, we want to provide time and space for us as individuals and a community to meditate on God’s Word and bow at His feet in prayer.\nEach Saturday during Lent we will read a brief passage of Scripture and a corporate prayer, both carefully chosen for this specific place in our Lenten journey. Sundays will be dedicated to scripture memorization, one of our favorite habits here at She Reads Truth.\nWe pray you will not only meet with the Savior on these quieter weekend days, but linger there with Him, in prayer and in His Word.\nO LORD,\n\nI marvel that thou shouldst become incarnate,\n   be crucified, dead, and buried.\nThe sepulchre calls forth my adoring wonder,\n for it is empty and thou art risen;\n the four-fold gospel attests it,\n the living witnesses prove it,\n my heart’s experience knows it.\nGive me to die with thee that I may rise to new life,\n for I wish to be as dead and buried\n   to sin, to selfishness, to the world;\n that I might not hear the voice of the charmer,\n   and might be delivered from his lusts.\nO Lord, there is much ill about me — crucify it,\n much flesh within me — mortify it.\nPurge me from selfishness,\n the fear of man, the love of approbation,\n the shame of being thought old-fashioned,\n the desire to be cultivated or modern.\nLet me reckon my old life dead\n   because of crucifixion,\n and never feed it as a living thing.\nGrant me to stand with my dying Saviour,\n to be content to be rejected,\n to be willing to take up unpopular truths,\n and to hold fast despised teachings until death.\nHelp me to be resolute and Christ-contained.\nNever let me wander from the path of obedience\n to thy will.\nStrengthen me for the battles ahead.\nGive me courage for all the trials,\n and grace for all the joys.\nHelp me to be a holy, happy person,\n free from every wrong desire,\n from everything contrary to thy mind.\nGrant me more and more of the resurrection life:\n may it rule me,\n may I walk in its power,\n and be strengthened through its influence.\n– “Crucifixion and Resurrection” from The Valley of Vision\n \n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram39.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Matthew 21:1-11, Revelation 7:9-12",
    "devo_title": "Hosanna!",
    "devo_summary": "\nBY Raechel Myers\n\nGood morning, friends. Sundays at She Reads Truth are normally Weekly Truth days, where we as a community join in the important practice of memorizing scripture together. We do have a memory verse and lock screen for you today (it’s at the bottom of this post!), but we hope you’ll join us in reading the full passage in Matthew and reflecting on Christ’s triumphal entry into Jerusalem.\n\nText: Matthew 21:1-11, Revelation 7:9-12\nYou know what stinks about being human? Being human. We are limited creatures. We only know what we know. Sure, hindsight is 20/20, but when it comes to foresight, we can be blind as bats. We don’t know what’s on the next page until we get there to live it.\nPaul, in 1 Corinthians 13:9-12, describes this as “seeing in a mirror dimly.” But, “when perfection comes,” Paul tells us we will see clearly—no longer linear, no longer partial, but complete!\nNow picture Jesus, both fully man and fully God, riding through the crowded street that day. He already saw the complete picture—beyond this Triumphal Entry—so He knew what this ride into the capital city really meant. He knew He was riding to His death at the hands of those who waved the palm branches that day.\nThe people cried “Hosanna”—a shout of adoration that was also the Hebrew word meaning “Oh, save now!” or “Please save!”.\nOnly Jesus knew the gravity of what the crowd was asking when they cried to Him, “Save us!”  And He rode on. He knew what had been and what was to come, and in love and obedience, He rode on.\nI wonder if, from His seat on that donkey, Jesus thought back to His mother Mary. She journeyed on a donkey, too, toward the most hope-filled moment the world has ever known. And here He was, riding toward the darkest moment in human history. Did He think back to her?\nOr maybe Jesus thought forward to that blessed day John describes in Revelation 7, when we will stand before Him in white robes as His Bride—all nations and tribes and colors and generations—waving palm branches once again, proclaiming that our salvation indeed comes from Him!\nWe don’t know; the Bible doesn’t tell us. He certainly knew all these things as He rode through the adoring crowds that day. And while it’s true we can’t know for sure what’s coming tomorrow or the next day the way Jesus can, we can confidently shout “Hosanna! Save us!” today, knowing He will and He did.\nHosanna in the highest! Salvation belongs to our God.  \n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen the crowd’s shout of worship and cry for salvation as Jesus rode into Jerusalem that Palm Sunday:\nBlessed is he who comes in the name of the Lord! Hosanna in the highest!\n– Matthew 21:9b, ESV\nWrite this verse down—copy it twenty time if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram40.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 23:27-31, Psalm 56:8, Hosea 10:1-8",
    "devo_title": "Daughters of Jerusalem",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Luke 23:27-31, Psalm 56:8, Hosea 10:1-8\nI’d like to nominate elevators as one of the most awkward spaces on the planet. You can go through most days refusing to acknowledge other people exist if you want to, but step onto an occupied elevator and you’re stuck. You know the other person is there. They know you know they’re there. You know they know you know they’re there. So you have 3 choices: stare straight ahead (awkward), stare at your phone (still pretty awkward), or look at the person (super awkward).\nMost of us choose Option A.\nJesus could have easily gotten away with ignoring the women crying out to Him as He walked along the dusty road, beaten and nearly naked, making the painful journey to an awful death. Yet even more remarkable than the fact that He brought His eyes up met theirs, or that He spoke to them in the midst of His suffering, is what He chose to say:\nTurning to them, Jesus said, ‘Daughters of Jerusalem, do not weep for Me, but weep for yourselves and your children.” (Luke 23:28, HCSB)\nJesus shifts the object of the their sympathy and mourning from Him back to themselves.\nWhy does He do this? Who are these women to whom the suffering Christ delivers a gentle but stern warning in the most striking of circumstances?\nThe women are noted to be citizens of Jerusalem, a center of religion that fervently rejected Jesus of Nazareth. We aren’t told exactly why they are following Jesus in a situation when many of His own have turned away. Perhaps they recognized glimpses of the divine in His words and actions and were following as unofficial disciples. Or maybe, and probably most likely, they were simply “good” religious folks who pitied Jesus and lamented the extreme cruelty being shown an innocent man.\nMore important than the motive behind their mourning are these three simple-yet-profound facts about their brief encounter with Christ:\nHe sees their tears. Jesus looks up from His own pain to acknowledge theirs. Yes, He was the divine Son of God suffering for the sin of humankind, and yes, they were members of that sinful race. Nevertheless, Jesus sees their tears, just like He sees mine and yours (Psalm 56:8).\nHe acknowledges their sorrow but redirects it to the proper place. Jesus quotes the words of the prophet Hosea when He describes the enormity of the sorrow to come for those who reject Him. In Hosea chapter 10, the people of God respond to fruitfulness and blessing not by turning toward God but turning toward themselves and their false gods. The consequences of this separation from God are severe—so severe that the people cry out for death to swallow them in their misery.\nJesus’ warning to the women on the Via Dolorosa that day was not an empty threat; it was the compassionate prophesy of a loving Savior who knows the natural way of a soul separated from the Father. I like commentator Matthew Henry’s explanation of Christ’s response when he says, “Let us weep, not for him (Jesus), but for our own sins, and the sins of our children, that were the cause of his death; and weep for fear (such were the tears here prescribed) of the miseries we shall bring upon ourselves, if we slight his love, and reject his grace.”\nBut Jesus does not leave the daughters of Jerusalem with a look and a warning that day. Which brings us to glorious #3—\nHe answers their grief with the ultimate display of love. The God who sees our every tear, who knows every hope and pain from whence they come, is the God who walked bruised and bleeding up the hill of obedience, called Calvary, and gave His very life to purchase our pardon. As NT Wright puts it, “The cross is the place where, and the means by which, God loved us to the uttermost.”\nThe God who views our tears as so precious that He keeps record of them in His book is the same God who says, “Don’t weep for me. Weep for yourselves.” For we are the sinful ones, Sisters, and He is all-holy. But through Christ’s work on the Cross, we are hidden in Him and brought eternally and indelibly near to God (Colossians 3:3). Thanks be to God!\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram41.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Isaiah 53:4-6, Luke 23:33-38",
    "devo_title": "“Father, Forgive Them”",
    "devo_summary": "\nBY Kaitlin Wernet\n\nText: Isaiah 53:4-6, Luke 23:33-38\nIn college, every older student I talked to gave me the same advice: whatever you do, don’t take Media Law. After a series of unfortunate events we’ll call “Requirements For Graduation,” I found myself gazing through my non-prescription lenses at my professor, who passionately spoke of famous court cases, the difference between slander and libel, and the details of his recent inner-ear surgery.\nIt was also in this class that I learned if I had kept up my childhood behavior, I’d basically be a criminal by now. (I’m now realizing that’s probably not something I want taken out of context. Let’s just keep that between me and you, ok? Ok.)\nYou see, I was on the fast track to breaking every copyright law in the book, which, yes, Dr. Collins, I read cover to cover. Growing up, I rewrote my favorite books to include myself in them. It wasn’t enough to feel like I knew a character; I needed the character to know me. I adjusted all of my favorite plotlines to include a spunky, curly-haired little girl who, of course, always had something to do with the happily ever after.\nMaybe you didn’t spend your childhood the same way, but I feel safe in saying that a good majority of us would jump at the opportunity to inject ourselves into our favorite stories.\nIn the simplest of terms, I came to faith the same way. I savored words of Truth for many years, but it wasn’t until I realized my name was already intertwined in The Gospel Story that I began to understand it. I’d figured I really was a sinner—by birth, inheritance, or association—but when I realized I’m an active sinner by trade, everything changed.\nI assume not many joyfully proclaim, “I’M A SINNER!!!,” in the middle of a school cafeteria, but I did, and I still remember the giddiness I felt upon being a part of the story.\nThe funny thing about this realization, as we’ve revisited during this Lenten season, is that my sinful nature is the very thing that should kick me out of the plotline for good. Instead, Jesus shows up, asking us to lean in a little closer and see how He’s written our own hearts into the story.\nLet’s settle in and take in the scene of today’s reading for a moment: two criminals have just been crucified, and Jesus is up next. It’s a climactic chain of events headed for the turning point, but then the focus shifts to the most unlikely of subjects— us.\n“Father, forgive them.”\n“Father, forgive [your name goes here].”\nAnd here’s where the story twists unlike any I could have written for myself. Honestly, I’m tempted to take my forgiveness and run for the hills, because things are getting intense and I’m afraid the casting of my role is a mistake.\nBut friends, we weren’t written out of the story. We’re still front and center.\nLike John MacArthur points out, “The forgiveness [Jesus] extended on the cross to those who put him to death is the same forgiveness he extends to sinners today.” His grace is specific for you and specific for me. Being the object of Christ’s love is the biggest role we’ll ever play—a role of a deep recognition and intimate knowledge, created by our Heavenly Father for us to fill. It isn’t until we view the story from our assigned places that we allow ourselves to see His forgiveness as a gift of personalized mercy.\nBecause of the sacrifice of the Son and the forgiveness of the Father, you and I have a place in this story—in The Story. May we continue to walk in the narrative of grace penned with us in mind.\nKaitlin Wernet is a Carolina girl who now plants her feet in Tennessee as the Community Coordinator for She Reads Truth. Each day, she excitedly celebrates grace with her SRT sisters while attempting to tame her curly hair and avoid parallel parking.\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/SRT-Lent2015_instagram42.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 23:32-33, Luke 23:39-43, Mark 15:27-32, Isaiah 53:12",
    "devo_title": "Numbered With The Transgressors",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Luke 23:32-33, 39-43, Mark 15:27-32, Isaiah 53:12\nIt’s become a standard part of my day now. Every afternoon, around 5:15, I take my place in the slow-moving right hand lane of I-65 North, and I repent.\nThe She Reads Truth office is a solid 50-minute drive from my house in light traffic, so on the way home it’s a totally different monster. There’s a section of road on 65 North, a mile or so preceding the exits to the 440 bypass, where I am daily and rather begrudgingly reminded I’m a sinner. It’s like God gives me a glimpse, via Nashville’s going-home traffic, of the filthy soot of sin that lines the edges of my heart like a chimney. I’m a new woman in Christ, God’s Word says (2 Cor. 5:17), but there’s still plenty of the “old woman” tendencies sticking around to cause a ruckus.\nIt’s not a road rage thing; it’s much more subtle for me. I sit in my white minivan, with my satellite radio and calm demeanor, letting the occasional driver from the lane left of mine squeeze in front of me. And in my head, I silently make two lists of people: the Nice Ones, those who get into the far right lane as early as possible to wait their turn for the I-440 East on-ramp, and the Rotten Ones, who take advantage of the lighter traffic in the left lanes to speed by us patient, orderly folk and then dart over in front of us at the last possible minute. I give an annoyed grumble and say condescending things to them in my head, while secretly wondering how much time this strategy shaves off their commute.\nAnd there’s the rub: I sin when I judge the Rotten Ones and think myself better than them. And I sin when I stay in the left lane longer than I ought, playing innocent when I’m the one needing to sneak a notch or two to the right. I sin when I’m convinced my schedule is more important than theirs, that these hundreds of humans traveling the interstate are just characters in my story instead of their own.\nI’m a sinner. A sinner who has a LOT of time to think on her drive home from work.\nWe do this, don’t we? We organize people into lists in our head—who’s kind and who’s not, who’s selfless and who’s selfish, who’s a hard worker and who’s lazy, who we’d like to hang out with and who we’d like to avoid.\nWhen it comes to who among us is entitled to God’s love, we’re all on the Not Worthy list.\nThe Worthy list is made up of only one name: Jesus.\nAnd it would stay this way forever, were it not for the Cross.\nThe Cross is the sacred place where Jesus—Son of God, Worthy Lamb, the Sinless One—is “numbered with the transgressors.” He is placed on the list of those deserving God’s holy wrath, taking the death due their sin— our sin. Christ becomes our substitute, exchanging His righteousness for our sinfulness.\nBecause of Jesus—and only Jesus—we are forgiven, our unworthiness erased. Because of Him, we have have been made worthy, our names permanently placed on the list of those held forever close to our holy, loving God, never again to be separated from Him.\nWhether you’ve been in the lane of faith and repentance for miles or you squeezed over at the last minute, God’s grace is effective for you.\nYou, daughter of God who puts her trust in Jesus—your name is on the Worthy list. And it cannot, will not be erased.\n“Who can be afraid of one who is written in the same list with us? Surely we may come boldly to Him, and confess our guilt. He who is numbered with us cannot condemn us. Was He not put down in the transgressor’s list that we might be written in the red roll of the saints? He was holy, and written among the holy; we were guilty, and numbered among the guilty; He transfers His name from yonder list to this black indictment, and our names are taken from the indictment and written in the roll of acceptance, for there is a complete transfer made between Jesus and His people. All our estate of misery and sin Jesus has taken; and all that Jesus has comes to us.”\n– C.H. Spurgeon\n\n\n ",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/SRT-Lent2015_instagram43.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Psalm 22:18, John 19:23-27",
    "devo_title": "His Garments",
    "devo_summary": "\nBY Debbie Eaton\n\nText: Psalm 22:18, John 19:23-27\nI rarely find myself at the movies these days, but I was invited by some friends to go and see the new, updated Cinderella movie and loved it. It was fun to see all the little girls at the theater, dressed up in their beautiful blue gowns, dreaming of what it would be like to live the fairy tale. The scenery in the movie was beautiful, the costumes were stunning, and the story vividly illustrated the power of kindness, love, courage, and forgiveness.\nMost of us don’t live a fairy tale of ball gowns and glass slippers, but the broader storyline is one we can relate to. Our real life exposes the juxtaposition of cruelty and kindness, harshness and compassion, hate and love, good and evil.\nI can’t image the depth of emotion Jesus’ mother must have experienced, seeing her son— the Son of God—hanging in the balance of life and death. She watched as the four Roman soldiers mocked Jesus and divided up His outer garments, the seamless tunic she may have made with her own hands being raffled off. Death is hard enough to look upon, but to witness such horrible torture, mockery, betrayal, and hate is difficult to stomach or even imagine. Yet, in those moments of extreme suffering, Jesus models once again the power of love, forgiveness, and grace.\nThe soldiers concerned themselves with things that don’t last—His garments—missing the immense display of love happening right in front of them. While they cast lots for His belongings, Jesus spoke to His dear mother for the last time. He saw her grief, and before His last breath, He transferred her care to His beloved disciple and friend, John. Jesus’ love for His mother stood in contrast to the mockery of those who hated Him—a reminder that we are known, seen and loved by God, even in the most painful and humiliating of circumstances.\nWe tend to value material things in this life, things that threaten to bring out the worst in us. Like those Roman soldiers, we trust what is temporal, covering ourselves with false garments—pride, fear, even hatred—that harden and betray our hearts. These worldly concerns distract us from looking up to see the Father’s great display of love for us.\nSisters, let us cast away our false garments and put on His garments of grace, compassion, and love available to us through Christ’s work on the Cross. Only in Him will we find eternal peace, hope and joy.\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/SRT-Lent2015_instagram44.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Psalm 22:27-31, Luke 23:44-49, Mark 15:33-39, John 19:28-30",
    "devo_title": "“It Is Finished”",
    "devo_summary": "\nBY Raechel Myers\n\nText: Psalm 22:27-31, Luke 23:44-49, Mark 15:33-39, John 19:28-30\nI wish I could greet each one of you with a quiet hug on this day of mourning. It is perhaps the most bittersweet day of the year, but somehow, in the darkness, the “sweetness” is harder to find.\nHave you read through today’s passages yet? If you haven’t, I’d love if you’d do that first. Today we’ll sit in three gospel accounts of Christ’s crucifixion. Allow your heart to enter the text and ask the Holy Spirit to quiet distractions as you give ear to this sacred narrative.\n.   .    .\nDo you feel the weight of what you just read? It’s hard to read without deep sighs and even tears, isn’t it? The reality of a real man—my God—enduring what He did. It makes me painfully uncomfortable. Yet, as I read these words, I’ve never felt so deeply loved.\nChrist’s final words came with His dying breath—”It is finished.” And it was.\nHe bore the wrath of the one, true, holy God against sin—wrath that was due to literally anyone and everyone but Him. And it was finally over. His death completed the work of salvation for His people. It was truly finished then, and it still is.\nIt is finished. Complete.\nAnd hear this today—really hear it: Because it is finished, there is nothing that any one of us can contribute to Jesus’ work on the Cross to bring us any closer to salvation.  \nLet’s worship the One who was wounded for our transgressions and crushed for our iniquities. As we observe this holy day of sacrifice for salvation, let’s remember the chastisement that brought peace for you and me, and receive the healing that comes to us from the stripes He bore.\n“So then, as through one trespass there is condemnation for everyone, so also through one righteous act there is life-giving justification, for everyone. For just as through one man’s disobedience the many were made sinners, so also through the one man’s obedience the many will be made righteous.”\nRomans 5:18,19, HCSB\nIt is finished, friends.\nThanks be to God.\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/SRT-Lent2015_instagram45.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Isaiah 53:9, Zechariah 12:10, Luke 23:50-56, John 19:31-42",
    "devo_title": "Holy Saturday",
    "devo_summary": "\nBY She Reads Truth\n\nText: Isaiah 53:9, Zechariah 12:10, Luke 23:50-56, John 19:31-42\nAs we walk through this season of reflection and repentance together, we want to provide time and space for us as individuals and a community to meditate on God’s Word and bow at His feet in prayer.\nEach Saturday during Lent we will read a brief passage of Scripture and a corporate prayer, both carefully chosen for this specific place in our Lenten journey. Sundays will be dedicated to scripture memorization, one of our favorite habits here at She Reads Truth.\nWe pray you will not only meet with the Savior on these quieter weekend days, but linger there with Him, in prayer and in His Word.\n\nO God, Creator of heaven and earth: Grant that, as the crucified body of your dear Son was laid in the tomb and rested on this holy Sabbath, so we may await with him the coming of the third day, and rise with him to newness of life; who now lives and reigns with you and the Holy Spirit, one God, for ever and ever. Amen.\n– from The Book of Common Prayer\n \n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/SRT-Lent2015_instagram46.jpg"
},
{
    "book_title": "Jesus, Keep Me Near The Cross",
    "devo_passages": "Luke 24:1-12, 1 Corinthians 15:20-22, 1 Corinthians 15:50-58",
    "devo_title": "Christ is Risen! He is Risen Indeed!",
    "devo_summary": "\nBY She Reads Truth\n\nText: Luke 24:1-12, 1 Corinthians 15:20-22, 50-58\n“Behold, this is our God; we have waited for him, that he might save us.\nThis is the Lord; we have waited for him; let us be glad and rejoice in his salvation.”\n– Isaiah 25:9, ESV\nResurrection Sunday is more than the miracle of a man coming back to life.\nIt is the fulfillment of David’s prophecy in the Psalms.\nFor You will not abandon me to Sheol; you will not allow Your Faithful One to see decay. (Psalm 16:10)\nIt is the making-true of the angel’s promise to Joseph.\n“She will give birth to a son, and you are to name Him Jesus, because He will save His people from their sins.” (Matthew 1:21, HCSB)\nIt is the resurrection of hope.\nAccording to His great mercy, He has given us a new birth into a living hope through the resurrection of Jesus Christ from the dead and into an inheritance that is imperishable, uncorrupted, and unfading, kept in heaven for you. (1 Peter 1:3-4, HCSB)\nIt is the irremovable seal on God’s vow of love to His children.\nFor all the promises of God find their Yes in him…And it is God who establishes us with you in Christ, and has anointed us, and who has also put his seal on us and given us his Spirit in our hearts as a guarantee. (2 Corinthians 1:20-22, ESV)\nIt is the definitive declaration that the Love we long for is not dead.\nFor I am sure that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord. (Romans 8:38-39, ESV)\nHe is alive!\nThe Creator God wrapped His infinite being in flesh (John 1:14).\nThe Son of God endured temptation and humiliation, scorn and scourge (Hebrews 4:14-16, Matthew 27:15-44).\nHe satisfied the wrath of the holy and just Father, reconciling us to God (Romans 5:6-11).\nAnd He walked out of the grave, forever defeating death and sin (1 Corinthians 15:55-57).\nDear friends, Jesus lived and died to buy your pardon, just like the old hymn says. He lives!\nHallelujah, the Gospel is true!\n\nSave this lock screen to your phone as a daily reminder this week that we worship a living Savior.\nChrist is risen! He is risen indeed!\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/04/4-Matthew-28-6a.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "2 Samuel 22:1-20, Psalm 139:7, 1 Corinthians 15:49",
    "devo_title": "O Love That Will Not Let Me Go",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: 2 Samuel 22:1-20, Psalm 139:7, 1 Corinthians 15:49\nOn the day his sister was married, in the picturesque village of Innellan on the shore of Scotland, George Matheson endured one of the most traumatic and unspeakable experiences of his life. So unspeakable, he would never disclose it; he would only say this: “Something happened to me, which was known only to myself, and which caused me the most severe mental suffering. The hymn was the fruit of that suffering” (Dough 111).\nThe hymn was “O Love That Will Not Let Me Go,” which famous American hymnwriter Fanny Crosby would affectionately call her favorite (112). \nCrosby and Matheson had something unique in common: they were both completely blind. Born with sight, Matheson’s eyes began failing over the course of his childhood, and he was fully blind by the age of eighteen. But that did not stop young George from pursuing what he loved. Coming from a wealthy merchant family in Glasgow, Matheson studied at the University of Glasgow and graduated with honors. He went on to become an influential pastor, leading a congregation of 2,000 members at St. Bernard’s Church in Edinburgh. \nBelievers from all over Scotland made the trek to St. Bernard’s to hear the blind preacher deliver his passionate messages from the pulpit, and congregants from all over the world sing his famous hymn to this day. Still, none but God and George himself will ever know what happened on that day in Innellan, as the man sat alone and furiously penned the words of this beloved hymn, the verses coming to him as if dictated by someone else. “It was the quickest work I ever did in my life,” he would later say. “I am quite sure the whole work was completed in five minutes” (111). \nThe Cross, the Joy, the Light, the Love—these were the truths that held tight to a Scottish pastor as he suffered through a pain he could not bear to name. They are the truths that hold us too.\nO Love That Will Not Let Me Go\nGeorge Matheson; Albert L. Peace\nO love that will not let me go,\nI rest my weary soul in thee;\nI give thee back the life I owe,\nthat in thine ocean depths its flow\nmay richer, fuller be.\nO light that foll’west all my way,\nI yield my flick’ring torch to thee;\nmy heart restores its borrowed ray,\nthat in thy sunshine’s blaze its day\nmay brighter, fairer be.\nO joy that seekest me through pain,\nI cannot close my heart to thee;\nI trace the rainbow through the rain,\nand feel the promise is not vain\nthat morn shall tearless be.\nO cross that liftest up my head,\nI dare not ask to fly from thee;\nI lay in dust life’s glory dead,\nand from the ground there blossoms red\nlife that shall endless be.\n\nDough, Whitney J. The Hymnwriters: Our Unknown Friends: A Biographical Guide to British and American Sacred Song. Franklin, TN: Providence House Publishers, 1995.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram1s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Romans 5:12-21, 1 Timothy 1:12-17, Hebrews 7:23-25",
    "devo_title": "Wonderful Grace of Jesus",
    "devo_summary": "\nBY Rebecca Faires\n\nText:  Romans 5:12-21, 1 Timothy 1:12-17, Hebrews 7:23-25\nNewly married and setting up house with his young bride, Haldor Lillenas wondered how he was going to provide for his family after barely pulling together enough money to finish building their home. Music composition was his passion, but he didn’t have a piano in his tiny new abode. \nWhen a neighbor offered a dusty organ with cracked leather and stiffened stops for the price of five dollars, Haldor eagerly bought the wheezy organ and set about composing. As he settled into family life, he wrote many songs on that first, imperfect instrument. \nOne of the early compositions Haldor wrote on that five-dollar organ was “Wonderful Grace of Jesus,” which he, in turn, sold for five dollars (Brown 117). This small investment helped him write more songs, better songs—over 4,000 hymns in his lifetime—and he went on to found his own music publishing company.\n“Wonderful Grace of Jesus” is a triumphant song about the abundant grace of Christ (1 Timothy 1:14), one that is deeper than the sea and higher than the mountains. It is a beautiful picture of God’s mighty grace in our times of want and His generous mercy in seasons of blessing.\nWonderful Grace of Jesus\nHaldor Lillenas\nWonderful grace of Jesus,\nGreater than all my sin;\nHow shall my tongue describe it,\nWhere shall its praise begin?\nTaking away my burden,\nSetting my spirit free;\nFor the wonderful grace of Jesus reaches me.\nRefrain:\nWonderful the matchless grace of Jesus,\nDeeper than the mighty rolling sea;\nHigher than the mountain, sparkling like a fountain,\nAll-sufficient grace for even me!\nBroader than the scope of my transgressions,\nGreater far than all my sin and shame;\nOh, magnify the precious Name of Jesus,\nPraise His Name!\nWonderful grace of Jesus,\nReaching to all the lost,\nBy it I have been pardoned,\nSaved to the uttermost;\nChains have been torn asunder,\nGiving me liberty;\nFor the wonderful grace of Jesus reaches me.\nWonderful grace of Jesus,\nReaching the most defiled,\nBy its transforming power,\nMaking him God’s dear child,\nPurchasing peace and heaven\nFor all eternity—\nAnd the wonderful grace of Jesus reaches me.\n\nBrown, Robert, and Mark R. Norton. The One Year Great Songs of Faith. Tyndale House Publishers, 2005.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram2s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Deuteronomy 32:1-4, Matthew 7:24-29, 1 Corinthians 3:10-15",
    "devo_title": "My Hope Is Built On Nothing Less",
    "devo_summary": "\nBY Raechel Myers\n\nText: Deuteronomy 32:1-4, Matthew 7:24-29, 1 Corinthians 3:10-15\nEdward Mote wrote just one hymn in his lifetime. From what we know of his life, “My Hope Is Built On Nothing Less” was just as much an anthem of his own testimony as it has become for believers all over the world. \nHaving grown up knowing nothing of God or His existence, Mote first attended church and became a Christian as a young adult. While still a new believer, he was compelled to try his hand at hymn writing. Thus, Mote wrote from a basic, yet profound understanding of his salvation. \nLater that same week, he visited a married couple at the wife’s sickbed. Without a hymnal handy to lead them in a song of worship, Mote produced a folded-up piece of paper upon which he had worked out four verses and a chorus. Together, they sang the hymn now known as “My Hope Is Built On Nothing Less” for the first time, blessed by the truths of God’s Word in the lyrics.   \nTwenty years later, as a Baptist minister, Mote was instrumental in securing a building for his congregation. As a show of thanks, the congregants offered to put the deed in his name, but Mote refused, saying, “I do not want the chapel. I only want the pulpit; and when I cease to preach Christ, then turn me out of that!” (Dough 72). Mote understood the profound simplicity of what remains secure and what will always be slipping away.\nChrist is the sole means of our salvation. Our hope is truly built on nothing less than Jesus.\nMy Hope Is Built On Nothing Less\nEdward Mote; William B. Bradbury \nMy hope is built on nothing less\nthan Jesus’ blood and righteousness;\nI dare not trust the sweetest frame,\nbut wholly lean on Jesus’ name.\nRefrain:\nOn Christ, the solid rock, I stand;\nall other ground is sinking sand,\nall other ground is sinking sand.\nWhen darkness veils his lovely face,\nI rest on his unchanging grace;\nin every high and stormy gale,\nmy anchor holds within the veil. [Refrain]\nHis oath, his covenant, his blood\nsupport me in the whelming flood;\nwhen all around my soul gives way,\nhe then is all my hope and stay. [Refrain]\nWhen he shall come with trumpet sound,\nO may I then in him be found,\ndressed in his righteousness alone,\nfaultless to stand before the throne. [Refrain]\n\nDough, Whitney J. The Hymnwriters: Our Unknown Friends: A Biographical Guide to British and American Sacred Song. Franklin, TN: Providence House Publishers, 1995. \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram3s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Genesis 9:8-17, Psalm 90:1-17, Lamentations 5:19",
    "devo_title": "O God, Our Help in Ages Past",
    "devo_summary": "\nBY Kaitlin Wernet\n\nText: Genesis 9:8-17, Psalm 90:1-17, Lamentations 5:19\nIsaac Watts never wanted to write hymns. In fact, he didn’t even enjoy singing. A scraggly and rebellious teenager in Southampton, England, Watts was a poet who refused to sing psalms in church because they didn’t rhyme. \nWatts’ lyrical appreciation and incessant poetics were an annoyance to everyone around him, including his own preacher father, who threatened to whip his son if he continued his daily rhyming. The son replied, “O Father do some pity take, and I will no more verses make!” (McKay 67). \nAfter his anger subsided, Watts’ father challenged his writer son to create something “better” than King David’s psalms. At just 18 years old, Watts began writing hymns that were loosely rooted in the Psalms and aligned with his own singing preferences (which, of course, included rhyming). He aimed to communicate timeless gospel truths in contemporary language, as if King David was writing in the present-day 1700s (Watts 15).\nHis hymn “O God, Our Help In Ages Past” is based on Psalm 90:4:\nFor in Your sight a thousand years\nare like yesterday that passes by,\nlike a few hours of the night.\nWhen Watts’ signature style is applied to this passage, it becomes a singable hymn: \nA thousand ages in Thy sight\nAre like an evening gone;\nShort as the watch that ends the night\nBefore the rising sun.\nWhether sung in original psalmic context or modern rhyming prose, the importance of recalling God’s character remains the same. When we adopt the practice of recalling His past faithfulness, we are reminded of His present kindness.\nO God, Our Help in Ages Past\nIsaac Watts\nOur God, our help in ages past,\nour hope for years to come,\nour shelter from the stormy blast,\nand our eternal home:\nUnder the shadow of your throne\nyour saints have dwelt secure;\nsufficient is your arm alone,\nand our defense is sure.\nBefore the hills in order stood\nor earth received its frame,\nfrom everlasting you are God,\nto endless years the same.\nA thousand ages in your sight\nare like an evening gone,\nshort as the watch that ends the night\nbefore the rising sun.\nTime, like an ever-rolling stream,\nsoon bears us all away;\nwe fly forgotten, as a dream\ndies at the opening day.\nOur God, our help in ages past,\nour hope for years to come,\nstill be our guard while troubles last,\nand our eternal home!\n\nMcKay, Graham. A Hymn a Day. Franklin, TN: O’More Publishing, 2003. \nWatts, Isaac. The Psalms of David – Imitated in the Language of the New Testament and Applied to the Christian State and Worship. Qontro Classic Books, 2010.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram4s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Isaiah 12:1-6, Galatians 2:19-20, Hebrews 2:10-13",
    "devo_title": "‘Tis So Sweet to Trust in Jesus",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Isaiah 12:1-6, Galatians 2:19-20, Hebrews 2:10-13\nSitting in the sand on a seaside holiday, Louisa Stead and her husband watched as their four-year-old daughter played in the sunshine. From out in the dark waves they heard cries for help from a boy struggling to stay afloat. Her husband ran into the water to rescue him. But despite his efforts to bring the boy back to shore, both he and the child drowned.\nShocked, grieving, and penniless, Louisa and her daughter struggled in the years that followed. The tragedy of her husband’s death weighed heavily on her, both as a mourning wife and as the unexpected head of household. She didn’t have money for food, and their hungry days passed slowly, sustained by a quiet faith in God’s goodness in spite of their dire circumstances.\nOn a day that began like any other, Louisa heard a sound at the door. Upon opening it, she found a solitary parcel on her front doorstep. Not seeing anyone around, she looked inside and discovered a small gift of food and money (McKay 89). That same day she penned the words, “‘Tis so sweet to trust in Jesus, just to take Him at His word.” \nLouisa’s life gives a powerful testament of simple yet mighty faith in Jesus. Her story reminds us that, even in the scary and sad places, God is surely our salvation. We can “trust and not be afraid” (Isaiah 12:2). Let us take Jesus at His word and believe that He will care for us.\n‘Tis So Sweet to Trust in Jesus\nLouisa Stead\n\n‘Tis so sweet to trust in Jesus,\nand to take him at his word;\njust to rest upon his promise,\nand to know, “Thus saith the Lord.”\nRefrain:\nJesus, Jesus, how I trust him!\nHow I’ve proved him o’er and o’er!\nJesus, Jesus, precious Jesus!\nO for grace to trust him more!\nO how sweet to trust in Jesus,\njust to trust his cleansing blood;\nand in simple faith to plunge me\nneath the healing, cleansing flood! [Refrain]\nYes, ’tis sweet to trust in Jesus,\njust from sin and self to cease;\njust from Jesus simply taking\nlife and rest, and joy and peace. [Refrain]\n\nMcKay, Graham. A Hymn a Day. Franklin, TN: O’More Publishing, 2003.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram5s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "2 Samuel 22:4",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nI called to the Lord, who is worthy of praise,\nand I was saved from my enemies.\n— 2 Samuel 22:4\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram6s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Psalm 148:1",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.  This week, we’re memorizing the key verse for this reading plan:\n Hallelujah!\nPraise the Lord from the heavens;\npraise Him in the heights.\n—Psalm 148:1\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/4-Hymns6-1.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Genesis 1:26-31, Job 28:12-28, John 1:18",
    "devo_title": "Immortal, Invisible, God Only Wise",
    "devo_summary": "\nBY Rebecca Faires\n\nText:  Genesis 1:26-31, Job 28:12-28, John 1:18\nWalter Chalmers Smith set out with lofty goals when he sat down to write the words to “Immortal, Invisible, God Only Wise.” Although it later became his most famous hymn, he was hesitant to complete it, and spent almost forty years revising, reconsidering, and researching before it reached its final form.\nDuring those years of meditating on what it means for God to be both immortal and invisible, Smith ministered at five different churches throughout Europe. As he honed his preaching skills, he also practiced his skills as a poet. His prolific collection of poetry reflects on the depths of human sin and the heights of God’s inexpressible greatness (Bailey 456).\nSmith’s love for poetry emboldened him to explore his desire to know the unknowable. He used phrases like “light inaccessible hid from our eyes” in an attempt to describe the indescribable. Job used the same kind of paradoxical phrases to explain the reach of an eternal God, who “fixed the weight of the wind” (Job 28:25).\nThrough his struggle to express the inexpressible, Smith created a unique hymn. He invited his parishioners to join him in singing about the deep mystery of a God who is both intimate and ineffable. \nSmith’s forty-year journey to settle on lyrics for this one hymn is a profound testimony to the mystery of our immortal, invisible God. Even as we spend years of our lives meditating on His character, may we never cease to be awed by the Ancient of Days.\nImmortal, Invisible, God Only Wise\nWalter C. Smith\nImmortal, invisible, God only wise,\nin light inaccessible hid from our eyes,\nmost blessed, most glorious, the Ancient of Days,\nalmighty, victorious, thy great name we praise.\nUnresting, unhasting, and silent as light,\nnor wanting, nor wasting, thou rulest in might:\nthy justice, like mountains high soaring above,\nthy clouds which are fountains of goodness and love.\nTo all, life thou givest, to both great and small;\nin all life thou livest, the true life of all;\nwe blossom and flourish like leaves on the tree,\nthen wither and perish, but naught changeth thee.\nThou reignest in glory, thou dwellest in light,\nthine angels adore thee, all veiling their sight;\nall praise we would render; O help us to see\n’tis only the splendor of light hideth thee!\nBailey, Albert Edward. The Gospel in Hymns: Backgrounds and Interpretations. New York: Scribner, 1950.  \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram8s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Job 12:7-12, Psalm 148:1-14, Matthew 6:26",
    "devo_title": "All Creatures of Our God and King",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Job 12:7-12, Psalm 148:1-14, Matthew 6:26\nOf all the monastic saints, we see reminders of Saint Francis of Assisi the most. He is immortalized in backyards everywhere as a stone lawn statue, usually cradling a bird or comforting a fawn. And there is truth behind the sculptures; Francis was actually very well known for his care and attention to animals. In fact, his enthusiasm for preaching the gospel and his love for animals occasionally drove him to go so far as to preach sermons to flocks of birds. \nIn 1226, with his vision failing and his life nearing its end, he wrote a poem titled “The Canticle of the Sun.” In his weakened state, he celebrated the psalmic call for all creation to praise God as Creator (Psalm 19).\nSaint Francis was always keen on unity with nature. In fact, in his original version of this hymn he referred to creation as family: brother sun, sister water, brother fire, mother earth, brother wind, and sister moon (Bailey 264). Although some English translations maintain those sentiments, when William Draper translated it from Latin to English in 1910 for a children’s festival, he paraphrased the original poem, leaving out references to any familial relationships with creation. \nWe can all join with creation to say, “Hallelujah!” and praise God for His creative goodness. We can sing with the psalmist in Psalm 148, praising God with the stars and the waters, the sea monsters, lightning, and clouds. Let us join together to praise and honor the Lord of heaven and earth.\nAll Creatures of Our God and King\n William Draper\n\nAll creatures of our God and King,\nlift up your voice and with us sing:,\nalleluia, alleluia!\nO burning sun with golden beam,\nand shining moon with silver gleam,\nO praise him, O praise him,\nalleluia, alleluia, alleluia!\nO rushing wind so wild and strong,\nwhite clouds that sail in heaven along,\nalleluia, alleluia!\nNew rising dawn in praise rejoice;\nyou lights of evening find a voice:\nO praise him, O praise him,\nalleluia, alleluia, alleluia!\nCool flowing water, pure and clear,\nmake music for your Lord to hear:\nalleluia, alleluia!\nFierce fire, so masterful and bright,\nproviding us with warmth and light.\nO praise him, O praise him,\nalleluia, alleluia, alleluia!\nEarth ever fertile, day by day\nbring forth your blessings on our way;\nalleluia, alleluia!\nAll flowers and fruits that is you grow,\nlet the his glory also show;\nO praise him, O praise him,\nalleluia, alleluia, alleluia!\nAll you who are of tender heart,\nforgiving others, take your part;\nalleluia, alleluia!\nAll you who pain and sorrow bear,\npraise God and on him cast your care;\nO praise him, O praise him,\nalleluia, alleluia, alleluia!\nLet all things their Creator bless,\nand worship him in humbleness,\nalleluia, alleluia!\nPraise, praise the Father, praise the Son,\nand praise the Spirit, Three in One:\nO praise him, O praise him,\nalleluia, alleluia, alleluia!\nBailey, Albert Edward. The Gospel in Hymns: Backgrounds and Interpretations. New York: Scribner, 1950.  \n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram9s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Exodus 24:3-8, Romans 5:6-11, Hebrews 9:15-22",
    "devo_title": "Nothing but the Blood",
    "devo_summary": "\nBY Guest Writer\n\nText:  Exodus 24:3-8, Romans 5:6-11, Hebrews 9:15-22\nThe hymn “Nothing but the Blood” was composed by Robert Lowry (1826-1899), a university professor and Baptist preacher from New England. \nAlthough an accomplished musician, Lowry wanted most to be known as a preacher. He said, “Music, with me has been a side issue… I would rather preach a gospel sermon to an appreciative audience than write a hymn. I have always looked upon myself as a preacher and felt a sort of depreciation when I began to be known more as a composer” (Butterworth 165). \nHis preference for preaching comes through in the way his most popular hymn plays like a sermon. The hymn utilizes a call-and-response pattern similar to that of Psalm 136, in which the leader of the assembly makes a statement about God, and the people respond, “His steadfast love endures forever.”\nThe lines of the hymn alternate—the odd lines asking essential questions about what reconciles us to God, while the even lines respond with the same refrain: “Nothing but the blood of Jesus.” The chorus, then, draws the musical sermon together, reminding us why the blood of Jesus is so necessary: “Precious is the flow that makes me white as snow. No other fount I know. Nothing but the blood of Jesus.”\nBy design, call-and-response hymns lead believers to confess their faith together. May we sing such songs over one another. And may “the message about the Messiah dwell richly among you, teaching and admonishing one another in all wisdom, and singing psalms, hymns, and spiritual songs, with gratitude in your hearts to God” (Colossians 3:16). \nNothing but the Blood\nRobert Lowry\nWhat can wash away my sin?\nNothing but the blood of Jesus.\nWhat can make me whole again?\nNothing but the blood of Jesus.\nRefrain:\nO precious is the flow\nthat makes me white as snow;\nno other fount I know;\nnothing but the blood of Jesus.\nFor my pardon this I see:\nnothing but the blood of Jesus.\nFor my cleansing this my plea:\nnothing but the blood of Jesus. [Refrain]\nNothing can for sin atone:\nnothing but the blood of Jesus.\nNaught of good that I have done:\nnothing but the blood of Jesus. [Refrain]\nThis is all my hope and peace:\nnothing but the blood of Jesus.\nThis is all my righteousness:\nnothing but the blood of Jesus. [Refrain]\nButterworth, Hezekiah. Story of the Tunes. New York, NY: American Tract Society, 1890.\nRuss Ramsey and his wife and four children make their home in Nashville, Tennessee. He is a pastor at Christ Presbyterian Church and the author of  Struck: One Christian’s Reflections on Encountering Death (forthcoming, IVP, 2017), Behold the Lamb of God: An Advent Narrative, and Behold the King of Glory: A Narrative of the Life, Death, and Resurrection of Jesus Christ.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram10s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Psalm 23:1-6, Micah 7:7, John 10:7-18",
    "devo_title": "Savior, Like a Shepherd Lead Us",
    "devo_summary": "\nBY Kaitlin Wernet\n\nText: Psalm 23:1-6, Micah 7:7, John 10:7-18\n“Savior, Like a Shepherd Lead Us” was first published in 1836, in a collection of songs titled Hymns for the Young, compiled by Dorothy Thrupp. While its composition is sometimes attributed to Thrupp, some publications do not credit her at all, citing the writer as anonymous. \nWhy Thrupp did not credit herself as the writer, we may never know. Regardless, the gospel truths echoed in this hymn belong to all of us, those who are childlike in both stature and faith (Bailey 184). \nToday, this hymn remains a strong, timeless invitation and prayerful response to the imagery found in Psalm 23. While the psalmist affirms the Lord’s faithfulness and goodness, the hymn writer actively calls upon God out of personal need. When coupled together, the psalm and hymn serve as a call-and-response: \n“The Lord is my shepherd; there is nothing I lack” (v. 1).\nSavior, like a shepherd lead us, much we need Thy tender care.\n“He lets me lie down in green pastures; He leads me beside quiet waters” (v. 2).\nIn Thy pleasant pastures, feed us.\n“He renews my life; He leads me along the right paths for His name’s sake” (v. 3).\nFor our use Thy folds prepare:\nBlessed Jesus, blessed Jesus,\nThou hast bought us, Thine we are.\nOur endless call to our Shepherd is that of lost, needy, hungry children, and His response is love. We are His lambs—tender, wandering, forgetful—and yet He leads us still. He is our sure comfort and restful pasture. May we continually recall God’s character and call out for His faithful response.   \nThou hast loved us, love us still.\nSavior, Like a Shepherd Lead Us\nBy Dorothy A. Thrupp\nSavior, like a shepherd lead us,\nMuch we need Thy tender care;\nIn Thy pleasant pastures feed us,\nFor our use Thy folds prepare:\nBlessed Jesus, blessed Jesus,\nThou hast bought us, Thine we are;\nBlessed Jesus, blessed Jesus,\nThou hast bought us, Thine we are.\nWe are Thine, do Thou befriend us,\nBe the guardian of our way;\nKeep Thy flock, from sin defend us,\nSeek us when we go astray:\nBlessed Jesus, blessed Jesus,\nHear, O hear us when we pray;\nBlessed Jesus, blessed Jesus,\nHear, O hear us when we pray.\nThou hast promised to receive us,\nPoor and sinful though we be;\nThou hast mercy to relieve us,\nGrace to cleanse, and pow’r to free:\nBlessed Jesus, blessed Jesus,\nEarly let us turn to Thee;\nBlessed Jesus, blessed Jesus,\nEarly let us turn to Thee.\nEarly let us seek Thy favor,\nEarly let us do Thy will;\nBlessed Lord and only Savior,\nWith Thy love our bosoms fill:\nBlessed Jesus, blessed Jesus,\nThou hast loved us, love us still;\nBlessed Jesus, blessed Jesus,\nThou hast loved us, love us still.\n\nBailey, Albert Edward. The Gospel in Hymns: Backgrounds and Interpretations. New York: Scribner, 1950.  \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram11s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Psalm 27:4-6, Psalm 45:1-17, Isaiah 33:17",
    "devo_title": "Fairest Lord Jesus",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Psalm 27:4-6, Psalm 45:1-17, Isaiah 33:17\nAs sweet as a lullaby, “Fairest Lord Jesus” seems like a delicate hymn for rosy-cheeked children. But it has a surprising and legendary German history, originally sung as a far rougher, more warlike battle hymn.\nLegend has it that the hymn originated in the 12th century as a Teutonic Knights’ anthem sung in Prussia under the Holy Roman Empire, or as an 18th century tune from the Germanic region of Silesia. Either way, the current tune carries the rousing moniker of “Crusader’s Hymn” (Brink 62).\nThis is due in part to Franz Liszt, prodigy pianist and world-renowned composer. He used this tune in his 1862 oratorio, “The Legend of St. Elizabeth,” as the battle march for his costumed crusaders. Suddenly, this quiet, lullaby of a song appeared in an entirely new light, all dressed up and armed for war. \nWith a closer look, we see this is true for many hymns and truths of the gospel as well. They can be sung gently and reassuringly, for we are God’s children, and we desperately need the comfort and beauty of this promise: “to dwell in the house of the Lord all the days of my life, gazing on the beauty of the Lord” (Psalm 27:4).\nBut the gospel is also a clarion call to the safety of our Lord in battle: “For He will conceal me in His shelter in the day of adversity; He will hide me under the cover of His tent; He will set me high on a rock” (Psalm 27:5-6). Thanks be to God, who preserves us and fights for us. And thanks be to Jesus, our Savior, the ruler of all nature.\nFairest Lord Jesus\nBy Joseph A. Siess\nFairest Lord Jesus,\nruler of all nature,\nO thou of God and man the Son,\nThee will I cherish,\nThee will I honor,\nthou, my soul’s glory, joy, and crown.\nFair are the meadows,\nfairer still the woodlands,\nrobed in the blooming garb of spring:\nJesus is fairer,\nJesus is purer\nwho makes the woeful heart to sing.\nFair is the sunshine,\nfairer still the moonlight,\nand all the twinkling starry host:\nJesus shines brighter,\nJesus shines purer\nthan all the angels heaven can boast.\nBeautiful Savior!\nLord of all the nations!\nSon of God and Son of Man!\nGlory and honor,\npraise, adoration,\nnow and forevermore be thine.\n\nBrink, Emily R. Psalter Hymnal Handbook. Edited by Bert Polman. Grand Rapids, MI: Faith Alive Christian Resources, 1998.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram12s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "2 Samuel 22:20",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord. \nHe brought me out to a spacious place;\nHe rescued me because He delighted in me.\n—2 Samuel 22:20\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/SRT-Hymns6-Instagram13s.jpg"
},
{
    "book_title": "Worthy of Praise",
    "devo_passages": "Micah 7:7",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go.  This week, we’re memorizing a verse about God’s promise to hear us:\nBut I will look to the Lord;\nI will wait for the God of my salvation.\nMy God will hear me.\n—Micah 7:7\nWrite this verse down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/4-Hymns6-2.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Genesis 28:10-17, Psalm 71:14-16, Psalm 146:1-2, John 6:47-51, Acts 2:32-36, 2 Timothy 1:11-12, 1 John 5:10-13",
    "devo_title": "Blessed Assurance",
    "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Genesis 28:10-17, Psalm 71:14-16, Psalm 146:1-2, John 6:47-51, Acts 2:32-36, 2 Timothy 1:11-12, 1 John 5:10-13\nFanny Crosby was born in the slums of Manhattan. Her family was so poor that when baby Fanny got a simple eye infection at six weeks old, they were unable to help her, resulting in the loss of her vision before she was even weaned. Still, she grew to be one of the most prolific hymn writers in America. Over the course of her 94 years, Fanny Crosby wrote well over 8,000 gospel songs. Given that she used more than 200 pen names, there may well be many more.\nFanny often composed lyrics to music written by friends. She just had a knack for it. But Fanny had standards, and wouldn’t write lyrics to just any old tune. Sometimes musicians would bring music from a saloon song and propose that she sanctify the lyrics. At this proposition, Fanny crossed her dignified ankles and declared, “Oh my, no.” She maintained that the Church must never sing its songs to the melodies of the world.\nOne of her dearest musician friends was Phoebe Knapp. And as poor as Fanny was, Phoebe was rich. She was born into the Brooklyn elite, and enjoyed the advantages of great wealth. These two very different women attended the same church and struck up a dear friendship. You could say Fanny’s favorite frolic was the philharmonics at Phoebe’s fancy flat. (But be careful.)\nOne afternoon, Phoebe sat at the piano and played a song of her own devising while Fanny listened quietly. As the story goes, when the music ended, Fanny clapped her hands and declared, “Why, that says ‘Blessed Assurance!'” And so the hymn was born.\nOur assurance in Christ is indeed blessed. He promises us simply and truly that “Anyone who believes has eternal life” (John 6:47).\n\nBlessed Assurance\nby Fanny Crosby\nBlessed assurance; Jesus is mine!\nOh, what a foretaste of glory divine!\nHeir of salvation, purchase of God,\nborn of His Spirit, washed in his blood.\nRefrain:\nThis is my story, this is my song,\npraising my Savior all the day long;\nthis is my story, this is my song,\npraising my Savior all the day long.\nPerfect submission, perfect delight,\nvisions of rapture now burst on my sight;\nangels descending bring from above\nechoes of mercy, whispers of love.\nPerfect submission, all is at rest,\nI in my Savior am happy and blest;\nwatching and waiting, looking above,\nfilled with His goodness, lost in His love.\n\nSources:\nCrosby, Fanny. Fanny J. Crosby, An Autobiography: the life of the beloved hymn writer, told in her own words. Peabody, MA: Hendrickson Publishers, 2015.\nMorgan, Robert J. Then Sings my Soul. Nashville: Thomas Nelson, 2011.\nOsbeck, Kenneth W. 101 Hymn Stories: The Inspiring Stories Behind 101 Favorite Hymns. Grand Rapids, MI: Kregel, 2012.\nPetersen, Randy. Be Still, My Soul: The Inspiring Stories Behind 175 of the Most-Loved Hymns. Carol Stream, IL: Tyndale House Publishers, Inc., 2014.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-1.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Psalm 51:1-9, John 1:10-18, Ephesians 1:7-12, Colossians 1:9-14, 1 Peter 1:17-21",
    "devo_title": "There Is Power in the Blood",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 51:1-9, John 1:10-18, Ephesians 1:7-12, Colossians 1:9-14, 1 Peter 1:17-21\nThis simple hymn is a Trojan horse filled with doctrine. It lays out the effects of believing in the sacrifice of Jesus, hiding those truths in the hearts of those who sing them. And a great many have. This hymn by Lewis Edgar Jones has appeared in hundreds of hymnals down through the years and is still widely known and sung today.\nLewis Jones graduated from the Moody Bible Institute in Chicago, then went to work for the Young Men’s Christian Association, better known as the YMCA. Jones wore many hats in his role with the YMCA, including organizing camps for those young men. Hymn writing was something he considered more of a side project. Often writing under pseudonyms, Jones wrote not to gain fame but to serve his campers.\nIt was during a camp meeting in Mountain Lake Park, Maryland, that Jones wrote both the lyrics and melody for “There Is Power in the Blood.” The simple song served a simple purpose: to remind the singer that he is saved by the blood of Jesus Christ alone—not by anything he himself does. 5\nSince that camp meeting, countless believers, young and old, have sung the song around campfires everywhere, proclaiming the ways the blood of Christ rescues sinners: \nIt frees us from the burden of sin and secures our victory over it. \nIt works against our pride even as it cleanses us of guilt. \nIt purifies us and calls us to praise Jesus for His generous grace.\nUsing repetition, rhyme, and imagery, Jones’s song clarifies what it means to trust in Christ. Listen as the refrain unpacks the glorious truth: There’s wonderful power in the blood.\n\nThere Is Power in the Blood\nby Lewis Edgar Jones\nWould you be free from the burden of sin?\nThere’s power in the blood, power in the blood;\nWould you o’er evil a victory win?\nThere’s wonderful power in the blood.\nRefrain:\nThere is power, power, wonder-working power\nIn the blood of the Lamb.\nThere is power, power, wonder-working power\nIn the precious blood of the Lamb.\nWould you be free from your passion and pride?\nThere’s power in the blood, power in the blood;\nCome for a cleansing to Calvary’s tide;\nThere’s wonderful power in the blood.\nWould you be whiter, much whiter than snow?\nThere’s power in the blood, power in the blood;\nSin stains are lost in its life-giving flow;\nThere’s wonderful power in the blood.\nWould you do service for Jesus your King?\nThere’s power in the blood, power in the blood;\nWould you live daily His praises to sing?\nThere’s wonderful power in the blood.\n\nRuss Ramsey and his wife and four children make their home in Nashville, Tennessee. He is the Content Director for She Reads Truth and He Reads Truth, and a pastor at Christ Presbyterian Church. Russ is the author Struck: One Christian’s Reflections on Encountering Death, Behold the Lamb of God, and Behold the King of Glory. You can follow him on Facebook, Twitter, and Instagram.\nSource:\nMorgan, Robert J. Then Sings my Soul. Nashville: Thomas Nelson, 2011.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-2.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Isaiah 12:5-6, Isaiah 18:3, Isaiah 42:10-12, Matthew 28:19-20, Luke 2:8-20",
    "devo_title": "Go Tell It on the Mountain",
    "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Isaiah 12:5-6, Isaiah 18:3, Isaiah 42:10-12, Matthew 28:19-20, Luke 2:8-20\nJohn Wesley Work, Jr. was a Nashville man, through and through.\nHe attended Fisk University where his father taught, and he majored in history and Latin. He stayed on there as a professor, eventually becoming chair of his department and then president of a nearby university. Once the man put himself on a path, he didn’t budge.\nTeaching paid the bills, but John’s joyful pursuit was discovering and preserving African American spiritual music. He led the Fisk Jubilee Singers for six years, touring at home and abroad. The Nashville boy got to see the world and share the art of the African American spiritual along the way. In a time when few black men were afforded the luxury of travel, John Jr. performed for Queen Victoria.\nIt took three generations of Works men over 70 years of field research, transcription, and publishing to put together a wide collection of African American spirituals which otherwise could have been lost to history. It was in this collection that John Jr. became the first to publish the hymn “Go Tell It on the Mountain.” \nThis hymn, like other spirituals of the era, had previously been communicated through singing only. Putting the tune and lyrics down on paper was a way John could give voice to the unknown slave who had composed the song many years before—who, despite his earthly enslavement, sang out with victorious hope. \n“Go Tell It on the Mountain” celebrates the good news of the God who makes Himself known to His people, right where they are.\n\nGo Tell It on the Mountain\nAdapted by John W. Work\nGo, tell it on the mountain,\nover the hills and everywhere;\ngo, tell it on the mountain\nthat Jesus Christ is born.\nWhile shepherds kept their watching\no’er silent flocks by night,\nbehold, throughout the heavens\nthere shone a holy light.\nThe shepherds feared and trembled\nwhen lo! above the earth\nrang out the angel chorus\nthat hailed our Savior‘s birth.\nDown in a lowly stable\nthe humble Christ was born,\nand God sent us salvation\nthat blessed Christmas morn.\n\nSources:\nHustad, Donald P., and George H. Shorney. Dictionary-handbook to hymns for the living Church. The history of Hope Publishing Company and its divisions and affiliates / George H. Shorney. Carol Stream, IL: Hope Publ. Co., 1978.\nWork, John Wesley, The Folk Songs of the American Negro. 1931.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-3.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Psalm 40:4-5, Psalm 107:23-31, Psalm 136:1-26, 1 Thessalonians 5:16-18",
    "devo_title": "Count Your Blessings",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 40:4-5, Psalm 107:23-31, Psalm 136:1-26, 1 Thessalonians 5:16-18\nNo doubt many things got started in 1892. One of the many was the hymn-writing career of Johnson Oatman, Jr. \nHe wrote 5,000 hymns during his lifetime, a handful widely regarded as standards: “Higher Ground,” “No, Not One!,” and “Count Your Many Blessings.” That final example was first published in a songbook for young people. It is considered to be Oatman’s opus. One critic said: “Like a beam of sunlight it has brightened up the dark places of the earth.”\nThe Sunday nights of my childhood were spent in church, hemmed in among the waistlines of good Baptists. The feeling was laid back, no strict order of service like the morning. Often the song leader would loosen his tie and ask us for our favorite hymns. We Baptists didn’t bet, but some voice crying out “Count Your Many Blessings” was a sure thing, every time.\nOn those easy-like-Sunday evenings, the last half of that hymn’s chorus held a temptation too great for a song leader to resist: congregational participation. He’d always surrender. He would gradually slow us during that high E-flat “Count your blessings,” followed by the descending “name them one by one.” Then he’d bring us up full stop, still as sheep. He’d grin and say, “Now I know one of you has a blessing to count.” A grateful voice would rise, followed by another, and then another. And we would name them, always surprised at what the Lord had done, every time.\n\nCount Your Blessings\nby Johnson Oatman, Jr.\nWhen upon life’s billows you are tempest tossed,\nWhen you are discouraged, thinking all is lost,\nCount your many blessings, name them one by one,\nAnd it will surprise you what the Lord hath done.\nRefrain:\nCount your blessings, name them one by one;\nCount your blessings, see what God hath done;\nCount your blessings, name them one by one;\nCount your many blessings, see what God hath done.\nAre you ever burdened with a load of care?\nDoes the cross seem heavy you are called to bear?\nCount your many blessings, ev’ry doubt will fly,\nAnd you will be singing as the days go by.\nWhen you look at others with their lands and gold,\nThink that Christ has promised you His wealth untold;\nCount your many blessings, money cannot buy\nYour reward in heaven, nor your home on high.\nSo, amid the conflict, whether great or small,\nDo not be discouraged, God is over all;\nCount your many blessings, angels will attend,\nHelp and comfort give you to your journey’s end.\n\nJohn Blase preached for over a decade but then he thought he’d go where the money is, so he started writing poetry. He’s a lucky man with a stunning wife and three kids who look like their mother. He lives out West but he’ll always be from the South. His books include The Jubilee: Poems; Know When To Hold ‘Em: The High Stakes Game of Fatherhood; and All Is Grace: A Ragamuffin Memoir (co-written with Brennan Manning). He ponders faithfully at johnblase.com.\n\nSources:\nMorgan, Robert J. Then Sings my Soul. Nashville: Thomas Nelson, 2011.\nOsbeck, Kenneth W. 101 Hymn Stories: The Inspiring Stories Behind 101 Favorite Hymns. Grand Rapids, MI: Kregel, 2012.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-4.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Isaiah 1:18, Mark 10:45, 2 Corinthians 12:1-10, Ephesians 1:13-14, 1 Peter 1:18-21, Revelation 5:11-14",
    "devo_title": "Jesus Paid It All",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Isaiah 1:18, Mark 10:45, 2 Corinthians 12:1-10, Ephesians 1:13-14, 1 Peter 1:18-21, Revelation 5:11-14\nWhenever I imagine the writing of a hymn, I picture a Victorian-era man with mutton chops and mussed up hair, scribbling by the flickering light of a lantern. His fingers are smudged with ink as he prays and pens and receives inspiration. A piano sits nearby, where he taps out a tune to adorn his words. It’s a very holy, solitary affair.\nPerhaps other hymns were written this way, but “Jesus Paid It All” was not. Of the hymn’s origin, one author put it this way: “An obscure woman scribbles a poem on the flyleaf of her hymnal, an amateur church musician unknowingly creates a matching tune, an unknown pastor provides encouragement, and another hymn is born.”\nWritten in 1865, this hymn about the total sufficiency of Christ’s atoning work on the cross was not a solitary affair, but a fruit of His church. Partially inspired by William Bradbury’s hymn by the same name, this version was written by Elvina M. Hall, while she sat listening to a sermon from the choir loft of Monument Street Methodist Church in Baltimore, Maryland. She jotted the lyrics on the inside of her hymnal and shared them with her pastor after the service.\nNothing might have become of those lyrics had John T. Grape not also attended Hall’s church. \nThirty years earlier, Grape served as organist and choir director, during which time he composed a tune titled “All to Christ I Owe.” After hearing the music, the pastor was reportedly “unimpressed,” and set it aside. Thankfully, that same pastor recalled Grape’s tune as he read Hall’s words some three decades later. He believed they would make a great match, and history has proven him right.\nThe story of “Jesus Paid It All” is a marvelous exhibit of God assembling various talents over time to orchestrate something beautiful and powerful: a song of our complete redemption.\n\nJesus Paid It All\nby Elvina M. Hall\nI hear the Savior say,\n“Thy strength indeed is small,\nChild of weakness, watch and pray,\nFind in Me thine all in all.”\nRefrain:\nJesus paid it all,\nAll to Him I owe;\n Sin had left a crimson stain,\n He washed it white as snow.\nLord, now indeed I find\nThy pow’r and Thine alone,\nCan change the leper’s spots\nAnd melt the heart of stone.\nFor nothing good have I\nWhereby Thy grace to claim;\nI’ll wash my garments white\nIn the blood of Calv’ry’s Lamb.\nAnd when, before the throne,\nI stand in Him complete,\n“Jesus died my soul to save,”\nMy lips shall still repeat.\n\nSharon Hodde Miller is a writer, speaker, pastor’s wife, mom, and she holds a PhD on women and calling. She is a regular contributor to Propel, blogs at SheWorships.com, and her first book releases in October 2017.\n\nSources:\nOsbeck, Kenneth W. 101 Hymn Stories: The Inspiring Stories Behind 101 Favorite Hymns. Grand Rapids, MI: Kregel, 2012.\nPetersen, William J., and Ardythe Petersen. The Complete Book of Hymns: Inspiring Stories About 600 Hymns and Praise Songs. Carol Stream, IL: Tyndale House Publishers, Inc., 2006.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-5.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Psalm 146:2",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nI will praise the LORD all my life;\nI will sing to my God as long as I live.\n—Psalm 146:2\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-6.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Isaiah 12:5",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nAs we travel through these early American hymns together, let’s memorize this key verse about celebrating the Lord for His glorious works. \nSing to the Lord, for he has done glorious things.\nLet this be known throughout the earth.\n—Isaiah 12:5\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Hymns7-1.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "1 Corinthians 15:50-58, 2 Corinthians 5:1-10, 1 Thessalonians 4:13-18, Revelation 20:11-15",
    "devo_title": "When the Roll Is Called Up Yonder",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 1 Corinthians 15:50-58, 2 Corinthians 5:1-10, 1 Thessalonians 4:13-18, Revelation 20:11-15\nJames Black was a Sunday school teacher in Pennsylvania in the late 1800s.\nIn addition to his love of teaching the gospel, Black had a heart for young people from difficult backgrounds. One such teen was Bessie, a 14-year-old daughter of an alcoholic. Black met her in an alley in town, invited her to church, and she accepted. Bessie attended regularly until one day, as Black called roll, she did not respond.\nThe gospel teacher’s heart was moved by her absence. He said to the class, “When my own name is called up yonder, may I be there to respond.”\nAfter Sunday school, James Black went to Bessie’s home to find her laid up with pneumonia, on the verge of death. Again his heart was pierced. He went home and, in a single sitting, wrote “When the Roll Is Called Up Yonder.” A few days later he led the congregation in singing the hymn at Bessie’s funeral.\nMore than a century later, Black’s song remains a reminder of hope in the face of mortality and suffering—a proclamation of the certainty of Christ’s coming. It isn’t a declaration of judgment, or some hellfire and brimstone dirge. The lyrics lift the soul and call listeners to Jesus.\nBlack calls believers to revel in, reflect publicly, and proclaim the love of Jesus—“of all His wondrous love and care”—as he did for Bessie and so many like her. His hymn points to the promise of eternal hope and joy for those in Jesus when God calls them home.\n\nWhen the Roll Is Called Up Yonder\nby James Black\nWhen the trumpet of the Lord shall sound, and time shall be no more,\nand the morning breaks, eternal, bright and fair;\nwhen the saved of earth shall gather over on the other shore,\nand the roll is called up yonder, I’ll be there.\nRefrain:\nWhen the roll is called up yonder,\nwhen the roll is called up yonder,\nwhen the roll is called up yonder,\nwhen the roll is called up yonder, I’ll be there.\nOn that bright and cloudless morning when the dead in Christ shall rise,\nand the glory of His resurrection share;\nwhen His chosen ones shall gather to their home beyond the skies,\nand the roll is called up yonder, I’ll be there.\nLet us labor for the Master from the dawn till setting sun;\nlet us talk of all His wondrous love and care;\nthen when all of life is over, and our work on earth is done,\nand the roll is called up yonder, I’ll be there.\n\nBarnabas Piper is the author of The Curious Christian: How Discovering Wonder Enriches Every Part of Life. He co-hosts the popular Happy Rant podcast, blogs at BarnabasPiper.com, and contributes to a variety of other websites. Barnabas speaks regularly at churches and conferences around the country and lives in Nashville, where he works for LifeWay Christian Resources.\n\nSource:\nMorgan, Robert J. Then Sings my Soul. Nashville: Thomas Nelson, 2011.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-8.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Psalm 5:1-3, Matthew 26:36-46, John 10:25-30, Hebrews 10:19-25, James 4:8",
    "devo_title": "In the Garden",
    "devo_summary": "\nBY Amanda Bible Williams\n\nScripture Reading: Psalm 5:1-3, Matthew 26:36-46, John 10:25-30, Hebrews 10:19-25, James 4:8\nC. Austin Miles was a pharmacist by trade, but the darkroom was home to his truer loves: photography and Bible-reading. He’d sit and read Scripture while waiting for film to develop, his well-worn Bible illuminated by the room’s familiar glow. \nOn such a day in March 1912, Miles began to process his photos, then opened his Bible to John chapter 20 as he waited. He’d read the passage before; it was one of his favorites. But this time, the scene seemed to come alive. He found himself imagining he was face to face with Jesus as He spoke to Mary near the empty garden tomb.\nOf the experience Miles wrote, “I awakened in full light, gripping the Bible, with muscles tense and nerves vibrating. Under the inspiration of this vision, I wrote as quickly as the words could be formed the poem exactly as it appeared. That same evening I wrote the music.”\nIn addition to his photos, Miles had developed a reputation as a music director at conventions, churches, camp meetings, and the like. Not long before that March inspiration, a music publisher named Adam Geibel had asked Miles to compose a specific type of hymn—one that was sympathetic and tender, “one that would bring hope to the hopeless, rest for the weary, and downy pillows to dying beds.”14 With the Holy Spirit’s help, a “downy pillow” for the soul is just what he delivered. \nWe all come to the garden alone, but our suffering Savior meets us there. He tells us what is true: we are His own.\n\nIn the Garden\nby C. Austin Miles\nI come to the garden alone,\nWhile the dew is still on the roses;\nAnd the voice I hear, falling on my ear,\nThe Son of God discloses.\nRefrain:\nAnd He walks with me, and He talks with me,\nAnd He tells me I am His own,\nAnd the joy we share as we tarry there,\nNone other has ever known.\nHe speaks, and the sound of His voice\nIs so sweet the birds hush their singing;\nAnd the melody that He gave to me\nWithin my heart is ringing.\nI’d stay in the garden with Him\nTho’ the night around me be falling;\nBut He bids me go; thro’ the voice of woe,\nHis voice to me is calling.\n\nSources:\nMorgan, Robert J. Then Sings my Soul. Nashville: Thomas Nelson, 2011.\nOsbeck, Kenneth W. 101 Hymn Stories: The Inspiring Stories Behind 101 Favorite Hymns. Grand Rapids, MI: Kregel, 2012.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-9.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Deuteronomy 33:27-29, Psalm 71:4-6, Psalm 91:1-16, Psalm 118:6, Proverbs 3:5-12, Galatians 3:5-9",
    "devo_title": "Leaning on the Everlasting Arms",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Deuteronomy 33:27-29, Psalm 71:4-6, Psalm 91:1-16, Psalm 118:6, Proverbs 3:5-12, Galatians 3:5-9\nBehind the cheerful tune of “Leaning on the Everlasting Arms” is a heartbreaking story.\nThere were not only itinerant preachers in the deep South of the mid-1800s, there were also itinerant teachers of church songs. One of the more popular of these traveling teachers was A.J. Showalter. Showalter published over 130 music books, his sales exceeding more than two million copies. He traveled throughout the South to various churches, spending roughly a month with each of them, teaching these revival songs. \nOn one of these trips, while in the small town of Hartselle, Alabama, A.J. Showalter returned to his room to find two pieces of mail. Each was from a former student, and each contained a tragic story. Both students had lost their wives on the same day and were now widowers. \nEager to offer them solace, Showalter searched the scriptures till he found Deuteronomy 33:27, which read, “The eternal God is thy refuge, and underneath are the everlasting arms.” And so he began to write the memorable chorus,\nLeaning, leaning, safe and secure from all alarm\nLeaning, leaning, leaning on the everlasting arms.\nShowalter sent the devastated men these words of comfort even as he was still struggling to compose the verses. He shared what he’d written with a friend, Elisha Hoffman, who then provided the verses. With those verses in place, Showalter wrote the music of the hymn we know today.\nIt’s ironic that this hymn, born of great tragedy, is couched in an upbeat tune that makes it so easy to remember. But in times of great sorrow, there can be no better truth to recall than this: we can lean, safe and secure, on the everlasting arms of our Lord.\n\nLeaning on the Everlasting Arms\nby E. A. Hoffman\nWhat a fellowship, what a joy divine,\nleaning on the everlasting arms;\nwhat a blessedness, what a peace is mine,\nleaning on the everlasting arms.\nRefrain:\nLeaning, leaning,\nsafe and secure from all alarms;\nleaning, leaning,\nleaning on the everlasting arms.\nO how sweet to walk in this pilgrim way,\nleaning on the everlasting arms;\nO how bright the path grows from day to day,\nleaning on the everlasting arms.\nWhat have I to dread, what have I to fear,\nleaning on the everlasting arms?\nI have blessed peace with my Lord so near,\nleaning on the everlasting arms.\n\nMatt Redmond loves words, music, his family, and the Church. Born in Birmingham, Alabama, Matt attended Southeastern Bible College and Covenant Theological Seminary, and has served in pastoral ministry as well as the banking industry. He and his wife Bethany have three children. Matt is the author of The God of the Mundane and blogs at Echoes and Stars.\n\nSources:\nMorgan, Robert J. Then Sings my Soul. Nashville: Thomas Nelson, 2011.\nPetersen, Randy. Be Still, My Soul: The Inspiring Stories Behind 175 of the Most-Loved Hymns. Carol Stream, IL: Tyndale House Publishers, Inc., 2014.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-10.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Genesis 1:1-31, Psalm 19:1-6, Psalm 50:11-12, Psalm 98:8-9, Matthew 6:25-34",
    "devo_title": "This Is My Father’s World",
    "devo_summary": "\nBY Kaitlin Wernet\n\nScripture Reading: Genesis 1:1-31, Psalm 19:1-6, Psalm 50:11-12, Psalm 98:8-9, Matthew 6:25-34\nMaltbie Babcock was the kind of college student that would make even a valedictorian jealous. To make matters worse, he was also kind, an expert swimmer, captain of the baseball team, and student orchestra leader. Babcock’s tall, muscled figure was the only thing about him that wasn’t well-rounded. \nAfter graduating from Syracuse University, he attended Auburn Theological Seminary and eventually became the pastor of the First Presbyterian Church in Lockport, New York. In between his daily pastoral duties, Babcock itched to get out of the church office and explore the outdoors surrounding it. \nHis favorite place to walk was a large hill two miles away that overlooked Lake Ontario. Grabbing his coat and running out the door, Babcock would tell his secretary, “I’m going to see my Father’s world.” He’d later write a sixteen-stanza poem, each verse beginning with that very same sentiment: “This is my Father’s world.”\nSadly, Maltbie Babcock died at age 42 from a bacteria he contracted on a ship en route to the Holy Land. Following his death, his wife compiled his writings into a book called Thoughts for Everyday Living, published in 1901. Fourteen years later, in 1915, the tune for this poem-turned-hymn was arranged from an old English melody by one of Babcock’s close friends, accomplished musician F.L. Sheppard.\nStill a favorite today, “This Is My Father’s World” reminds us not only of the beauty of creation, but of the way it tethers us to the more enduring beauty of the gospel and to the goodness of our Father.\n\nThis Is My Father’s World\nby Maltbie D. Babcock\nThis is my Father’s world,\nAnd to my listening ears\nAll nature sings, and round me rings\nThe music of the spheres.\nThis is my Father’s world:\nI rest me in the thought\nOf rocks and trees, of skies and seas—\nHis hand the wonders wrought.\nThis is my Father’s world:\nThe birds their carols raise,\nThe morning light, the lily white,\nDeclare their Maker’s praise.\nThis is my Father’s world:\nHe shines in all that’s fair;\nIn the rustling grass I hear Him pass,\nHe speaks to me everywhere.\nThis is my Father’s world:\nO let me ne’er forget\nThat though the wrong seems oft so strong,\nGod is the Ruler yet.\nThis is my Father’s world:\nWhy should my heart be sad?\nThe Lord is King: let the heavens ring!\nGod reigns; let earth be glad!\n\nSources:\nMorgan, Robert J. Then Sings my Soul. Nashville: Thomas Nelson, 2011.\nPetersen, Randy. Be Still, My Soul: The Inspiring Stories Behind 175 of the Most-Loved Hymns. Carol Stream, IL: Tyndale House Publishers, Inc., 2014.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-11.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "2 Chronicles 30:6-9, Psalm 116:12-19, Matthew 16:24-28,  Acts 21:10-14, Romans 12:1-2, Titus 2:11-14",
    "devo_title": "I Surrender All",
    "devo_summary": "\nBY Guest Writer\n\nScripture Reading: 2 Chronicles 30:6-9, Psalm 116:12-19, Matthew 16:24-28,  Acts 21:10-14, Romans 12:1-2, Titus 2:11-14\nThough he’d grown up a simple Michigan farm boy, Judson Van DeVenter always loved the arts, especially painting and music. He eventually pursued his artistic dreams at the collegiate level, and after graduation moved to Pennsylvania, where he immediately took up a position as an art teacher. \nAs a young adult he was able to venture out on a tour of some of Europe’s finest galleries, taking in great masterpieces and refining his own painterly skills. Some said he had the makings of a truly exceptional artist, poised to take his place among the greats.\nJudson had been a devout believer since his youth, and as an adult, he became active in the music ministry at his church. Though he’d always loved being an artist, the tug of ministry life proved a real struggle for him. God had all along been wooing him to full-time ministry, and it seemed that his hope of a life of artistic influence would have to go. After years of struggle, Judson knelt in prayer, saying, “I surrender all to Thee.”19 Years later, he penned the hymn inspired by this pivotal moment of calling. \nFrom this patient life of submission, God brought forth much fruit—not only through the impact of this famous American hymn, but also through Judson’s ongoing service at Florida Bible Institute, where a young Billy Graham was inspired by Judson’s ministry. \nAs in Judson’s life, the gentle moving of God’s Spirit often works by ordinary means to affect in us extraordinary surrender. May our hearts, quickened by His Spirit, be conformed to His likeness, molded by His love, and enlivened by His power, that we may rest on nothing of our own, but surrender all to Him.\n\nI Surrender All\nby Judson W. Van DeVenter\nAll to Jesus I surrender,\nAll to Him I freely give;\nI will ever love and trust Him,\nIn His presence daily live.\nRefrain:\nI surrender all, I surrender all;\nAll to Thee, my blessed Savior,\nI surrender all.\nAll to Jesus I surrender,\nMake my, Savior, wholly Thine;\nLet me feel Thy Holy Spirit,\nTruly know that Thou art mine.\nAll to Jesus I surrender,\nLord, I give myself to Thee;\nFill me with Thy love and power,\nLet Thy blessing fall on me.\n\nCaleb Faires draws and writes at a table he built from poplar boards. He loves to build and create. Blank paper is an invitation for lines and beauty. He lives in Tennessee with his wife and five children. See what he’s up to at calebfaires.com.\nSource:\nPetersen, Randy. Be Still, My Soul: The Inspiring Stories Behind 175 of the Most-Loved Hymns. Carol Stream, IL: Tyndale House Publishers, Inc., 2014.\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-12.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Psalm 71:14",
    "devo_title": "Grace Day",
    "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut I will hope continually\nand will praise you more and more.\n—Psalm 71:14\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/SRT-Hymns7-Instagram-13.jpg"
},
{
    "book_title": "Go Tell It on the Mountain",
    "devo_passages": "Psalm 136:1",
    "devo_title": "Weekly Truth",
    "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nNow that we’ve traveled through these early American hymns together, let’s memorize this verse about giving thanks to the Lord for His goodness. \nGive thanks to the Lord, for he is good.\nHis faithful love endures forever.\n—Psalm 136:1\nWrite this passage down and post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about Scripture memorization. Will you join us?\n \n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2017/06/4-Hymns7-2.jpg"
}
]