[
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Deuteronomy 6:13-14, Isaiah 40:18-31, Matthew 14:22-33, Joshua 24:14-15, John 4:21-24",
        "devo_title": "What Is Worship?",
        "devo_summary": "\nBY Amanda Bible Williams\n\nI was five years old, standing with my mom and brother in a pew near the front of the sanctuary. We were singing a hymn and I had my eyes closed, my hands held in front of me with my palms facing up as if carrying an invisible tray. This is my earliest memory of worship. \nI didn’t know to call it that. I was just responding to the reality of who God showed Himself to be. Somehow—maybe through the Scripture read from the pulpit or a truth proclaimed in that hymn, or maybe through whispers from the Holy Spirit to my heart—I caught a glimpse of God, big and strong and holy, but also good and loving. I felt connected to Him, like I knew Him and He knew me. It didn’t matter that I was small; I knew right then that I was His, and my heart responded in kind. \nThat moment in my memory marks the beginning of a lifelong journey of worship, of learning to respond to God with all of myself. There are times this resembles that day in the church pew, my heart swelling in worship as the pipe organ plays and the congregation sings. More often it takes a subtler form, a different shape of surrender for each circumstance and season. Sometimes my worship is misplaced; like a train without tracks, I give my awe and reverence to something other than my Creator. \nScripture makes it clear that we are to worship nothing and no one other than the one true God. He is the only one worthy of our worship. \n“To whom will you compare me, or who is my equal?” asks the Holy One. Look up and see! Who created these? He brings out the stars by number; he calls all of them by name. Because of his great power and strength, not one of them is missing.” –Isaiah 40:25–26\nBut if worship is indeed more than singing on Sunday morning, what is it? Jesus told the Samaritan woman at the well that true worshipers worship “in Spirit and in truth” (John 4:23). How do we worship with a heart tuned to the Spirit of the Lord and tethered to the truth of His Word? \nThese are the questions we will explore in this study of what it means to worship God. Each day we will read about an aspect of worship from Scripture, spending time reflecting on what it looks like in our lives. While these two weeks will not give us an exhaustive look at the topic of worship in the Bible, our prayer is that we’ll walk away with a fuller understanding of what “worship in spirit and in truth” means for us and the God who made us. \nLike that little girl with hands stretched out, I am still learning how to worship. Join me as we learn together, and may our lives reflect more of God’s goodness and glory as a result. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day1-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Psalm 33:1-9, Psalm 147:1-9, Exodus 15:19-21, Acts 16:16-34, Colossians 3:16",
        "devo_title": "Worship Through Song",
        "devo_summary": "\nBY Guest Writer\n\nMy emotions have been a bit up and down lately. I’ve been writing songs in fits and starts, leaving chords and scribbled notes in papers on the piano, unfinished and forgotten. This is an especially dynamic time for our family as we have recently welcomed a new baby. But as we shift into this new season of life, I find I am once again comforted by chords and lyrics, by the act of praising and worshiping God through them. I find rest when I call to mind these words from the psalmist: “For the word of the LORD is right and true; he is faithful in all he does” (Psalm 33:4 NIV). Our God has made all things with His own hands, and with every new season and turning of our lives, He invites us to sing a new song to Him.\nIn the midst of all these changes, I try to live in the moment, to be present and take it all in stride. But the thing about living in the moment is that it’s wrapped up in the weather, the mood I’m in, what I ate for lunch, how much sleep I’ve had, or how stressed I am about work obligations. Emotions are the fuel and the energy of our daily rhythms; they provide the movement of our lives. Created by God, our emotions are good and can teach us things about who we are, who our God is, and who our neighbor is; however, in and of themselves, our emotions are not trustworthy and ought not be left in charge to guide our lives. This is where worship can come into play.\nWorship can lasso the wild horses of shame, gladness, anger, loneliness, and sadness and then corral them inside the fence of truth. Worship is restorative; it is the corrective to our emotional ups and downs. It turns the disharmony of our circumstances into the resonant harmonies of a new song. Worship is not just about living in the moment; it is an honest look at who we are in light of who God is, of where we’ve been and where we are going. \nThrough worship and song, God invites us into a deeper relationship with Him. He reveals more of Himself through the act of worship, and as a result, our spirits, minds, and bodies are realigned to His reality—not what we perceive our circumstances to be through the lens of emotion. God provides and sustains in all things, and He teaches us to sing new songs of praise, new ways to worship Him within each new twist and turn of life, in times of both joy and sorrow.\nThere’s an old gospel hymn that says, “I sing because I’m happy, I sing because I’m free.” But when we go through times of difficulty or transition that are disorientating, how do we keep worshiping? When awakened in the middle of the night with a newborn baby, or rising in the morning after a break-up, or standing on the grass at a loved one’s funeral, or in the slow delays of a long illness—how do we keep on singing?\nIt takes faith to believe in what we cannot see, to sing ourselves forward into hope. Worship is the practice of faith, of aligning our spirits with God’s kingdom reality; singing is what comes out on the other side. These words seem to spring up out of a deep well of gratitude within the psalmist, who says, “Hallelujah! How good it is to sing to our God” (Psalm 147:1).\n\nSandra McCracken is a singer, songwriter, and producer from Nashville, TN. Over the course of ten critically acclaimed studio albums, Sandra has developed a body of work that encompasses hook-driven melodic pop, No Depression-style Americana, contemporary recastings of classic hymns, and even children’s music as part of the Nashville alt-folk super-group Rain For Roots. Her newest album, Songs from the Valley, was released this spring.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day2-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Matthew 25:31-46, Isaiah 58:6-11, Mark 10:35-45",
        "devo_title": "Worship Through Service",
        "devo_summary": "\nBY Guest Writer\n\nHave you ever wrestled with what it means to serve? In my own life, I’ve found it’s far easier to seek out what’s fun or brings comfort. Life gets tiring and stressful, and the only way we can survive is by putting something “fun” on the calendar, something to look forward to. Our family does this, and I don’t believe there is anything wrong with it. But I wonder if our craving for fun is masking a deeper desire for joy—the kind of fulfillment that comes from serving others.\nIn the Gospel of Matthew, Jesus says that when He returns He will know who loves Him by the way that we help others: “For I was hungry and you gave me something to eat; I was thirsty and you gave me something to drink; I was a stranger and you took me in” (Matthew 25:35).\nWe’re tempted to read this verse and say to ourselves, “I need to sign up for a food kitchen” or “I need to give that homeless person a dollar the next time I see them.” These are all good things, sure, but is this the kind of service Jesus is really talking about in this passage?\nJesus also said, “For even the Son of Man did not come to be served, but to serve” (Mark 10:45). These two passages are bold calls to live our lives wide open to constant, regular, and sacrificial acts of laying our lives down for others. Jesus’s words beckon us to worship Him not through obligatory service, but with guttural prayers asking the Lord to allow us opportunities to love in His name. \nWhy does Jesus ask this of us? Jesus loves us, came to die for us, and knows that the only way for us to have the full, free, and joy-filled life that we so deeply desire is through the laying down our lives for others (John 15:13).\nWhat does this look like? It might look like embracing an interruption in our already busy day. Or perhaps it looks like bravely praying that God would send someone your way to love in His name. It might look like asking Him to reveal opportunities to worship Him through service to others. Maybe you’re called to embrace the uncomfortable and not shy away from that call because you are afraid of the unknown. \nWhen we create margin in our lives to serve others, we realize that any sacrifices we make to worship God in this way—whether it be through our time, resources, or creativity—all pale in comparison to the joy we receive as a result.\nI pray that today, God would show us ways we can serve as Jesus served, and that the joy that wells up when we do would create an unquenchable desire for more!\n\nMaria Furlough is a wife and a mother to one amazing 11-year-old daughter, three rambunctious boys, and one baby boy who lives in the arms of Jesus. Formerly a full-time youth pastor, Maria now teaches women’s Bible studies and works as the Missions Team leader at Lake Forest Church in Huntersville, North Carolina. Maria is the author of Breaking the Fear Cycle: How to Find Peace for You Anxious Heart and Confident Moms, Confident Daughters. You can find Maria on Instagram or Facebook @MariaFurlough or online at www.mariafurlough.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day3-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Daniel 6:1-24, Colossians 3:17, Psalm 19:7-14, Micah 6:8",
        "devo_title": "Worship Through Obedience",
        "devo_summary": "\nBY Guest Writer\n\nIf we believe all of God’s Word is true, then we must receive even the hard things as being good for us. This means these words from the psalmist are true as well:\nThe precepts of the LORD are right, making the heart glad; the command of the LORD is radiant, making the eyes light up. –Psalm 19:8\nThe Lord’s commands are “radiant”—brilliant and beaming beacons of light in this world—and this verse tells us they are able to bring us joy. Those words are poetry, yes, but they are also true and applicable. So do we believe them in a practical sense? Do we experience joy from God’s commands? Do we feed and thrive on faithfulness and obedience to God as Daniel did?\nFor Daniel, there was no room for discussion about obedience. Even when he knew he’d be thrown into the lion’s den for worshiping the Lord, “three times a day he got down on his knees, prayed, and gave thanks to his God, just as he had done before” (Daniel 6:10). Obedience and worship were a way of life for Daniel, a posture of his heart and indicative of his relationship with God, not just a response to crisis. \nIn giving our lives in obedience to the Lord, in doing “everything in the name of the Lord Jesus” (Colossians 3:17), we ascribe worth to God, acknowledging that He alone is worthy of our worship, not only through our words but also through our actions. When we choose to live in accordance with God’s Word and His ways, we submit to His will and die to our own.\nLiving as an exile in Babylon most of his life, Daniel knew well that the earth was not his ultimate home, and he lived like it. He lived in obedience and continual service to his King, the Lord of heaven and of earth. Do we live like that? Do our lives look as radically obedient as Daniel’s life? Do the Lord’s commands bring light to our eyes or weight to our hearts? We know theoretically that God’s commands are for our good. But if we’re honest, we’re a wrecked, half-hearted people who worship so many other things with our lives.\nBut “the LORD is compassionate and gracious, slow to anger and abounding in steadfast love” (Psalm 103:8); He does not leave us to ourselves. While we were still lost to our sin, Jesus Christ came to save us from ourselves, humbling “himself by becoming obedient to the point of death” (Romans 5:8; Philippians 2:7–8). Even now, He is sanctifying us into a people who will worship Him with our whole heart and whole lives in obedience to Him (2 Corinthians 3:18). The One who calls us to obedience gives us everything we need to obey Him (2 Peter 1:3).\n\nKimberly Girard is a well-loved child of God, wife of an extraordinary man, mother of three amazing kids, and writer living in Pittsburgh, Pennsylvania. You can find her at Loud Singing and on Twitter. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day4-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "1 Chronicles 16:4-36, Ezra 3:10-11, Psalm 136:1-26",
        "devo_title": "Worship Through Gratitude",
        "devo_summary": "\nBY Melanie Rainer\n\nIn college, I was part of a university ministry that had been led in faithfulness by the same pastor for many years, and he still leads it to this day: a picture of steadfast commitment and fruit-bearing that can only come from a long obedience in the same direction (to borrow a book title from the late Eugene Peterson). \nThree years ago, we gathered with alumni and supporters to celebrate the twentieth anniversary of this faithful, beloved ministry. We took turns sharing memories and singing hymns, but the wind that blew through the whole evening was one of corporate gratitude: together, thanking God for His indescribable gift, we worshiped in song and story, in thanksgiving and praise. We thanked God for what He had done, and what we knew He would continue to do. \nEach of today’s passages from Scripture highlights corporate gratitude expressed in worship. In 1 Chronicles 16, David institutes the daily practice of thanksgiving, commissioning Asaph to lead the community in worship. David decrees his song of thanks in verses 8–36, which is then reflected in parts of Psalms 96, 105, and 106. \nThe structure of David’s song matches the content of Psalm 136 incredibly closely, and there’s a lot to be gleaned from what David thanks the Lord for and in what order.\nIn Psalm 136, we see the creation story unfold with a refrain about God’s everlasting love: He made the heavens, He spread the land on the water, He hung the sun and the moon and dotted the stars. Then we read, with the same call-and-response pattern, how He saved the Israelites from Egyptian slavery, struck down evil kings to protect His people, and gave them a homeland. The same themes leap off the page in 1 Chronicles 16, and they are cues we can take into our daily practice of worship and gratitude. \nIt’s interesting to me in that 1 Chronicles 16, David doesn’t specifically thank God for what had just happened: the bringing of the ark of the covenant into Jerusalem. They worshipped at the ark, where God dwelled, but their gratitude was cosmic in scale. It was not, “Thank You for what You did today, for this one specific thing we have to celebrate.” It was, and perhaps should usually be, “Thank You for who You have always been, for how You have loved Your people since the beginning of time.”\nIn corporate worship, in private prayer, in the smallest moments, and the most earth-shattering ones, we always have reason to thank God for what He has done and what we know He will do. Whether or not we feel grateful or not, whether or not we feel worshipful, there is always reason to worship in gratitude: because His faithful love endures forever. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day5-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Joshua 24:15",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBut if it doesn’t please you to worship the LORD, choose for yourselves today: Which will you worship—the gods your fathers worshiped beyond the Euphrates River or the gods of the Amorites in whose land you are living? As for me and my family, we will worship the LORD.\nJoshua 24:15\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day6-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "John 4:23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for this reading plan. \n“But an hour is coming, and is now here, when the true worshipers will worship the Father in Spirit and in truth. Yes, the Father wants such people to worship him.” —John 4:23\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/4-InSpiritAndTruth-1-2-576x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Leviticus 20:7-8, Isaiah 1:11-20, 1 Peter 2:1-10, James 1:19-27",
        "devo_title": "Worship Through Holiness",
        "devo_summary": "\nBY Guest Writer\n\nIn third grade I got called to the principal’s office for saying an inappropriate word. In my defense, someone had written it on the chair in front of me, and I was reading it aloud to my friend. As I made the trek from my classroom to the office, I remember my heart beating through my chest and tears running down my face. “Failure!” That’s what I heard over and over again in my mind, and I hated it. I never wanted to experience that feeling again—and a perfectionist started growing in me.\nWhen I met Jesus, my tendency toward perfectionism collided with my sinfulness, which then re-collided with the call on my life to be “holy” with my thoughts and actions. I don’t think I am alone in this struggle, and my prayer today is to break this whole “holiness” thing down and learn together how to worship God through it.\nLeviticus chapter 20 speaks to this call to holiness: “Consecrate yourselves and be holy, for I am the LORD your God” (v.7). In this passage, God warns His people to stay far away from cultural practices that are not of Him. God lays it out very simply: If what is going on around us is not of Him, then we need to stay away from it, to stand apart from what the world is doing—not simply because we have to, but because we want to, as an act of worship. We are called to live holy lives because we love God enough to trust that what He asks of us is for our good and His glory. \nIt seems simple, right? We worship God by standing apart. But how do we stand apart?\nWe find the answer in the next verse, which says, “Keep my statutes and do them” (Leviticus 20:8a). At the onset, we might get stuck on that fact that we can’t possibly keep all of His statutes on our own; we will always fall short and fail. Instead, we need to step into God’s infinite grace and mercy to see how He finishes the verse for us: “I am the LORD who sets you apart” (Leviticus 20:8b).\nIn these places of perfectionism and failure, I sense God whispering to me, “Sweet child, you worship me through holiness by coming to me over and over again and allowing Me to make you clean.” This is why Jesus came: to make us holy and bring us back into right relationship with God. He has chosen us to be His own and calls us holy now, today. Out of His great mercy, He called us out of the darkness of sin and into freedom in Him (1 Peter 2:9–10).\nWhat God asks of us is to do more than just hear and receive His word; we are to put our faith into action (James 1:22). He asks that we also pursue holiness and “rid [ourselves] of all malice, all deceit, hypocrisy, envy, and all slander” (1 Peter 2:1). In doing so, we “present [our] bodies as a living sacrifice, holy and pleasing to God; this is [our] true act of worship” (Romans 12:1, emphasis mine).\nThis is our true act of worship: to submit ourselves daily to our loving God, and to consecrate every part of our lives to Him and His ways. We are to set our actions apart from the ways of this world, because He has chosen us and has already set us apart for Himself.\nEven this we cannot do this apart from the Holy Spirit in us. Let us then worship God freely, hands raised high and hearts wide open, knowing that both the holiness we possess and the holiness we pursue, He has made possible in us. \n\nMaria Furlough is a wife and a mother to one amazing 11-year-old daughter, three rambunctious boys, and one baby boy who lives in the arms of Jesus. Formerly a full-time youth pastor, Maria now teaches women’s Bible studies and works as the Missions Team leader at Lake Forest Church in Huntersville, North Carolina. Maria is the author of Breaking the Fear Cycle: How to Find Peace for You Anxious Heart and Confident Moms, Confident Daughters. You can find Maria on Instagram or Facebook @MariaFurlough or online at www.mariafurlough.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day8-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Matthew 6:5-15, Philippians 4:6-7, Psalm 44:1-26",
        "devo_title": "Worship Through Prayer",
        "devo_summary": "\nBY Guest Writer\n\nLast night when I got into bed, I was completely wrecked by my sin—my selfishness in not loving my husband and children well, my discontentment, my quickness to anger, my quickness to speak out of anger… I could go on. And as I cried, I finally cried out to the Lord. I had been in the middle of writing this devotion on prayer, and yet turning to Him was not my first reaction. But the Lord, who sees and knows the depth of my sin much better than I do, met me and reminded me that He sees me in all my mess and loves me still. Indeed, there is great reward in prayer (Matthew 6:6).\nPrayer is coming to my Father as a needy child, acknowledging my inability to change situations or people or my own heart, and then acknowledging that God is mighty and that He reigns, ascribing worth to the Lord for who He is. \nIn Psalm 44, this kind of worship is modeled for us. Here, the psalmist is very real with his emotions. His plea is raw with vulnerability. He feels abandoned, yet he begins and ends the psalm in recognition of God’s faithful love for His people. Despite feeling rejected and forgotten, he comes back to what he knows to be true: God is faithful. \nThis is just one way prayer blesses, or “rewards,” us. When we turn to God in prayer, we are reminded of who He is and who we are not. There is relief in remembering that we are not the center of all things—not even our own lives. He is. And as He recenters us, He is able to do serious work in our hardened hearts as only He can, bringing peace when we feel fraught with anxiety.\nOf course, the ultimate reward of prayer is being in relationship with the Lord Himself. Prayer can be a form of worship because engaging in prayer reminds us that He is in our midst, in the details of our lives. “God is our refuge and strength, a helper who is always found in times of trouble” (Psalm 46:1). Regardless of our circumstances, He is sovereign. \n“The LORD is compassionate and gracious, slow to anger and abounding in faithful love” (Psalm 103:8). God knows our desperate need of Him, even when we don’t acknowledge it ourselves. He says, “Come to me, all of you who are weary and burdened, and I will give you rest” (Matthew 11:28). His presence alone is the perfect balm to our weary souls.\nPrayer is an open invitation to relationship with God. It’s not always going to look pretty because we’re sinful, a broken and messy people. But Jesus’s blood covers all our sin—past, present, and future. He sees us in secret, knows the depths of our hearts, and loves us still.\n\nKimberly Girard is a well-loved child of God, wife of an extraordinary man, mother of three amazing kids, and writer living in Pittsburgh, Pennsylvania. You can find her at Loud Singing and on Twitter. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day9-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Exodus 23:14-17, 2 Samuel 6:1-23, Acts 2:46-47, Revelation 19:6-9, 1 Corinthians 10:31",
        "devo_title": "Worship Through Celebration",
        "devo_summary": "\nBY Ellen Taylor\n\nWhen I was seven or eight, I went to a Vacation Bible School with one of my friends. Her church was huge, much bigger than the one I attended every Sunday with my parents, and VBS was the biggest event of the summer. I remember being in awe throughout the morning session, which was complete with flashing lights, teenagers-turned-VBS-couselors performing skits on stage, and a David Crowder song based on part of the NIV translation of 2 Samuel 6:22: “I will become even more undignified than this.” The first few lyrics of the song are forever etched in my memory. I can still picture hundreds of kids jumping around the room singing: “I will dance, I will sing, to be mad for my King. / Nothing, Lord, is hindering this passion in my soul…” That’s the first time that I remember feeling like worship was a celebration. \nCelebration occurs all throughout Scripture—beautiful examples of people being reminded, and in turn, reminding one another, of who God is and what He has done. In Exodus 23, the Israelites are given specific instructions to celebrate throughout the year as a reminder of what God had done for them. And in Acts 2, we get a glimpse into how the early Church celebrated when they met together to praise God.\nIn 2 Samuel 6, we read about the all-out worship of King David before his God. He was “leaping and dancing before the LORD” (v.16), celebrating the arrival of the ark of the covenant in Jerusalem. However, his wife, Michal, thought his celebration was undignified and dishonoring. But David kept on celebrating, telling her, “I will dance before the LORD, and I will dishonor myself and humble myself even more” (vv.21–22). \nSince that morning at VBS, I’ve worshiped through celebration countless times. Any time we are gathered with other people to rejoice in what God has done or is doing in our lives, we worship and honor our God. Sometimes that takes the form of worship as we normally think of it, as singing, praying, and rejoicing, And sometimes, it can look a little different, like an outright, good ole celebration—birthday dinners and wedding receptions, baptisms and showers.\nIt’s important to remember that celebration can be a form of worship—a response to who God is and what He has done. And when we remember all that He has done for us, of course our response should be celebration! We have received grace upon grace in Christ, and that is worth celebrating.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day10-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Romans 12:1-2, Psalm 51:1-19, Luke 7:36-50, Hebrews 13:15-16",
        "devo_title": "Worship Through Sacrifice",
        "devo_summary": "\nBY Melanie Rainer\n\nMy toes tend to curl when I hear the word “sacrifice.” My toes curl when I’m uncomfortable, when my anxiety spikes, or when I see something gross or gory flash across the television screen. It’s involuntary, like the knee-jerk reflex test at my annual physical. There’s some sort of connection in my brain between the word “sacrifice” and the feeling of danger and discomfort. \nI don’t think that’s necessarily a bad reaction, but one that gives me pause when I think about today’s readings. Even the notion of “worship as sacrifice” feels a little primitive, conjuring up images of priestly rites and clean animals and fires and blood. \nThe Old Testament sacrificial system depended on an exchange: the clean blood of an animal exchanged for a person’s uncleanness. Psalm 51 shows David’s prayer of repentance after his sin with Bathsheba. It is full of references to the sacrificial system but hints at the salvation to come: “You do not want a sacrifice, or I would give it; you are not pleased with a burnt offering” (v.16).\nWe no longer have to offer blood sacrifices to draw near to God; rather, Jesus has served as the sacrifice. Hebrews 10 gives us all the assurance of this blessed truth: “By this will we have been sanctified through the offering of the body of Jesus Christ once for all time” (v.10). \nRitual sacrifice is no longer required from us, but as we read today, sacrifice is presented as a form of worship. Throughout the New Testament, we see sacrifice exhorted and explained. It is part of our life of worship, our response to who God is and what He has done for us. \nThe beautiful story in Luke 7 shows a sinful woman offering her finest perfume to wash the feet of Jesus. Her sacrifice is monetary, but she also lays down whatever pride and fear she must have had. Given the scornful cynicism of the Pharisees who watched her, her actions must have cost her substantially more than an alabaster jar of fine perfume. \nIn Romans 12, Paul calls believers to sacrifice by living differently than the present age. “Do not be conformed to this age,” he writes (v.2). Reflecting on what it would truly mean for me to live differently than the world also makes my toes curl. \nHebrews 13 gives us two more examples of sacrifice: praise and good works. Philippians 4 commends financial offerings as sacrifice (v.18). And Mark 12 tells us that loving God and loving our neighbor are more valuable than burnt offerings (v.33).\nSacrifice looks like submission to God as He renews my heart, mind, words, service—my whole life—to better reflect His perfect character and boundless mercy. I am called to sacrifice my sinful nature, my active temptations, and my selfishness in an ongoing act of worship and praise to God, whose sacrifice alone makes me worthy to stand before Him.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day11-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Deuteronomy 32:3-4, Nehemiah 8:1-12, John 9:13-38",
        "devo_title": "Worship Through Proclamation",
        "devo_summary": "\nBY Guest Writer\n\nFor the record, I’m a pretty good driver. But give me an open stretch of highway heading west into a golden sunset or a dark country road lit by only a glowing harvest moon, and you’ll have reason to worry if you’re in my passenger seat. My focus shifts to the sky. Not only do I linger on the beauty, but I want whoever is riding with me to be deeply moved by it too. “Look at that sky!” I repeat, pointing and craning my neck to see more. “Do you see it?” I ask again, wanting to be sure that my passenger isn’t missing any of the glory. \nIn Reflections on the Psalms, C.S. Lewis said, “I think we delight to praise what we enjoy because the praise not merely expresses but completes the enjoyment; it is its appointed consummation.” Expressing awe and wonder deepens our appreciation, and we are better for it. As Lewis also said, praise is inner-health made audible.\nWe see this life-giving, out-loud pattern of worship throughout Scripture. It starts by recognizing the power and presence of God. Then, we proclaim His goodness to others. In turn, we experience deeper meaning and joy ourselves. \nWe see this in Deuteronomy when we read of Moses, ancient Israel’s prophet and deliverer, proclaiming the greatness of God to all the people. He says, “I will proclaim the LORD’s name. Declare the greatness of our God!” (Deuteronomy 32:3).\nWe hear it in the psalmist’s song of praise in times of both celebration and suffering. He proclaims, “I will bless the LORD at all times; his praise will always be on my lips” (Psalm 34:1).\nIt is good for praise to bubble up from our hearts and for celebration to spill out of our mouths as we proclaim God and His creative work all around us. But, there’s more. This pattern of proclamation deepens as we also give voice to how God has touched us personally. \nIn John 9, Jesus illustrates how God reveals Himself to the world through His personal touch by restoring sight to a man born blind. Neighbors wondered if the one with fresh eyes could really be the blind beggar they had passed on the street year after year. The Jewish leaders, fearing that Jesus was gaining reputation and power among the people, also cast suspicion on the miracle. They interrogated, insulted, and expelled the man from their community. But neither his neighbors’ skepticism nor the Jewish leaders’ intimidation would prevent the healed man from publicly declaring the works and ways of Jesus. He says, “One thing I do know: I was blind, and now I can see!” (v.25). This man had been given new vision and a new story. \nThis is the pattern of proclamation: I recognize that I was once blind, but now I have seen and experienced God’s personal touch and restoration in my life. This causes me to humbly and boldly proclaim His goodness to others, and my joy and wonder deepen as I share my story. \nSo, lean out the window and look again. God is at work all around us and even inside our own lives. Nudge the person next to you and crane your neck to see more. Look at what God is doing! Do you see it? Share the vision, and proclaim the story. We don’t want anyone to miss His glory! \n\nPatti Sauls lives in Nashville, Tennessee, with her husband Scott and daughters, Abby and Ellie, where they serve alongside the people of Christ Presbyterian Church. Prior to living in Nashville, the Sauls planted churches in Kansas City and Saint Louis and served at New York City’s Redeemer Presbyterian Church. A trained speech therapist, Patti also enjoys serving behind the scenes, hiking with friends, and reading good books.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day12-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Hebrews 13:15-16",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nTherefore, through him let us continually offer up to God a sacrifice of praise, that is, the fruit of lips that confess his name. Don’t neglect to do what is good and to share, for God is pleased with such sacrifices.\nHebrews 13:15-16\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day13-1024x1024.jpg"
    },
    {
        "book_title": "In Spirit & in Truth: A Study of Biblical Worship",
        "devo_passages": "Romans 12:1",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a call to worship God in our daily lives. \nTherefore, brothers and sisters, in view of the mercies of God, I urge you to present your bodies as a living sacrifice, holy and pleasing to God; this is your true worship. —Romans 12:1\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/08/SRT-Spirit-And-Truth-Instagram-Day14-819x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Romans 12:3-8, Acts 15:6-21, Galatians 3:27-29",
        "devo_title": "Making Room for Others",
        "devo_summary": "\nBY Raechel Myers\n\nOne evening I was invited to a friend’s house to pray. The agenda was simple enough: eat snacks and mingle, settle in to spend time alone in prayer, then encourage each other. \nI’m not always comfortable with group events, and nine times out of ten I’ll choose a quiet evening at home over a social gathering, especially on a weeknight. But this time I went. Mostly compelled by an opportunity to catch up with some friends and the possibility of a slice of cheesecake, I reassured myself that the tender-heart time wouldn’t last too long. \nSeveral months later, I cannot recall how the food tasted, or what shoes I wore, or how awkward I felt. But I clearly remember how the Lord used that gathering to soften my heart in a very specific way. That night, in the quiet of the solo prayer time, the Holy Spirit impressed upon my heart just two words: make room.\nIn the days that followed, I considered the different ways I could make room: in my heart, on my calendar, in my home. I thought about who I could make room for: the new women moving to our burgeoning city, the people I know who need more than they have to offer, and the guy who definitely eased his way in front of me in line at the concession stand last weekend. But even before any of that, I can make room for my Lord, who promises me His presence whether I take time to be present with Him or not (John 14:16–17). \nAs I penciled down a list, I realized all the ways people had already made room for me: \nHere is my time; it’s yours now. Here is this meal; I want you to be nourished. Here is my forgiveness; I know what a gift it is to be forgiven. Here is this space to sit; I’d rather you have rest than me. Here I am entering into your sorrow, I was comfortable, but you need comfort more than me.\nEven more extravagant than the hospitality offered to me by others is that offered by the Father Himself:\nI was an orphan; He calls me His daughter (John 1:12). I was a foreigner; He made me a citizen (Ephesians 2:19). My sin made me unclean like a leper; He did not cast me out (Ephesians 2:13).\nHospitality, I am learning, is often untidy and almost always inconvenient. But making room is not about my own comfort. It’s about taking something I presume is mine and offering it to someone else. \nJesus made room for everyone, for all types of people—neighbors, the poor, His betrayers, strangers, children, and so many more. It was a mark of His ministry: giving Himself and offering Himself to others and to the Father. Jesus made room because His is a gospel for all people. The apostle Paul writes, “ For those of you who were baptized into Christ have been clothed with Christ. There is no Jew or Greek, slave or free, male and female; since you are all one in Christ Jesus” (Galatians 3:27–28). In the gospel, there is no “other”—there is only “us.”\nBy His grace, God makes us living testimonies of Christ’s life by this truth: “We love because He first loved us” (1 John 4:19). In being inconvenienced and uncomfortable and messy, we find a nearness with God, because Jesus was these things and more on our behalf. We are learning to make room for others, because while we were still sinners, room was made for us.\nThanks be to God.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day1-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Luke 10:25-37, Mark 12:28-34, Romans 13:8-10, Galatians 6:2",
        "devo_title": "Making Room for Your Neighbor",
        "devo_summary": "\nBY Kaitie Stoddard\n\nI’m embarrassed to admit how often I don’t love my neighbor. \nOne of my neighbors is a man who regularly stands on a corner near my house. Pangs of guilt shoot through my heart every time I shift my eyes away from him as I pass by. I have a long list of excuses for my inaction, of course—mind tricks and rationalizations to push away the guilt. It might not be safe to interact… I might enable an addiction… I can’t make a difference anyway. But is ignoring his very existence the way of the gospel? \nWhen asked point-blank to identify the most important commandment, Jesus responded:\n“Love the Lord your God with all your heart, with all your soul, with all your mind,  and with all your strength. The second is, Love your neighbor as yourself.  There is no other command greater than these” (Mark 12:30–31).\nNotice how Jesus snuck two commandments into His answer? With this twofold response, Jesus showed just how interrelated and inseparable these two commandments really are. To truly love God, we must also love people.\nOn our best days, we want to obey Jesus’s command. But if we’re honest, some people are easier to love than others. Maybe they require less sacrifice, they love us back, or they just caught us in a good mood. Whatever our reasons, Jesus challenged this preference and inconsistency: “For if you love those who love you, what reward will you have? Don’t even the tax collectors do the same?” (Matthew 5:46). In other words, don’t expect a gold star for only loving when it’s easy.\nWhen we feel guilty, we often want to justify our actions. When the Holy Spirit whispers to our conscience, we might argue away that sense of conviction by asking, Who really is my neighbor? In the book of Luke, we see a lawyer asking Jesus for clarification on the very same question (Luke 10:29). Jesus responded with the parable of the good Samaritan, a story that still offends our sensibilities, no matter how many times we hear it. Jesus told this parable to show His followers both who they should love and how they should love. The Good Samaritan and the man in the ditch had nothing in common, except for this one important detail: they were both journeying on the same road. For Jesus, that was enough of a reason to stop, to care, to be a neighbor. Anyone in our path—or on our path—is our neighbor, and we are called to love them. \nHow can we possibly love every person we meet? The truth is, in our own strength, we can’t—not perfectly. But the command remains. Scripture tells us that those who are in Christ are able to love because He first loved us (1 John 4:19–20). The life we live and the love we give are by His power and for His glory (Galatians 2:19–20). \nThe Son of God is the ultimate embodiment of the good Samaritan. Jesus left heaven to become one of us (Philippians 2:6–8), to seek us out and meet us in our deepest need, when we were still lying dead in the ditch of our sin (Ephesians 2:1). He left His throne room to rescue us, even to the point of death on a cross. Let us love our neighbors with this same otherworldly love, the love of Christ. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day2-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Deuteronomy 15:11, Proverbs 22:9, 1 Samuel 2:7-8, 1 Timothy 6:17-19, James 2:1-13, 1 John 3:17-20",
        "devo_title": "Making Room for the Poor",
        "devo_summary": "\nBY Kaitlin Wernet\n\nWe dragged a queen-sized mattress from the guest room, which could only mean one thing: showtime. Growing up, my brother and I crafted our best gymnastics routines under the forest green glow of our bonus room. Standing in line, we’d take turns tumbling and toppling to the latest Backstreet Boys hits, the mattress catching our falls. We would practice for hours, gaining confidence with our bounding and landing. Then we’d make a phone call to the neighbor kids, inviting them to our pre-dinnertime performance.\nI should be the first to admit that the show was never great. These were not Olympic backflips and handsprings; we were the somersault-and-YMCA kind of kids. We’d run and flip and run and flip until the audience got bored and decided to show us they could actually do better—and they could do headstands. The thing is, I’ve never been able to do a headstand. My legs are too long and my patience too thin. “Just try it!” the neighborhood kids would say. “You can do it!” they insisted. \nWhen it comes to most things in life—and when we’re talking about how to serve those who are poor—Jesus asks us to do the same: Take the world’s promises and turn them upside down. That’s how you’ll see My promises. In Scripture, we look upside down to see right-side up. Let’s attempt a headstand together: \nThe LORD brings poverty and gives wealth; he humbles and He exalts. He raises the poor from the dust and lifts the needy from the trash heap. He seats them with noblemen and gives them a throne of honor” (1 Samuel 2:7–8).\nMaybe it’s the blood rushing to my head, but I’m seeing in a fresh light all the ways the Lord cares for the poor. He lifts them “from the dust” and gives them “a throne of honor” with noblemen. Do you see what I’m seeing? Not once do these verses mention money. True wealth has nothing to do with our bank accounts; it has to do with the riches of the kingdom that are ours in Christ.\nDoes God use money to help the poor get on their feet or provide them with a warm meal? Yes. Should we serve the poor among us by meeting their physical needs? Absolutely! Scripture tells us this is a non-negotiable (1 John 3:17). The gospel calls for us to make room for the poor in our budgets and in our homes, and to welcome them into the family of God, just as God welcomes us. Regardless of our material wealth or lack, we are all spiritually bankrupt without the lavish love and grace of God given to us in Jesus Christ. \nWhen we think loving the poor is too complicated—if we get bogged down in the logistics, wondering who and how and what, when it comes to our time and resources—we can go to God’s Word for clarity. In his first letter to Timothy, Paul gives us a reminder on how to see things gospel-side up:\nInstruct them to do what is good, to be rich in good works, to be generous and willing to share,  storing up treasure for themselves as a good foundation for the coming age,  so that they may take hold of what is truly life (1 Timothy 6:18–19).\nGenerosity is more than a kind gesture; it is a lifeline that keeps us tethered to what is real, to what is eternal. When we joyfully give our resources to those in need, it reminds us that everything we have is a gift from the God who lifts us from our desperate need by His grace. May we be generous with our time, our homes, our money, as an outpouring of the room that has already been made for us in Christ. Amen.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day3-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Matthew 7:1-5, Matthew 23:37-39, Luke 15:11-32, Luke 18:9-14, Romans 2:1-11, Romans 3:9-23",
        "devo_title": "Making Room for the Self-Righteous",
        "devo_summary": "\nBY Claire Gibson\n\nAs a teenager I was a pretty lousy prodigal. The youngest of three daughters, I had the benefit of watching my sisters’ rebellious moments backfire, and so I learned quickly that the best way to stay in my parents’ good graces was to toe the line. Add to that the fact that we lived at the U.S. Military Academy at West Point, surrounded by structure, discipline, and people who knew how to do things right. Early on, I decided I wanted to be like them. While good leaders might make honest mistakes, they usually don’t blow a bunch of cash partying. They go to college, get good grades, and become generals and senators. \nI applied that same logic to my young Christian faith. I thought if I lived “rightly,” all my dreams would go just as I’d planned. I even claimed Scripture to back me up! (See Proverbs 16:3.) Instead, my self-righteousness grew like a cancer, slow and undetected, hidden by a life focused on pleasing others. \nThere is so much irony in self-righteousness because it is exactly the self-righteous who don’t think they have a problem. That’s why it can be a toxic sin, one that creeps into our lives without our awareness. Today, I find it most apparent in my marriage. When I’m having a bad day, God forbid my husband sneeze too loudly, miss a button on his shirt, or accidentally leave the stove on. I’m quick to point out or dwell on his minor flaws while ignoring the far bigger issue: my critical spirit.\nIn the parable of the prodigal son, the older brother starts a long argument with his father. He was angry and, legally speaking, he probably had a case against his younger brother. But followed to the root, his anger was really a deep-seated resentment. He tells his father, “I have been slaving many years for you” (Luke 15:29). His angry confession reveals that all along, he’d felt bitter about the work his father had asked him to do. He mentions that he’d never had a party thrown in his honor. Deep down, he felt he deserved one, along with the accolades that would surely come with it. \nSelf-righteousness blocks our ability to find joy in the redemption of others. When I’m being self-righteous, I’m far better at calling other people names than I am at naming my own sin. Reading the parable of the prodigal son has never been fun for me because I know I’m the older brother—heart hardened and locked up tight—and I would much rather be the younger brother, who knows he’s in desperate need of forgiveness.\nIn church circles, people often talk about the father running out to meet his son. I’ve heard it told that men in that culture didn’t run; they never picked up their robes, exposing their ankles. What the father did was unabashedly and radically loving. But something I’ve never noticed before was that he didn’t stop there—he didn’t just run out to greet the son who’d been lost and gone astray. The father also sought out his self-righteous son; he looked around and noticed that his eldest was missing from the party. \nThere is hope in the gospel of Jesus Christ, even for self-righteous people like me. Out of His abundant love, the Father comes after us too. There is room for all of us at His table.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day4-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Exodus 23:4-5, Matthew 18:15-20, Luke 6:27-36, John 18:15-18, John 21:15-19, Colossians 3:12-13",
        "devo_title": "Making Room for Your Betrayers",
        "devo_summary": "\nBY Lore Ferguson Wilbert\n\nThis is a true story.\nI invited my enemy to dinner on purpose. There was no applause or great relief or gratefulness on her part. After all, she didn’t know she was my enemy. She didn’t know the words she’d said about me had made their way back to my ears. She didn’t know how wounded I’d felt by her piercing remarks about my life, my home, my personality, and my portion. \nShe didn’t know God had set that table for me in the presence of my enemy. And so, she enjoyed my wine and my bread, my Brussels sprouts with bacon, my perfectly roasted pork tenderloin, and my chocolate brownies, still gooey from the oven and topped with a small dollop of ice cream. She ate it all up and still left my enemy. Months later, more of her words made their way back to me, and I planned another dinner, determined to win her affections, her heart, her repentance, or at least the absence of her criticism.\nThis is a true story, of sorts, but not entirely the way I’ve told it to you. The truer story is that I was the enemy and God was my ever-present and gracious host. Again and again, He laid the feast before me, knowing the wounds of words like mine. Yet He invited me back again, and again, and again. This is the God who loves us.\nI have often thought about the small verse that follows Peter’s first denial: “Now the servants and the officials had made a charcoal fire, because it was cold. They were standing there warming themselves, and Peter was standing with them, warming himself” (John 18:18).\nI think, here was Peter, denying Christ and warming himself by a fire God created. But Peter was not just denying his relationship with Christ. In a way, he was also denying Christ’s divinity. He partook of the hospitality of God in the common grace of warmth on a cold night and then left the fire as if he were God’s enemy. \nWe are no different. \nThere are books aplenty with ideas for dinner parties and table settings, inspirational images and four-course meal plans, but there is no recipe for showing hospitality to those who have cursed you, except one: the imitation of God. With unimaginable hospitality, God creates a feast, and invites all the world—His own creation—to partake of it. He does so in the face of our repeated wrongs done against Him. \nOur gracious God invites His enemies to warm themselves by the fire. He spreads out a table in their presence (Psalm 23:5). He rescues the oxen of those who hate Him (Exodus 23:4–5). He blesses those who curse Him (Luke 6:28)—and on and on. His hospitality knows no bounds. \nThe story I began with is true of me, and it’s true of you too; we were enemies of God (Romans 5:10). But the story is also true in other ways. There are those who have gossiped about me, who have slandered and cursed and wronged me. Yet God invites me to imitate Him. The world says to stop offering grace, to withhold good until it’s deserved. But the gospel saves the best wine for last, and it sets an even finer spread than each and every time before. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day5-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Romans 12:13",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nShare with the Lord’s people who are in need. Practice hospitality. —Romans 12:13 NIV\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day6-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Romans 15:5-6",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nIn this study of hospitality we will memorize Romans 15:5–7, a passage that focuses on glorifying God and living in harmony with one another. We will start by memorizing verses 5–6.\nMay the God of endurance and encouragement grant you to live in such harmony with one another, in accord with Christ Jesus, that together you may with one voice glorify the God and Father of our Lord Jesus Christ.  —Romans 15:5–6 ESV\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/4-MakingRoom2019-1-576x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Isaiah 1:17, Psalm 68:4-6, John 14:15-18, 1 Timothy 5:3-16, James 1:27",
        "devo_title": "Making Room for Widows and Orphans",
        "devo_summary": "\nBY Rebecca Faires\n\nThe first day I met Gus, he screamed at me. I had lived a quiet life up until that point, and I had never heard screaming like this before. I myself have screamed at swim meets, at being tickled, while riding on roller coasters—but never like this. Gus’s screams terrified me. His eyes were far away and unreasoning. It was like all the unknown in him rushed out of his mouth and straight at me. I wanted to run away from him and back to my quiet life. But I couldn’t run because Gus was going to be my son, and the paperwork was already at the Embassy in Ethiopia. What was I going to do—chicken out because he’s loud?\nIf we were together and you cared to hear, I would tell you about our adoption of two baby boys from Africa, and how they scared the curse words out of me. (They still scare the horse apples out of me sometimes.) And I would tell you that God has been so gracious and redemptive in our lives. But that’s a long story. So let’s just talk about loving people we are afraid to love, people who maybe scare us because they come from a different place. Honestly, it scares me to love people who are not like me, but it turns out, gospel love isn’t about me anyway. It’s about Jesus and how He loves.\nHospitality is uncomfortable. There are people who make me want to run. To a certain degree, we all like a quiet, settled life. I mean, it’s easier to remain comfy and contented with the people we’re used to, rather than to engage with those we don’t know anything about. It can feel awkward, even risky, reaching out to people who are different, whose lives seem so dissimilar to our own. \nThis is the heart of hospitality: finding people on the margins and bringing them in. Remember in Psalm 68, David praises the Lord because He “provides homes for those who are deserted” (v.6). “He defends the rights of the fatherless” (Isaiah 1:17). But this hospitality extends well beyond adoption or caring for widows. God has given us so many ways to reach out to the solitary, those who’ve been deserted.\nThe first step to hospitality is one of obedience: we must bring people in. This obedience helps us form soup kitchens, deliver casseroles, care for widows and orphans, and welcome people into our homes. But this is only the first step. Because once we have invited people in, we are called to love them the way Christ loved us. \nIn the book of Zephaniah we see this exquisite mystery:\nThe LORD your God is among you, a warrior who saves. He will rejoice over you with gladness. He will be quiet in his love. He will delight in you with singing (Zephaniah 3:17).\nOur heavenly Father rejoices over us with singing! And because we are called to imitate Christ, we can’t just stop at going through the motions and serving folks soup once a year or when convenient. We are called to rejoice over others with singing; to love them. \nMaking this jump on our own is impossible. The only way to change our hearts is to submit them to Christ. Pray with me today that God would teach us hospitality toward widows and orphans and all those on the margins—and not only hospitality, but love.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day8-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Leviticus 19:34, Ruth 2:5-12, Matthew 25:35-36, John 4:1-26, Acts 16:6-10",
        "devo_title": "Making Room for the Stranger",
        "devo_summary": "\nBY Claire Gibson\n\nMy husband and I moved into a new house last summer—well, a new house to us, at least. In fact, it is a very old house, full of drafty windows and narrow stairs, but all those quirks were glossed over with stainless steel appliances, fresh paint, and marble countertops. For us, part of the appeal was extra space to share, but we had no idea how quickly the need would arise. \nWe hadn’t finished unpacking when we learned that a missionary family from Spain needed a place to live for a month. Not knowing who they were or how much English they spoke, we agreed, then hurried to set up a bed and buy some extra towels for the guest bathroom. \nThe couple arrived a few days later with their 18-month-old son, who had bright blonde hair and a gap-toothed grin. I had only a few semesters of high school Spanish under my belt, but after just a few days, through smiles and hugs and the heavy use of words like gracias, Rebecca and I had become fast friends. We communicated with a mix of Spanglish and charades, soon sharing some of our deepest heartaches and joys, even though we only had the shared vocabulary of kindergarteners. It’s amazing the connection God can forge between strangers. \nI love that we serve a God who shows no favoritism (Romans 2:11). In a society where women were ostracized, Jesus frequently addressed women directly, talking to them about their most intimate fears and sins. He had no concern for His own reputation. He saw no difference between rich and poor, able-bodied and lame. Jesus made room for everyone. This makes me wonder, Is it possible that there is no such thing as a stranger? Is it possible that all the boundaries we draw are invisible? Is it possible that the lines of language and skin color and difference are passing away? \nIt was fun and exciting to welcome a family from Spain into our home. But as I read these verses of Scripture, I’m struck by how much harder it is for me to welcome in those “close” strangers who are a regular part of my life. The sister-in-law who doesn’t quite fit in. The mother who doesn’t live up to my needs or expectations. Sometimes emotional boundary lines are harder to cross than oceans. Yet, God is with us as we welcome those strangers too. He blesses our feeble efforts. He is with us when our patience wears out. He repairs the damage of lost years, and He quiets us with His love. \nAs Christians, it can be easy to isolate ourselves from the world. But God has shown us that this world is not our home. We, too, are foreigners in a strange land, living here only for a short while before passing on to our permanent address with the Lord. \nWe, of all people, can afford to open our homes to the stranger, the ostracized, the forgotten. “For our momentary light affliction is producing for us an absolutely incomparable eternal weight of glory” (2 Corinthians 4:17).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day9-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Psalm 139:13-16, Proverbs 17:6, Matthew 18:1-6, Matthew 19:14, Matthew 21:14-16, Mark 10:13-16, Ephesians 6:1-4",
        "devo_title": "Making Room for Children",
        "devo_summary": "\nBY Kaitlin Wernet\n\n“Mama, I feel like I’m upside down in a cornfield!” \nMaybe this is something commonly heard in motherhood, but since I’ve yet to become a mother, I wouldn’t know. Hopefully, you’re just as confused as I was when I woke up to this statement in the middle of the night. I rubbed my eyes in confusion, as it took a minute to regain my bearings and remember exactly where I was—at the beach, with one of my best friends and her three children. \nIt was their annual beach vacation, and I’d said yes last-minute to hopping in the minivan for a few days of saltwater and sunshine before the rest of the family arrived. I didn’t have to be a mother to know that a seven-hour road trip with three kids is some kind of miracle. Ours was completed with only one short episode of crying and one small snack-spilling incident. Victorious, we’d tossed aside our sandals and rolled up our jeans at the first sight of ocean. We splashed around in the dark until we could barely keep our eyes open. \nOur cozy hotel room was filled with baby snuggles and loud giggles. It was a world away from my quiet apartment at home, and I loved making room for every sweet moment. I was letting the little children come to me and received cuteness and cuddles—a serious benefit—in return. But upon waking up in the middle of the night, the scene was a little different.\nA flipped lightswitch signaled that the “upside down in a cornfield” child was awake and not dreaming. Her tiny whimper and the worried look on her mama’s face confirmed the girl’s sudden sickness and strange hallucination. Their hurried footsteps headed for the bathroom, where baby brother’s travel crib was still blocking the toilet. That’s when I remembered that I’d been sharing a water bottle with the sweet, sickly child all day long, which meant I was probably halfway to a “cornfield” myself. \nSmall things sometimes turn out to be the most significant and, well, contagious—especially when they have hearts that beat like yours and mine. Making room for children is hard because we never stop being children ourselves. We never stop needing our Father. We struggle to make room even for ourselves, only to see that He already has, again and again. \nThis is why it’s important to make room for the children tugging on our shirts and hanging on our legs even—especially—if they aren’t living in our homes. The parent-child relationship is one of the most prevalent themes in Scripture. Shouldn’t it be one of the most prevalent themes in our lives? We should care for these little ones Jesus loves so dearly. Even when it means getting messy. Even when it means waking up in the middle of the night. Even when it means being upside down in a cornfield. \nIsn’t that what He does for us? God knew us when we were formless (Psalm 139:16). He prepared praise from our mouths as infants (Matthew 21:16). He asks us simply to come to Him (Matthew 19:14). May we do the same for others, especially when they are small, for they are not small to Him. Amen.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day10-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Psalm 133:1, Malachi 2:10, John 13:35, Acts 4:32, Romans 8:15–17, 1 Corinthians 12:4–11, Ephesians 3:8–10, Colossians 3:12–17",
        "devo_title": "Making Room for the Church",
        "devo_summary": "\nBY Erin Davis\n\nNow the full number of those who believed were of one heart and soul,  and no one said that any of the things that belonged to him was his own,  but they had everything in common (Acts 4:32).\nThis verse sure feels warm and fuzzy. It’s easy to romanticize the friendships in the early church. But the reality of our own relationships surely lifts the veil. What is true for us must also have been true for them: authentic community takes work. \nMind if I make a confession? I spent most of my adult life trying to live without intimate Christian friendship. It was too uncomfortable for me, too messy. The investment didn’t seem to match the payout. But living life outside the circle was like being a fish in a bowl: I could survive, but I sure didn’t thrive. My patient, loving, imperfect friends have pulled me out into deeper waters again and again. \nI used to think this verse from Acts 4 meant the church shared all their “stuff.” Maybe they rotated the ancient equivalent of lawn mowers and weed eaters, or pooled their money to get a better rate at the fish market. There may have been an element of that, but I’m now convinced they had more than stuff in common. \nThey shared their gifts, recognizing that spiritual gifts are given by God “for the common good” (1 Corinthians 12:4–11). \nThey shared the hope of glory, recognizing that we’ve been adopted into the same family by the will of the Father (Romans 8:15–17). \nThey shared a calling, recognizing that we can spend our lives building little, individual kingdoms, destined to pass away, or we can join forces to join God in working on the only kingdom promised to stand forever (2 Samuel 7:16). \nIf the church in Acts was anything like my community of friends, the people there shared their burdens too. When the weight of hurt or disappointment or rejection becomes too heavy for one of us to carry, we lay it down, knowing someone else in the circle will pick it up. \nJust this week, I was hauling a load of heartache so big I worried it might bury me. My friends stepped in and said, “Let us carry this with you.” My circumstances didn’t change, my heart didn’t instantly mend, but I could stand up straight again. When life knocked me down, these friends picked me up. This, too, is a picture of hospitality. The way we in the Church respond to each other in the toughest of times shoots up a flare. It tells a watching world that we are broken and busy people, eternally bound together with the unbreakable chord of Christ’s love. “By this everyone will know that we are [His] disciples, if [we] love one another” (John 13:35).\nYes, hospitality is worth extending because of the benefits it affords us, but there’s a bigger story being told. Jesus knows we’re His disciples based on the evidence found in our hearts. The world knows we’re His disciples based on the evidence found in our homes. It doesn’t matter if our houses are big enough, if our floors are clean enough, if our cooking skills are accomplished enough—we should show hospitality anyway. Our hearts and lives are messy. But when we open our doors and our arms, we’re telling the story of Christ’s love.\nIf you’re living in a fishbowl, gulping and gasping for air, allow hospitality to pull you into deeper waters. Because it’s not just about gathering; it’s about giving. It’s not about neat and tidy; it’s about the poor and needy. It’s not about you. It’s about Christ and His Church. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day11-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Psalm 25:3, Psalm 28:6-9, Jonah 3:1-10, Luke 19:1-10, Acts 9:17-31, 1 Peter 2:9",
        "devo_title": "Making Room for the Lost Cause",
        "devo_summary": "\nBY Rebecca Faires\n\n“Everybody, even the worst stinker on earth, is somebody for whom Christ died.”  – Robert Farrar Capon\nI know so many stinkers. I bet you do too. The question of what to do about someone who seems like a lost cause is, frankly, often on my mind. I knew some real stinkers even when I was in middle school, and during those years I was very committed to reading The Lord of the Rings. All those years ago, dressed in my mithril shirt, clutching my sword of Gondor, and nibbling on lembas bread, I discovered the stinker to beat them all: Gollum. \nOriginally, he was just a normal hobbit, until he fell into some bad circumstances (found a dangerous object) and made some bad choices (murdered his cousin) that conspired to turn him into the wretched creature we all know as Gollum. Most of the “lost causes” I know got that way because of similar reasons: an unfortunate combination of bad choices and bad circumstances. \nThat instinct to be free of a “lost cause” is something many of us share, although we aren’t inclined to admit it. But, man, remember how Saul persecuted the church, and stood by, complicit, at the stoning of Stephen (Acts 7:54–66)? God picked Saul up, turned him around one hundred and eighty degrees, and sent him in the other direction with instructions to proclaim Jesus as the Son of God (Acts 9:20). God wasn’t done with Saul; He had a whole new life in store for him as Paul, follower of Jesus.\nThe story of Zacchaeus is similar, though instead of being a zealous Pharisee, Zacchaeus was a rich and “sinful” man (Luke 19:1–2,7). But like Paul, Zacchaeus repented when he met Christ (Luke 19:5–6). Both Paul and Zacchaeus turned from their old way of life, not because they sought Christ on their own, but because they were called to Him. The change in their lives didn’t happen because they were fed up with life and focused all their gumption toward making themselves better human beings. It was God who called them to Himself.\nIf you are a Christian today, it’s not because you are a better or more disciplined person than your “lost cause.” It is because of “the One who called you out of darkness into His marvelous light” (1 Peter 2:9). He calls us. He changes us. It is He who makes the difference in the lives of the broken, the stubborn, the sneaky, the exhausting, the terrifying, and the unlovely. \nWhat do we do in the meantime? If it’s all up to God, does that get me off the hook? I would be so happy to go back to my second breakfast and let God deal with His own invitations to stinkers. Jonah definitely felt the same way: Good riddance, Nineveh, you bunch of eye-gougers! (Jonah 3:1–3; 4:1–3, my summation and paraphrase). Then God had to call both Jonah and Nineveh to obedience; He called Nineveh to repent and Jonah to deliver His message of repentance.\nAnd there it is. God does the calling. God does the changing. We are called to pray and walk in obedience, even if our steps are slow. \nWe don’t know the exact end of the story. In spite of how much I wanted Gollum to be shoved off a cliff and go away already, at the end of The Lord of the Rings, he was necessary to save the whole world. Even the most seemingly hopeless case may still have a part to play. The gospel urges us not to give up, but instead to hope continually in quiet obedience.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day12-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Matthew 25:35",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nFor I was hungry and you gave me food, I was thirsty and you gave me drink, I was a stranger and you welcomed me. —Matthew 25:35 ESV\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/SRT-MakingRoom2019-Instagram-Day13-1024x1024.jpg"
    },
    {
        "book_title": "Making Room: A Study of Biblical Hospitality",
        "devo_passages": "Romans 15:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nMemorizing Scripture is one of the best ways to carry God-breathed truth, instruction, and reproof wherever we go. \nIn this study of hospitality we are memorizing Romans 15:5–7, a passage that focuses on glorifying God and living in harmony with one another. This week we will memorize verse 7. \nTherefore welcome one another as Christ has welcomed you, for the glory of God. —Romans 15:7 ESV \nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/05/4-MakingRoom2019-2-576x1024.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Galatians 5:16-26, John 14:15-26, Acts 1:4-8, Acts 2:37-39",
        "devo_title": "The Fruit Of The Spirit",
        "devo_summary": "\nBY Amanda Bible Williams\n\nHaircut days are some of the best days.\n\nI love sitting in the chair, making small talk with my stylist-turned-friend and knowing that, when I stand to leave, my hair will be better for the time I spent with her. I have no problem showing up with a dirty bun piled high on my head, no issue relinquishing creative control while we chat. I am perfectly willing to come as I am and let her do the work. We have a relationship, she and I, and I trust her to do magical things with my wayward locks. Seeing as how she is the professional and I am not, barging into our appointment and taking control of the scissors would be a bad move on my part. Trying to commandeer a process I don’t fully understand would not only be silly, it would have unfortunate and unsightly consequences. (My one and only attempt at a self bang-trim was sufficient proof of this.)\nMy hair stylist, though lovely, is not the Holy Spirit, so the metaphor only goes so far. But as I read today’s text, it’s clear the Me who seeks to be a fruit-bearer for the Kingdom could stand to take a few tips from the Me who sat in the salon chair two days ago. I don’t want to insist on creating my own goodness; I want to learn the art of trusting the only One who is truly good.  \nIn his letter to the Galatians, the Apostle Paul states the clear contrast between our rotten, self-made fruit and the good, God-made and God-pleasing fruit of the Holy Spirit:\nNow the works of the flesh are obvious: sexual immorality, moral impurity, promiscuity, idolatry, sorcery, hatreds, strife, jealousy, outbursts of anger, selfish ambitions, dissensions, factions, envy, drunkenness, carousing, and anything similar. I tell you about these things in advance—as I told you before—that those who practice such things will not inherit the kingdom of God.\nBut the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faith, gentleness, self-control. Against such things there is no law.\n(Galatians 5:19-23, HCSB)\nUntil we repent of our sinfulness and lean wholly on the perfection of Jesus, we humans remain stuck in the cycle of that first list, powerless to break free. Even works of flesh we believers call “good” cannot gain us entrance to the Kingdom of God. But when we call out to Christ for salvation, we receive mercy, forgiveness, and freedom—and we receive the Holy Spirit, a gift promised by Christ Himself.\nTake a look at John 14:15, when Jesus issues His disciples a tall yet serious order: “If you love Me, you will keep My commands.” Easier said than done, they may have thought. But Jesus doesn’t stop there; He explains how they are to keep His commands. This is more than a to-do—this is His Spirit at work in them!\n “I will ask the Father, and He will give you another Counselor to be with you forever. \nHe is the Spirit of truth… I have spoken these things to you while I remain with you. But the Counselor, the Holy Spirit—the Father will send Him in My name—will teach you all things and remind you of everything I have told you.”\n(John 14:16-17, 26)\nJesus knows us all the way through. He knows our forgetful hearts. And in His grace He leaves His very Spirit to be our helper, our comforter, our advocate. This is Christ’s gift to us, the far-off ones, bringing and keeping us close to God—not a “reach out and touch you” kind of close, but closer still. As close as our own breath is the Spirit of Christ to us. That is not mere hope or speculation, that is a promise from God’s Word! (See Romans 8:9-11.)  \nFriends, those good things Paul lists in Galatians 5:22-23 are not borne of our best efforts. The fruit of the Spirit is borne only of the Spirit. Only by abiding in Him, resting in His goodness and trusting Him to do the hard work of redemption on our behalf, can we bear fruit. \nAs we begin these 12 days of discovering the Spirit’s fruit as presented in Scripture, let’s repent of every bit of goodness we’ve tried to squeeze out on our own. Let’s lay down the fruit we’ve tried to produce with good intention, self improvement and striving, and let’s see God as the source of everything good. May we hide and abide in the perfect life and love of Christ.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram1.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "John 13:34-35, 1 Corinthians 13:1-13, 1 John 4:7-19",
        "devo_title": "Love",
        "devo_summary": "\nBY Kaitlin Wernet\n\nSaturdays were pancake days. Regardless of what activities the day held, it always began with batter and blueberries.\n\nI would come down the stairs mid-morning, always last and always late. Sometimes we had additional guests, phone call interruptions or fluctuating appetites, but the scene was always the same:\nI knew my brother would want milk, and seconds.\nHe knew I wouldn’t be mad if he used all of the syrup.\nI knew my dad would request coffee first, pancakes later.\nHe knew I would eat the most blueberries.\nI knew my mom would mention how my Papa used to call them ‘hotcakes.’\nShe knew I would want to flip the “pancakes, not hotcakes!” myself.\nThey all knew not to talk to me before 8 am.\nOne night I sleepily told my mom, “I love you more than blueberry pancakes!,” because in my opinion, there was nothing better. We began using the phrase frequently and, although I  outgrew my small plate, twin-sized bed and eventually my quaint hometown, I would never outgrow this phrase that said I miss you, I love you, I can’t wait to see you again, and I’ll always be there, all in one.\n“Love you!”, my mom texted to me on my first night in my college dorm. “Love you more than blueberry pancakes!”, I replied. I knew I was trading pancake Saturdays for dining hall delicacies (I was clearly mislead), but the thought made me look forward to the next time I’d be home with my mom and her mixing bowls. It tasted even better in my mind than in my mouth.\nBefore you think I’m leading you to measure your love in terms of actual fruit, look again at the end of 1 Corinthians 13, where Paul is also looking forward to something:\nFor now we see only a reflection as in a mirror; then we shall see face to face. Now I know in part; then I shall know fully, even as I am fully known.\n-1 Corinthians 13:12\nDoes anyone’s heart LEAP and get crazy excited about heaven when you hear this? Me too, me too!\nThe type of love we are given as a fruit of the Spirit is agape love, which is a goodwill, benevolent, brotherly kind of affection. In fact, one of the most well-known passages about love—1 Corinthians 13—concludes with Paul’s beckoning description of heaven, and I don’t think that’s a coincidence.\nFriends, the love of Christ in us makes us a sisterhood joined by the heart-leaping hope of Heaven. This love—an earthly display of eternal perfection—is the essence of Jesus’ life, death and resurrection. And, it is ours as a gift! His love for us fuels our love of others while we await our great going Home. \nIn his book The Four Loves, C.S. Lewis says that loving others as ourselves “is an image, a foretaste of what we must become to all if Love Himself rules in us without a rival.” Love is the result of God in us. We truly do love because He first loved us. This love is viewing others through a heavenly lens, a God-given tool to fasten our heart strings to the hope of Glory.\nWe are a family standing in the waiting room of Fully Known, determined to exchange a foretaste of what’s to come. And so, whether it be through words, actions or pancakes, may our love always be a result of Jesus’ love for us—a reminder that we are His.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram2.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Psalm 16:1-11, Psalm 43:3-4, John 16:19-24, James 1:2-4",
        "devo_title": "Joy",
        "devo_summary": "\nBY Guest Writer\n\nThis spring has been one of the rougher seasons for our family. We’re coming off 12 weeks (yes, 3 months) of solid illness and injury, and I’m figuratively and literally limping to the finish line. An examination of my googling history tells the story. I’ve searched everything from “Benadryl dosages for itchy kids” to “physical therapists for herniated disc,” “rare skin rashes” to “do the terrible twos automatically end on the third birthday?” (I’m still holding out hope on that last one.)\n\nSo when asked to share about joy today, I admittedly lifted my still sinus-infected head to the heavens and said, “Really, God?! You’re giving me joy?” I confess that lately my life has felt, in a word, joyless.\nI’ve done all the “joy capturing” exercises in an attempt to shape up. I’ve made the gratitude lists, numbering those things that give me moments of happiness in my day: matcha lattes, husband-emptied dishwashers, YouTube videos of pets underestimating the distance from the coffee table to the couch. I’ve searched so hard to see every blessing in my life and my present circumstances. And yet, amid grief and hardship and hurts, I come up short.\nIt turns out joy is kinda like the car keys that slipped between the cushions of my favorite easy chair—I’m looking for it in all the wrong places.\nTrue joy is not something that can be conjured up or willed. Joy exists apart from our control—we simply choose whether or not to enter in. Joy, the Psalmist tells us, is given in God’s presence. It will never end, never fall short, never disappoint (Psalm 16:11).\nJoy is not momentary pleasure—it is the deep and lasting condition of our relationship with God this world cannot steal away. Christ tells us, “Now is your time of grief, but I will see you again and you will rejoice, and no one will take away your joy” (John 16:22, NIV).\nMy exercises of gratitude for things of this world cannot produce because joy is not a fruit of our work, our circumstances or ourselves. Joy is a fruit of God’s Spirit. It is a manifestation of who He is, a result of the heart-transforming power of Jesus Christ in us.\nWe are commanded time and time again in Scripture to “rejoice,” “be joyful” and even consider trials as “pure joy.” Why? Because Jesus is always, always worthy of our rejoicing. If we label our lives as joyless, it is due to our misplaced hope and pleasure in things of the world rather than the joy of our salvation.\nSo, I have a new joy exercise plan. I will admit the wrong places, albeit sometimes good places (my family, my work, my community), where I am looking for joy and surrender them to God. I will ask the Holy Spirit to bear the fruit of joy in my life with the prayer, “Lord, remind me of the joy I have because of what You have done!” I will—joyfully!—look to His Word and rest in His promises.\nThen I will hit my knees, bow my still sinus-infected head and pray, Really, God. YOU are my joy. \nFor you, O Lord, have made me glad by your work;\nat the works of your hands I sing for joy.\n– Psalm 92:4, ESV\nSarah Matheny is an ever-growing, ever-changing gal, laughing and living in the Pacific Northwest. One-time attorney, food blogger, and author, all-the-time wife and mom to three wild-eyed, spunky girly girls, she’s passionate about her family, her friends and growing in her walk with Christ as He dishes up an always unpredictable, but totally delicious life.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram3.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Psalm 34:13-14, John 14:27, Philippians 4:5-7, James 3:16-18",
        "devo_title": "Peace",
        "devo_summary": "\nBY Rebecca Faires\n\nI have one really firm rule in my house: only one person can cry at a time.\n\nWe have a few caveats.\nNumber One: If someone is already crying, you can’t add in your four choruses of the sob serenade until the first cryer is finished.\nNumber Two: The youngest cryer gets precedence, so if you are crying and someone younger than you begins to cry, you just have to dry up until the baby stops crying, at which time you may resume.\nNumber Three: It’s all hands on deck to help the youngest stop crying.\nBelieve it or not, this actually kind of works. Until it doesn’t. I instituted this rule years ago because I was DYING for peace in my home. We had four kids under four, which means so much poop and crying.\nUnfortunately the key to peace isn’t just keeping the volume and stink at bay, though I wish it were that simple. It’s easier for me to work on the behavior of my children or the condition of my home than to look at the state of my own heart.\nDo you ever find yourself sitting cross-legged on the floor of your life, looking around at all the screaming pieces and groaning, “I just want peace”? I do this all the time.\nIt’s hard for me to admit my version of peace isn’t actually real peace. My version of peace is everything under control, my control—books alphabetized and noses wiped. True peace is a soul rightly aligned with the way of Christ.\nBut, goodness, alignment of my soul to Christ sounds pretty heady for a girl who is typing one-handed while nursing a baby who is triumphantly filling his diaper. I don’t know a lot about peace or alignment. Thankfully, we have God’s Word to consult on the subject! James says, “a harvest of righteousness is sown in peace by those who make peace” (James 3:18 ESV). That sounds SO GOOD! I want to sow seeds of peace and reap giant peace gourds and watermelons! I want to arrive at harvest time to a whole heap of peace.\nI think James is saying that our daily, quiet acts of peace—listening to someone who is super needy, emptying the dishwasher when it’s not our turn, letting someone else win—gently nudge our souls into alignment with the peace of Christ.\nAnd then, when our little boats are sailing in the wake of His ship, we see how wayward and wobbly our course is, how imperfectly and poorly we make peace. But we also see how great is the wake of Christ. It hems in our feeble steering. The closer we draw to Him, the more we see that peace is not something we make. Rather, Christ’s peace He gives to us, not as the world gives it.\nToday—when you wrangle your loud baby-blessing, when you can’t see over the pile of bills, or when your friends don’t make any sense—let your strivings fall away and breathe in the peace of Christ, because He promises, “Peace I leave with you; my peace I give to you.”\n\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram4.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Romans 8:19-25, Galatians 6:9, James 5:7-11",
        "devo_title": "Patience",
        "devo_summary": "\nBY Andrea Lucado\n\nWhen I see the word patience listed in Galatians 5 with the other fruit of the spirit, I groan. I’m reading happily along with love, joy and peace, and then… patience. Ugh, I say to myself. I know I’m not patient. Just watch me try to fold a fitted sheet.\n\nTemper tantrums, waiting, inconvenience—this is what I think of when I think about the word patience. But patience, as talked about in the Bible, is much more than remaining calm in the midst of fitted-sheet frustration.\nTake the new believers in the book of James as an example. These people were Jews recently converted to Christianity. Because of their new beliefs, they were rejected by their own people. Their own families. They were persecuted by everyone around them, and James tells them to do what? “You also must be patient,” he says. “Strengthen your hearts because the Lord’s coming is near” (James 5:8 HCSB).\nThe Greek word often for used for patience in Scripture is makrothyemia, which means… well, it means words that make me uncomfortable, such as:\nLongsuffering\nSlowness in avenging wrongs\nSteadfastness\nForbearance\nPatience is much deeper than something you practice when someone is hogging the bathroom. Patience—the longsuffering kind of patience—is something that arises when real trial strikes.\nA few months ago my own longsuffering was tested. I went through a period of anxiety like I had never experienced before. It landed on me heavy, like a weight, and didn’t leave for a few months. Small, daily tasks felt almost impossible. My thoughts turned dark. I shouldn’t be feeling this way, I told myself. I’m on the cusp of a new career and a new relationship. Things are going well! Yet, I woke up and went to sleep exhausted, anxious, sad, and weary.\nI would like to say that in this dark time I turned to God and said, “I trust you. I don’t understand what’s happening, but you do.” I wish I could tell you I did that, but no. Instead, I shook my fist, and I shook it hard. I was angry at God, and I tried desperately to escape the anxiety and darkness by my own means.\nYou could say I was the opposite of longsuffering. I was short-suffering, tiny-suffering, microscopic-suffering. I realized in those few months that my pain threshold is nearly nonexistent and, even still, I know most of you reading this have weathered much worse. My life was not bearing the fruit of patience because somewhere deep down inside of me I didn’t trust my God. And somewhere even deeper inside of me, I had lost hope and convinced myself I was alone.\nBut there’s an amazing thing about the word longsuffering in the New Testament: it is almost always an instruction given in the context of hope.\nRomans 8 says, “For we know that the whole creation has been groaning together with labor pains until now… We ourselves who have the Spirit as the firstfruits—we also groan within ourselves, eagerly waiting for adoption, the redemption of our bodies” (vv. 22-23 HCSB).\nAnd in Galatians 6:9, we’re told, “We must not get tired of doing good, for we will reap at the proper time if we don’t give up” (HCSB).\nWE groan. WE don’t give up. I love that word “we” because it means we are not in this suffering thing alone. Better still, we do not wait without hope! As Matthew Henry says, we can look at our circumstances “with an eye to a future glorious recompense: Be patient to the coming of the Lord.”\nWe do not wait in vain. We wait for our God—the God who has promised and secured our full redemption through Jesus Christ.\nUltimately, it was my community who pulled me out of the dark time. They reminded me of who God is and who I am in Him. They reminded me of His love, and after a while my anger dissipated into something that looked a little more like patience, a little more like longsuffering.\nMay we do the same for each other in the face of our trials. Let’s longsuffer (yes, I made this a verb) together. Let’s look at our lives with an eye to a future glorious day when suffering is but a long, forgotten memory of this earth.\n \nAndrea Lucado is a freelance writer and Texas native who now calls Nashville, Tennessee, home. When she is not conducting interviews or writing stories, you can find her laughing with friends at a coffee shop, running the hills of Nashville, or creating yet another nearly edible baking creation in her kitchen. One of these days she’ll get the recipe right.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram5.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Luke 6:35-36, Ephesians 4:25-32, Colossians 3:12-13",
        "devo_title": "Kindness",
        "devo_summary": "\nBY Hayley Morgan\n\nThese days we talk about random acts of kindness and “paying it forward” like we’re running some sort of karmic racket, doing good things as a way to score more points for the Nice Team. But kindness as a fruit of the Holy Spirit has less to do with the good deeds of our outer lives and more to do with the posture of our inner lives.\n\nBiblical kindness is an outward fruit of the inward work of the Spirit. We are kind as a way of being more than a way of doing.\nI have a friend who is always unnecessarily kind to me. She shows me more mercy than I can imagine. She believes the best of me and she hopes for more of Jesus in my life. She suffers through not-so-pleasant times in our friendship for the sake God’s glory and our good. Her kindness to me mirrors the kindness of Christ.\nThe Greek word for kindness used in Galatians 5 is chrēstotēs, which means “moral goodness” and “benignity.” Benignity means bringing a person no harm. Christ uses the root of this word chrēstos in Matthew 11:30, when He says His “yoke is easy”—meaning, it doesn’t needlessly burden.\nWe also know from Scripture that being kind is much more powerful than just being nice. Romans 2:4 tells us that God’s kindness leads us to repentance. In other words, kindness has the power to transform. It is not weak, it does not ignore, it does push things under the rug. Kindness can change our own lives and the lives of those we love. In Ephesians 4:32, we are commanded to be kind and compassionate to each other, forgiving others just as God has forgiven us. It is this forgiveness from God—and the indwelling of the Holy Spirit in us—that prompts our kindness to others. Think of our kindness as a sort of through-line for God’s goodness to us. We have the privilege of pouring out that kindness from the Holy Spirit to others! We get to mirror the kindness of Christ, kindness that leads to life-changing repentance.\nThe Christlike kindness my dear friend shows to me is not simple. It requires abiding in the Source, yielding to the Spirit, and submitting to the Heavenly Father. But, as a result of her obedience, I feel unconditionally accepted. I know, by God’s grace, she never means me harm or burden me with a mantle that isn’t mine to bear.\nIn a world where kindness is often used as a tool for getting ahead, it’s incredibly comforting to encounter those people who embody biblical kindness. Will we be those people today? The fruit of kindness is proof of the Holy Spirit’s good work in our hearts. It is powerful to change lives by pointing others to Jesus, the true Source of everything good.\n\nWhat could be sweeter than that?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram6.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Galatians 5:22-23",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nWe believe memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen the verses at the center of our study of the fruit of the Spirit:\nBut the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law. \n– Galatians 5:22-23, NASB\nWrite this verse down—copy it twenty times if that helps! Post it on your mirror or at your desk, in your car or on the fridge—anywhere you’ll see it often. Save the image below as your phone’s lock screen so you can read these words of truth throughout the day.\nWe want to be a community that is intentional about scripture memorization. Will you join us?\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/4-galatians-5-22.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Psalm 23:1-6, Psalm 31:19, Matthew 12:33-37, Ephesians 5:6-10",
        "devo_title": "Goodness",
        "devo_summary": "\nBY Raechel Myers\n\nI was always a good kid.\n\nAsk my parents and I think they’d tell you, I was a joy of a daughter to raise. (Tell ‘em, Mom!) I never really gave any trouble when it came to boys, I had absolutely no interest in the shenanigans of drugs or alcohol, I was an excellent student, great friend, medium athlete and a conscientious includer of people. When we studied the fruit of the Spirit in my high school theology class, “goodness” was one of those fruits I was pretty sure I was nailing—no Spirit necessary for this one, thankyouverymuch. Being good was easy! Just look at how impressive I was!\nAh, the overconfidence of youth. I remember sitting up late one night on our senior class trip to Florida, riding shotgun with the bus driver while the rest of the class slept. We barreled down the highway somewhere between Toledo and Orlando while I flapped my adorable jaw about how I knew everything there was to know about God and the Bible. After twelve years of private Christian education, I really saw no need for further study of Scripture or pursuit of additional spiritual instruction. I was relatively confident graduation would procure for me both a high school diploma and my own personal sanctification certificate, all in one march across the stage.\nDarkness.\nI was in spiritual darkness. Not because my life showed all the signs of rebellion and bad news, but because my soul had no need for a Savior, or so it thought. I assumed I had saved myself through years of right answers and right behavior. But at 18 years old, my goodness wasn’t enough to save me—it was actually separating me from Christ.\nThe bus driver that night didn’t tell me all the hundred ways I’d gotten it wrong or laugh me off the bus. It was worse than that—he wasn’t impressed by me. In the honesty of that moment, just two people and a whole lot of highway, all the words I’d served him didn’t return the usual, “Wow, you’re such a great kid!” that I was used to. Instead, he looked concerned. That was new and puzzling for the good girl accustomed to good reviews. We sat quietly after that—me, the bus driver and the Holy Spirit. And God was at work in my “good”/dark heart, revealing a need for Him I’d honestly never noticed before.\nIt turns out, God wasn’t impressed by me either. The act of goodness, kindness, self-control and so-on that I had perfected (and was sure would save me) was the very thing of which I needed to repent. My acts of righteousness were exactly the bad fruit Jesus warns us about in Matthew 12—produced from the upside down heart of a girl who thought her behavior made her a believer.\nSlowly but surely, in the days and months following that night on the bus, the Holy Spirit gave me eyes to see that God wasn’t commanding me to bear fruit to begin with—fruit-bearing was the job of the Holy Spirit. Rather, God was beckoning me to abide in His presence, like Jesus tells His disciples in John 15.\nI love the way David talks about God’s shepherd-like presence in Psalm 23. God is near to him—leading and restoring him, even in the valleys. David writes in verse 6, “Surely goodness and mercy shall follow me all the days of my life.” He understands God’s nearness doesn’t make him good, but that goodness and mercy are always with him because the Lord is with Him. God is good, so the fruit of God’s Spirit, or presence, is goodness.\nFriends, whenever we think we can do goodness on our own, we are saying we can be the essence of God without the presence of God. But we can’t! Ephesians 5:8 tells us, “at one time you were darkness.” I was, too. All of us. And we’re learning again and again and again: our self-made fruit does not rid us of our darkness—it doesn’t have that power. Only God can make us light.\nEven when we fool the whole world with our goodness, God sees and knows our hearts better than we know them ourselves. May His goodness follow us as we draw near to Him, and may we may dwell in the house of the Lord forever.\n“Oh, how abundant is your goodness!”\n– Psalm 31:19\n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram8.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Hebrews 11:1-40, Proverbs 3:1-4",
        "devo_title": "Faithfulness",
        "devo_summary": "\nBY Diana Stone\n\nHave you ever looked around at the wonderful, beautiful things your Christian friends are doing in their lives and thought, When I build up a little more faith, that will be me. Or, One day when I have faith like that, I’ll let God know I’m ready for Him to use me.\n\nI want to be used for an eternal purpose. Really, I do. I long for my life to be completely His, yet I hold back, assuming everyone doing those big things must have big faith—faith much greater than mine. So, naturally, when I saw I’d be writing on faithfulness, my first thought was, Ah yes, faith… that’s something I need to work on. It was only when I started digging into my study of faithfulness that I realized the irony of my statement. Faithfulness is a fruit of the Spirit, not a fruit of my efforts.\nFaith is something present in us from the moment we give our life to Christ, accepting that His death has covered our sins and we are fully forgiven, our life now hidden in a bigger purpose than our worldly satisfaction. According to Ephesians 2:8, this faith is a gift to us from God Himself! Hebrews Chapter 11 (a.k.a. the “Hall of Faith”) lists person after person who took the faith they were given and walked in faithfulness to God’s promise, a promise they believed but could not yet see.\nFaith is the conviction that Jesus Christ is our only salvation.\nFaithfulness is remaining in that truth, holding fast to the faith.\nThe issue is not the quantity, or “bigness”, of my faith so much as Who I’ve put my faith in.\nThe disciples in Luke 17:5 say to Jesus, “Increase our faith!” His response is probably not what they expected: “If you have faith the size of a mustard seed… you can say to this mulberry tree, ‘Be uprooted and planted in the sea,’ and it will obey you” (Luke 17:6). Even Jesus’ own disciples—the men who walked with Him, saw His miracles with their own eyes, listened to His words firsthand—are told it is not the size of their faith that matters. Instead, Jesus compels them to turn their small faith into lives of much faithfulness—remaining in and acting on the faith they’ve been given. \nThe fullness of God’s purpose for each of us comes when our faith propels us to offer up our lives for the glory of the Kingdom. Not later, when we feel more qualified or can see just where He’s leading us—but right now, just as we are.\nWe serve a God whose speciality is redemption. He says to us, “My grace is sufficient for you, for my power is made perfect in weakness” (2 Corinthians 12:9 ESV). Our Lord doesn’t require perfection or faith the size of a mountain. He asks for a humble heart willing to stand fast wherever He leads.\nToday, as we go about our lives and ponder our circumstances—whatever they may be—let’s remember Jesus Christ, the source and object of our faith. The One who gives us faith is the One who makes us faithful when we remain in Him. Rather than listening to the lies of the Enemy who wants us to believe our broken pieces and small faith make us ineligible to be used by God, let us cling to our mustard seed of faith and believe in the unseen promises of God. Oh, Lord, by the power of your Holy Spirit, make us faithful. Amen. \nThen I heard the voice of the Lord saying, “Who should I send? Who will go for Us?” \nI said, “Here I am. Send me.”\n–  Isaiah 6:8\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram9.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Proverbs 15:1, Ephesians 4:1-6, 1 Peter 3:4-6",
        "devo_title": "Gentleness",
        "devo_summary": "\nBY Vivian Mabuni\n\nHelen’s eyes were kind and steady. Deep, deep brown like a doe. I admired everything about her. We spent my first year of college in Bible study together and had grown to become good friends. The college ministry we were involved with sent students all over the country and around the world on summer missions. Most of our friends were off to those exciting, exotic locales serving God and we were stuck back at home taking summer school classes and working. We decided to stay connected and support each other throughout that summer by meeting together for Bible study.\n\nI grew up culturally Buddhist. In high school I began a relationship with Jesus, so the Christian faith felt relatively new. Helen was not only two years older than me; her spiritual maturity exuded a deep, intimate relationship with God and her knowledge of the Bible proved equally admirable. I happily anticipated time with Helen in hopes of becoming more like her.\nWe sat cross-legged on a large boulder next to a babbling stream. Our Bibles open, the birds chirping, the sky a Colorado summer vibrant blue…a truly picturesque, Pinterest-worthy scene.\nWe closed our eyes to pray for our friends far away and for each other.\nI opened one eye in time to see an ugly creepy crawly bug scurry across the pages of my Bible. I lifted my hand ready to smash bug guts everywhere, but in that split second I watched as Helen cupped her hands and let the bug crawl onto her hands. She carefully released the bug in the nearby grass.\nHelen, to me, embodied gentleness—reserved, quiet, shy, soft-spoken, introverted. When friends sought her out for counsel, her deep brown eyes would close slowly as her head tilted in a slow nod of understanding. Kind to all God’s creation, she did not squish bugs.\nHelen embodied everything I was not.\nBack then I equated “gentle” with “shy.” Verses like 1 Peter 3:4, “but let it be the hidden person of the heart with the imperishable quality of a gentle and quiet spirit, which is precious in the sight of God,” left me despairing, wondering how to willfully become shy.\nFurther study on the word “gentle,” however, yielded both unexpected relief and challenge.\nThe Greek word for gentleness, prautes, is defined as meekness, which means “strength under control” (Barclay). The image is one of a beautiful, strong stallion, trained under bit and bridle. The stallion retains all his tremendous strength, but now operates under the control of a master. Gentleness is not weakness; it is not a personality bent, a sentimental fondness or passive quiet. It is a fruit of the Spirit which enables a believer to place the will of God before her own.\nJesus, with strength enough to control the weather, describes Himself as gentle and humble in heart (Matthew 11:29). He subjects His great power to the will of God the Father, a model of the biblical gentleness that is precious in the sight of God. You and I can’t control the weather, but we do retain our personality, gifting and strengths when we come into relationship with God. Through the gift of the Holy Spirit, we are empowered to submit our strength to the greater strength and Kingdom purposes of our God.\nI still think my friend Helen is one of the gentlest people I’ve ever known, but now I better understand the “why” of her gentle spirit. Rather than shy, the fruit of gentleness calls me to be surrendered. Quiet or outgoing, bug-squisher or bug-saver, the key is found in the posture of our heart. A Christlike gentleness is not clutching and grabbing for control. It is the spirit of following Jesus with hands and heart open, humble yet strengthened in Him.\nFather, help us bear fruit that honors You by laying aside our will for yours. Amen.\nVivian Mabuni is an author and speaker, and a sushi, white Christmas lights, coffee-with-friends-lover. She has been on staff with Cru (formerly Campus Crusade for Christ) for 26 years and serves with Epic Movement, the Asian-American ministry of Cru. Vivian is the author of Warrior In Pink: A Story of Cancer, Community and the God Who Comforts.\n \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram101.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "Proverbs 25:28, 1 Corinthians 6:19-20, 1 Corinthians 9:24-27, 1 Corinthians 10:13, 2 Timothy 1:7",
        "devo_title": "Self-Control",
        "devo_summary": "\nBY Debbie Eaton\n\nThe alarm goes off at 6:30am and I lay in bed thinking about the day ahead. I have the best intentions—I will eat healthy, exercise, limit my time on Instagram, Twitter, Facebook and email. I will be cheerful and present for my family, friends, co-workers, and keep my tongue in check. “I am in control” is the unsaid message exchanged between my head and heart.\n\nMy feet hit the floor and, in less than an hour, I have already spent too much time scrolling through social media, resulting in a rush to get breakfast on the table. Now feeling anxious and angry, I yell at everyone in the house for being late. The personal and work emails that arrived overnight overwhelm me, and the sight of dishes piled in the sink and clothes left on the floor exasperates me. Today’s exercise, I rationalize to myself, will be walking from the car to Starbucks and back again.\nMy good intentions have evaporated all too quickly, and I am ready to throw in the towel and surrender the white flag before it’s even time for lunch. The control I thought was mine seems lost. I am wiped out and done in with self-defeat. And with that, I have left an open door for the enemy to wreak havoc.\nA person without self-control is like a city with broken-down walls.\n– Proverbs 25:28, NLT\nI’m sure I’m not the only one reading these Scriptures today whose good intentions become muddled in the presence of daily stresses, desires and demands. The determination to exhibit self-control can deteriorate quickly in the reality of the day, leading us down a path of guilt and discouragement, fear and shame. But does biblical self-control simply mean the ability to do what I’m determined to do, and avoid what I’m determined not to do? Is it just about trying harder?\nScripture teaches that self-control is a fruit of the Spirit, not a fruit of our determination. As believers in Christ’s saving grace, we have the presence of the Holy Spirit in us, guarding our life which is now hidden in Christ. The Spirit is a sort of wall, protecting our mind, heart and soul. In His love and mercy, God rebuilds and redeems our broken pieces as we learn to abide in Him. We may not always exhibit self-control the way we want to or ought to, but His presence is here in us—Jesus promised us this!\nThe Holy Spirit in us is not subject to our desires, but rather He conforms our desires to Christ’s will. As we’ll read tomorrow in John 15, Jesus explains His relationship to His disciples as a vine into whom they are grafted. “Apart from me you can do nothing,” He says (John 15:5). When we are grafted into the Vine, we already have the power and authority to say “yes” or “no,” or just “not right now” because the God who lives in us has all power. Abiding in Christ’s power releases us from striving to muster up our own. In His presence we are free to move forward in grace and with courage, knowing that He is “our refuge and strength, a very present help in trouble” (Psalm 46:1).\nI still wake up most days with a mental list of all the ways I’ll control my behavior, my words, my time and my disposition, but God is teaching me that true victory is not found in controlling myself—true freedom and victory are found in being led by God’s Spirit who dwells in me. Self-control comes when I relinquish ultimate control to Jesus, my Vine and my strength. When we find our identity in Him, the fruit will come in abundance.\nLord, may we experience fulfillment today, not because of what we determine to do or not do, but because of what we know you’re doing in us. Amen.\n \n\n \n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram11.jpg"
    },
    {
        "book_title": "Fruit of the Spirit",
        "devo_passages": "John 15:1-11, Galatians 5:25, 2 Corinthians 3:17-18, 2 Corinthians 5:17-21",
        "devo_title": "The True Vine",
        "devo_summary": "\nBY She Reads Truth\n\nLove.\nJoy.\nPeace.\nPatience.\nKindness.\nGoodness.\nFaithfulness.\nGentleness.\nSelf-control.\nWhen I read the familiar list of the fruit of the Spirit, I immediately think, YES. I want to be all those things!\nWho doesn’t love joy and peace? Who couldn’t use more kindness and self-control?\nIt’s right to see this list and want it to be true of us—the fruit of the Spirit is good because God is good! The problem comes when we set out to bear fruit by being good, when we pretend fruit-bearing is simply a matter of our will instead of a result of our connection to Christ. The key lies in the name: the fruit of the Spirit. Not my fruit. Not your fruit. Not the fruit of She Reads Truth, or your favorite theologian, or even the Church! The fruit of the Spirit is borne of the Spirit. Period. The end.\nTo understand fruit-bearing in Gospel terms, there is no better resource than John Chapter 15. (Seriously – read the whole thing and then read it again! So good.) Jesus uses clear and practical imagery to explain the connection between Himself and His disciples:\n“I am the vine; you are the branches. The one who remains in Me and I in him produces much fruit, because you can do nothing without Me.”\n– John 15:5 HCSB\nLove, joy, peace, patience, kindness, goodness, faithfulness, gentleness and self-control are not fruits we bear of our own sheer will and desire. We bear fruit when, and only when, we are grafted to the True Vine. Jesus Christ is our nourishment! His Holy Spirit in us is the fruit producer; we are simply the branches which have the privilege of displaying His fruit. Or, as I keep saying and threatening to put on a t-shirt, “We don’t bear it; we just wear it!” (I know. Thank me for that one later.)\nFriends, Jesus Christ comes to make us new. He comes to redeem the dead branches that we are and give us abundant life! Abiding in Him—resting, dwelling, remaining in Him— is the only source of our strength, our goodness, our fruit. Let’s press into the True Vine together today. Let’s be about the business of abiding in Jesus, and trust His Spirit to be about the business of bearing fruit in our lives.\nAs we wrap up this study, let’s take a moment to reflect and share:\nWhich fruit of the Spirit are you most tempted to produce on your own, apart from the Vine?\nHow has the Scripture you’ve read over the last 12 days changed the way you think of fruit-bearing? And abiding?\n——\nPSST – Just because our study of the Fruit of the Spirit is over, it doesn’t mean we’re done! Let’s keep reading! Keep seeking! Keep *ahem* abiding! Join us MONDAY as we begin a short, 5-day, crowd-favorite study of old Hymns and the Scriptures that inspired them! Not only will we enjoy some favorite returning guest writers (Sandra McCracken, Ellie Holcomb and more!), but this time around, we have actually been in the studio recording She Reads Truth’s very own arrangements! (More details tomorrow!!!)\nSo. Grab a friend or two, and plan to spend 5 days in the Word with us, with that special added layer of Scripture and worship!! WE CAN’T WAIT!!!\n \n\n \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2015/05/SRT-FOTS_instagram12.jpg"
    },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Genesis 1:1-25, Isaiah 45:12, John 1:1-5, Hebrews 11:3",
            "devo_title": "God Created the Heavens and the Earth",
            "devo_summary": "\nBY Jessica Lamb\n\nScripture Reading: Genesis 1:1-25, Isaiah 45:12, John 1:1-5, Hebrews 11:3 \nIn a hole in the ground there lived a hobbit.\nAll children, except one, grow up.\nIt was the best of times, it was the worst of times…\nOf all the most memorable first lines in literature, I’ve always loved the opening of God’s Word most:\nIn the beginning God created the heavens and the earth.\nWhen I read these words from Genesis chapter 1, I’m often tempted to focus on the “how” in this opening passage. How has God always existed? How did He create Creation? How does He hold everything together? I try mining the text for answers about timelines and processes. But the Bible doesn’t emphasize the “how” as much as it draws our attention back to the “who” at the center of the story: God created. God saw that it was good. Genesis 1 doesn’t explain the details of how God created everything as much as it focuses on the nature of God Himself, the Creator.\nGod speaks and acts with purpose. He speaks the universe into existence. He moves the sky, mountains, trees, and oceans into place. Animals swarm and plants flourish at His command. None of this happens randomly—each part of the universe is arranged by Him. We live our lives in the world He’s created and sustains with purpose.\nGod is good, and He made everything to be good. Genesis 1 repeats the phrase, “and God saw that it was good,” six times (we’ll see it a seventh time in tomorrow’s reading). As God reflects on His creation— His handiwork—He tells us it is designed to be good. Later we’ll read how sin darkened the world with sickness and death, deception and decay, betrayal and greed. But it wasn’t created this way. It was created wholly good, and God had a plan to make it whole and good once again.\nOur good God wrote—and is writing—the story of the gospel. \nFor the next two weeks, we’ll read through the movements of this gospel story: creation, fall, redemption, and restoration. The word gospel means “good news,” and that news for us is this: when the time was right, the kingdom of God broke through on earth in the person of Jesus Christ. \nJesus, the Son of God, accomplished for us in His life, death, and resurrection what we could not accomplish for ourselves—forgiveness for our sin and reconciliation with God. The Creator demonstrated His love for the created in that ”while we were still sinners, Christ died for us” (Romans 5:8). \nThe gospel story is for you, whomever you are, right where you are today. It is for those who believe, to remind them of the truth that continues to change them every day. And it’s for those who don’t believe, who are seeking or doubting or anywhere in between. \nThe opening words of Scripture are the beginning of an invitation to know and be known by the God who still speaks and acts with purpose, and who is working to make all things truly good.\n\nJessica Lamb consumes books, tea, and street-style tacos with equal ferocity. When she’s not working as the managing editor for She Reads Truth, she can be found singing Broadway tunes off-key or traveling. She lives with her husband, daughter, beloved mutt, and tolerated chickens in Nashville, TN.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram1.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Genesis 1:26-31, Psalm 8:1-9, 1 Corinthians 15:47-49",
            "devo_title": "God Created Mankind in His Image",
            "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: Genesis 1:26-31, Psalm 8:1-9, 1 Corinthians 15:47-49\nWhen God created man, He scooped up the new dust of the new earth, blew the breath of life into it, and fashioned a man in His own image. Man is the only creation made in the image of God! It’s hard to know exactly what this means, because God is spirit and does not have a body like man (John 4:24). So bearing the image of God doesn’t mean we have His nose or His widow’s peak; it means we are eternal beings, worthy of worth, value, and dignity.\nEach one of us, every human being—regardless of where we are born or whether we can do calculus—carries this worth, value, and dignity imparted to us because we are God’s image-bearers. You can hear David’s incredulity in Psalm 8 when he marvels, “What is a human being that you remember him?” (v. 4). \nPaul perfectly articulates this tension between the glory and honor of being an image-bearer of God and being made from the gritty dust of the earth. We are both earthly and heavenly.\nIndeed, it seems like all this glorious attention and honor is more than we deserve. In fact, it is. Since the fall of humanity, we have marred this gracious glory of being God’s image-bearers with our sin. Now we are tempted to use our dominion over creation to hurt and control instead of steward and love. Nevertheless, God’s image remains inextricably stamped on our very being, even in our fallen state.\nIn his sermon “The Weight of Glory,” C.S. Lewis reminds us of this enduring truth:\nThere are no ordinary people. You have never talked to a mere mortal. Nations, cultures, arts, civilizations—these are mortal, and their life is to ours as the life of a gnat. But it is immortals whom we joke with, work with, marry, snub and exploit—immortal horrors, or everlasting splendors.\nAll our actions, friendships, feuds, sidelong glances, and grocery store checkout interactions have eternal significance, for good or ill. The fall of humanity did not eliminate either our worth or our responsibility as God’s image-bearers.\nThe glorious news of the gospel is this: the perfect glory of who we are supposed to be is not lost forever. We have the promise of perfection restored and made even more glorious in Christ. Adam, the first man, was made of dust. But the second Man, Jesus, came from heaven. He was not created, but is coexistent and coeternal with the Father and the Holy Spirit—together as the Holy Trinity, they always have been and always will be (John 1:1–4). If we are in Christ, we straddle the life of the first man and the second Man; we bear the image of both. And in the end, because God has been mindful even of us, we will one day bear His image perfectly, reflecting the glory of Christ for all eternity.\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as the managing editor and writer at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram2.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Genesis 3:1-19, Deuteronomy 28:15-19, Isaiah 1:4-5, Romans 5:12-14",
            "devo_title": "Humanity Rebelled Against God",
            "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Genesis 3:1-19, Deuteronomy 28:15-19, Isaiah 1:4-5, Romans 5:12-14\nFrom the time my pigtails bounced and my skirt twirled, I’ve always been a “good girl”—just ask my mama. I was a straight-A student who rarely got in trouble. I picked the right college, the right fella, the right outfit. You get the idea.\nTurning my life over to Jesus ripped my story into two distinct halves: life before Him and life after Him. Still, there isn’t a lot of drama in the “before” part. No skeletons in the closet. No criminal record. No massive public failures. It’s tempting to think that Jesus died to make me a new and improved version of myself: Erin 2.0. \nI’ve been walking with the Lord for more than two decades now, and the strangest thing has happened. The longer I know Him, and the more familiar I become with His Word, the uglier my heart looks. It’s like one of those optical illusion pictures that just looks like a bunch of squiggles at first. But the longer you stare, the more the edges of a hidden image start to emerge, and you see it’s not a pretty picture.\nSure, my behavior screams “good girl,” but my deceitful heart whispers thoughts of jealousy, pride, envy, hate, anger, bitterness, greed—the list goes on and on. Because here’s the truth: the Bible tells us no one is good except God alone (Romans 3:10). The achievements, accomplishments, and attitudes we attempt to polish up with a high shine are destined to look like filthy rags next to His blinding holiness (Isaiah 64:6).\nOur sin—and the sin of our first parents, Adam and Eve—is a reality the Bible doesn’t bother to sugarcoat (Genesis 3). We are the children of sinners who produce children who sin. We are not a people defined by our goodness, but rather all of humanity is “weighed down with iniquity” (Isaiah 1:4). We, all of us, have turned our backs on our Creator.\nWhen it comes to holiness, there is no bell curve. The Bible warns that everything, every single thing in our world is cursed by our sin and rebellion against God: our civilizations and our agriculture, our food and our children, our crops and our herds, our coming in and going out (Deuteronomy 28:17–19).\nIt has taken my entire life, but my good girl facade has cracked. Praise God. Following the rules doesn’t make me righteous, but the good news of the gospel keeps picking me up and dusting me off. “For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord” (Romans 6:23).\nFacing up to the reality of my sin hurts. But when I wrestle with the gospel, the gospel always wins. Being good is not enough, but the thoroughly sufficient grace of a good and loving God is.\n\nErin Davis is an author, blogger, and speaker who loves to see women of all ages run to the deep well of God’s Word. When she’s not writing, you can find Erin chasing chickens and children on her small farm in the Midwest.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram3.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Genesis 4:1-16, Genesis 6:5-6, Jeremiah 17:9-10, Romans 6:20-23 ",
            "devo_title": "All People Are Sinful by Nature",
            "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Genesis 4:1-16, Genesis 6:5-6, Jeremiah 17:9-10, Romans 6:20-23\nThe progression of Cain and Abel’s story in Genesis 4 can be summed up in three words: offering, sacrifice, curse.\nOffering: Cain and Abel both make offerings. Cain’s is rejected by God, not because the offering in and of itself is bad or wrong but because Cain’s heart behind it is. Abel’s is accepted, not because his offering is better but because “the Lord had regard for Abel” (Genesis 4:4).\nSacrifice: God warns Cain not to let his sin get the best of him, but Cain succumbs to it and kills his innocent brother. And his blood cries out to God from the ground (v. 10).\nCurse: Cain is cursed with fruitless labor and a restless, wandering spirit—a punishment that is too great for him to bear (v. 13).\nIt is not a hopeful ending, and humanity continues to suffer the consequences of this curse for generations to come. It’s a curse I feel even today.\nThis spring I spoke at women’s conference at a church. I prepared for months, reading Scripture, commentaries, looking up Greek and Hebrew verbs. A couple of weeks before the event, I found myself in the depth of shame over an old sin pattern I had fallen into yet again—the one I say I’ll never do again and then inevitably always do.\nHead in my hands, I asked God, How can I speak on a stage, proclaiming your Word while knowing the sinner I am? In that moment, I could not see beyond the curse. I felt the weight of Jeremiah 17:9: “The heart is more deceitful than anything else, and incurable—who can understand it?”\nThe progression of Christ’s story in the Gospels is similar to Cain and Abel’s, with a much different ending: offering, sacrifice, resurrection.\nThe imperfection and curse in Cain and Abel’s story was ultimately corrected and perfected through the death, burial, and resurrection of Jesus Christ. He lifted the curse. We are no longer wanderers laboring for fruitless gain. As Paul says, “Since you have been set free from sin and have become enslaved to God, you have your fruit, which results in sanctification—and the outcome is eternal life!” (Romans 6:22).\nOur sin nature, like our shadows, is the dark side of us, one that we can ignore until the light hits us at the right moment and exposes it. Of every critical aspect of the gospel, sin is perhaps our least favorite to talk about, but it is also the most necessary in order to fully understand the salvation and hope offered in Jesus.\nThat day of the conference, as I was sitting in shame over my sin with only the curse as my truth, I felt the Holy Spirit point out the choice I was making. I was choosing the enslavement of the curse over the freedom of Christ. I realized then that it is not because of how good I am that I am able to speak about the Word of God. It is only because of how good He is. I could choose the curse and refuse to speak, or I could choose Christ and let His power be made perfect in my weakness.\nWe are offered this choice every day. My prayer is that even on those days when we feel the depths of our sin the most, we will choose freedom in Christ Jesus. It is for this freedom from sin and shame that He has come to set us free (Galatians 5:1). This is the full and complete gospel. May we choose to walk in it and thank God daily for Jesus’s sacrifice that has made this freedom possible for all who believe in Him.\n\nAndrea Lucado is a freelance writer, Texas native, and the author of the memoir English Lessons: The Crooked Path of Growing Toward Faith. When she is not conducting interviews or writing stories, you can find Andrea laughing with friends at a coffee shop or creating yet another nearly edible baking creation in her kitchen. One of these days she’ll get the recipe right. \n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram4.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Isaiah 24:1-6, Matthew 19:16-22, Romans 8:5-11, 18-25, Hebrews 7:26-28, Hebrews 9:22",
            "devo_title": "We Cannot Save Ourselves",
            "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Isaiah 24:1-6, Matthew 19:16-22, Romans 8:5-11, 18-25, Hebrews 7:26-28, Hebrews 9:22\nHave you ever waited for something you really wanted? Like really wanted. I bet we all have. Whether you wanted a friend on your first day of school, a fairytale romance, or an elf to do your laundry, we all know what it’s like to wait for something to come into fruition. \nIt’s hard to be patient when we have big hopes and dreams. We want what we want—now. And while all dreams are different, I believe we do have one in common: above all else, we long for heaven.\nIf we’re honest, we all feel unsatisfied with something in this life. From our personal lives to our politics, our world is grumbling and groaning (Romans 8:22–23). Maybe our relationships haven’t provided the community we need, or our jobs aren’t utilizing our full potential. Or maybe we aren’t being the women we know we were created to be. For most of us, there are many sources of personal frustration. Societally, we hear stories of tragedy every day. Tales of injustice and war flood our news feeds. The world is broken. The effects of the fall reverberate in and around us because things are not as they should be.\nBut why are we surprised when we encounter disappointment in this life? Where does this strong sense that the world should be better come from? We long for a perfect world we’ve never experienced. C.S. Lewis put it best when he said, “If we find ourselves with a desire that nothing in this world can satisfy, the most probable explanation is that we were made for another world.” \nWe were made for another world! In our heartbreak, discouragement, and righteous anger there is a yearning for the new heaven and new earth. Paul describes our eagerness and groaning like a woman in childbirth (v. 22). We can’t wait “for our adoption to sonship, the redemption of our bodies” (v. 23). Yet this redemption is not something we can accomplish on our own. Our separation from the holy God is a chasm we are utterly and irrefutably unable to cross. \nOnly Christ can reconcile us to God. His sacrifice paid for our sins. His resurrection defeated death forever. The world around us “wastes away and withers,” but we must remember the story isn’t over yet. Jesus came to offer eternal hope, and Jesus is coming back. “The sufferings of this present time are not worth comparing with the glory that is going to be revealed to us” (v. 18).  \nWhen we feel the weight of the pain and brokenness of this world, we must remember the greater story. We are caught in a fallen world between redemption and restoration. We who have the firstfruits of the Spirit within us should be groaning for more, waiting eagerly and with patience. We long for heaven, and heaven is coming.\n\nKaitie Stoddard is a professional counselor who recently relocated from Chicago to Colorado with her husband. She has her Master’s degree in Clinical Psychology and is passionate about helping couples and families find healing in their relationships. On any given weekend you’re likely to find Kaitie snowboarding in the Rocky Mountains, checking out new restaurants with friends, or catching up on her favorite Netflix and podcast series.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram5.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "John 1:1-5",
            "devo_title": "Grace Day",
            "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nIn the beginning was the Word, and the Word was with God, and the Word was God. He was with God in the beginning. All things were created through him, and apart from him not one thing was created that has been created. In him was life, and that life was the light of men. That light shines in the darkness, and yet the darkness did not overcome it.\n-John 1:1–5\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram6.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Romans 6:23",
            "devo_title": "Weekly Truth",
            "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize a verse that acknowledges sin’s consequences and points is to the hope found in Jesus.\nFor the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\n-Romans 6:23\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n \n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/4-Titg-1.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "John 3:16-17, Matthew 15:29-31, Luke 18:31-33, John 19:28-30, Romans 5:6-11, Philippians 2:5-11",
            "devo_title": "Jesus Lived, Died, and Rose from the Grave",
            "devo_summary": "\nBY Rebecca Faires\n\nScripture Reading: John 3:16-17, Matthew 15:29-31, Luke 18:31-33; John 19:28-30; Romans 5:6-11; Philippians 2:5-11\nThis is the big show. This is the central truth of our faith. We can quibble over infant baptism and transubstantiation and ordination, but on these points all Christians must come together and agree. God came to earth in the form of a man, and this God-Man lived, died, and rose from the grave. They called Him Jesus. While we were helpless and lost in our sin, Jesus died to save us completely (Romans 5:6).\nIt is the truest and most real fairy story ever known. The Church is the princess trapped by the pretending ruler of this world: a dragon who seeks to hoard all he can. The hero slays the dragon once and for all though a mighty and earth-shaking sacrifice. The dragon vanquished, the hero rescues the princess and brings her to his beautiful home. And they literally live happily ever after.\nNotice who’s who in this story. We are the Church and the princess: the bride of Christ. What does the princess have to do to make the story come off properly? The answer is… nothing.\nWe’d like to think we get to play a champion’s role in the story, but no matter how politically incorrect it may be, we, the bride, are helpless. The princess does not slay the dragon. She awaits the coming of her prince, the hero who will save her.\nAs unflattering as it is, we are helpless apart from Christ. If that weren’t enough to make us uncomfortable, Paul reminds us we were also ungodly enemies of God, undeserving of rescue (Romans 5:10). The Church is the the beggar bride, who has gotten overly comfortable living with the dragon. It is Christ who makes us holy, Christ who makes us lovely, Christ who washes us clean and removes the dragonish stench from our garments, preparing us for His kingdom.\nBy His life, He emptied Himself of glory, walking in perfect righteousness and enduring every earthly sorrow. By His death, He fully satisfied God’s just wrath against us, washing away our every sin. \nBy His resurrection, He defeated death and hell and secured newness of life for those who believe. \nBy His ascension, He advocates for us before the throne of grace, guaranteeing our eternal inheritance.\nThe great story of the gospel is the story of Christ. His life and death, His resurrection and ascension—this is the gospel. He is the gospel. Thanks be to God.\n\nRebecca Faires loves the gospel story and needs it every morning when she wakes up to her five little people. Rebecca holds a bachelor’s degree in German from Hillsdale College, and most recently worked as managing editor at She Reads Truth. She now works from her log cabin in the hills of Tennessee, writing and illustrating books with her favorite mountain man. There she enjoys porch-sitting as it rains, reading the Oxford English Dictionary, and getting in way over her head. She is expecting her sixth baby and her first book in February of 2019.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram8.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Psalm 51:1-19, Joel 2:12-13, Mark 1:14-15, Romans 5:1-2, Romans 10:9-10",
            "devo_title": "Jesus Calls Us to Faith and Repentance",
            "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Psalm 51:1-19, Joel 2:12-13, Mark 1:14-15, Romans 5:1-2, Romans 10:9-10\n“The time is fulfilled, and the kingdom of God has come near.\nRepent and believe the good news!”\n– Mark 1:15\nRepent and believe.\nOf all the important words used to tell the gospel story, these are the two I’ve struggled to truly understand. Here in Mark 1, Jesus is calling us to repent and believe, but too many times I’ve interpreted His words as “grovel and behave.” Or really, Get your junk together, Kara, and then go out and do the work God has called you to. \nSometimes it’s easier for me to fall in line with the idea of God’s justice than it is to trust and receive His love for me. To trust Him, I have to be vulnerable, my heart and mind laid bare before Him. And yet to even begin to understand God’s gift of salvation, I have to understand my need for it, my need for Him. \nIn all of Scripture, David’s words in Psalm 51 have to be some of the most vulnerable, self-aware, and unguarded. Many of us know this part of David’s story and the impetus of this psalm—how he lusted after Bathsheba, bedded her and committed adultery with her, and then had her husband Uriah, his friend and confidante, murdered (2 Samuel 11–12). David left behind an enormous amount of suffering in the wake of his desire, and this psalm proves his awareness of his sin. But in the midst of all that relational wreckage, he confesses to the Lord: “Against you—you alone—I have sinned and done this evil in your sight” (vv. 3–4).\nDavid is grieving his sin before his Maker. He knows he is utterly lost and in need of God’s forgiveness when he prays, “God, create a clean heart for me and renew a steadfast spirit within me.” The earthly king is asking God to restore what’s been lost: the joy and peace that can only be found in right relationship with God (vv. 10–12). \nOur sin grieves God, and it should grieve us, too. For those who don’t trust Jesus for salvation, sin separates them from an eternity with God. For those who do trust in Him, their salvation is secure, but sin can still prevent them from experiencing an abundant, vibrant relationship with God now, on this side of heaven.\nLike David, we all have sinned and fall short of God’s glory and perfection. But this is the good news: we’re not called to live perfect lives. Jesus already did that for us! His righteousness is ours if we believe and trust in Him (Romans 3:23;10:9–10). We are called to continuous repentance, to keep turning away from our sin and the false promises of this world, and to turn back to God with all our heart (Joel 2:12).\nIf you’re anything like me, there have been times when you’ve struggled to believe you’re truly forgiven and radically loved (Zephaniah 3:17). You’ve heard the righteous rebuke in Jesus’s call to repent, but perhaps not the loving invitation to turn back to Him, and to continue coming back—not because your salvation isn’t secure, but because He knows our rebellious hearts keep us from knowing and enjoying His presence today. \nThe time has come! Jesus—Immanuel, “God with us”—has come near. Repent and return to Him. And then keep turning back to Him. Believe the good news is true, and that it’s true for you.\n\nKara Gause is an editor for She Reads Truth and happily resides in Nashville, Tennessee. She’s married to one swell fella and mother to a set of delightfully spirited twin girls. Sunsets, snow cones, and cinema are near and dear to her heart, as is anything or anyone who reminds her of God’s goodness.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram9.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Ephesians 2:1-10, Romans 3:21-26, Galatians 4:4-7, 1 Peter 1:3-9, 18-19, John 10:27-30",
            "devo_title": "We Are Saved by Grace Through Faith",
            "devo_summary": "\nBY Guest Writer\n\nScripture Reading: Ephesians 2:1-10, Romans 3:21-26, Galatians 4:4-7, 1 Peter 1:3-9, 18-19, John 10:27-30\n“In the matter of Samuel Ellis Gibson…”\nMy husband and I sat in a conference room with a notary named Janet, listening to the judge’s voice coming through the speakerphone. The judge sat on her bench somewhere in Florida, and as she spoke, we strained to hear every word. The journey to adopt our son had begun long before he was ever conceived. Now, he was seven months old, and a judge was making a final judgment in his case. \nShe looked at the facts, asked us her questions, and evaluated the progress he’d made since coming into our care. In the end, she made the final adoption decree. From that point forward, she said, it would be as if “the blood of Patrick Gibson and Claire Gibson were running through his veins.” I burst into tears—shocked at the beauty and finality of that legal language. This little child, who had no idea what was going on, had just had his life changed forever. \nThis is God’s grace to us. When we were weak, He left everything behind to come find us, save us, and adopt us into His family. At the cross, a final judgment was made on our behalf about our family, about our future. In essence, the gospel decrees over us: “From this point forward, it is as if the blood of Jesus were running in their veins.” \nWhat occurred at Calvary is a mystery—beautiful and scandalous and hard to understand. But throughout Scripture we are given word pictures to help those of us in the physical world understand what Jesus accomplished for us in the spiritual world. \nIt’s like an adoption (Galatians 3:26–4:7). We were lost but Jesus transferred us legally into His family, forever making us His brothers and sisters with access to the Father’s great riches (Romans 8:17; Colossians 1:12).\nWe were like lost sheep (John 10:1–18), but Jesus guided us gently to safety. We were once helpless, but Help came to rescue us.\nWe were once dead in our sins (Ephesians 2:1–5), but Christ made us alive again. \nWe had failed (Romans 3:23), but Christ gave us His perfect record as a substitute for our own. Grace is the lifeline we couldn’t throw to ourselves.\nAll of these metaphors are mere pictures of what we will one day experience fully, in His presence. But in the meantime, Jesus invites us to live our lives as His children. We can trust the final word of our great Good Judge. What He says sticks. We are children of God, saved by grace through faith in Jesus (Ephesians 2:5). This is our standing both now and forever.\nThanks be to our good and gracious God.\n\nClaire Gibson is a writer whose work has been featured in publications including The Washington Post and Entrepreneur Magazine among many others. An Army kid who grew up at West Point, New York, Claire is currently growing roots in Nashville, Tennessee, with her husband, Patrick, their son, Sam, and their dog, Winnie. Her debut novel, Beyond the Point, will be published next year.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram10.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "John 14:27, Colossians 1:13-23, Colossians 3:1-4, 2 Corinthians 5:17-19, 1 Corinthians 15:51-57",
            "devo_title": "Jesus Secures Our Peace with God",
            "devo_summary": "\nBY Guest Writer\n\nScripture Reading: John 14:27, Colossians 1:13-23, Colossians 3:1-4, 2 Corinthians 5:17-19, 1 Corinthians 15:51-57\nThere have only been a few moments in my life when I have felt perfectly at peace. Moments of sweetness and beauty so profound, they leave me feeling as though the veil between now and eternity is lifted for just a moment, long enough to breathe in before the exhale drops me back into the mundane. \nWe live in this in-between, in the “already but not yet” reality of Christ. We only receive a few precursors of perfect peace in our mortal bodies, when our desire for heaven is almost satisfied for a second. We crave heaven because it is what we were made for. We long for peace because our hearts are hard-wired for it. \nIn her novel Housekeeping, Marilynne Robinson describes longing for peace like this: \nTo crave and to have are as like as a thing and its shadow. For when does a berry break upon the tongue as sweetly as when one longs to taste it, and when is the taste refracted into so many hues and savors of ripeness and earth, and when do our senses know any thing so utterly as when we lack it? And here again is a foreshadowing—the world will be made whole. \nToday’s passages give me similar moments of peace and pause. Colossians 1 and 1 Corinthians 15 are both banner moments in Paul’s writings. I can hardly read them without the very best kind of tears filling my eyes. These passages provoke the deepest, unfulfilled places in my heart. They remind me that I was made for a perfect eternity.\nOur eternal peace with God will be better than anything we can ever imagine. We will put on, as Paul writes so hopefully, our incorruptible bodies—new and perfect versions of ourselves (1 Corinthians 15:53). We will also be fully reconciled with God. \nTheologians categorize the work of Christ into different buckets, one of which is Christ as our reconciler. Sin alienates us from God and it makes us strangers to His mercy. There is an uncrossable chasm between us. But when we know Jesus and believe in Him, He makes our peace with God. He binds us up into covenant relationship, into perfect peace. \nJesus doesn’t offer that peace to us as a pretty gift wrapped in a bow; rather, He spent His breath and bones to purchase it for us, “making peace through his blood, shed on the cross” (Colossians 1:20). And so because of His blood, we claim reconciliation as God’s people. We will be reunited to Him forever. Death is no longer an uncrossable chasm. Death has lost its sting, having been swallowed up in Christ’s victory on the cross (1 Corinthians 15:54–55).\nAs those who have been raised with Christ, let us seek eternal things, not earthly things. One day He will appear again, and we will join Him in glory. But as we wait, let us rest in the peace of Christ today. Lord, hasten the day of your return.\n\nMelanie Rainer is a bookworm from birth who makes her days writing, editing and reading in Nashville, where she also joyfully serves as the editor of Kids Read Truth. She has an M.A. in Theological Studies from Covenant Seminary, spends as much time as she can in the kitchen, and can’t wait until her two daughters are old enough to read Anne of Green Gables.\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram11.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Psalm 24:1-2, Isaiah 65:17-25, Revelation 21:1-5, Revelation 21:22-27, 2 Peter 3:10-13",
            "devo_title": "All Creation Will Be Restored",
            "devo_summary": "\nBY Andrea Lucado\n\nScripture Reading: Psalm 24:1-2, Isaiah 65:17-25, Revelation 21:1-5, Revelation 21:22-27, 2 Peter 3:10-13\nOf all of the gospel promises, the promise of future restoration is perhaps the most hopeful for me and also the most difficult to understand. Having only known a broken world, how do I even begin to imagine what the new creation will look like?\nPain will no longer exist? Death, crying, and grief will no longer exist? The wolf and the lamb will eat together? Aging will not be an issue?\nI love the idea of all of these things, but like trying to imagine a new color, I don’t have a frame of reference for them. And so they feel more like a far-off dream than a future reality. But whenever the big picture of Scripture is too hard for me to imagine, it helps me to zoom in closer, to look at the passage on a smaller scale and consider where I’ve seen this truth play out in my own life.\nPerhaps trying to imagine this earth returning to its Eden state is too difficult, but has God not already done the same work of restoration in me? At the very heart of the gospel is a God who restored us to Himself through His Son Jesus Christ. Now anyone who is in Christ is a new creation (2 Corinthians 5:17).\nThis means restoration is happening now. Newness is happening now. Maybe we can’t imagine what the new heaven and new earth will look like, but we need look no further than ourselves in order to see the power of restoration and possibility of newness through our Father.\nThis gives me even greater hope. Because now my hope is not just in the future restoration. I can be assured that restoration is possible today. By the work of the Spirit and with the example of Jesus Christ, we—as a new creation ourselves—can work toward this restoration in our relationships, in our work, and in our communities.\nAs the apostle Peter said, the promise of the new creation has great implications for how we live our lives today:\nBut the day of the Lord will come like a thief; on that day the heavens will pass away with a loud noise, the elements will burn and be dissolved, and the earth and the works on it will be disclosed. Since all these things are to be dissolved in this way, it is clear what sort of people you should be in holy conduct and godliness as you wait for the day of God and hasten its coming (2 Peter 3:10–12).\nIf God could restore us to Himself, how much more could He restore? Relationships, communities, broken dreams—not only will all that is broken be made new on the next side of heaven, but God is making things new on this side too.\nToday, when I read about the new creation I am trying to see it not as some sort of ethereal image I can’t comprehend, but as proof that God can restore all things in heaven and on earth. His promise of restoration doesn’t have to puzzle me; it can energize me, giving me purpose in how I work out restoration here until the day of our God.\nSo if you are doubting today whether the brokenness of this world can ever be mended, or that true reconciliation could ever happen, or that the pain will ever go away—look to Scripture and what God has done for you and and remember His words, said in present tense, “Look, I am making everything new” (Revelation 21:5).\n\nAndrea Lucado is a freelance writer, Texas native, and the author of the memoir English Lessons: The Crooked Path of Growing Toward Faith. When she is not conducting interviews or writing stories, you can find Andrea laughing with friends at a coffee shop or creating yet another nearly edible baking creation in her kitchen. One of these days she’ll get the recipe right. \n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram12.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "Colossians 1:19-20",
            "devo_title": "Grace Day",
            "devo_summary": "\nBY She Reads Truth\n\nUse today to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nFor God was pleased to have\nall his fullness dwell in him,\nand through him to reconcile\neverything to himself,\nwhether things on earth or things in heaven,\nby making peace\nthrough his blood, shed on the cross.\nColossians 1:19–20\n\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/SRT-TITG-18-instagram13.jpg"
        },
        {
            "book_title": "This Is the Gospel",
            "devo_passages": "John 3:16-17",
            "devo_title": "Weekly Truth",
            "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we will memorize the key verse for this reading plan, a summary of the gospel of Jesus.\n“For God loved the world in this way: He gave his one and only Son, so that everyone who believes in him will not perish but have eternal life. For God did not send his Son into the world to condemn the world, but to save the world through him.”\nJohn 3:16–17\n\n",
            "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/4-TITG-2.jpg"
        },

{
    "book_title": "Justice",
    "devo_passages": "Romans 5:12-21, John 18:28-40, John 3:16-17",
    "devo_title": "Justice: let’s begin at the cross",
    "devo_summary": "\nBY Raechel Myers\n\nShe Reads Truth is truly honored to provide this study of biblical justice in collaboration with these special guest contributors: Gary A. Haugen, founder and CEO of International Justice Mission Bethany Hoang, Director of the Institute for Biblical Justice at IJM Jessica Honegger, founder of Noonday Collection Jennie Allen, author of Restless and Anything\n_______________________________\nFor the judgment following one trespass brought condemnation, but the free gift following many trespasses brought justification. – Romans 5:16b\nWe cannot begin a conversation about justice anywhere but at the cross of Jesus.  We want to talk about justice within the church and on a global scale. We struggle to understand the relationship among justice, vengeance and fairness. We want to restrain the crushing hand of the oppressor and extend the hand of mercy to widows and orphans. We want to know why the emphasis on justice seems to shift in the Bible, between the Old Testament law and the New Testament teachings of Jesus. We want to know why the people we love suffer—why the people God loves are hurting. We want to understand justice! The pursuit of justice changes lives and directs the course of history. It shapes families and shifts paradigms. Justice is a highly current conversation, and the pursuit of social justice occasionally finds biblical justice in the backseat.\nSo, what exactly is biblical justice? And why do we insist that this conversation must begin at the cross? We start here because the cross was The Great Inversion of Justice. The cross of Jesus is where justice and mercy kiss. It’s where Adam’s sinful curse is met with the New Adam’s sinless sacrifice, and the severe wrath and sovereign mercy of God bring the world to right, once and for all. The cross was the crucifixion of a sinless man, sentenced to death, shedding innocent blood, giving up His God-ness, becoming sin, and satisfying the world’s debt because of His great mercy.  So has God done an injustice by allowing the death of His righteous son? No, it is we who have done the injustice. Indeed, no greater injustice can be committed than that man would kill God.\nWe start at the cross because there is no place else to start. It is the place where our own slates were wiped clean—the place where Jesus paid it all and all to Him we owe. It is the place where we throw “deserve” and “fair” out the window because we realize what true justice would mean for any one of us. As followers of Christ, we cannot go forward in our conversation about justice on any basis but this:\nMy sin has sentenced me to death. Death is what I deserve. God in His mercy became sin —my sin— and took my death excruciatingly up Himself. Because of that, I owe Him my life.\nLet’s start here, Sisters. Each of us coming with her own experiences, her own hurts and joys—let’s stick our collective flag in the sand here, and let’s come back here every single day of this study. Let’s view each facet of justice through this cross-shaped lens. \nOver the next two weeks, we’ll read tons of scripture and share lots of ideas surrounding the topic of biblical justice. We’ll walk briefly through the role of justice in our relationship with God, our neighbor, and the world. The conversation is going to get hard, and we do not have all the answers. Even still, we believe the Bible has more than a lot to say about this topic that is part of the very heart and character of our God.\nIt may feel a bit like drinking from a fire hose at times (trust us—we feel the same way!), but our prayer is that, through these scripture passages and stories, we would be changed. That we would learn more about God and His fierce love for His children. That we would learn something new about ourselves and how we can actively pursue justice in our daily lives (because, we absolutely can!). That we would not feel paralyzed but rather empowered to join in the redemptive work God is doing today, in our own neighborhood and around the world. Will you join us?\n ___________________\nIn our study and writing on the topic of biblical justice, we’ve leaned heavily on a number of excellent resources. We strongly encourage you to use this She Reads Truth study as a simple springboard for a deep dive into this topic that is so close to the heart of God. May we recommend the following? Generous Justice: How God’s Grace Makes Us Just by Tim Keller, pastor and theologian The Good News About Injustice by Gary A. Haugen, founder and CEO of IJM The Locust Effect by Gary A. Haugen, founder and CEO of IJM When Helping Hurts by Steve Corbett and Brian Fikkert\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/112.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Matthew 20:1-16, Psalm 146:5-9, Deuteronomy 16:18-20, Psalm 33:4-5",
    "devo_title": "what is justice?",
    "devo_summary": "\nBY Guest Writer\n\nText: Matthew 20:1-16, Psalm 146:5-9, Deuteronomy 16:18-20, Psalm 33:4-5\nJustice, and only justice, you shall follow, that you may live and inherit the land that the Lord your God is giving you.\n– Deuteronomy 16:20\n“Is not this the kind of fasting I have chosen:\nto loose the chains of injustice and untie the cords of the yoke,\nto set the oppressed free and break every yoke?”\n– Isaiah 58:6\n\nI’ll never forget the moment when I first encountered the part of Isaiah 58 that talks about breaking the chains of oppression and setting the captives free.\nIsaiah 58 first came into my life as a powerful statement of promise to me personally. If there was anything I longed for most at that point in my life, it was freedom. Freedom from the chains of my own sin that seemed to choke my spirit. Freedom from the sin of others that left me carrying a load of shame I could not shake. Freedom from the oppressiveness of my fears that seemed to cripple me. As I read Isaiah 58, the words came at me like gale force winds of the Holy Spirit, reminding me that Jesus came to set the prisoners free.\nThese words of truth changed me.\nBut about two years after I was first so deeply affected by the Scripture, I began to see that Isaiah 58 was meant to be more than a spiritual metaphor for me—it was a command for all of the people of God and spoke to a reality of literal slavery and oppression. The prophet Isaiah was indicting Israel for the physical captivity and oppression in which they were complicit; most importantly he was connecting their lack of justice to their false worship before God.\nSeeking justice—bringing right order and exerting life-giving power to protect the vulnerable—is a command that the God of justice gives to us all.But, fighting injustice—the abuse of power that oppresses the vulnerable through violence and lies—can be excruciatingly hard work. It can be exhausting. So, seeking justice begins with seeking our God who created justice; our God who longs to use us, every one of his children, to bring justice; our God who offers us the yoke of Jesus in exchange for things that otherwise leave us defeated. He offers to make our burdens light.\nThe gospel is about spiritual freedom from sin and reconciliation to God through Jesus for eternal life, and it is also about bringing physical freedom for those suffering abuse and oppression. Our lives are meant to proclaim that Jesus has broken our spiritual chains, and in this proclamation we join Jesus in seeking justice for the oppressed.\nWhen we understand the reality that God sees injustice and calls his people to act, we will grow to see that our own personal freedom and reconciliation in Christ is not the end of the story. We are free so that we can be part of God’s work of setting others free.\nThe questions we find ourselves asking as we meet God in his Word are ever changing and ever expanding. But what is most important is that we continually put ourselves in front of God’s Word, to ask the Holy Spirit to guide us—this will draw us ever nearer to understanding justice first in the heart of God and next in our own lives.\n___________________\nBethany Hoang is the Director of the Institute for Biblical Justice for the International Justice Mission. She is a member of the Advisory Board for U.S. Lausanne and served as a Delegate for the 2010 Lausanne Congress on World Evangelization in Cape Town, South Africa. Bethany holds a B.A. in Religion and History from Miami University of Ohio, and a Master of Divinity from Princeton Theological Seminary. She is the author of Deepening the Soul for Justice.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/24.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Isaiah 59:14-21, Micah 6:8, Luke 4:16-21, Isaiah 30:18",
    "devo_title": "justice or mercy?",
    "devo_summary": "\nBY Hayley Morgan\n\nText: Isaiah 59:14-21, Micah 6:8, Luke 4:16-21, Isaiah 30:18\nTherefore the Lord waits to be gracious to you, and therefore he exalts himself to show mercy to you. For the Lord is a God of justice; blessed are all those who wait for him.\n– Isaiah 30:18\nGod’s mercy and grace are the great equalizers. His mercy steals a believer from the jaws of death (which she surely deserves), and sweeps her up into His unending grasp. She is then washed clean and made a daughter of God—such grace! All good gifts she receives are not of her own goodness but are from God above (see James 1:17).\nSometimes though, we can forget that. We can start to think that any good thing, be it beauty or position or money or extra time, is something we’re owed, something we’ve earned. We can start to live tightfisted, with insular lives, just living small and serving our own interests. We can start to live like we can meet God’s standards in our own power, with no need for Him. \nWe can twist the idea of justice—the restoration of all that is good and right, the recognition and treatment of all people as God’s creation—and make it about us, about “fairness” from our own limited perspective. We can forget that justice and mercy are not mutually exclusive, but rather both characteristics of the one true God.\nI think when we first taste God’s mercy and grace, we fully know it’s unwarranted pardon and an extravagant gift. We relish the unexpected sweetness, and we want everyone else to experience it, too. We want to show the lovely gift we received from our Father who calls us the apple of His eye. But over time, just like a dessert you eat every day or a gift you see every day, the shininess wears off. We take it for granted. But God’s blessing is one gift we should never grow used to. \nTim Keller says, “Grace is key to it all…It is the generosity of God, the freeness of his salvation, that lays the foundation for the society of justice for all” (from Generous Justice).\nDid you catch that? Grace lays the foundation for justice. \nWhen we understand God’s insane mercy and grace, we will be compelled to live them out in our own lives, meeting the needs of others in love. The Holy Spirit will grow fruits in us that enable us to act justly. But when we forget the generosity of God and the freeness of salvation, we will begin serving ourselves instead of others.\nLet’s not be women who forget. Let’s not take for granted God’s grace and mercy in our lives. Let’s remember that we were pardoned and accepted into the family of God. That goodness and sweetness is restoration, friends, and we should seek that restoration for others.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/33.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Jeremiah 20:1-18, Psalm 140:12, Isaiah 10:1-4",
    "devo_title": "vengeance is whose?",
    "devo_summary": "\nBY Rebecca Faires\n\nText: Jeremiah 20:1-18, Psalm 140:12, Isaiah 10:1-4\nI know that the Lord will maintain the cause of the afflicted, and will execute justice for the needy.\n– Psalm 140:12\nI like quiet. I have four small children, three of whom are boys, and I really like quiet. Everything about my boys is loud. Even the way they breathe seems unnecessarily loud. I say unsteady things to my husband like, “The children are making me nervous.” Honestly, I don’t even 100% enjoy the sound of children laughing.\nSince I’m the boss, I mandate a lot of quiet time. Those children want to yell? Fine, I’ll make them pay by not speaking for a week. They deserve it because they are disrupters of my peace.\nOk, but here’s the thing. I am the loudest person in my house. Seriously. I don’t know what’s wrong with me. I get excited when I talk, sing a lot, clank around in the kitchen, and holler up the stairs. You know how some women are wonderful and soft spoken? Yeah, I think they’re wonderful, too.\nSo, when my little boys wake me up at 5:30am by kicking the walls and shouting, I think, “VENGEANCE IS MINE!” And I send those little stinkers outside to wake up the neighborhood instead. But what I forget is how my family and friends forgive me all the time for doing the same thing. I make a lot of noise. It’s pretty hypocritical for me to keep this double standard.\nIn Psalm 140:12, David says, “You have no right to ask for justice when you are an oppressor.” Oh no! In my house, I am the oppressor! Sure, it’s my job to train and discipline these little people, and I would be wrong to let them run wild. But in my little sphere of authority, I’m a volume tyrant. I’m the only one who is allowed to be loud.\nI love the idea of international justice. Goodness, I love widows and orphans, right? But big, sexy international justice has to begin with boring, everyday justice in my home. (And, as those with feet on the ground for international justice know, it is hardly glamorous.)\nIf I am going to dream big about international justice, I need to stop being an oppressor myself.\nHow can we begin to seek and live out justice in our own lives? We must see our own sin for what it is: not a difference of opinion, or an innocent mistake, or a personal right. Rather, it is a rank offense to God. Our double standard is the very thing that put Christ on the cross. It isn’t innocent at all.\nOnly when we see the horror of our sin, and the grace of a God who loves us in spite of it, can we begin to know what God’s vision of justice really is. This thought makes me quiet and grateful. And when my heart stops shouting about vengeance, I can hear God remind me that “Vengeance is MINE!” (Romans 12:19). Not Rebecca’s petty vengeance. God’s vengeance. And goodness, aren’t we glad?\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/43.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Luke 14:12-24, Deuteronomy 10:18-19, Exodus 23:6-9",
    "devo_title": "you yourselves were aliens",
    "devo_summary": "\nBY Guest Writer\n\nText: Luke 14:12-24, Deuteronomy 10:18-19, Exodus 23:6-9\nSo show your love for the alien, for you were aliens in the land of Egypt.\n– Deuteronomy 10:19, NASB\nAliens… I relate to the word. I feel so out of place at times.\nRecently my husband was sitting across the table from me at our lovely, unsuspecting Italian restaurant. He pushed in close, but I didn’t have words to define the tears hitting the table. He knew. More than 2 years ago we prayed a prayer and its repercussions were everywhere.\n“God—we will do anything.”\nOur anythings seemed to be costing us everything. Nothing about our previously sane lives was the same. Over the previous year we had given up all control, and God had taken us up on those simple, naive little words.\nSince we prayed, God led us deeper into the lives of the people He loved and further from the safety of the familiar. That night I wondered… Should we take back our prayer?\nIf you try to hang on to your life, you will lose it. But if you give up your life for my sake, you will save it. (Matthew 16:25)\nFreedom and healing hide in the backwards way God tells us to find life.\nDie to live. Lose to find. Empty yourself to be filled.\nIn Luke 14, Jesus describes a banquet. It is beautifully spread out. Everyone has been invited. But as the host prepares to welcome his friends, he realizes everyone has made an excuse of some sort. And no one comes.\nDisappointed, he sends his servant out into the streets to go get the poor, the crippled—the blind and the lame. The servant goes and gets them all, bringing them to the incredible banquet, but there is still room. Room for more.\nThe master then tells his servant,\n“Go out to the highways and hedges and compel people to come in, that my house may be filled.”\nCan you imagine his servant? How nervous and excited and confused he must feel leaving the banquet and running for the least likely party candidates. His master sends him for those who won’t take love for granted.\nWe get to be part of giving people God. \nGod’s economy makes beautiful exchanges: as we give, we grow. You do not risk like a fool; you are wisely investing in the only two things that will not die: God and people’s souls.\nJust like the master to his servant, God whispers through the words of Scripture to us.\nRun on; go get my people. Go to the crippled, the poor, the blind, the lame—they know they need Me. They will come. And after they come, run out to the highway and grab whoever you can—the gates are flung open. Fill up my table! \nCompel them! You were reconciled to me so that you can reconcile others to me. You are my ambassadors. I am making my appeal through you. Run on. (paraphrased portions of 2 Cor. 5:17-20)\nNo matter how uncomfortable and chaotic our lives seem to keep getting, Zac and I could never take back the words of that prayer. Yes, there are nights that tears hit the pillow or our Italian food. But it is worth it. Anything, God. This is life—running to the highways, arms waving, full of God and giving Him away. It is what we were built for, it is what we were saved for, and my heart feels most at home here, doing just this—loving my God and loving His people.\nGod is home to us, and helping others find their way home makes our journey here a little less alien-feeling, don’t you think?\n___________________\nJennie Allen is the founder and visionary behind IF, a movement to gather, equip and unleash the next generation of women to live out their purpose. She is the author of Restless: Because You Were Made for More and Anything: The Prayer That Unlocked My God and My Soul. Jennie lives with her husband Zac and their four children in Austin, Texas.\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/53.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Micah 6:8",
    "devo_title": "weekly truth",
    "devo_summary": "\nBY She Reads Truth\n\nWe believe that memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen this challenging verse from the Old Testament book of Micah:\nHe has shown you, O mortal, what is good.\nAnd what does the Lord require of you?\nTo act justly and to love mercy\nand to walk humbly with your God.\nMicah 6:8, NIV\nWrite this verse down – copy it twenty times if that helps! Save the image below to your phone’s lock screen so you can read these words throughout the day. We want to be a community that is intentional about scripture memorization. Will you join us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/4-micah-6-8-576x1024.png"
},
{
    "book_title": "Justice",
    "devo_passages": "Jeremiah 22:3, Zechariah 7:8-14, Matthew 9:35-36, Mark 12:41-43, Leviticus 5:11-13",
    "devo_title": "Jesus loves the vulnerable",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Jeremiah 22:3, Zechariah 7:8-14, Matthew 9:35-36, Mark 12:41-43, Leviticus 5:11-13\n“When he saw the crowds, he had compassion for them, because they were harassed and helpless, like sheep without a shepherd.”\n– Matthew 9:36\n“For the whole law is fulfilled in one word: ‘You shall love your neighbor as yourself.’”\n– Galatians 5:14\nWhen I think of the vulnerable people whom I have truly loved, the list is short and predictable:\nMy three children.\nMy father in his last painful years of life.\nA few other family members, babies and children along the way.\nThere were the obligatory mission trips when I was in high school and college. I remember well the worn, suntanned face of an elderly woman in Appalachia, the irresistible smiles of inner city kids in St. Louis. It was a kind of love, to be sure. But I’m not convinced it’s exactly what Jesus had in mind when he commanded us to love our neighbor as ourselves. I don’t know about you, but I prefer when those who love me stick around a while.\nThere is another name I can add to that list. Let’s call her Rose.\nRose walks the neighborhood each day, beginning at 8 in the morning and continuing until dusk. I know she starts at 8 because I asked her once. We became friends in the 9 years we were neighbors — that is, from the same part of town. Rose has no formal residence of her own but moves from place to place, paying rent to friends. She walks for no particular reason and for all the reasons. She walks because she can’t not walk. One might have the urge to feel sorry for Rose, but she doesn’t feel sorry for herself. Other than voicing some worry when folks are unkind to her, I’ve not heard her utter a single negative word. “Be careful,” she always calls after me when we say goodbye. And she always asks about my kids. Always.\nLove is officially defined as “a feeling of warm personal attachment or deep affection.”\nPity, on the other hand, is “sympathetic or kindly sorrow evoked by the suffering, distress, or misfortune of another.”\nPity is not a bad thing. Pity is often appropriate. But Jesus didn’t call us to pity. Jesus calls us to love.\nI pitied Rose for years, but then I got to know her. When I allowed myself to develop a “warm personal attachment” to her, and her to me, “pity” no longer described my feelings at all. Rose is my friend. I love her.\nLet’s picture Jesus in this passage from Matthew 9. Read it again, if you have a minute.\nJesus had compassion on the people “because they were harassed and helpless.” Oh, but our Jesus, He did not merely pity that crowd in desperate need of a Savior. He loved them. He had the deepest of affection for them—for us!\nThroughout the New Testament, and even the Old, we don’t see God’s tolerance of or pity for the poor—we see His fierce love and even His preference for the poor and vulnerable. \nThe widow’s offering? It was worth more to Him than the richest man’s treasure. The most daring rescue of all time? It started with a baby in a manger. The first people to know of Jesus’ birth? They were nameless shepherds, living life on the fringes of city and society. And the first to witness Christ’s resurrection from the dead? Two women, hardly the preferred spokespersons of their culture. The adjective “powerful” doesn’t even make the list.\nSo, what about us? Dare we show preference for the poor?\nDare we not pity but love the vulnerable, the way Jesus taught us to love? May we be so bold as to seek out not just one Rose in our lives, but open our eyes and hearts to the many vulnerable children of God among us? Could this become our rule rather than the exception?\nCan we start today?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/72.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Luke 10:25-37, Matthew 5:46-47",
    "devo_title": "the great samaritan",
    "devo_summary": "\nBY Guest Writer\n\nText: Luke 10:25-37, Matthew 5:46-47\n“For if you love those who love you, what reward do you have?”\n– Matthew 5:46a\nI recently sat on the floor in the hut of an Indian slum with a paralyzed woman. She taught me how to Kantha stitch one of the pieces for Noonday Collection,  the organization I run that creates economic opportunity for the vulnerable. Unable to leave her house, this work provided her enough income to send her kids to school. I had so little in common with her– in language, physical ability, culture, and economics. Who was I to come into her home? Me, with my American privilege. Me, with my able body. Me, with my life of so little suffering.\nAnd yet, this is what Jesus did for us. He left Heaven—His perfect culture, with all the comfort and untainted love He shared with the Father— to become incarnate. And He now invites each of us to do the same for one another.\nMoving into different and uncomfortable spaces to love sacrificially is a theme Jesus pounded into earth during his leave of absence from Heaven. In the story of the Good Samaritan we see an invitation to STOP. To be INTERRUPTED. To be INTENTIONAL to meet the vulnerable who may look different than ourselves.\nWhen we leave what is comfortable to share the burden of another, we become incarnational ministers with Jesus. After all, it was Jesus who asked us, “For if you love those who love you, what reward do you have?” (Matthew 5:46)\n“Jesus is the Great Samaritan to whom the Good Samaritan points.”\n– Tim Keller, Generous Justice\nTake a look at the people in your life. Do they all look the same as you? How often does the opportunity to love inconveniently, unexpectedly, and with someone who can give little in return (and I am not talking about parenting!) occur in your week? Tim Keller defines agape love as serving a person “for their good and intrinsic value, not for what the person brings you.” Yet we are often fearful of what it could mean to become the Good Samaritan in our daily life. It is too messy to actually incarnate, so we write a check instead because that feels safer. Or we act the Good Samaritan partly for selfish reasons—we love how it makes us appear. We declare ourselves obedient with ten degrees of separation, still keeping us safe from human suffering. \nGod’s invitation to us is to agape love. It is to a love full of self-forgetfulness.\nThe good news is we can begin emulating the Great Samaritan even when we’re scared. We can start small. We can even move reluctantly, because God will capture our hearts for His beloved with or without our permission. We may certainly act imperfectly; faithfully serving the poor, prioritizing their dignity and intrinsic worth is a complicated road with many false starts. I have loved sincerely but poorly in my journey with the vulnerable. I have commoditized and patronized unknowingly. I have volunteered too far outside my skills, acting as a midwife in the mountains of Bolivia (I have a degree in Latin American Studies but not obstetrics!) and served on a hoity toity board (even worse). And yet the only way I am learning to agape love is by practicing! Not just praying “God give me a heart for the poor” or waiting for that perfect opportunity (because there is no perfect when it comes to justice…it is entirely untidy), but by doing.\nBecause ultimately, Jesus left heaven where salvation was still an unrealized plan and came to earth to actually save a desperate humanity. May we draw courage from His resolve and strength from His mercy to go and do likewise.\n\n \n____________________\nJessica Honegger is the founder of Noonday Collection, an organization which uses fashion and design to create economic opportunity for the vulnerable. What started as a trunk show in Jessica’s home as a means to raise money for the adoption of her son and third child from Rwanda, has grown into a thriving business directly affecting the lives of over 2,000 artisans and their families in more than 10 countries around the world.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/83.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Isaiah 51:4-6, Isaiah 1:17, Matthew 23:1-11, 23-28",
    "devo_title": "do justice",
    "devo_summary": "\nBY Guest Writer\n\nText: Isaiah 51:4-6, Isaiah 1:17, Matthew 23:1-11, 23-28\n“Learn to do good. Seek justice. Help the oppressed. Defend the cause of orphans. Fight for the rights of widows.”\n– Isaiah 1:17, NIV\nIn my work at International Justice Mission, I often see people experience reactions of paralyzing despair when they learn that there are nearly 30 million people held in slavery in our world. Or that a stunning 4 billion people live “outside the protection of the law” – that is, they live in places where they are utterly defenseless from violent people.\nThere is a lot of darkness in our world. So, what do we do?\nWhen our kids were little, sometimes they refused to go to bed because they were afraid of the dark. So we began a tradition called “charging the darkness.” I would stand outside the doorway and charge into the darkness of the room. Of course nothing would happen and my kids would burst out laughing and see that there was nothing to fear in the dark.\nLikewise, I think that the God of light, “in whom there is no darkness at all,” is yearning for us to charge the darkness. To be bearers of light in the darkest places.\nAnd even when the darkness seems pitch black, there are ways that the smallest light can begin to change everything.\nSo, how do we charge the darkness?\nI want to share just 3 powerful ways I’ve seen courageous people of faith charging the darkness.\nDefend the poor.\nMost of the people today who are trapped as slaves, or held unjustly in prison, or are having their houses destroyed by men with machetes cannot afford to have advocates defend them.  Yet, that is something we can actually do for them. Wouldn’t we want someone to do that for us? Paying for the rescue and defense of the poor is something we can and must do.\nRaise your voice.\nIn every forum where poverty is being discussed, you can begin to raise your voice and ask, “What are we doing about the problems of violence against the poor?” My prayer is that as Christians, we will recover our role in building communities where the poor are protected from violence, sustainably through functioning criminal justice systems. Christians played a wonderful role in sounding the alarm on the HIV/AIDS epidemic. They became world leaders in confronting and engaging it. You can look to the struggle against slavery in the 19th century, to the struggle against child labor, to the civil rights movement. In each era, the church not only deployed those with specialized expertise and skill to the work of justice, but the whole church joined in by raising its voice as advocates for the poor. This is the church at its best!\nLook Around.\nSearch within your own life and community to see who around you might be suffering from intimidation and fear. Consider how you could be the one who breaks through with hope and God’s power to bring justice and restoration. Spend time rediscovering, not only God’s passion for justice in the scriptures, but also God’s promises for those who pursue justice (Isaiah 58). I invite you to test God’s faithfulness and power. You will be impressed and encouraged.\nLet me encourage you not to give up. God is building a movement—one of ordinary people, like you and me, who are starting right where we are to confront the injustice in our world. We’ve seen God do mighty things through the willing hearts of people. For this reason, I actually have a lot of hope—because people like you are paying attention, lifting your voice, applying pressure, and not giving up.  \nIt is indeed incredible that God chooses to accomplish the miraculous through the ordinary. Let’s continue to charge the darkness—to take one step at a time, as we follow His holy and good call to us: Seek Justice.\n\n_______________\nGary A. Haugen is founder and president of International Justice Mission (IJM) – a global human rights agency that protects the poor from violence by partnering with local authorities and law enforcement to rescue victims, bring criminals to justice, restore survivors and strengthen justice systems. The largest organization of its kind, IJM has served thousands of survivors of violence. Haugen was the Director of the U.N. investigation in the aftermath of the Rwandan genocide, and has been recognized by the U.S. State Department as a Trafficking in Persons “Hero” – the highest honor given by the U.S. government for anti-slavery leadership. His work to confront violence against the poor has been featured by Foreign Affairs, The New York Times, the New Yorker, The Times of India, Forbes, U.S. News and World Report, the Guardian and National Public Radio, among many other outlets. Haugen is the author of The Locust Effect and The Good News About Injustice.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/93.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Colossians 1:16-17, Isaiah 58:10-12, Matthew 25:31-40, Jeremiah 22:16",
    "devo_title": "love mercy",
    "devo_summary": "\nBY Guest Writer\n\nText: Colossians 1:16-17, Isaiah 58:10-12, Matthew 25:31-40, Jeremiah 22:16\n“If you pour yourself out for the hungry and satisfy the desire of the afflicted, then shall your light rise in the darkness and your gloom be as the noonday.”\n– Isaiah 58:10\n“I will tell you what my problem is,” said Wanda glaring at me, “my problem is HER! Because I ain’t nobody’s summer project.” I was 19, and living for the summer in the very place where God awakened my heart to the work He was doing among the poor—inner city Washington DC.\nWhen I first fell in love with Jesus in my early teens, He made 2 things very clear to me: 1) I was the object of His affection, and 2) He loved the poor and wanted to me to “know Him” by spending my life engaged with the poor.\nAnd so here I found myself, a white privileged teenager interning in a home for women recovering from drug addiction. When Wanda called me out during our weekly house meeting, I froze. Was I treating her like a project? It sure could seem that way— me zipping in for the summer to live in a home of recovering addicts, to ensure they followed house rules and to engage in their recovery journey. “Jesus is my only project,” was all I could muster.\nAfter a few weeks, Wanda asked to talk with me. “Thanks for letting me get mad at you and loving me anyway. When I was your age, I was already turning tricks on the streets. I am so jealous that you are on the right track when I wasted so many years of my life.”\nI am thankful Wanda taught me, when I was still so young, that the poor are not a project. Colossians 1:16-17 talks about how God created ALL things and that in EVERYTHING Christ has the supremacy. This includes poor communities. As Corbett and Fikkert summarize in When Helping Hurts, Christ is and has been actively at work in poor communities. When we enter into the lives of the poor, it is like walking on Holy Ground. \nColossians goes on to say that, through the cross of Jesus, God has reconciled to Himself ALL things that were broken. The broken relationship we had with God— REDEEMED! The broken relationship man had with one another— RENEWED! The broken relationship we had with work and nature— RESTORED! The broken relationship we had with ourselves— RESCUED!\nGod calls each of us to not only share the gospel in words, but to be agents of reconciliation across all of the above relationships in order to create a flourishing world. The good news of the Kingdom that Jesus announced in Luke 4:17-21, is the “renewal of the whole world through the entrance of supernatural forces. As things are brought back under Christ’s rule, they are restored to health, beauty and freedom” (Tim Keller). Communities are restored through the all-encompassing nature of the gospel.\nIt doesn’t matter that you may have different experiences, speak a different language, or come from a different income bracket than your poor neighbor. Each of us is invited by God Himself to spend ourselves on behalf of the poor. This is what it means to know God. This is what it means to love mercy.\n\n____________________\nJessica Honegger is the founder of Noonday Collection, an organization which uses fashion and design to create economic opportunity for the vulnerable. What started as a trunk show in Jessica’s home as a means to raise money for the adoption of her son and third child from Rwanda, has grown into a thriving business directly affecting the lives of over 2,000 artisans and their families in more than 10 countries around the world.\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/102.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "1 John 2:1-6, 1 Corinthians 10:24, Philippians 2:1-11",
    "devo_title": "walk humbly",
    "devo_summary": "\nBY Hayley Morgan\n\nText: 1 John 2:1-6, 1 Corinthians 10:24, Philippians 2:1-11\n“Let no one seek his own good, but the good of his neighbor.”\n– 1 Corinthians 10:24\n \nWhen we drink in the goodness of grace upon salvation and every day after that, we are no longer in debt to sin but are uniquely bonded to Christ forever. It is said that collectively we are the hands and feet of Christ, the very body that can carry out His desires on Earth.\nWhen we humble ourselves before the Lord, we recognize that our own life is gone and we are bonded and risen with Christ. If we stay in step (walk humbly) with Him, we’ll know His heart and come to discern what makes it beat faster.\nThis world is broken with sin. It is evident in every facet of life, bringing forth everything from poverty to pride, from violence and vengeance to apathy and indifference. Sin causes rifts in relationships. Sin is always a break in the way God intended the world to be.\nTim Keller writes about a beautiful concept of “reweaving shalom” in his book Generous Justice. If we look at the tapestry of life, we can see there are threads that are broken. We can see the beauty of the whole has been compromised in places, worn out, torn through, frayed.\nBut shalom, it is peace times infinity.It is the powerful and holy peace that comes from God, from His power and in His grace. As believers, we have access to this shalom through the Holy Spirit and we can begin to repair the fabric of life in His name. \nKeller writes about the gifts we have been given— our time, resources, and power. When we have a right view of God and ourselves, we know these gifts are evidence of a gracious Giver not our own goodness. So, we can humbly use our time, resources, and places of authority or influence to strengthen and restore the fabric of life for others.\nWhen we are acting out of step with God, these gifts can become idols in themselves. But, when we walk humbly with Him, we see that we can use these gifts to make things right here on Earth. To be the hands and feet of Christ and begin to reweave shalom in the fabric of our communities is an exciting gift in itself!\n“Reweaving shalom means to sacrificially thread, lace, and press your time, goods, power, and resources into the lives and needs of others” (Tim Keller, Generous Justice). We can be part of making the whole fabric of life stronger and more beautiful by using the gifts He has given us.\n\nWe learn how to use those gifts by walking humbly with Him.\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/113.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Matthew 12:18-21, James 2:15-16",
    "devo_title": "a real and costly love",
    "devo_summary": "\nBY Amanda Bible Williams\n\nText: Matthew 12:18-21, James 2:15-16\n“Isn’t it obvious that God-talk without God-acts is outrageous nonsense?”\n– James 2:16, MSG\n“The load, or weight, or burden of my neighbor’s glory should be laid daily on my back, a load so heavy that only humility can carry it, and the backs of the proud will be broken… Our charity must be a real and costly love…”\n– CS Lewis, “The Weight of Glory”\nWhen was the last time you thought of your neighbor as having glory? When was the last time you thought of yourself as having glory? I tend to think of myself as, well, just me. And I’m ashamed to say I often think nothing of others at all. But if we believe what the Bible says is true—that we are made in the image of God (Genesis 1:27)—then shouldn’t we live like it?\nThe awareness of God’s image in us should change the way we view the world. It should change the way we view our brothers and sisters, neighbors and strangers, even our enemies.It should be our “first great motivation for living lives of generous justice, serving the needs and guarding the rights of those around us” (Tim Keller, emphasis mine).\nWhen we serve others, we are serving Jesus. Isn’t that what He taught us? (See Matthew 25:31-46.)\nJesus also said that love is laying down your life for a friend (John 15:13). Then He proved it by giving His life for us. We didn’t deserve it. We deserved justice. Yet He took what we deserved upon himself and mercifully gave the impossible gift.\nHis was the ultimate “real and costly love.” \nHere we are, sinners in a sinful world, longing for the world to be brought to right. (Because even in a world of blurred lines, there is still a right.) We’ve tasted something deeper, sweeter than mere fairness — We’ve experienced the kiss of justice and mercy that can only come from the one true God, and we long for the world to experience it, too. We long to see the broken restored, the sick healed, the enslaved set free, and the oppressed liberated.\nThis longing for justice is God-given and right. But if the longing for justice in our hearts does not translate to our hands, we do not fully grasp the passion of our God. \nGod is passionate about justice.\nHe is passionate about mercy.\nHe is passionate about people.\nWe will be, too, if we are passionate about Him.\nJustice is gathering up the love and hope we’ve been given in Jesus and giving it to those who need it most— in the form of our resources and time, our talents and strength, our words and the work of our hands.\nJustice is carrying the Gospel in our literal hands to a world of people just as messed up and undeserving as us, who are made in the very image of the God to whom we pray.\nJustice is a lifetime of linking arms with our Justifier, in pursuit of bringing the world to right, the way He made it to be — Whole. Full. Beautiful. Peaceful. Good.\n“Justice is doing for others what we would want done for ourselves.” – Gary A. Haugen\nAnd it starts right where you are, right now, today.\n\n \n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/122.jpg"
},
{
    "book_title": "Justice",
    "devo_passages": "Ecclesiastes 9:10",
    "devo_title": "weekly truth",
    "devo_summary": "\nBY She Reads Truth\n\nWe believe that memorizing scripture is one of the best ways to carry the Word of our God with us wherever we go—to have God-breathed truth, instruction and reproof in our hearts and minds as we live unto Him each day.\nThis week we’ve chosen this sober yet joyful charge from the book of Ecclesiastes:\nWhatever you do, do well. For when you go to the grave, there will be no work or planning or knowledge or wisdom.\nEcclesiastes 9:10, NLT\nWrite this verse down – copy it twenty times if that helps! Save the image below to your phone’s lock screen so you can read these words throughout the day. We want to be a community that is intentional about scripture memorization. Will you join us?\n\n\n",
    "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/4-ecclesiastes-9-10-576x1024.png"
}
]