[
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 1:27, Genesis 2:4-9, Genesis 2:15-25, Genesis 3:1-24, Joel 2:26-27",
        "devo_title": "Adam and Eve",
        "devo_summary": "\nBY Rebecca Faires\n\nIn any study of biblical people, it’s tempting to take the easy route and look at the humans in the story and say, “Yeah! Do what they did!” or, more frequently, “Don’t do what she did, oh no!” We long to take a moral from the stories of their lives. Resist this urge. Look instead, in every story, at what God is doing. Even in the stories where we don’t see His name mentioned, He is working and remembering His people. He is putting the gospel story on display in their individual stories—and in our own.\nAdam and Eve give us a glimpse of what pre-fall humanity looked like as untarnished image-bearers of God (Genesis 1:27). At the start, they are righteously naked—naked like babies. I imagine they are just delighted to be alive, living freely in healthy, functioning bodies alongside their Creator. But after the fall, Adam and Eve are tarnished image-bearers of God, and their nakedness bears shame instead of pure and innocent glory.\nTruly, Adam and Eve’s original state is hardly recognizable to us. Since the fall, we now see all things from the perspective of our own fallenness. Every nook and cranny of our world now hides a tinge of that original sin. So it’s tough to imagine righteous nakedness, but I am definitely on board for the new heaven and the new earth where shame and sin no longer smudge the image of God we bear.\nAdam and Eve, realizing their sin and shame, attempt to hide and cover up. First they use their own hands to craft garments from fig leaves; they are attempting a man-made, physical solution to a spiritual problem. This is insufficient.\nThen God clothes them in animal skins, but this requires the first shedding of blood—the loss of life and spirit of an animal—signifying that a God-created, spiritual solution is needed to solve the problem of sin and shame.\nWe need God to clothe us as He clothed Adam and Eve. Our spotless righteousness was lost in the fall. Now, we must be clothed with His robes of righteousness, which can only be granted by the shedding of blood—Jesus’s blood. When we are clothed in His righteousness, we can once again find freedom from shame and guilt.\nWe still try to find our own way to righteousness, to free ourselves from shame, either by declaring our sins to be virtues—or by ignoring them altogether. We try to deny that we are fallen at all and laud our shame as admirable (Romans 1:28–32). But these efforts are just more fig leaves.\nThe only solution is Christ. He does not return us to the past, to Eden, but raises us to a new and greater Eden, which cannot be lost. He does not merely restore us to pre-fallen righteous nakedness, but grants us the new and more glorious clothing of Christ’s righteousness. In Him alone we find the fullness of what it means to be made in the image of God: to be like Christ. And “we know that we shall be like him, because we shall see him as he is” (1 John 3:2).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day1-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 5:28-29, Genesis 6:11-22, Genesis 7:1-12, Genesis 8:13-22, Genesis 9:1-17, Psalm 9:10, Romans 8:28-30",
        "devo_title": "Noah",
        "devo_summary": "\nBY Sharon Hodde Miller\n\nMy husband and I swore we would never plant a church.\nWe didn’t have the personalities for it. We didn’t have the risk tolerance. We didn’t have the entrepreneurial skill set it demanded. And besides, we had seen other people start churches and knew how hard it was. We believed in church planting, but it was for “other people,” we said.\nAnd then, God called us to plant a church. \nFor months we resisted. We considered other options. We interviewed for other jobs. We asked God to confirm His calling while secretly hoping He would not. This was not the story we had chosen for ourselves. \nRadical obedience to God makes for great Sunday school lessons and bedtime stories, and Noah’s Ark is one of the most beloved. A man called by God, so late in his life, to do something remarkably ludicrous by the world’s standards: to build an ark on dry ground, large enough to hold animals of every kind. It is a fun story to tell, but the reality of radical obedience is a different matter. It is scary. It is uncomfortable. It is risky. And sometimes, it is embarrassing.\nWe can only imagine how Noah might have felt throughout the construction of the ark. What was the reaction of the surrounding community? Did they question his state of mind?\nAs often as we tell this story to our children, as often as we reenact the animals marching two by two, and as often as we remember the importance of trusting God’s character, we sometimes miss the utter foolishness of Noah’s faithfulness. In Noah’s story and many others’ throughout Scripture, it is impossible to obey and maintain one’s dignified reputation. They have to choose. As do we.\nThis is the less talked about side of following God. Yes, it is hard. Yes, we sacrifice. Yes, it is painful. But the part of faithfulness that sometimes catches us by surprise is the humiliation of it. The whispers. The stares. The questions about your motives. The doubts about your leadership. The absence of support. The silence. The skepticism about whether or not you really heard from God.\nWe cannot miss this part of Noah’s story—his willingness to look like a fool—because this is, very often, what we are saying yes to when we say yes to God. Thankfully, we have historical figures like Noah to remind us who God is and why we can trust Him. And more importantly, we also have Christ, who obediently became a fool, endured mockery, and suffered total humiliation because He knew the end of the story. This so-called foolishness is the narrow path we are called to, but because of spiritual ancestors like Noah, and because of Christ Himself, we know that no matter what God calls us to—whether we would have chosen it or not—we are never doing it alone. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day2-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 11:27-31, Genesis 12:1-7, Genesis 15:1-21, Genesis 17:1-14, 23-37, Galatians 3:8",
        "devo_title": "Abraham",
        "devo_summary": "\nBY Guest Writer\n\nWhen the New Testament talks about the great patriarch Abraham, it’s his tremendous faith that is the highlight of his story. He was indeed exceptional, but Abraham wasn’t perfect. Throughout the course of his story, we see that while Abraham clearly believed God’s promise, he didn’t always trust God’s process. \n(A part of Abraham’s story is God changing his name, from Abram to Abraham. More on that in a moment. But let’s begin earlier in his journey, before God changed his name.)\nWhen God promised Abram that he would be the father of a son who would be the beginning of a mighty nation, Abram believed God and it was “credited to him as righteousness” (Genesis 15:6). But his faith didn’t keep him taking from matters into his own hands. He had a son, but not by his wife Sarai. She had been unable to conceive, so, at Sarai’s prompting, Abram slept with Sarai’s servant Hagar. Ishmael was born, but he was not the son of promise. \nAbram and his wife took the promise God had made to them and tried to bring it about on their own terms. In a sense, it was the fall all over again (Genesis 3). It wasn’t Abram’s finest moment, but it’s not the end of his story. After his failure, God didn’t abandon His promise to Abram. God had another, better plan. God’s plan was an invitation to stretch Abram’s faith.\nGod called Abram to a life cut off from his old practices and patterns. This would be symbolized in two ways. First, God changed his name from Abram to Abraham. Second, God instructed Abraham to be circumcised. Circumcision showed Abraham’s trust was in the Lord, not in his own flesh, to put it delicately.\nThis call to obedience was followed by an unbelievable promise. God would demonstrate His faithfulness to Abraham by giving he and his wife Sarah a son; they would name him Isaac. \nThe Bible tells us he went that very day to circumcise himself and the men of his household. \nCan I ask you to think about the faith it took for Abraham to honor God in circumcision when God’s promise of Isaac depended on that very part of his anatomy? Not to be crass, but the circumstances of his circumcision couldn’t have been exactly clinical, and the recovery was likely difficult. And yet, in less than a year, Abraham would be holding the reality of God’s promise in his arms.\nAbraham had to completely trust God for the blessing of his son Isaac. His story reminds us that God’s greatest promises often invite the greatest faith. God hadn’t just given Abraham a son, God had strengthened Abraham’s faith. \nOur faith must win out over our fear. Fear will cause us to fret, scheme, and take control. Fear will convince us that we can and should take matters into our own hands. Abraham’s story proves that God’s plans won’t always be accomplished in the ways we might imagine. Our faith isn’t built merely on the promises of God, but on the character of the God who makes those promises. We live in confidence that He will fulfill them in His time and in His ways.\n\nWhitney Capps is a national speaker for Proverbs 31 Ministries. Her first book, Sick of Me (B&H Publishers) and bible study, We Over Me (LifeWay) both release in March 2019. Whitney is the founder of Simple Seminary, a place for the everyday gal to learn theology. She and her husband, Chad, are raising their four boys just outside Atlanta, Ga. You can connect with her at whitneycapps.com or on Instagram, @whitneycapps.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day3-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 16:1-16, Genesis 21:8-21, Psalm 56:8",
        "devo_title": "Hagar",
        "devo_summary": "\nBY Rebecca Faires\n\nI have a very little baby right now. I spend most of my hours nursing her or holding her. And when she finally happens to be sleeping somewhere that’s not my arms I’m able to do other things. But the problem is my list of “necessaries” has become so long and so urgent that I can’t even decide where to begin. I lay the baby down and just stand still with glazed-over eyes, thinking, Where do I begin? This morning while she napped, I gaped at my list with sheer, uncomprehending panic. I couldn’t set myself on a course. And if you can’t find a place to start, and then stick with your plan, nothing ever gets done. I spend the moments in between nursing sessions drifting from task to task. Homeschooling, housecleaning, writing, trying to be present and available. But these responsibilities stack on top of each other, and I inevitably find my mind aimlessly wandering.\nEven the most focused among us are prone to wander. We allow ourselves little, innocent wanderings (like idly wondering if hummingbirds fly to Puerto Rico in the winter) or wide, damaging veers off the course (like refusing to forgive). And sometimes we flat-out run away. That’s what Hagar did. Sarai, later renamed Sarah, treated her maidservant harshly, and pregnant Hagar ran from her, into the wilderness. But the Lord saw her. He gives grace to those who can’t seem to take anymore.\nDo you find yourself in her shoes sometimes? Not, ahem, the impregnated maidservant of a biblical patriarch so much, but by yourself in the wilderness? Those who stray, those who run, are nevertheless beloved by Him. He still attended and cared for Hagar in the desert, and He does the same for us.\nGod sees us even when we can no longer see straight. His providence encompasses us no matter where we go. This is not a reason to excuse and condone waywardness, but it’s a reminder of the goodness and graciousness of God, a provocation to gratefulness and an exhortation to run to Him.\nHe didn’t see Hagar because of anything she’d done. We aren’t told she had faith like Abraham’s. We read nothing about her devotion to God or to righteousness. As Sarai’s maidservant, she didn’t have much of a choice in the matter when it came to bearing Ishmael. And when Sarai was mean to her, she ran off in disobedience. Of course, we can all empathize with her, but the fact of the matter is, God saw Hagar and comforted her in the desert because He is good, not because Hagar was. And that is good news for all who wander. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day4-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 17:15-22, Genesis 18:1-15, Genesis 20:1-18, Genesis 21:1-7, Philippians 1:6",
        "devo_title": "Sarah",
        "devo_summary": "\nBY Melanie Rainer\n\nMy backyard garden is an unrealized dream. A few months ago we sowed and scattered seeds with the haphazard helping hands of my four-year-old daughter. Despite multiple warnings not to do so, she dumped an entire container of bird seed alongside my hoped-for flowers. In addition, the sod we ripped up to make room for the garden left rows of roots that like to pop up, and no matter how many times I rip them out, they always seem to show up again. \nNow I cannot tell weeds from future blooms, and the hours I spent trying to cultivate a beautiful cut-flower garden seem fruitless (or, flowerless). I know that eventually, the real flowers will bloom, and then I can root out the weeds that have grown. \nSarah’s life was marked by a root of bitterness, a weed that made her scoff at God’s promise and treat Hagar with contempt and cruelty. Bitterness was born out of her perceived injustice: her husband fathering a son with her slave (Genesis 21:9–10), her own inability to have children (11:30), and the seemingly-impossible promise God made to her (18:10). \nIf you told me today that in two months, my garden would be bursting with zinnias, peonies, snapdragons, and gardenias, I would probably laugh. My track record, like Sarah’s in childbearing, is sparse. I have nothing on which to base my hope of a bountiful flower harvest. \nWhat did Sarah have to fight back against her bitterness? She had a promise, a word spoken by the Author of promises. But still, she laughed. \nThankfully, the fulfillment of God’s promise to Sarah did not rest on her. God did not bless her with a son, Isaac, because of her attitude. It was not a reward based on piety, or character, or anything other than His word. And His word is always good, no matter the shape and bent of our hearts. \nBitterness has deep roots in my own heart, and daily I have to push against its influence. I think, You deserve this. You’ve earned it. And then I compare my circumstances to someone else’s, reasoning, What has she done to get that thing (job, house, vacation, experience, complexion)? I am just as worthy!\nThe problem with this false narrative is this: not only is it deeply baked in privilege, but it feeds into the merit-based culture we live in. Entitlement begets merit, which begets more entitlement, and so on. The culture of God’s kingdom is anchored neither in merit nor in entitlement, but rather in the goodness and faithfulness of God. \nSarah had neither merit nor entitlement. She seemed to have bitterness where faithfulness should grow. But what she did have was the promise, and so she became the mother of the promise by God’s grace alone. \nOn bitterness, poet and hymn writer Anne Ross Cousin said this in her poem, “In Immanuel’s Land”:\nSoon shall the cup of glory Wash down earth’s bitterest woes, Soon shall the desert briar, Break in to Eden’s rose  …  I stand upon His merit,  I know no other stand Not e’en where glory dwelleth In Immanuel’s land. \nThe things I long for are chaff and weeds, distractions from the best promise ever made: the eternal presence of the Lord Himself. Like Sarah, I have no merit to cling to as I wait for the fulfillment of God’s promises. But I have Him, and His Word, and His merit alone. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day5-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Philippians 1:6",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nI am sure of this, that he who started a good work in you will carry it on to completion until the day of Christ Jesus. —Philippians 1:6\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day6-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Romans 8:28",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we’ll memorize Romans 8:28, a reminder that the same God who is sovereign over these stories in the Old Testament is sovereign over our stories as well. \nWe know that all things work together for the good of those who love God, who are called according to his purpose. —Romans 8:28 \nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-1-576x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 22:1-19, Genesis 25:11, Genesis 26:1-5, Genesis 26:12-25, John 3:16-17",
        "devo_title": "Isaac",
        "devo_summary": "\nBY Erin Davis\n\nAny woman who has held a chubby-faced cherub in her arms surely gets squeamish at the idea of surrendering a child. Though it knots up our stomachs, the pattern of parents surrendering children to the Lord is inescapably woven throughout the Bible. \nWe see it with Moses’s mama as she tenderly laid him in a basket and placed him in the river (Exodus 2:1–10). Perhaps we remember our own bins of baby clothes stashed in the closet as we read about Samuel, whose mother, Hannah, gave up her toddler to serve in the temple, and then faithfully delivered a “little robe” to him each year (1 Samuel 1:1–2:21). And as we consider the life of Isaac, the promised miracle child of Abraham, we see this surrender in graphic detail. \nIf this is just a human story about a human family, frankly, it stinks. How could a good God ask a father to give up the child of promise he was given? How could a good father agree to such a request? It is hard to wrap our hearts around the situation. But this is more than a story about one human family. This account of Abraham and Isaac points to the bigger story. Way back in Genesis, God was showing His people a preview of the gospel. If we anxiously look away from this story or race through it to find an easier pill to swallow, we will miss the stunning parallels. \nIsaac carried the wood for the sacrifice on his back (Genesis 22:6).Jesus carried the cross on His back, on the way to Golgotha (John 19:17). \nIsaac was bound and led to the altar (Genesis 22:9).Christ was bound and led to the cross (Mark 15:1). \nIsaac is described as Abraham and Sarah’s beloved and “only son” (Genesis 22:2). Centuries later, God the Father would declare from heaven, “This is my beloved Son, with whom I am well-pleased” (Matthew 3:17). \nBecause of Abraham’s obedience, the angel of the Lord promised, “All the nations of the earth will be blessed by your offspring because you have obeyed my command” (Genesis 22:18).Because of Christ’s obedience, “[He] purchased people for God by [His] blood from every tribe and language and people and nation” (Revelation 5:9).\nBut these stories diverge at a critical juncture. Isaac’s life was ultimately spared (Genesis 22:11–14), but for Christ there would be no ram in the thicket. The Father would follow through with the sacrifice so that all sons and daughters could be spared. \nWe will all have “Isaacs” to lay down on the altar. But our stories are no more about us than Isaac’s moment on the mountain was about him. Our lives are stamped by the gospel. Every baby in the bullrushes, every “tiny robe,” every day we choose to hold our own beloveds with open palms—we are reminded that our God willingly sacrificed His beloved Son so that we might be called the children of God (John 1:12). \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day8-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 24:1-67, Genesis 25:19-26, Psalm 37:23-24 ",
        "devo_title": "Rebekah",
        "devo_summary": "\nBY Guest Writer\n\nThree years ago, we told our kids we were moving to a new city. Through tears, we told them we were choosing to follow where we believed God was leading us. My husband said he believed God would be kind to each one of us in this move because He “is good, and his faithful love endures forever; his faithfulness, through all generations” (Psalm 100:5, emphasis mine).\nGranted, God’s goodness didn’t always look the way we expected it to, but over these past three years, our family has experientially learned over and over again that God is indeed good and that He doesn’t stop being faithful to His people. And we see that same faithful God in Rebekah’s story.\nRebekah is going about the daily work the Lord has set before her when she’s asked to leave everything familiar behind and follow God into the unknown. Not only is she asked to move to a new land, but she’s also asked to marry a man she’s never seen. And she goes willingly! \nWhen Abraham’s servant tells Rebekah’s family this remarkable story of God’s leading, Rebekah’s father and brother declare, “This is from the Lord; we have no choice in the matter. Rebekah is here in front of you. Take her and go, and let her be a wife for your master’s son, just as the Lord has spoken” (Genesis 24:50–51).\nIt’s clear to Rebekah’s family and to Abraham’s servant that “a person’s steps are established by the Lord” (Psalm 37:23). They see that the Lord has appointed Rebekah for Isaac. \nWhile we see the faithfulness of both Rebekah and her family in how they follow God, this is also the story of a much deeper faithfulness—God’s faithfulness to His people. Rebekah’s story, my story, and all the stories of God’s children are ultimately stories of God’s unending commitment to His people. Even in the deeply painful places, God is faithful. His faithfulness is found all over this story and throughout our own lives as well. And as we see with Abraham’s servant, when we share the stories of God’s faithfulness, they lead us to worship.\nYou don’t have to read much further to find that Rebekah is sinful just like us. But the good news of the gospel is that God’s faithfulness isn’t contingent upon our own. “While we were still sinners, Christ died for us” (Romans 5:8). The Bible is the story of God’s faithfulness to an unfaithful people He never stops pursuing.\nHowever huge and daunting the unfamiliar—or even the familiar—seems today, we can trust God because He is faithful, as He was in the past and will be forever. “His mercies never end. They are new every morning; great is [His] faithfulness!” (Lamentations 3:22–23).\n\nKimberly Girard is a well-loved child of God, wife of an extraordinary man, mother of three amazing kids, and writer living in Pittsburgh, Pennsylvania. You can find her at Loud Singing and on Twitter. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day9-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 25:27-34, Genesis 26:34-35, Genesis 27:1-46, Genesis 28:1-5, Hebrews 12:14–17",
        "devo_title": "Esau",
        "devo_summary": "\nBY Kaitlin Wernet\n\nThe early 2000s were a treasure trove of television game shows. If you don’t already know this by heart, let me explain. (And if you do, you are my kind of people and can pass “Go” to collect $200.) \nWhile I’ve always had infinite admiration for Vanna White on Wheel of Fortune, and my brother claimed he bonded best with our father over Family Feud, it was a blonde British woman named Anne Robinson who really raised the bar for game shows. Host of The Weakest Link, (which came aired at 4 pm, just in time for my elementary-school self to hop off the school bus and grab a cheese stick), Anne was known for her no-nonsense TV personality, and I adored her for it. \nOn the show, a team of contestants would take turns answering trivia questions with the goal of getting the most correct answers within a specific amount of time. When time was up, the team voted on the weakest link (a.k.a., the worst player in the game). Then it was time for the most memorable part of the show, when Anne would announce the loser by addressing the individual by name and proclaiming, “You are the weakest link. Goodbye.”\nIt’s easy to treat the story of Jacob and Esau like another episode of The Weakest Link. Which brother is doing the right thing? Who deserves favoritism? Who does God love more? \nFirst, we have Esau, who sells his birthright to Jacob for stew. Then, we have Jacob, who steals the blessing that was rightfully Esau’s. If I were the judge, I’d conclude that they were both at fault. They’re both weak links. \nEsau’s story is much like ours; he gave in to his fleshly desires and lost the most valuable thing in his possession. But he was also hurt and wronged by his own flesh and blood, his brother Jacob. It’s the oldest and truest story we know: Our flesh chose sin, and our hearts chose betrayal. Pain is a constant in our stories. We are the weakest links. And yet, God didn’t say goodbye to us in our weakness—far from it, actually. He did the exact opposite: He sent His Son to reverse the curse by bearing the weight of our sin, a burden that had rightfully been placed on us. \nThese stories in Genesis, set just after creation story and the Fall, and long before the birth of our Savior, show us how deeply we need redemption. We cannot be trusted with things of value like birthrights, brothers, or blessings. An intervention is necessary, and thanks be to God, an intervention is coming. But first, we must take this opportunity to realize our humanity, grieve our sin, and repent. We cannot proclaim His strength without first admitting our weakness (2 Corinthians 12:9). \n“And make sure that there isn’t any immoral or irreverent person like Esau, who sold his birthright in exchange for a single meal. For you know that later, when he wanted to inherit the blessing, he was rejected, even though he sought it with tears, because he didn’t find any opportunity for repentance” (Hebrews 12:16–17).\nAny average ruler (or game show, for that matter) would certainly have chosen for Esau, Jacob, you, and I to pack up our bags a very long time ago, at the onset of our failures. But because of Christ’s sacrifice, we are welcomed into eternity instead of turned away. What a prize indeed. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day10-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 29:1-35, Psalm 63:1-4, Matthew 1:1-16",
        "devo_title": "Leah",
        "devo_summary": "\nBY Andrea Lucado\n\nWhatever my four-year-old niece is doing, she wants my sister, her mom, to be watching.\n“Look, Mommy!”\n“Look at this, Mommy!”\n“Look over here, Mommy!”\nIt’s as if whatever ball she is throwing, twirl she is doing, or somersault she is attempting doesn’t count unless her mom sees her. \nThis desire to be seen is innate in us all, and it doesn’t disappear with childhood. As we read today, a full-grown woman can ache with longing when she knows she is not seen.\nLeah is unloved and unwanted. Jacob loved her sister, Rachel, more than her. Rachel is described as “shapely and beautiful.” Leah is described as ordinary. Oh, could this story hit more close to home? Who hasn’t felt less than, like not enough in comparison to the women around you?\nThis story gives me flashbacks to my tall, gangly adolescent self. I knew I was neither shapely nor beautiful. I watched both of my sisters—inside and out, the most beautiful women I know—be crowned Homecoming Queen and Prom Queen and I wondered, does anyone see me? If I am not wearing a crown, am I still worth something? In high school, it’s hard to believe that you are.\nLeah is aware that God sees her: “The LORD has seen my affliction,” she says (Genesis 29:32). “The LORD heard that I am unloved” (v.33). But her response to God’s attention is to then desire the attention of Jacob. As she says after she bears three sons, “Surely my husband will love me now… At last my husband will become attached to me” (vv.32,34).\nI wonder if we are all born with an innate desire to be seen because we already are. But instead of resting in God’s attention and care, we crave the attention of others. We want the crown, the sons, the stamp of approval that will make us feel loved and seen by everyone but God.\nInterestingly, our story does not end with Jacob giving Leah his stamp of approval. Instead, after the birth of her last son, Judah, it is a different stamp of approval that Leah desires: “This time I will praise the Lord” (v.35). No craving for Jacob’s love. No hoping for his attachment. Her attention is now on the One who’s always paid attention to her, the One who’s loved her all along.\nJudah would eventually be Israel’s greatest tribe. Jesus’s bloodline would point back to Judah by name, while the others are referred to as “his brothers” (Matthew 1:2). Leah and her plight would be memorialized forever in history. But she knew none of this when she praised the Lord. \nWhat is the reason you feel unseen? Whose attention do you crave? Do you believe you are heard by God, seen by God? If so, this time, this day, instead of longing for the gaze of that person, or those people, rest in the gaze that is already on you. You don’t have to beg Him to “Look!” He is already looking. This time, praise the Lord.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day11-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 30:1-24, Genesis 35:16-20, Psalm 98:1-3, Hebrews 4:16",
        "devo_title": "Rachel",
        "devo_summary": "\nBY Rebecca Faires\n\nLaban really gave his daughters a raw deal. When he tricked Jacob into marrying Leah, he sentenced both of his girls to one truly heartbreaking marriage. Instead of enjoying sweet accord between husband and wife, both women are crowded into a bitter, vengeful squeeze of marital misery. One wife is just the right number of wives, but one man, two sisters, and their maidservants to boot is a cramped relationship for sure. Indeed, the normal strains of marriage are quite enough without having to engage in a fertility contest with your own sister. A fertility contest that Rachel was losing—the stats were 10 to 0 against Rachel before Joseph was finally born.\nOnce a month, my husband goes out for an evening with his friends to discuss literature. But by the time he gets home at 10pm I’ve had quite enough of sharing him with others. Marriage is a tight circle of two. Rachel and Leah were both denied the sweet intimacy that can only exist when two people are alone in a marriage. They likely both felt forgotten by both their husband and by God. And forgotten is a feeling that we can all identify with. People will absolutely forget us. Terrible marriages, absent parents, distracted friends, and even children can pass over us as they forge ahead in life.\nBut there is One who does not forget. God remembers His people. God remembered Rachel (Genesis 20:22). And in Scripture, when it says that God “remembers” someone, it means that He is going to intervene and help. When God remembers, He takes action (Genesis 9:15, 19:29, 30:22; Exodus 2:24, 32:13; Psalms 25:6–7, 74:2). Even though Rachel seems to only be asking Jacob for help, God remembers Rachel. He remembers, He listens, and He opens her womb (Genesis 30:1,22).\nIn the weirdest and most uncomfortable situations—in the deepest, saddest days—God remembers and listens. It goes without saying that His action may not be what we are asking for or what we think the situation requires, but in His sovereignty, He listens and remembers His people.\nRachel died in childbirth when Benjamin was born. She fought with Leah for her entire married life, and she never got to enjoy watching her own sons grow up. She didn’t get to grow old with the man she loved. It was Leah’s son, Judah, who was in the line of Christ. Rachel’s life probably did not turn out at all like she had hoped. But she was remembered by God.\nLife isn’t about us and what we are doing. It is easy to forget that just because things have not gone as we hoped, that does not mean that we are forgotten or abandoned. Indeed, God builds His kingdom even amidst our dashed expectations.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day12-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Hebrews 12:14–15",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nPursue peace with everyone, and holiness—without it no one will see the Lord.  Hebrews 12:14\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day13-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Psalm 63:1",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we’ll memorize a verse we read together after Leah’s story on day 12. Written by David, Psalm 63:1 is an encouragement to us that we can cry out to God in every circumstance. \nGod, you are my God; I eagerly seek you. I thirst for you; my body faints for you in a land that is dry, desolate, and without water. —Psalm 63:1\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-2-576x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 28:10-22, Genesis 31:13, Genesis 32:3-32, Genesis 33:1-11, Genesis 35:9-15, John 1:43-51",
        "devo_title": "Jacob",
        "devo_summary": "\nBY Bailey Gillespie\n\nGrowing up in Northern California, I spent summers along the south fork of the American River in the tiny, blink-your-eyes-and-it’s-gone town of Coloma, the heart of the gold rush valley. Summers there were sticky. Tourists from every pocket of the world came for the whitewater and left baptized by sunshine, sunscreen, and coconut frozen yogurt from the shop down the street.\nAlong the river, you can spot towers of smooth stones called cairns balanced one or two feet high. Although these are now little more than artistic contributions from local river folk, in ancient times, cairns served as burial monuments or ceremonial landmarks. They marked something worth remembering. \nThroughout Scripture, stones symbolize many different things. After Jacob’s dream, where God promises to watch over and provide for him, he is caught off guard and uses the stone lying at his head to memorialize the moment: “Surely the LORD is in this place, and I did not know it” (Genesis 28:16). Suddenly, that place was known as Bethel, the house of God, because the Lord had made His presence known there (v.19). \nI love that Jacob was surprised by encountering God. Aren’t we always forgetting how close He is? Embedded in us is the classic tension between head and heart: we know God is with us, though sometimes it may not feel like He is. I can’t tell you often I’ve been surprised to find Him, just when I’d feared that His silence indicated His absence.\nThis stone was an important step in Jacob’s journey. Because of what the Lord revealed to him in a dream, he was able to carry forward the promise of returning to his “native land” with confidence (Genesis 31:13). But I admit, I’m a little confused by the plot twist. \nBefore Jacob makes it home, he meets and wrestles with God. Why was this the method for receiving God’s blessing? Why couldn’t Jacob have his homecoming without a disjointed hip? Despite the paradox of blessing brought from misfortune, Jacob is so moved by encountering God’s presence that he, once again, names the place to memorialize it. \nWhether it’s owning a home or publishing a book or witnessing a reconciliation, my heart desires things that aren’t guaranteed. What God does promise is abundant life: new ways of thinking, of living, of being. We are no longer slaves to death. We don’t have to wait for God to inhabit a place now that His Spirit lives in us. \nAs we watch for the Lord together, let’s name the moment we see Him. Let’s raise a stone in remembrance. Let’s live from a place of blessing and abundance rather than scarcity, because our birthrights are no longer dependent upon our earthly lineage. Instead, we hold the heavenly birthright Christ gives us, “an inheritance that is imperishable, undefiled, and unfading” (1 Peter 1:4).\n\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day15-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 37:1-13, Genesis 37:18-28, Acts 7:9-16, Genesis 50:15-21",
        "devo_title": "Joseph",
        "devo_summary": "\nBY Claire Gibson\n\nSibling relationships are tough. For the entirety of my childhood, I skittered around my older sisters’ bedrooms, pilfering makeup, borrowing clothes, and denying that I’d done anything of the sort. We tattled on each other constantly. And when one of my sisters finally got her driver’s license, she was annoyed to discover that meant she would have to drive me to school every day. I wanted my sisters to like me, and yet try as I might, I was always a little bit annoying.\nJoseph was a little annoying too. Scripture tells us he had a habit of tattling on his brothers (Genesis 37:2). And later, when he had vivid dreams of his future glory, he didn’t tuck those dreams away to contemplate in private. Instead, he went on blabbing them to everyone! Even his father got a little tired of 17-year-old Joseph’s big head (v.10).\nJoseph’s story is the very last story in Genesis. It’s a hard story, one of sibling rivalry and deceit and near-murder. After all, when his brothers sold him into slavery, they had no idea how Joseph would fare in the hands of his captors. Would he survive? Did they care?\nThough today’s assigned Scripture gives the bookended view of Joseph’s story, it’s worth taking time to read what happened in between. In the years after his brothers sold Joseph into slavery, he was sold again, accused of rape, and then thrown into prison, where he festered for more than two years. When Pharaoh finally summoned Joseph from the dungeon to interpret his terrifying dreams (Genesis 41), Joseph’s own dreams could have easily faded into nothing in his memory. Where was the God who had promised to give him power and influence? \nThe truth is, Joseph’s life was far worse and far better than what he’d seen in those dreams. God had a plan for him, but that plan included much suffering. That plan included brothers that plotted evil against him. It included time in a dungeon. It included trembling before a king that could have killed him on sight. And it included rising to a position of power that ultimately saved his entire family—and the region—from starvation. What they planned for evil, God used for good (Genesis 50:20). \nBecause we have the rest of Scripture, we know that Joseph’s role in the redemption of the world was only the beginning. After all, that large family that arrived in Egypt to escape starvation ultimately became the nation of slaves at the beginning of Exodus—the ones crying out for a savior. There was more suffering to come. And more saving.\nJoseph’s life was central to God’s plan for the world. But just because we’re living out God’s plan for our life doesn’t mean there won’t be pain. We can rest assured that even what others plan for evil, God can use for good.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day16-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Genesis 39:1-23, Proverbs 24:15-16, Ephesians 5:1-4, 1 Thessalonians 4:1-8 ",
        "devo_title": "Potiphar’s Wife",
        "devo_summary": "\nBY Sharon Hodde Miller\n\nOne of the hardest and most helpless feelings in the world is when another person deals carelessly with our reputations. Maybe it is an anonymous person online who publicly questions our motives. Maybe it is a commenter who glimpses one photo of our lives and makes assumptions about our parenting. Maybe it is a friend who is angry with us and then vents to our mutual friends. Maybe it is an ex-boyfriend, or an ex-husband, who is sharing a very different version of the break-up than the one we know to be true.\nWhenever we experience slander, unfair criticism, or unfounded accusations, it can feel as though our hard-earned reputations are being dismantled brick by brick. Everything we worked for, the integrity we established over the course of years, suddenly seems fragile and vulnerable, all because of the untested words of a gossiper.\nJoseph knew this helplessness well. He was a humble man of exceptional character, who spent his life climbing out of a pit, working his way up, making connections, and earning a good name, only to have it all undone by the wicked whim of a powerful woman. At least, that is how it must have seemed at the time. But that is not how Joseph’s story ended. In actuality, what determined the outcome of Joseph’s story was not power, but character.\nAs we now know, Joseph’s life did not end with this accusation. It seems that almost immediately, Potiphar distrusts his wife’s account. We know this because the punishment for Joseph’s supposed crime should be death, but instead, Potiphar only imprisons him. He is, in essence, not giving Joseph what he deserves. What this tells us is that Joseph’s character is influencing the outcome, and it would continue to do so for years.\nIn the chapters that follow, Joseph’s character opens doors for him. He gains favor with those in authority over him, until he eventually receives authority himself. Joseph is forever remembered as a noble man and a great leader; Potiphar’s wife, on the other hand, is only remembered for one of the worst decisions of her life. We don’t even know her name.\nIt is difficult to be on the receiving end of slander or a false accusation, but this story comforts us with this truth: your character is louder than you think. Character always reveals who you really are, and no amount of power, lies, or manipulation can hide it. This is a comfort for those of us who choose the way of holiness, but it is also a warning for when we don’t. \nThe sin of Potiphar’s wife was not simply lust, but the abuse of power, and none of us is immune to it. Our need for control—even when it is directed toward good and noble purposes—can lead us to compromise our integrity. “The ends justify the means,” we reason. But this is not the logic of godly character. Instead, we follow a Savior who chose to be falsely accused rather than exert His will by force. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day17-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Exodus 1:8-21, Psalm 34:1-22, Galatians 6:7-10",
        "devo_title": "Shiphrah and Puah",
        "devo_summary": "\nBY Guest Writer\n\nObedience always brings blessings. I’ve heard that message preached, but Exodus 1 seems to teach us something different. It reminds us that we must be very careful with what we expect for our obedience and what we define as a blessing. Today’s reading commends a faith that reverently fears God, not the opinions, whims, and wants of men.\nFearing the growth and potential power of the Hebrew slave nation, Pharaoh orders the midwives who assisted the Hebrew women in childbirth to kill all the boys they helped to deliver. The Bible records the names of these women: Shiphrah and Puah. Pharaoh commands them to be His co-conspirators in a plot to decimate the Hebrew population. But they never carry out Pharaoh’s plan. It is a bold, faith-filled move. But the results are a mixed bag of blessings. We can learn a few important lessons from their example.\nWe must be careful not to assume that our obedience clears the path to ease and happiness. The midwives feared God more than they feared Pharaoh. But their act of rebellion, though honorable, moved Pharaoh to ratchet up his plan against Israel, and he commanded that all baby boys be thrown into the Nile. This is why we must be careful not to barter our obedience for God’s blessings. Our blessing may be things we cannot see.\nIn the case of the midwives, they were rewarded with tangible gifts. The Bible records that God blessed the women with families of their own. There is no formula that says our obedience will unlock the desires of our hearts. However, God is the Giver of every good thing we receive (James 1:17).\nIt’s not entirely clear if the midwives were Hebrew or Egyptian. Either way their faith was tested. Yes, God blessed the midwives with families of their own, but the very next verse says that Pharaoh now commanded that all Hebrew boys be thrown in the Nile. Would the faithful midwives now lose their own children to Pharaoh’s evil mandate? Or were the midwives Egyptian women who would watch helplessly as even more baby boys were killed? God saw their faithfulness and would now grow their faith even more. \nOur greatest blessings and most precious rewards are the eternal ones. I want God to make me bolder, refine my character, and chisel away my selfishness. Those treasures won’t always feel like blessings. \nThe overwhelming context of Scripture points to these same truths. Obedience doesn’t guarantee or broker blessings. Obedience must be motivated by faith in God, not the fear of man. Like Shiphrah and Puah, we are commended to act in ways that prove our confidence in our God who is always faithful, keeps His word, and blesses His people. I’d like to be the kind of person who trusts God to give and define my blessings. I’d rather be changed for eternity than comforted temporarily.\n\nWhitney Capps is a national speaker for Proverbs 31 Ministries. Her first book, Sick of Me (B&H Publishers) and bible study, We Over Me (LifeWay) both release in March 2019. Whitney is the founder of Simple Seminary, a place for the everyday gal to learn theology. She and her husband, Chad, are raising their four boys just outside Atlanta, Ga. You can connect with her at whitneycapps.com or on Instagram, @whitneycapps.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day18-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Acts 7:17-36, Exodus 3:1-22, Exodus 4:1-17",
        "devo_title": "Moses",
        "devo_summary": "\nBY Rebecca Faires\n\nMoses is a hero of our faith. His life is the stuff of legends—found as a baby in the Nile, talking to a burning bush, heralding plagues in Egypt, parting the Red Sea. Who can claim a life as epic as the one Moses got to lead? And what made the difference? What made this man so dramatically different from everyone else?\nWe are inclined to picture Moses with the face of Charlton Heston—square-jawed, steely-eyed, and full of manly courage. But his first, second, and third responses to God’s call were fear and squirming. He eventually answered the call, but courage certainly wasn’t what made him stand apart. Moses even doubted God’s ability to work through him. In his self-doubt and excuse-making, we see how afraid Moses was, running from the serpent, and trying to wiggle out of his holy calling.\nHere is what makes all the difference: God’s promised presence. He said to Moses, “I will certainly be with you” (Exodus 3:12). Moses was great because he stood on holy ground (vv.5–6). He stood on the foundation of God’s faithfulness. Every word from his mouth, or from the mouth of Aaron, was powerful because they were God’s words. The staff in his hands was the tool of God’s work of deliverance. Again and again, the assurance that God gave to trembling Moses was that He, the God of Abraham, Isaac, and Jacob, would be the true deliverer of Israel.\nWhen Israel rejected Moses’s leadership, they were truly rejecting God; Moses was simply the minister of God’s will and word to His people. In this we see two great truths that apply directly to us today. First, God Himself is the true deliverer. We do not lead others out of bondage. Only Christ does. We do not save.. Only the hand of God does.\nSecond, our own calling, like that of Moses, is to be willing instruments in the hands of God. It does not matter how feeble our voices, how weak our knees, how trembling our hearts. God’s power is made perfect in our weakness. The greatest deeds of our lives will be those in which we are malleable to His will, and in which He receives all the glory. He must increase, and we must decrease.\nGod graciously invites fearful and inarticulate servants like us to join in His great work in the world. There was nothing extraordinarily special about Moses, except that He was chosen by God to stand on holy ground. And thanks be to God, that the true work of deliverance is already accomplished fully by His own Son Jesus Christ!\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day19-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Ephesians 5:1–2",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nTherefore, be imitators of God, as dearly loved children, and walk in love, as Christ also loved us and gave himself for us, a sacrificial and fragrant offering to God. —Ephesians 5:1–2\n\nBennett\ngrew up in a different environment and says that he’s gambled all of\nhis life even enjoying church bingo when growing up. Although the Bible\ndoesn’t outright approve of gambling, there are some questions a\nChristian can answer to help discern their truth. This philosophy contends that gambling might be permissible for a Christian if four conditions are met:\n1.\nWhat is staked must belong to the gambler and must be at his free\ndisposal. It is wrong, therefore, for the lawyer to stake the money of\nhis client, or for anyone to gamble with what is necessary for the\nmaintenance of his wife and children.2. The gambler must act freely, without unjust compulsion.3. There\nmust be no fraud in the transaction, although the usual ruses of the\ngame may be allowed. It is unlawful, accordingly, to mark the cards, but\nit is permissible to conceal carefully from an opponent the number of\ntrump cards one holds.4. Finally,\nthere must be some sort of equality between the parties to make the\ncontract equitable; it would be unfair for a combination of two expert\nwhilst players to take the money of a couple of mere novices at the\ngame.”(7)\nClose\nHowever, even those who subscribe to this philosophy concede that low deposit gambling can lead to problems. For example, if gambling leads to a squandering of time and money then it may be “a source of sin and ruin to others.” Like other addictions, gambling can arouse excitement in the participant and may lead to conduct which is difficult to control. (8)\nUnder\nthis view of Christian liberties and what the Bible does not\nspecifically address about gambling, the acceptance of gambling is then\nconditioned upon the presence of all four of the above requirements and\nthe self-discipline of the gambler. Such a philosophy allowed Mr.\nBennett to gamble without being morally conflicted. If you can handle\nit, that’s fine, but if you “can’t handle it, don’t do it.”\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day20-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Psalm 34:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nOn day 18, we read the story of Shiphrah and Puah, two Egyptian midwives who feared God and defied the orders of Pharaoh to protect God’s people. This week we’ll memorize Psalm 34:7, a verse from that day celebrating God’s goodness and power to protect those who seek refuge in Him. \nThe angel of the LORD encamps around those who fear him, and rescues them. –Psalm 34:7\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-3-576x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Exodus 4:27-31, Exodus 7:8-13, Exodus 32:1-6, Exodus 32:21-24, Leviticus 8:1-5, Leviticus 9:1-7, 1 Corinthians 10:7",
        "devo_title": "Aaron",
        "devo_summary": "\nBY Claire Gibson\n\nLet me be straight with you. I was excited to share a few reflections about “Men and Women in the Word.” But I wasn’t super stoked when I saw that I’d been assigned to write about Aaron. Aaron. Really? Moses’s right-hand man? The guy who made the golden calf? What more was there to say about a person who nearly caused the destruction of Israel a few days after God parted the Red Sea?\nI wrote down a few adjectives—words that described my assumptions about Aaron. To me, he seemed like a charismatic guy. A classic over-achiever. A man who was called by God, but also bent on pleasing people. The more I jotted down the adjectives, the more I realized I was describing myself.\nAaron has a complicated story. Before God appeared to Moses in the burning bush, He’d already called Aaron to start moving toward Moses to help him. In the story of Israel’s redemption, Aaron played a massive role—speaking on behalf of Moses, who spoke on behalf of God. He saw God’s miracles firsthand. He called down plagues to strike Egypt and spare Israel. He walked through the Red Sea on dry land, surrounded by water like walls. \nNot long after those miracles, Moses left Aaron in charge while he went to Mount Sinai and received instructions from God on how to build the future tabernacle (Exodus 25–31). Moses had been on the mountain for more than 40 days, longer than he’d planned to be gone. Soon, cajoled by the Israelites, Aaron assumed Moses had died. While Moses was hearing instructions from the Lord, Aaron was busy building a golden calf.\nUnable to wait patiently for God’s instructions, he moved on with his own plans. Comfortable in his position of power, he used his gifts to lead people astray. Aaron was of feeble mind and character, and he was quick to turn his back on the one true God.\nAs Moses came down from the mountain to see this ghastly scene, the truth was revealed. God may have called Aaron into holy service, but Aaron wasn’t holy. He was impatient, charismatic, and reckless. He was a sinner in need of saving. Aaron was just like me. \nThough God went on to punish the Israelites for their sin, he spared Aaron. In His mercy and grace, God allowed Aaron to see the tabernacle, fully built. Compared to the golden calf Aaron created with his feeble hands, the tabernacle was a spectacle of beauty, a moveable house constructed with expertise to God’s exact specifications (Exodus 4:30). Aaron was the first high priest to serve there, charged with carrying out sacrifices for the people. In that role, I imagine Aaron came to understand his need for atonement. As he sacrificed real animals, spilling real blood, I wonder if he continued to repent over that first, false image that he’d created.\nWe are all Aaron. Called by God, and yet capable of turning our back on Him. Gifted, and yet capable of using those gifts for our own glory rather than God’s instruction. We are all sinners, in need of an atoning sacrifice. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day22-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Exodus 2:1-8, Exodus 14:1-31, Exodus 15:19-21, Isaiah 12:2",
        "devo_title": "Miriam",
        "devo_summary": "\nBY Erin Davis\n\nWe assume Miriam was simply the sister who watched her barely weaned brother float helplessly down the river, then witnessed his miraculous rescue by the hands of Pharaoh’s daughter. But there is so much more to her.\nIt was Miriam who boldly offered to retrieve a nurse for the princess and then ran to her mother to reunite her with her boy. (What a girl!)\nMiriam saw her people spared from the twelve plagues that struck all of Egypt. She then fled with her people when Pharoah miraculously let them go. \nWith dry sand of the Red Sea between her toes, Miriam watched towers of water stand at attention for her people’s passing. \nIt was Miriam who busted out her tambourine and led the people of God in a holy conga line to celebrate Israel’s deliverance: “Sing to the LORD, for he is highly exalted; he has thrown the horse and its rider into the sea” (Exodus 15:21).\nThis is a woman of conviction. This is a woman of faith. This is a woman of praise. \nBut she is not (and neither are we) a woman without need for a Savior. \nNumbers 12 feels out of place in the snapshots of Miriam’s life. It reads more like a scene from one of our family vacations. The siblings are at each other’s throats. What about exactly? The Lord’s favor. Who deserves it? Who doesn’t? Who has more than their share?\nTurns out even prophetesses are prone to spiritual envy. \nWith rebellion in their hearts, Miriam and Aaron grumbled. “They said, ‘Does the LORD speak only through Moses? Does he not also speak through us?’ And the Lord heard it” (v.2). The Lord responded in anger, striking Miriam with temporary leprosy. Why? Because here’s the truth about spiritual envy: it uncovers our lack of faith.\nWhen we resent and covet the blessings God has given others… When we worry someone else’s adequacy is a commentary on our inadequacy… When we look at someone else’s piece-of-the-kingdom pie and worry we will get the crumbs left over… When we want to trade in our gifts for something more “flashy”… \nSpiritual envy reveals little pockets in our hearts that are still absent of faith, corners not yet convinced that God is faithful and good. We doubt even when we’ve been delivered, after we’ve seen Him make a way where there seemed to be no way. This means we cannot rest on yesterday’s praise, because we will never stop needing Him. Life will never stop giving us opportunities to choose to trust that He will come through. \nYes, Miriam is a woman who lived her life for God’s glory. But He is glorified in her weakness, as is He is in her faith. Her dramatic delivery from slavery points to a more important need. She needed to be rescued from her sinful heart. She needed to be set free from her shame. So do I. So do you. Because Jesus is faithful to do it, let us bust out our tambourines in praise. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day23-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Exodus 31:1-11, Exodus 35:1-35, 1 Corinthians 12:4-7, 11, 2 Peter 1:3",
        "devo_title": "Bezalel",
        "devo_summary": "\nBY Guest Writer\n\nIn the past, I’ve made an idol out of calling. There were countless times when I cried out to God, asking Him to “make it clear” what it is He wanted me to do with this life. While it’s true that I really did want to know how to spend my days and focus my attention, what I really wanted was certainty. I thought if God could just point me in the generally right direction, I could start hustling to make something of myself. What I wanted was the assurance I wouldn’t fail. I wanted control. \nBut God doesn’t offer us the assurance of this kind of control. He does, however, promise His faithful love and His promise to be present with His people (Deuteronomy 31:6; Hebrews 13:5). Our God is not the means to an end—He’s the beginning, the end, and everything in between (Revelation 22:13). And so calling isn’t so much a sure destination but an invitation into deeper relationship with our Creator God. \nOne of the ways God has invited me to experience Him is through the gifts He’s given me. When I read about Bezalel in Exodus 31, I see God’s same commitment to be present through both calling and gifting. \nThe LORD also spoke to Moses: “Look, I have appointed by name Bezalel son of Uri, son of Hur, of the tribe of Judah. I have filled him with God’s Spirit,  with wisdom, understanding, and ability in every craft to design artistic works”  (Exodus 31:1–5, emphasis mine).\nBezalel was an artisan with a BIG call on his life: to lead in the creation of the tabernacle, where God would take up residence with His people. Still, God didn’t leave Bezalel to fend for himself in the face of such an enormous undertaking. He sent Himself—His Spirit.\nThe Hebrew word Ruach is translated as “God’s Spirit,” and here it refers to God’s personal presence and power coming forth to empower God’s people to do the specific tasks He’s called us to do. The Creator of the universe (Genesis 1:1) called Bezalel to create something God surely could’ve made on His own—no doubt perfectly and far more efficiently. Instead, He gifted and called a man like Bezalel. Why?\nBecause our God is relational, revealing His glory through creation and those who bear His image (Genesis 1:26–28). He doesn’t need us or the work of our hands, but He wants us and He invites us to share in His work. By His Spirit He gives us gifts to do that work (1 Corinthians 12:4–7). It’s a precedent He set in the garden. God is about bringing eternity here to earth now, creating space for Him to dwell—to tabernacle—with His people. For those who call Jesus Christ Lord, that meeting place is now within us, by His Spirit (2 Corinthians 6:16).\nWhatever the call, He’s already given us everything we need to accomplish it (1 Peter 1:3). The gifts He gives us are a vehicle through which we can know Him better, go on mission with Him to accomplish His will, bring Him glory, and care for His creation and people. Apart from Him, our gifts are useless, our calling aimless (John 15:5). But in His presence is complete and utter joy (Psalm 16:11) as we partner with Him in the restoration of His creation.\n\nKara Gause is a content editor for She Reads Truth, happily residing with her family in Nashville, Tennessee. \n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day24-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Joshua 1:1-18, Joshua 23:1-16, Deuteronomy 31:6-8",
        "devo_title": "Joshua",
        "devo_summary": "\nBY Guest Writer\n\nAll the facts told me I could not be brave. I was twenty weeks pregnant, my unborn child had been given a fatal diagnosis, and I wanted to run away. I didn’t think I could answer God’s call to carry a baby full-term if that baby would not be mine to keep. I looked at the journey before me and the assignment God had given to me, and thought, “There is no way I can do this. I’m not strong enough.”\nHave you ever felt like this? Have you ever lost sleep over the fear of a circumstance? Have you ever been afraid that God might ask you to do something you cannot do?\nI believe that God wants to redeem our worries, and we would do well to learn from the story of Joshua. God had a very important assignment for Joshua. Moses was about to die, and it was time for the Israelites to finally stop their desert wandering to find a permanent home in the promised land. God wanted Joshua to lead them into their first battle at Jericho. He said to Joshua: “Do not be afraid or discouraged, for the LORD your God is with you wherever you go” (Joshua 1:9).\nJoshua’s task was scary (think war and death), victory looked improbable (think impenetrable fortified city), and a whole nation hung in the balance (think no room for doubt). God knew all of this, and yet what did He say to Joshua? No matter what lies before you, “be strong and courageous” (Joshua 1:6).\nHow could God ask this of Joshua? How could God ask me to be brave and carry a child I knew would pass away?\nIt’s because of this:\nThe Lord will never leave us (Joshua 1:9). We might not know the twists and turns of the journey before us. But we can stand confidently, knowing the Lord will never ever leave our side.\nIt is the Lord God who fights for us (Joshua 23:3). God does the fighting! Joshua’s strength, my courage, your bravery—these do not come from within ourselves. No! They come from the Holy Spirit, and His power has no limits.\nThe Lord our God is worthy of our love and devotion (Joshua 23:9–11). God gave Joshua and his people many commands, but He gave clear emphasis to this one in particular. Jesus gives us a similar command: “Love the Lord your God with all your heart, with all your soul, with all your strength, and with all your mind, and your neighbor as yourself” (Luke 10:27). This is the call we’ve been given, and if our eyes are on the one who calls us, then no matter what life throws at us or what impenetrable circumstance lies ahead, we will be okay.\nI named my son Gideon. And during those 90 minutes he lived in my arms, God proved all of His promises to be true. Our God will never leave us. He will always fight for us. And He delights in our love for Him.\n\nMaria Furlough is a wife and a mother to one amazing 11-year-old daughter, three rambunctious boys, and one baby boy who lives in the arms of Jesus. Formerly a full-time youth pastor, Maria now teaches women’s Bible studies and works as the Missions Team leader at Lake Forest Church in Huntersville, North Carolina. Maria is the author of Breaking the Fear Cycle: How to Find Peace for You Anxious Heart and Confident Moms, Confident Daughters. You can find Maria on Instagram or Facebook @MariaFurlough or online at www.mariafurlough.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day25-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Joshua 2:1-24, Joshua 6:22-25, Matthew 1:1-6, Hebrews 11:1, Hebrews 11:31",
        "devo_title": "Rahab",
        "devo_summary": "\nBY Kaitie Stoddard\n\nI had this sneaking feeling that I was going to lock myself out of the office one day. Every once in a while, it would cross my mind that I should hide a key somewhere, just in case, but then I’d brush that thought aside. Well, what do you know, today was the day! Of course, my coworkers were gone for the day, and the second the door latched behind me I knew I’d forgotten my key. They say hindsight is 20/20, but it doesn’t do you much good when you’re trapped on the wrong side of the door, pulling up Google on your phone to find a locksmith. \nSometimes we feel that nagging urge to act, and we just stuff it down. Getting locked out of an office is a minor inconvenience, but what about when the urge to act comes from the Lord? What about when that holy nudge requires you to step out in faith? \nRahab is a woman who saw what was coming and chose to act in obedience. She didn’t obey because she was an especially godly person. Far from it, in fact. The book of Joshua tells us that Rahab was a prostitute. But despite her moral failings, Rahab recognized the power of God. When Joshua’s two spies were in need of a hiding place, Rahab sensed they were men of the one true God. Though she barely knew this God, Rahab put her faith in Him and betrayed her own king (Hebrews 11:31). \nHow did a woman living so far from God take such an enormous leap of faith? A single act of courage, that’s how. That’s all it took to completely change the future for Rahab and her family. Although she had only heard of the power and goodness of God, she recognized what He was doing and stepped out in faith. This foresight saved the lives of Rahab and her family, and she went on to become part of the lineage of Jesus Himself (Matthew 1:1–6). \nJust as God worked through Rahab, He delights in using women from every walk of life to tell His grand story of redemption. It doesn’t matter what you have or haven’t done in the past. You don’t need to be a “perfect Christian” for God to call you to action. You don’t need to be a perfect Christian to listen to that still, small voice and “see it coming,” whatever it may be. God does not wait for us to get it together in order to weave us into His plan of redemption. “Instead, God has chosen what is foolish in the world to shame the wise, and God has chosen what is weak in the world to shame the strong” (1 Corinthians 1:27). \nIf you are hearing a voice that says you can’t be used by God, that you’re too much of this or too little of that, let me tell you that voice is not from the Lord. Maybe God’s given you a dream, but you’re not taking the next step because of these critical voices. Would you join me in throwing off that spirit of condemnation? Our courage comes not because we believe we are strong, but because we know that God can do anything. If He calls us He will also equip us for His work. Let’s be women who see what God is doing, and follow Him in faith. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day26-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "2 Peter 1:3",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nBy his divine power, God has given us everything we need for living a godly life. We have received all of this by coming to know him, the one who called us to himself by means of his marvelous glory and excellence.\n2 Peter 1:3 NLT \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day27-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Isaiah 12:2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nOn day 23 we read about Miriam, who sang a song of praise after the Lord provided an escape for the Israelites through the Red Sea. This week we’ll memorize Isaiah 12:2, a verse from that day’s reading and reminder that God Himself is our salvation. \nIndeed, God is my salvation; I will trust him and not be afraid, for the LORD, the LORD himself, is my strength and my song. He has become my salvation. –Isaiah 12:2\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-4-576x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Judges 4:1-24, Judges 5:1-31, Deuteronomy 20:1-4 ",
        "devo_title": "Deborah and Barak",
        "devo_summary": "\nBY Melanie Rainer\n\nAbout ten years ago, my husband and I, newly married and eager to serve, volunteered to teach the preschoolers at our little church. Most Sundays were a blur of crayons and goldfish crackers, and our primary goal was for each child to take home a scribbled-on coloring sheet as proof that we tried to teach them something about Jesus. \nBut I remember one Sunday morning, we arrived to teach a lesson plan about Deborah, Barak, and Jael. I skimmed the story and shot a worried glance at my husband. We were supposed to teach this story? About a woman who drives a tent peg through the head of a military leader? To three-and-four-year olds? I had not had enough coffee for that. \nI actually don’t remember what we did that day in class, but I don’t think we read the kids that part of the story. It’s the part of the story that most of us remember, because it’s wild and gruesome, though full of strong women. All of that is true, of course, but at its heart, the story of Deborah and Barak and Jael and Sisera is about God and having confidence in Him. \nA lot can be said and unpacked about Barak and his trepidation, the seemingly impossible battle he faced, and how his attitude contrasted with Deborah’s, and later Jael’s. But this story offers us more than a study of human weakness overwhelmed by the glory and power of God; it offers us a picture of a woman, strong and wise, counted upon by the whole nation of Israel and chosen by God, who walked in obedience to Yahweh. \nDeborah heard from God, shared His Word with Barak, and supported Barak as he reluctantly followed God’s order. Deborah rebuked him when necessary but still went with him into battle. And then, after the victory against Sisera’s army and Sisera’s gruesome death at the hands of Jael, Deborah and Barak sang of praise. \nTheir song is a rich poem, full of beauty and truth and focused on the glory of God—how He delivered His people and destroyed His enemies. Deborah was a woman inspired by God’s Word and His faithfulness to her people. She was unafraid because she knew that come what may, our God fights for those who trust in Him (Deuteronomy 20:3–4). May God’s Word so fuel us to stand for His truth, to support our brothers and sisters in faith, and to sing His glory for the rest of our earthly lives. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day29-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Judges 6:11-23, Judges 6:33-40, Judges 7:1–23, Psalm 9:3-10",
        "devo_title": "Gideon",
        "devo_summary": "\nBY Lore Ferguson Wilbert\n\nI am not like the child who keeps asking. I am like the one who asks once, receives a “no,” and leaves dejected. Persistence is not a particularly strong skill of mine, and it takes a great deal of attention for me to know what I desire most of the time. This may be rare. I know many women whose desires are potent, present, and always before them. They posture themselves before God asking and asking and asking again for Him to meet their desires. We have all been given different measures of faith (Romans 12:3).\nIn this passage, Gideon is an asker who won’t take “yes” for an answer. He wants reassurance even after God responds to his request: “‘Don’t be angry with me; let me speak one more time. Please allow me to make one more test with the fleece. Let it remain dry, and the dew be all over the ground’” (Judges 6:39). In the end, God gives him the reassurance he’s asked for: God’s presence goes with Gideon in battle.\nI sometimes wonder why God entertained Gideon’s request. Was God bolstering Gideon’s faith, bit by bit, before leading Gideon into battle? After all, God had already answered Gideon. But God met Gideon right where he was, giving him what he needed in the moment, progressing Gideon’s faith—growing it, bolstering it, and filling it to overflowing.\nWhen we ask God for something again and again, it doesn’t always mean we’re petulant children, whining about how unfair life is. Sometimes it means we’re inching closer and closer to seeing the enormity of God’s overwhelming help, love, and presence, which seem almost too good to be true.\nWhen we ask God for what we don’t think is humanly possible, we acknowledge our utter inability to bring it to pass. We submit to the truth of His absolute sovereignty over all things. This is what Gideon shows us about God and man: the beautiful practice of God’s children seeking and asking, and the spectacular gift of God’s presence with us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day30-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Ruth 1:1-21, Ruth 2:1-13, Ruth 2:18-20, Ruth 3:1-11, Ruth 4:13-17, Proverbs 31:10-31",
        "devo_title": "Naomi and Ruth",
        "devo_summary": "\nBY Kaitlin Wernet\n\nThe height of a Disney princess ranges from five foot four to five foot seven—nothing more, nothing less. How do I know this, you ask? It’s the one fact that shattered all of my childhood aspirations in an instant. Standing at five foot ten, I’ve come to resent the last three inches that kept me from frolicking around the Magic Kingdom as Ariel, Belle, Snow White, or Pocahontas. It wasn’t just some childhood fantasy; it was a potential career path, guys.\nI realize this is not that big of a deal. If I were five foot four, I probably would have had aspirations of being in the WNBA, falling several inches below the basketball hoop. Yes, we’ve all wished for more or for less, or just to step on over to the other side of the fence where the grass sure does look a whole lot greener. \nWe’ve all had those Goldilocks moments in our lives, times when the porridge is too hot or the chair is too small, the job is too difficult, the relationship too painful, or the circumstance too out of control.\nAfter losing her husband and two sons, it’s no surprise that Naomi felt as if her life had become more than she could handle. And so when Ruth and Orpah, her daughters-in-law, offer to stay with her, Naomi tells them, “No, my daughters, my life is much too bitter for you to share, because the LORD’s hand has turned against me” (Ruth 1:13).\nToo bitter. \nHow often do we believe God has turned against us when life begins to feel like too much? And yet the overwhelming circumstances we find ourselves in, the ones that make us feel like we’ll never be enough or have enough—these are the richest soil for God’s redemption. He loves to meet us in the places where we’ve given up and then shower us with His abundance. \nRuth could have easily walked away from Naomi, leaving her mother-in-law alone in her bitterness, just as God could have easily rejected us in our unfaithfulness. Thankfully, that’s not how the story goes. Both women chose to travel together, dusting off their wounds and collecting their sorrows. They didn’t know what they would find next, but they left “Moab, because [Naomi] had heard in Moab that the Lord had paid attention to his people’s need by providing them food” (v.6).\nIf you’ve read this story before, you already know that God provided much more than food for these women. He gave Ruth a new husband, and in turn, Naomi also received a new son. But the story of Naomi and Ruth is about more than a God who will give us whatever we want and make all our dreams come true, if we’ll just muster up enough faith to believe in Him. This story, and all of Scripture, is about a God who is faithful when we are not.\nLet us look to the One whose power is perfected in our weakness; He promises that His grace is exactly what we need—what our sin requires—and it is sufficient for everyone who leaves behind the ways of this world in order to follow Him (2 Corinthians 12:9). “Blessed be the LORD,” who redeems and restores (Ruth 4:14).\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day31-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Samuel 1:1-28, 1 Samuel 2:1-11, Philippians 4:4-7",
        "devo_title": "Hannah",
        "devo_summary": "\nBY Guest Writer\n\nHave you ever sobbed so hard that your body shook? Hot tears welling up from places you didn’t even know existed? Did you wonder if the tears would ever stop? I’ve cried tears like that. I’ve felt that kind of desperation, and yet somehow and in some way it’s there that God has proven He is exactly who He says He is. \nIn today’s reading we see that Hannah has been there too. As so many women who have come after her, Hannah was greatly grieved by her circumstances. “Deeply hurt, Hannah prayed to the LORD and wept with many tears” (1 Samuel 1:10). Through her story, we are given an example of what it means to approach God honestly with our pain. \nGod cares about our pain. He knows how many tears you and I have cried (Psalm 56:8). Just as He cared about Hannah’s deep pain, He cares about yours and mine too. God wants us to know what to do with our hurt, and that He will meet us in our suffering. We can start by taking our pain to Him in bold and honest prayer, just as Hannah did: \n“LORD of Armies, if you will take notice of your servant’s affliction,  remember and not forget me, and give your servant a son,  I will give him to the LORD all the days of his life” (v.11). \nGod hears the cries of our hearts. “The righteous cry out, and the LORD hears, and rescues them from all their troubles” (Psalm 34:17). He is worthy of our trust, which is something Hannah truly believed. Scripture tells us that after praying, “Hannah went on her way; she ate and no longer looked despondent” (1 Samuel 1:18). Hannah did not yet know whether God was going to give her a child, but she went away confident that He had heard her plea. As should we!\nGod comforts us in our pain. I understand the relief that comes from honest prayer. After losing my son, I prayed to God repeatedly, sobbing, “I want him back right now!” In that deep, unimaginable pain, I found Him to be the tender God of all comfort (2 Corinthians 1:3). I also found that His Word is true; He truly “is near the brokenhearted; he saves those crushed in spirit” (Psalm 34:18).\nWe don’t need to be ashamed of our pain. When Eli accuses Hannah of being drunk, she tells him like it is: “I am a woman with a broken heart” (v.15). No excuses, no shame, no embarrassment. Sadness is part of the human condition that points to our need for a saving God. It is okay to be sad. Hannah’s honest prayer points to God’s reliable power and goodness. And so she declares, “There is no one holy like the LORD. There is no one besides you!” (1 Samuel 2:2). \nGod did give Hannah a son, yes, but more than that, He gave her the peace of His presence. He is with us as well. In His presence, may we learn to rejoice in Him always—regardless of our circumstances. May we learn to bring Him the deepest longings of our hearts, “through prayer and petition with thanksgiving. And the peace of God, which surpasses all understanding” will be ours (Philippians 4:4,6–7). He waits to comfort us.\n\nMaria Furlough is a wife and a mother to one amazing 11-year-old daughter, three rambunctious boys, and one baby boy who lives in the arms of Jesus. Formerly a full-time youth pastor, Maria now teaches women’s Bible studies and works as the Missions Team leader at Lake Forest Church in Huntersville, North Carolina. Maria is the author of Breaking the Fear Cycle: How to Find Peace for You Anxious Heart and Confident Moms, Confident Daughters. You can find Maria on Instagram or Facebook @MariaFurlough or online at www.mariafurlough.com.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day32-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Samuel 2:12–26, 1 Samuel 3:1-21, Exodus 27:20–21",
        "devo_title": "Samuel",
        "devo_summary": "\nBY Erin Davis\n\nI was in the sixth grade the first time I felt a desire to open my Bible on my own. I’d had a particularly rough day at school (aren’t middle school girls the worst?), and as I sobbed into my New Kids on the Block pillow, suddenly my pink Precious Moments Bible seemed to call to me from the bookshelf. It wasn’t an audible sound, just a subtle heart tug toward the Word of God I’d never felt before that moment. I didn’t know a psalm from a proverb, couldn’t articulate the gospel, and had no way of knowing how God’s Word would eventually transform me. I just knew I needed comfort and thought the Bible might be a straw worth grasping for. \nA tiny spark was kindled, but the ember was enough to keep me reading through middle school and into high school, when I would eventually surrender my life to Christ. The spark is now a bonfire that consumes my life. Like the psalmist, I declare, “Instruction from your lips is better for me than thousands of gold and silver pieces” (Psalm 119:72). God’s Word is my greatest treasure. \nThe Bible tells us, “Samuel did not yet know the Lord, because the word of the Lord had not yet been revealed to him” (1 Samuel 3:7). And yet the Lord was clearly speaking to the boy. Though Samuel’s inexperience with the voice of God made him slow to respond, the Lord kept patiently nudging until eventually, “Samuel grew, and the Lord was with him, and he fulfilled everything Samuel prophesied. All Israel from Dan to Beer-sheba knew that Samuel was a confirmed prophet of the Lord” (vv.19–20). \nHe is the hound of heaven. He pursues us when we are still running in glad rebellion. He woos us when our hearts are still turned toward lesser loves. He shepherds before we, His sheep, can distinguish the sound of His voice. Truly, “God proves his own love for us in that while we were still sinners, Christ died for us” (Romans 5:8). \nSamuel learned to serve the God who speaks. I have learned to love the One whose story I first glimpsed in the pages of a little pink Bible. It’s true that when we seek, we find Him. And when we knock, He always opens the door (Matthew 7:7–8). But the Lord, in His kindness, also whispers to us before our hearts know how to listen. He loves us, even if our hearts are too broken to love Him back (1 John 4:9). Because He speaks, we can know Him—and that is a reason to rejoice.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day33-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Philippians 4:5",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\nLet your graciousness be known to everyone. The Lord is near.\nPhilippians 4:5\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day34-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Samuel 2:2",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we’ll memorize a verse about God’s faithfulness, taken from Hannah’s prayer of praise on day 32.\nThere is no one holy like the LORD. There is no one besides you! And there is no rock like our God. –1 Samuel 2:2\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-5-576x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Samuel 10:1-27, 1 Samuel 13:1-14, Numbers 18:7",
        "devo_title": "Saul",
        "devo_summary": "\nBY Claire Gibson\n\nFor me, reading through 1 Samuel is like learning Israel’s history for the very first time. I’ve been so fascinated by this story because Saul seems so well-intentioned, at least based on outward appearance. But when I look a little closer, I realize that Saul was a man of great fear, one who was constantly seeking the approval of other people. What’s more, Saul shrouded his insecurity in half-obedience to the Lord. \nUgh. Knife in the gut. \nI could so easily replace Saul’s name with my own in both of the sentences above. I am a woman of great fear. I hide all of my insecurity by pretending I’m following the Lord, when really, I’m looking for other people’s approval.\nIn today’s reading, Saul’s habit of half-obedience is on full display—twice. In Chapter 10, the prophet Samuel is surrounded by crowds, and the people are looking around, trying to find Saul to put a crown on his head and officially make him their king. Saul already knows he’s been chosen, but he’s so very fearful of the job that he literally goes and hides himself in a big pile of baggage (1 Samuel 10:22).\nThe metaphor is too good to pass up. Hiding in baggage? Yep, I totally do that too. And I think I do it for two paradoxical reasons. First, I hide because I’m afraid; I’d much rather be hiding in the shadows than be up front where if I fall or make a mistake, people will see. The baggage—my past mistakes, what other people have said about me, the lies I believe about myself—allows me to keep a safe distance from any kind of leadership.\nI also hide because I want to be important enough to be found. Scripture tells us that after Saul hid himself, the people ran and brought him out, shouting, “Long live the king!” (v.24). That must have felt nice. He was so important, that even though he was hiding, the people wouldn’t let him hide for long. They came and found him and put him in the spotlight. Maybe that’s what Saul really wanted: to feel chosen by the people. Perhaps being anointed by God wasn’t enough, because he wanted the seal of approval from the people more. \nIn Chapter 13, Saul commits a sin fatal to his kingship when he offers burnt offerings on the altar only entrusted to Samuel (vv.1–14). His action is one of half-obedience. He was told to wait, and he did wait—but only for so long. He knew that there would be sacrifices, and so he took those sacrifices into his own hands. He wanted to prove to the men around him that he was doing something. He was afraid of being deserted, not by God, but by his soldiers. Once again, his obedience to God was only a farce to hide his reliance upon others. Saul feared man—not God. \nBut here’s the thing: God had already chosen Saul, and God has already chosen us (1 Peter 2:9; Ephesians 1:4). We do not need to hide. And we do not need to be found, because we will never be deserted by Him. Even if everyone else falls away, even when we fail, God will never desert us.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day36-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Samuel 16:1-13, 2 Samuel 5:1-12, 2 Samuel 7:1-29, Acts 13:21-23",
        "devo_title": "David",
        "devo_summary": "\nBY Bailey Gillespie\n\nLast year, I turned 30, and my best friend threw me a surprise party to end all surprise parties. It included an original song, a tropical photo booth, fifty of my favorite people, and a game that requires you to eat a donut off a string (a not-so-subtle nod to her tenth birthday, where we played the same game and I had a crumb stuck in my eye for the rest of the night). For me, that birthday signaled two things: the incredible blessing of my friends and the end of my youth. \nTurning 30 kind of makes you rethink all of your life choices. \nAlthough my feelings about growing older were a little melodramatic, the truth is that things were changing. My body just isn’t twenty anymore. \nI find it interesting that in 1 Samuel, the Lord rejects what the prophet believes is obvious king material—physical appeal and strength—but favors David, who is also handsome with “beautiful eyes” (16:12). The qualifying trait here can’t be physical appearance because God makes it clear in His choice that “humans see what is visible, but the LORD sees the heart” (v.7). So, why David? He had the looks and health he would need for success, but we’re also told that he had a heart that would carry out the Lord’s will (Acts 13:22). That soft heart always appears to be key to spiritual flourishing. \nAlthough David’s good health no doubt benefited his leadership, it was his devotion to God that helped guard him against ultimate destruction. When his youth and virility waned, along with many of the characteristics that traditionally make for a great king, he still had a heart overflowing with praise.    \nSurrounded by friends and family at that surprise party, I imagine I felt a sliver of what David did when he burned with thanksgiving for God’s blessing. When I look back on my life thus far through a kingdom-oriented lens, my sorrow for things lost slowly turns to gratitude for things given. Sure, I wish my eyes didn’t look so permanently tired and my muscles moved like hot taffy, rather than a seat belt after stopping short. But when I assess the work of God in my life, and in the lives of others, it can be too overwhelming to bear sometimes. Each fine line and sore ligament serves as a testimony to the adventure of being sanctified.\nPeople may only look at you skin deep, but our Lord sees the wild rivers of courage, affection, and sacrifice under the surface. It’s an upside-down kingdom, after all. Whoever surrenders their youth finds wisdom and maturity (hopefully)—and whoever loses their life for the sake of Christ will find it (Matthew 10:39). \nNo matter what my appearance or circumstances or achievements or health status indicates, I want to echo the words of King David: “For You, Lord GOD, have spoken, and with Your blessing Your servant’s house will be blessed forever” (2 Samuel 7:29). The blessing God gave David’s lineage, that eventually gave way to Christ, continues into our lives today. We can never age out of it.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day37-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Samuel 25:1-44, Proverbs 15:1-4",
        "devo_title": "Abigail",
        "devo_summary": "\nBY Kaitie Stoddard\n\nScrolling through social media, you’re likely to see posts with comment threads a mile long. If you dare to unfold those threads, they’re often divisive and negative. The distance created by an online world makes it easier for tempers to flare and harsh words to be thrown like daggers. I find myself wanting to retreat from social media for this very reason. When we sense danger, many of us have a tendency either to jump into the fight or to take flight. But the story of Abigail offers us a third and better way to respond. \nIt couldn’t have been easy for the “intelligent and beautiful” Abigail to be married to Nabal (1 Samuel 25:3). He was a foolish and harsh man, and when David sent his young men to him for provisions, Nabal almost incited a war. Nabal’s lack of generosity sparked David’s temper, and David began planning his retaliation. \nOnce Abigail heard what was going on, she took action—but not to join in the fight or to run for cover. While her husband had been unnecessarily loud and offensive and David was quick to seek revenge, Abigail was a swift peacemaker. With David organizing his army and calling for blood, others may have assumed a battle was inevitable. But Abigail still had hope that things could be resolved peacefully. With wisdom, she discerned how to repair an extremely heated situation. Abigail approached David with humility and generosity, and was able to bring healing to a gaping wound caused by her husband’s foolishness. \nAbigail helped bring peace to two men, thus saving many lives from death and destruction. Jesus praised peacemaking saying, “Blessed are the peacemakers, for they will be called children of God” (Matthew 5:9, NIV). Not only did Jesus value the virtue of peacemaking, but He embodied it. He chose to lay down His life in order to offer true and everlasting peace to all people through His death and resurrection. \nThe way Abigail responded is beautiful because it mirrors the heart of God. Scripture tells us that the new heavens and new earth will be a place with no need for weapons or war (Isaiah 2:4). In a divided and conflicted world, we are called to be agents of peace. Just as Abigail could have easily given up hope, it can be tempting for us to think the problems in our society are unsolvable. But Christ has can bring peace to the darkest situations. Our God can breathe life into the driest of bones. Instead of fighting or retreating, let’s respond to conflict around us with discernment and generosity in the power of the Holy Spirit. Then our actions of peace will be a witness to the heart of our loving Creator. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day38-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "2 Samuel 11:1-17, 2 Samuel 11:26-27, 2 Samuel 12:7-25, 1 Kings 1:1, 1 Kings 1:5-31 ",
        "devo_title": "Bathsheba",
        "devo_summary": "\nBY Guest Writer\n\nEditor’s Note: Some passages in Scripture deal in subject matter which might be especially painful for some readers. Though many of the wounds we receive in this life are deeply personal and unimaginably painful, when they appear in God’s Word, we are reminded that He sees them. Whenever sin is addressed in Scripture—whether through teaching or story—it comes to us in the context of God’s unwavering commitment to bring an end to all evil in this world through the finished work of Christ (Revelation 21:3–4). We are praying for and with you as you read. \nOne of the most scandalous stories recorded in Scripture involves King David and Bathsheba, the wife of one of his trusted warriors. David’s sexual sin against Bathsheba is condemned by Nathan and confessed by David himself. His blame has never been in question. Often called “an affair,” Bathsheba’s involvement is less than clear, however. Helpfully, Scripture offers valuable context to help us navigate the culture of that time. \nScripture records a detail that tells us something important about Bathsheba; she was bathing to cleanse herself after her monthly cycle (2 Samuel 11:4). For women practicing the Jewish faith, this was commanded, to bathe after monthly menstruation. This is important because it tells us that Bathsheba had chosen to obey the commandments of the covenant and honor Yahweh. We know Bathsheba lived protected within the city because David was able to see her bathing on her rooftop from the comfort of his own home. \nLet’s take a minute to remind ourselves that this woman wasn’t a character in a story or an actor in a movie.  Bathsheba was a real woman, living in the ancient Near East under the militaristic, political, and cultural control of King David. Bathsheba had real fears, life pressures, and hopeful expectations. Like us, Bathsheba was likely both strong and fearful. Like us, she probably wanted to make a life, build a family, and care for her friends. She likely worried about her future and her reputation. \nI imagine Bathsheba never envisioned the turn her life would take. She would lose her first husband and bury her first son with David. Sadly, much of Bathsheba’s story is shaped by what was likely the hardest season of her life, when she was swept up into the center of scandal, shame, and heartache. Though the circumstances may be different, I suspect many of us know this sting. And in the midst of that kind of turmoil, we can all be tempted to wonder things like:\nWhere is God? \nWhy has He allowed this to happen? \nCan He redeem even this?\nBut Bathsheba’s story wasn’t over. God wasn’t finished working in and through her. Heartache wouldn’t have the last word—not for Bathsheba, and not for you or for me. Mercifully, Scripture records other instances where Bathsheba would help lead, influence, and shape God’s story for His people. Scripture attests to her humility before the Lord and her bravery before King David, as she advocated for her son Solomon take his God-appointed place as king of Israel (1 Kings 1:11–40).\nWhere Bathsheba looked forward in faith, we have the unbelievable privilege of looking back in gratitude. Because of Jesus, we can be confident that even the darkest days and the most heart-wrenching circumstances can be redeemed. If the cross brought everlasting life, then nothing in our lives can be so ruinous that God can’t use it for our good and His glory.\n\nWhitney Capps is a national speaker for Proverbs 31 Ministries. Her first book, Sick of Me (B&H Publishers) and bible study, We Over Me (LifeWay) both release in March 2019. Whitney is the founder of Simple Seminary, a place for the everyday gal to learn theology. She and her husband, Chad, are raising their four boys just outside Atlanta, GA. You can connect with her at whitneycapps.com or on Instagram, @whitneycapps.\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day39-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "2 Samuel 13:1-21, Psalm 55:1-23",
        "devo_title": "Tamar",
        "devo_summary": "\nBY Ellen Taylor\n\nEditor’s Note: Some passages in Scripture deal in subject matter which might be especially painful for some readers. Though many of the wounds we receive in this life are deeply personal and unimaginably painful, when they appear in God’s Word, we are reminded that He sees them. Whenever sin is addressed in Scripture—whether through teaching or story—it comes to us in the context of God’s unwavering commitment to bring an end to all evil in this world through the finished work of Christ (Revelation 21:3-4). We are praying for and with you as you read. \nThere are certain stories in Scripture that cause me to blink back tears every time I read them—Abraham leading Isaac up the mountain for sacrifice, Jesus begging God to take the cup from Him in the garden of Gethsemane, and Peter’s denial of Jesus, just to name a few.\nTamar’s story causes me to both blink back tears and shake with anger. It’s a difficult story to stomach, and I get more queasy with every verse I read. It brings up memories I’d rather forget and questions of God’s justice that I’d rather not ask: How could God allow something like this to happen to Tamar? She was just an innocent girl. She didn’t deserve this injustice. She didn’t ask for this.\nThese are the same sort of questions I ask myself every time another #MeToo story breaks on the news. They are the same questions I ask every time I hear another one of my friends tell a story from a time in their life when someone went a little too far, when an unforeseeable circumstance brought about unbearable pain and trauma. \nTamar’s story is not one that you hear preached about on Sunday mornings. It’s not suitable for young ears, and for some, it’s definitely triggering. If the Bible were a movie, Tamar’s story would push it to receive an R rating. But the same thing that’s true of all the stories women and men have brought into light over the last couple of years is also true here: they all have value, and we need to hear them. Tamar’s story is important because God saw fit to include it in His Word.\nTamar’s story allows survivors of sexual assault to see themselves in Scripture. It helps them see that they are not alone—that they, like Tamar, did not deserve this injustice. And because we know God’s character, we know that when we cry out morning, noon, and night—when we tear our clothes with grief like Tamar—He hears us (Psalm 55:17). He sees us. He meets us in the midst of our distress, and reminds us that we are His. He promises He will “not leave the guilty unpunished” (Exodus 34:6–7), that He will “[execute] justice for the exploited” (Psalm 146:6–7). \nSo although Tamar’s story is so painful we’d often rather forget it happened, we would do well to see her in her pain and recognize that God is still at work. He is still at the center of her story, and He remains at the center of ours as well.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day40-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Psalm 55:22",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nCast your burden on the LORD, and he will sustain you; he will never allow the righteous to be shaken. Psalm 55:22\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day41-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Samuel 16:7",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we’ll memorize 1 Samuel 16:7, a verse from David’s story on day 37 about what God sees and values.\n“Humans do not see what the LORD sees, for humans see what is visible, but the LORD sees the heart.” –1 Samuel 16:7\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-6-576x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "2 Samuel 4:4, 2 Samuel 9:1-13, 2 Samuel 19:14-30, Luke 14:12-14 ",
        "devo_title": "Mephibosheth",
        "devo_summary": "\nBY Erin Davis\n\nWe all walk with a limp. Sin has twisted our hearts. It’s warped our lives. Humanity is handicapped by our failed attempts at holiness. I see us in the twisted feet and pitiful heart of Mephibosheth. As he grovels before King David and asks, “What is your servant that you take an interest in a dead dog like me?” (2 Samuel 9:8), I hear an echo of David’s own words in Psalm 8:4: “What is a human being that you remember him, a son of man that you look after him?”\nWhy would a perfect God love one as broken as I am? I am surely damaged goods. Yet, He does not cast me aside. \nThe story of Mephibosheth is a shadow of the sweetness of the Lord. Mephibosheth had a heritage of rebellion. His grandfather Saul ran from the law of the Lord in more ways than I have the keystrokes to recount, before dying in shame surrounded by his enemies. Disgrace might have seemed a fitting end to Mephibosheth’s story. Yet, he received grace instead. Plucked from the mire, he was given a seat at the king’s table. It’s a story that should ring some bells. Though we deserve darkness, we are welcome to pull up a chair to the table of the King of kings. \n“Let us be glad, rejoice, and give him glory, because the marriage of the Lamb has come, and his bride has prepared herself.” – Revelation 19:7\nCrippled by the sins of his ancestors, and surely humbled by his own, Mephibosheth was the recipient of the king’s extravagant kindness. Instead of the poster child for brokenness, he became the poster child for grace. \nFast forward to the book of Acts. The world is being transformed in the wake of the gospel’s tide, when Peter and John encounter another broken man. Lame since birth, he lies daily at the Beautiful Gate of the temple, begging for scraps of mercy. Yet, he receives so much more. Peter says to him: “I don’t have silver or gold, but what I do have, I give you: In the name of Jesus Christ of Nazareth, get up and walk!” (Acts 3:6).\nAnd he does. He jumps up. He starts to walk. He enters the temple. He is “walking, leaping, and praising God” (vv.8–9). \nThe people recognize him.They are filled with awe. They are astonished at what had happened to the beggar before the Beautiful Gate (v.10).\nFrom outcast to insider… From broken to made whole… From lame to leaping… \nThis is our story. This is our song. May the world be filled with wonder before our great God. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day43-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Kings 3:1-28, 1 Kings 8:54-66, 1 Kings 9:1-9, James 3:13-18 ",
        "devo_title": "Solomon",
        "devo_summary": "\nBY Lore Ferguson Wilbert\n\nI have asked for many things in my life—a home, children, a spouse, a car that doesn’t break down, financial means to pay off my school loans, good friends, a few acres in the country. God has given me a few of these blessings, and some He still has not and might not ever. But it is rare for me to ask God for the intangible things. I like measurable. I like quantifiable. It’s difficult to measure wisdom or quantify humility or capture joy long enough to know it’s real. What’s more, the means to come by those qualities are often difficult and wrought with pain, and I don’t like pain. \nGod sometimes gives His people tangible gifts in an instant. It only took me three seconds to meet my husband. Two seconds to sign my name on a contract to buy our home. One second to click, “Pay in full,” on my student loans. \nThe gift of wisdom, though? Not so much. Wisdom takes a lifetime. \nBut not for Solomon. Solomon asked for wisdom, and Scripture says God gave it to him, right then and there. He told Solomon, “I will therefore do what you have asked. I will give you a wise and understanding heart, so that there has never been anyone like you before and never will be again” (1 Kings 3:12). For most of us, those qualities take a lifetime to develop and hone, but because Solomon’s heart desired the right thing—to please and honor God by living with wisdom and understanding—God gave it to him. \nThere is a kind of wisdom that is not of God; James calls it “earthly, unspiritual, demonic. For where there is envy and selfish ambition, there is disorder and every evil practice” (James 3:15–16). I often find that my desire for what I think is a good, tangible blessing often brings disorder to my affections. It seems that as soon as I get “the thing,” I forget the Giver of every good thing. But there is another kind of wisdom, the kind Solomon sought: \n“Wisdom from above is first pure, then peace-loving, gentle, compliant,  full of mercy and good fruits, unwavering, without pretense.  And the fruit of righteousness is sown in peace by those who cultivate peace” (vv.17–18).\nWould things we long for change if we first asked for wisdom from above, trusting God to meet our truest needs with a gift that cannot be quantified? Solomon’s desire for riches or houses were rightly ordered under his desire for wisdom. God honored that desire and gave it to him, and I want to be like that too.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day44-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Kings 16:29-33, 1 Kings 18:1-6, 1 Kings 19:1-5, 1 Kings 21:1-29, Matthew 7:15-20",
        "devo_title": "Ahab and Jezebel",
        "devo_summary": "\nBY Rebecca Faires\n\nFor my grandma, the word “Jezebel” was synonymous with “worldly woman.” And grandma simply did not broach subjects like drinkin’ or card playin’ or movie-house goin’—no ma’am. So much of what we now allow as acceptable would have fit under her “Jezebel” heading. It’s pretty awkward to call anybody worldly, and much easier to just stand back and let “you do you.” In fact, there is a contemporary trend to even view Jezebel herself as an empowered modern women—to classify the queen of idolatry as a savvy and sassy businesswoman. How did we get so far from the truth? Is it possible my grandma was right after all?\nJezebel’s husband was Ahab, a notoriously evil king whose wickedness is largely attributed to Jezebel. Scripture says Ahab “devoted himself to do what was evil in the LORD’s sight, because his wife Jezebel incited him” (1 Kings 21:25). Instead of devoting themselves to do good, they set the compass one-hundred and eighty degrees in the other direction and actively sought to do evil. Theirs is a pretty condemnable legacy.\nYet how was Jezebel seen in her own day? If she was like Ahab, she was an able administrator and politician. She was a strong female leader who got things done. Her political marriage to Ahab brought with it an alliance to the mercantilist strength of the Phoenicians. She was a woman of her time and of her culture, and she brought her religious beliefs with her into Israel.\nHer devotion to Baal was a culturally normal thing to do. Baal was a god who was worshipped through music, dance, partying and debauchery, and sexual promiscuity. In return, Baal promised agricultural, social, and economic success. In contrast to the moral standards of the God of Israel, Baal made an easy appeal to man’s basest inclinations.\nBut Christ warns us about this very danger: “Be on your guard against false prophets who come to you in sheep’s clothing but inwardly are ravaging wolves” (Matthew 7:15). We know that not all leaders are trustworthy, and we know that not all success is measured in money and power. God calls us to measure our success not by the world’s standards, but by the standards of His kingdom.\nOn our own, we all have Jezebel hearts, offering up the sacrifices of our own choice, hoping to barter a deal for worldly success from the higher powers. The applause of the world is a deceiver. But God is not like Baal. He is holy, and He does not exchange His favor for anything we can give to Him. He is not like the gods of this world. He judges the world concerning two things: righteousness and wickedness. And this righteousness, which alone can please Him, is not native to us. It runs counter to every strain of the fallen human heart. To truly please God, to truly have His favor, we must rest wholly in the righteousness of Christ.\nAt the end of Jezebel’s life, she was confronted by Jehu, whom God had anointed to drive out wickedness from the land. Though Jehu was far from righteous, he nonetheless reminds us of the true anointed One, Jesus, whom God sent to earth to put an end to wickedness.\nWhile I do allow card playin’ and movie watchin’ in my own home, I think my grandma was on the right track about Jezebel. Run from those who seek evil. Don’t reclassify evil as empowerment. Evil will always be evil. May God be gracious to us and purify us from worldliness. May He transform us into the image of His Son, who alone is our righteousness.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day45-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Kings 18:1-46, Proverbs 20:22",
        "devo_title": "Elijah",
        "devo_summary": "\nBY Kaitlin Wernet\n\nYou’re probably familiar with Robert Frost’s poem “The Road Not Taken,” which ends with these infamous lines: “Two roads diverged in a wood, and I— / I took the one less traveled by, / And that has made all the difference” (18–20).\nIt’s a work I’ve always loved, but I also have a few follow-up questions for Mr. Frost, like “Would you still feel the same way if the path less traveled had ended in a ditch?” and “If you’d gotten lost, wouldn’t you wish you’d taken the one more traveled by?”\nI don’t know the answers to either question, but I do know that decision-making is hard. For every road not taken, there’s a path we regret choosing, or a journey we still long to take. And it’s mostly because, like Frost says, our choices really do make all the difference. (No pressure, right?)\nAs they gathered at Mount Carmel, Elijah asked the people of Israel to make a choice between God and Baal: “How long will you waver between two opinions? If the LORD is God, follow him. But if Baal, follow him” (1 Kings 18:21).\nLet’s take a step back here for a moment and remind ourselves that we have the unique privilege of holding the Old and New Testaments together as the true story of redemption. The Israelites did not. So while it may be tempting to focus on Elijah’s obedience or the Baal prophets’ doubt, there’s a much larger story at play here. \nFirst, God gives us what we need to trust in Him. The Israelites didn’t need more research, proof, or signs; God had provided a means of knowing Him, and they just had to believe. Although, as decision makers, we are indecisive and imperfect, God is steady and perfect. He does not wrestle with or question His own decision making. He stays true to His character, and He is always on the side of both justice and love.\nThings get a little intense in the test between God and Baal, but when Baal’s people call his name only to receive no response, it’s clear that God is the one true God. He answers not only with a display of power, but with an invitation for His people to return to Him. He is always calling His children back home. And regardless of whether we choose the path less or frequently traveled, we can rest assured we will not be choosing alone. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day46-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Hosea 1:2-11, Hosea 2:1, Hosea 2:5-23, Hosea 3:1-5, Psalm 144:2",
        "devo_title": "Hosea and Gomer",
        "devo_summary": "\nBY Claire Gibson\n\nI am currently in a group text with some women who are trying (and failing) to help our friend name her fourth baby. The child is a boy, and while the list of possible names keeps growing longer—(Theo… Patrick… What about Finn?)—the reasons why she can’t choose those names keep coming too. (I like it but my neighbor used it… I don’t want him to be called “Pat”… It just doesn’t “feel right,” you know?)\nI don’t blame her for taking her time. Choosing a name for another human being is a sacred task and shouldn’t be taken lightly. We know this because throughout Scripture, God changes the names of His people to reflect His love and call on their lives. He gave Simon a new name, “Peter.” From that point forward, every time someone spoke his new name, Peter had the opportunity to remember that though his faith was at times shaky, Jesus had called him “the rock” on which His church would be built (Matthew 16:18). \nIn today’s reading, God’s tells a man named Hosea to go and marry a promiscuous woman. The call on Hosea’s life is to offer the same compassion, acceptance, and love to an undeserving woman that God has offered to His people. He chooses Gomer, and begins to create a life with her and have children with her. It’s a hard assignment, one that leaves Hosea and his children ostracized and exposed. The children are given cursed names, such as “No Compassion” and “Not My People.” \nCan you imagine? Everywhere these children went, they would have been reminded of their family shame and their mother’s sin. But our generous God is in the name-changing business because He is also in the life-changing business. In His economy, those who were called “not my people” can now be called “children of God.” He is the God who turns our curses into blessings.\nWhat name do you call yourself today? Here are a few of the names I call myself: “Not Successful” and “Not Capable,” “Excluded” and “Unwanted.” But God, through the work of Jesus Christ, invites me to shed the curse of those names and embrace the truth of His love and acceptance. My identity is now shaped by His love for me. I am His, and He calls me His “daughter.”\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day47-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "James 3:17",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nBut the wisdom from above is first pure, then peace-loving, gentle, compliant, full of mercy and good fruits, unwavering, without pretense.  James 3:17\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day48-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "1 Kings 8:60",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we’ll memorize a portion of the prayer Solomon prayed at the dedication of the temple in Jerusalem on day 44.\nMay all the peoples of the earth know that the LORD is God. There is no other! –1 Kings 8:60\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-7-576x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "2 Kings 19:8-19, 2 Kings 19:35-37, Isaiah 38:1-20",
        "devo_title": "Hezekiah",
        "devo_summary": "\nBY Melanie Rainer\n\nIn December 2015, a group of archeologists led by Dr. Eliat Mazar announced that they had found a bulla in an excavation site near the Temple Mount in Jerusalem. The bulla, a clay seal stamped with Hebrew characters, had belonged to King Hezekiah, a good king of Judah who reigned in the 7th and 8th centuries BC. I know very, very little about biblical archeology, but when I found dozens of old news articles about this little 1/2” clay circle, I thought it was pretty cool. \nHezekiah was a real person. He lived in a real palace, was served by the real prophet Isaiah, and he prayed real prayers to our real God. And almost three thousand years later, utilizing a method called “wet sifting” (an archeological process using mesh trays flooded with water), someone discovered an impression in clay made by King Hezekiah’s royal seal. \nThe two prayers from today’s reading in 2 Kings and Isaiah reveal much about Hezekiah’s character, and his real, flesh-and-bone existence. But they also reveal his utter dependence upon a very real God. In his first prayer, Hezekiah cried out before the Lord when he heard that King Sennacherib of Assyria had mocked God and threatened the kingdom of Judah (2 Kings 19:14–19; Isaiah 37:14–20). Hezekiah’s second prayer came after he’d become very sick and was told he would die. He wept and prayed, asking the Lord to deliver him from his illness (Isaiah 38). \nTwice, Hezekiah prayed for God’s deliverance, and twice God delivered him; Sennacherib was defeated, and Hezekiah was healed. His third prayer is a poem of reflection about his experience of being so near imminent death, about feeling the brittleness of his bones and the fragility of his flesh:\n“I waited patiently till dawn, but like a lion he broke all my bones; day and night you made an end of me. I cried like a swift or thrush, I moaned like a mourning dove. My eyes grew weak as I looked to the heavens. I am being threatened; Lord, come to my aid!” – Isaiah 38:13–14 (NIV)\nIn reflecting upon his own emotional state while facing death, Hezekiah conceded, “Indeed it was for my own well-being that I had such intense bitterness” (v.17). In the face of death and destruction, both external (at the hands of Sennacherib) and internal (because of his own illness), Hezekiah trusted in, relied upon, and sought the favor of the immortal, all-powerful, very real God. \nSo often, I try to find my security and safety in the physical, but Hezekiah’s story—his real, lived, embodied, true story—reminds me that whatever I face in life or death, I can rely on the same immortal, all-powerful God. This is a God for whom evidence cannot be sifted out of trays doused in water, but a God who has proven Himself to be real, time and time again through His Word, His faithfulness, His miraculous work, and by His Son. A God who so loved us that He came to earth, flesh and blood, incarnate and holy, real, to prove that love. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day50-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Ezekiel 2:1-10, Ezekiel 3:1-15, Ezekiel 12:1-20, Isaiah 55:6-7 ",
        "devo_title": "Ezekiel",
        "devo_summary": "\nBY Lore Ferguson Wilbert\n\nEvery time I fly and I hear the phrase, “Please make sure your oxygen mask is secure before helping anyone else,” I wonder how it would feel to be a parent, desperate to put a mask on their child to the detriment of their own life. But I see the temptation exists for us everywhere: to give before we’ve received, to pour out before we’ve been poured into. And worse, it’s a part of Christian culture to do so. We laud service and eschew Sabbath. We exalt work and neglect rest. We praise doers and overlooker hearers. We try to feed others before we’ve been fed ourselves. We are in a crisis of care in many spheres of life today. No matter our vocation, it can be tempting to pour out before we allow ourselves to truly be cared for, poured into, and ministered to by the Word of God. \nThis was the climate into which the prophet Ezekiel was speaking. In today’s passage, the Lord appears to Ezekiel and, essentially, says, “Eat my words and then go speak them to others” (Ezekiel 2:8, my paraphrase). God’s people were in exile, going about their duties, beginning and ending each day exactly the same, the monotony unending. Ezekiel’s vision was intended to interrupt their trance of sameness, to give them a picture and a promise of something better. \nBut Ezekiel would have been unable to rightly or compellingly convince anyone of anything better if he had not first eaten, chewed on, swallowed, and subsisted on the Word of God. He had to be fed before he could feed others. He had to put on the oxygen mask of God’s message before he could put it on others. \nIn the same way, the world is asking us to fill spaces, to show up, be something, be everything, speak something, say anything, do something, do everything, but we often feel like walking air-pockets, void of anything of substance inside us. Have you been there? I know I have. The Word of God is food for us, just as it was for Ezekiel. And our food is to do the will of God, just as it was for Jesus (John 4:34). We are called to breathe in what He has given us in His Word, and then to go and speak it to everyone we know. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day51-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Daniel 2:1-49, Luke 12:11-12, Colossians 3:23-24",
        "devo_title": "Daniel",
        "devo_summary": "\nBY Rebecca Faires\n\nSocrates famously declared, “I am wise because I know that I know nothing.” There is certainly a kind of paradoxical wisdom in his statement that is admirable, but it is still only the wisdom of men. It is the same kind of wisdom we see displayed by the Chaldean wise men who advised Nebuchadnezzar. They knew that they knew nothing. They could not penetrate the deep mysteries of unremembered dreams. This was the realm of the gods alone, those who did not dwell with men (Daniel 2:11).\nBut the wisdom of God is higher than the wisdom of men, and in Daniel we see a wisdom that far surpasses that of Socrates. It’s in a whole different category. The wisdom of Daniel is this: he knew that true wisdom is from God alone, the Creator of heaven and earth. Furthermore, he knew that the one true God was not like the gods of the Chaldeans, gods who were neither all-knowing nor all-powerful. Daniel knew that he served a God who was both of those things, yet also near to His people. \nWhile living in exile, Daniel and his friends understood that they dwelt in a land of deep darkness, a land of idolatry, harsh kings, and the threat of death. But their security was not in a king’s decrees, or the wisdom of the Chaldeans. They found security bowing on their knees before the God of all wisdom and power. He was their true Lord and King, and in serving Him, they did not need to fear the whims of man (v.20–21).\nIn a remarkable turn of providence, the very lives of the wise men of the world are preserved by the intercession of Daniel (v.24). Like Christ’s parable of the mustard seed (Matthew 13:31–32), where even the birds of the air find rest in the branches, so also the providence of God is the foundation upon which even the kingdoms of the earth must rely, for even they belong to Him.\nI find that I’m constantly inundated with the seeming wisdom of the world, but it is a wisdom that falls far short of the kingdom of God. The promise that Daniel foretold in Nebuchadnezzar’s dream is one that is even now being fulfilled: “The kingdom of the world has become the kingdom of our Lord and of his Christ, and he will reign forever and ever” (Revelation 11:15). In light of such revelation, we, too, may have confidence as we approach the throne of grace, knowing that we serve a God who is not far off, but has drawn near to us, even taking on flesh and dwelling with us. This God, this Christ, is the true King of kings.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day52-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Daniel 3:1-30, Isaiah 43:2",
        "devo_title": "Shadrach, Meshach, and Abednego",
        "devo_summary": "\nBY Ellen Taylor\n\nEven if not, He is still good. I’ve seen that phrase all over the Internet, on Pinterest boards, college dorm room walls, and coffee mugs—used time and time again to remind us that God is still good in the midst of trials and pain and suffering. \nA few weeks ago, I had a really painful situation occur with one of the people I love most, and I almost lost them. I felt completely betrayed. As a result, I lost a lot of trust in that person. And it occurred to me that I have no idea how people survive the painful situations in their lives if they do not believe in God.\nI don’t believe in the prosperity gospel, the lie that tells us if we believe in God enough and work hard enough to somehow live lives worthy of His love, then He will lavish upon us riches and good fortune. But I do believe that every good and perfect gift comes from God (James 1:17), and that God’s good plan ultimately ends in the restoration of His kingdom and eternal life spent in worship of the Creator God (Revelation 21–22).\nBut is God still good when everything stable, everything you thought you knew, is ripped out from under you? Or when your boyfriend breaks your heart? Is He good when your grandmother gets cancer? Is God still good when the plans you had for your life fall apart right in front of you?\nYes. He is.\nShadrach, Meshach, and Abednego were really good examples of living out that Pinterest-worthy saying: Even if not, He is still good. They trusted in God so fiercely that they agreed to be put in a fiery furnace to prove their heartfelt belief. They risked their lives for their faith by refusing to bow before anyone or anything but God. In doing so, they brought Him glory. And when pushed on the matter by the king, they simply said, “Even if [our God] does not rescue us, we want you as king to know that we will not serve your gods or worship the gold statue you set up” (Daniel 3:18).\nTheir faith in God’s provision and protection was so strong that they were willing to walk into the fire, believing that He would save them. And they were confident in their decision because of their dedication to their God—even if He chose not to rescue them from the fire. \nThe same is true for us. No matter the circumstances that come our way, when we walk through the pain and trials of life, this truth remains: we are still His, and He is still ours (Isaiah 43:2). And He is still good.\nThe end result for these three men? A king convinced of the goodness of God and a whole empire of people now told to worship Him, instead of the false gods and idols of their past. All because of the faith of three men and their willingness to say, “Even if not, He is still good.”\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day53-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Esther 2:1-18, Esther 3:1-6, Esther 4:1-17, Esther 8:1-7, Hebrews 4:14-16",
        "devo_title": "Esther",
        "devo_summary": "\nBY Rebecca Faires\n\nEsther’s bravery was a provision of God’s gracious and eternal plan. Esther had the privilege of being part of the story of Israel’s rescue. But it’s unlikely that she wanted to be anywhere near the king’s harem—she probably would have preferred to stay safely at home.\nAnd when calamity threatened, her cousin Mordecai prefaced his exhortation to Esther with this profound observation: “If you keep silent at this time, relief and deliverance will come to the Jewish people from another place” (Esther 4:14).\nMordecai understood that the real story doesn’t depend on us, but upon God, who always accomplishes His will. Only in light of this truth can we understand what it means to live rightly in the time and place God has put us. Mordecai’s words to Esther provide three profound implications:\nFirst, it conveys an unwavering trust in God’s providence. Mordecai was not in doubt as to Who was Israel’s security and hope. It was not Esther. It was not himself. It was not man or the strength of men. He knew that God is faithful, that He keeps His covenant, that He alone is the preserver of His people. God alone can save.\nSecond, it is a reminder that God calls us to humility. When we find ourselves in a position either of pressure or of prominence, both are God’s doing, and both are for the glory of His kingdom. Mordecai mourned and repented in the public square, openly confessing His dependence on God. His call to Esther was to do the same with her position of privilege: not to use it for her own preservation or security, but to lay it at the feet of God, to yield it up to the purposes of His kingdom.\nThird, it frames a biblical perspective of time and history. The phrase “for such a time as this” brings to mind all of the moments when God’s unseen hand is at work in the Esther narrative. The primary action of the story is not dependent upon what people decide to do, but on what “happens,” or rather, what Providence decrees. The story moves on a series of passive verbs, indicating a divine will that guides all things. “For such a time as this” is a reminder that both the evil of the day and the opportunity to stand for justice were provisions of God’s hand. God is at work, and He works all things—even the evil that men do—for the glory of His kingdom and the good of His people. \nThis hope is ultimately fulfilled in Christ. The true rescue of captive Israel is foreshadowed in Esther, but accomplished in the work of Jesus’s sacrifice. He is the true Savior of Israel. He stood before the rulers and judges of the world and obeyed even to the point of death on the cross. He took upon Himself the gallows punishment so that we might be redeemed. He fought the battle for us in order to give us victory. His eternal decree has overturned the decrees of kings and rulers, of powers and principalities, and He has established a kingdom that endures and confounds the powers of this world. \nThis is not a story about the bravery of Esther or the wisdom of Mordecai. It is a story about the sovereign providence of God. We are all born for such a time as this, and we can depend on Christ to fulfill His promises.\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day54-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Colossians 3:23–24",
        "devo_title": "Grace Day",
        "devo_summary": "\nBY She Reads Truth\n\nTake this day as an opportunity to catch up on your reading, pray, and rest in the presence of the Lord.\nWhatever you do, do it from the heart, as something done for the Lord and not for people, knowing that you will receive the reward of an inheritance from the Lord. You serve the Lord Christ. —Colossians 3:23–24\n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/SRT-WMITW-Instagram-Day55-1024x1024.jpg"
    },
    {
        "book_title": "Women & Men in the Word: Old Testament",
        "devo_passages": "Daniel 2:21",
        "devo_title": "Weekly Truth",
        "devo_summary": "\nBY She Reads Truth\n\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\nThis week we’ll memorize a reminder from the prophet Daniel, whose story we read on day 52, about our great God who holds the course of history in His hands.\nHe changes the times and seasons; he removes kings and establishes kings. He gives wisdom to the wise and knowledge to those who have understanding. —Daniel 2:21\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n",
        "img_url": "https://27p8cl3iyobo4cgs2e6ekpg1-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/4-WMITW-8-576x1024.jpg"
    }
]